[{"_id":"54b5dbdf70c589513562570e","id":173,"pasta":"He's a good player, a bit overated in my opinion. But defenitely okay to be in a top team! To say that he is one of the best solo mids etc is really exageration, he played like 10 games in a high level LAN, you need way more to compare him to Dendi, s4 or FATA","tags":"#dota2#rtz#7ckingmad#overrated#arteezy","favourites":264,"__v":0,"created_on":"2015-01-14T02:52:29.786Z","score":0.008949105849361393},{"_id":"54bf2af73b0a330105ff5bab","id":344,"pasta":"n0tail u r fuckin perfect m8.\nyou're a flower. you're also a rainbow and a river. you are the manifestation of all perfection and i want to i don't fucking know. i want this to not sound gay, but you are fucking perfect, n0tail.\nty for listening","tags":"#dota2#n0tail#fucking#perfect#perfection","favourites":246,"__v":0,"created_on":"2015-01-21T04:27:41.355Z","score":0.009556151246183786},{"_id":"54b5f438f6a1885137f43cda","id":184,"pasta":"Arteezy sat in a dark room. The words \"Dire Victory\" filled up the screen. Not even Arteezy's shadow fiend could win this game. 3/8/7 378 GPM. Tears filled Arteezy's eyes as he carassed his hand of midas. The sound of hard core gangster rap and crying filled the room. The door creaks open and EE-sama enters the room. \"You lost Artour.\" \"You do know what happens when you lose.\" Arteezy removed his clothes, wearing only one of EE's anime wigs. EE removed his clothes, \"You lost 23 MM. Thats how many hours your punishment will be.\" Arteezy spent the next 23 hours being furiously fucked by his mentor. After the punishment the semen covered Arteezy arised. \"Thank you master, I can't wait to return the favor when you lose.\" Envy smiled. \"So will I Artour.\"","tags":"#dota2#arteezy#rtz#eternalenvy#ee#midas#fanfic","favourites":182,"__v":0,"created_on":"2015-01-14T04:41:41.443Z","score":0.006562995769788097},{"_id":"54bf3ace3b0a330105ff5bd2","id":358,"pasta":"As Artour stood in the school library, the dean approached him:\n\"Artour\" He said \"This is your last exam, if you fail this you're out, Babaevsky.\"\n As he turned his face slowly, with a grin as large as his GPM, he responded with \nsuch elegance:\"LMFAO wHo cAREAS HAHA Xd\" ","tags":"#dota2#rtz#arteezy#school#library#dean#gpm","favourites":175,"__v":0,"created_on":"2015-01-21T05:27:38.041Z","score":0.007190702057232696},{"_id":"54b59230e90c10d22e88b97e","id":126,"pasta":"ヽヽ༼༼ຈຈل͜ل͜ຈຈ༽༽ﾉﾉ HAFU TURN OFF THE VIBRATOR ヽヽ༼༼ຈຈل͜ل͜ຈຈ༽༽ﾉﾉ","tags":"#hearthstone#hafu#vibrator#donger","favourites":170,"__v":0,"created_on":"2015-01-13T21:46:19.211Z","score":0.006168410092750763},{"_id":"54b2ee7bce7b585004706dc5","id":44,"pasta":"I sexually Identify as an Attack Helicopter. Ever since I was a boy I dreamed of soaring over the oilfields dropping hot sticky loads on disgusting foreigners. People say to me that a person being a helicopter is Impossible and I'm fucking retarded but I don't care, I'm beautiful. I'm having a plastic surgeon install rotary blades, 30 mm cannons and AMG-114 Hellfire missiles on my body. From now on I want you guys to call me \"Apache\" and respect my right to kill from above and kill needlessly. If you can't accept me you're a heliphobe and need to check your vehicle privilege. Thank you for being so understanding.","tags":"#general#tumblr#attack#helicopter#reynad","favourites":164,"__v":0,"created_on":"2015-01-11T21:42:07.663Z","score":0.005790460746490588},{"_id":"54b2e7a4ce7b585004706d6f","id":1,"pasta":"☑ “This guy's deck is CRAZY!” ☑ “My deck can't win against a deck like that” ☑ \"He NEEDED precisely those two cards to win\" ☑ “He topdecked the only card that could beat me” ☑ \"He had the perfect cards\" ☑ “There was nothing I could do” ☑ “I played that perfectly\"","tags":"#hearthstone#kripp#checkboxes#topdeck#crazy","favourites":161,"__v":0,"created_on":"2015-01-11T21:14:04.886Z","score":0.005699701966667157},{"_id":"54b2eb9ece7b585004706d97","id":17,"pasta":"Hello my name is Sing_sing and I am from the distant future. I am here to inform you, past Sing_sing that you must replace S4 on SECRET and travel with your new team to the TI5 EU Hub and play Mario Party for 2 weeks straight, if you fail to do this The Bankers will take over the world and it will descend into chaos. Thank you for listening to future Sing_sing. Please no pasta alfredo","tags":"#sing#singsing#dota2#secret","favourites":151,"__v":0,"created_on":"2015-01-11T21:24:27.532Z","score":0.005401892272078767},{"_id":"54b472cd7622b32a1cea7b71","id":83,"pasta":" <:::::[]=¤༼ຈل͜ຈ༽ﾉ I am the knight of spamerino. Stand back foul moderino <:::::[]=¤༼ຈل͜ຈ༽ﾉ","tags":"#knight#spam#nazi#mods#sword#donger","favourites":144,"__v":0,"created_on":"2015-01-13T01:20:07.684Z","score":0.005291213208228986},{"_id":"54bf29182d74781f04a603c1","id":341,"pasta":"ʕ ͡•ᴥ ͡• ʔ(_̅_̅_̅FISSURE_̅_̲̅_̅_̅_̅()","tags":"#dota2#earthshaker#fissure#bear#bare","favourites":141,"__v":0,"created_on":"2015-01-21T04:15:00.449Z","score":0.005993497469425687},{"_id":"54bf14322d74781f04a60379","id":311,"pasta":"Ｈｅｌｌｏ  Ｉ＇ｍ  Ｓｎｉｔｈ，  ｐｌａｙｉｎｇ  ｍｙ  ２０２１４３ｔｈ  ｇａｍｅ  ｏｎ  Ｃｈｅｎ．  Ｅｖｅｎ  ｔｈｏｕｇｈ  ｉｔ＇ｓ  ｔｈｅ  ｏｎｌｙ  ｈｅｒｏ  Ｉ  ｐｌａｙ  Ｉ  ｓｔｉｌｌ  ｓｕｃｋ  ａｔ  ｉｔ．  Ａｓ  ａ  ｃｏｍｐｅｎｓａｔｉｏｎ  ｆｏｒ  ｍｙ  ｌａｃｋ  ｏｆ  ｓｋｉｌｌ  Ｉ  ａｍ  ｇｏｉｎｇ  ｔｏ  ｂｕｙ  ａｌｌ  ｓｕｐｐｏｒｔ  ｉｔｅｍｓ  ａｎｄ  ｇａｎｋ  ｍｉｄ  ａｔ  ｌｖｌ  ２  ａｎｄ  ｆａｉｌ．  Ｔｈａｎｋｓ  ｆｏｒ  ｌｉｓｔｅｎｉｎｇ","tags":"#dota2#hello#snith#chen#only#hero#suck","favourites":135,"__v":0,"created_on":"2015-01-21T02:44:07.591Z","score":0.005771905729726185},{"_id":"54b344916bd15d33165d28a9","id":55,"pasta":"My Grandfather smoked his whole life. I was about 10 years old when my mother said to him, 'If you ever want to see your grandchildren graduate, you have to stop immediately.'. Tears welled up in his eyes when he realized what exactly was at stake. He gave it up immediately. Three years later he died of lung cancer. It was really sad and destroyed me. My mother said to me- 'Don't ever smoke. Please don't put your family through what your Grandfather put us through.\" I agreed. At 28, I have never touched a cigarette. I must say, I feel a very slight sense of regret for never having done it, because your post gave me cancer anyway.","tags":"#reddit#cancer#post#smoking#grandpa","favourites":131,"__v":0,"created_on":"2015-01-12T03:03:39.683Z","score":0.0048131235378495105},{"_id":"54bf066ebd6b1a11037e7c98","id":300,"pasta":"\"Sheever, ravage!\" Singsing shouts, infuriated at yet another of Sheever's antics. Sheever upon hearing this retreats to her room, tears streaming down her cheeks.Singsing doesn't notice until hours later, after losing to pubs for the third time in a row and switching off his stream.He finds Sheever in a ball on her bed, tear marks on the sheets and her eyes red and swollen. \"What's wrong, Sheever-chan?\" Singsing asks.\"You.. you yelled at me!\"","tags":"#dota2#singsing#sheever#fanfic","favourites":118,"__v":0,"created_on":"2015-01-21T01:50:16.708Z","score":0.005151326859305741},{"_id":"54bf32603b0a330105ff5bc2","id":353,"pasta":"ʜᴇʟʟᴏ ʙᴜʟʟᴅᴏɢᴇ I ᴀᴍ ғᴀᴍᴏᴜs ᴘᴏʀɴ ᴅɪʀᴇᴄᴛᴏʀ, ᴛᴏɴʏ ᴘᴀsᴛᴇʀɪɴᴏ. ᴡᴇ ᴡᴏᴜʟᴅ ʟɪᴋᴇ ʏᴏᴜ ᴀɴᴅ sʜᴇᴇᴠᴇʀ ᴛᴏ ᴘᴀʀᴛɪᴄɪᴘᴀᴛᴇ ɪɴ ᴏᴜʀ ɴᴇᴡ ᴠɪᴅᴇᴏ \" ʜᴏᴏᴋɪɴ' ɴ ᴊᴜᴋᴇɪɴ' \" sʜᴇᴇᴠᴇʀ ᴡᴏᴜʟᴅ ʙᴇ ᴡɪɴᴅʀᴜɴɴᴇʀ ᴀɴᴅ ʏᴏᴜ sᴀʏ ɴᴏ ᴊᴜᴋᴇʀɪɴᴏ ᴀɴᴅ ʙᴀᴄᴋᴅᴏᴏʀ ʜᴇʀ.","tags":"#dota2#admiralbulldog#porn#sheever#jukerino#backdoor","favourites":108,"__v":0,"created_on":"2015-01-21T04:42:26.764Z","score":0.004792333499090962},{"_id":"54b5f43df6a1885137f43cdb","id":185,"pasta":"Albert Einstein, one of the greatest minds to ever live, was once perplexed by the speed at which Arteezy was able to farm. Seemingly impossible GPMs of 800+ every game were consistently observed, leading to the hypothesis that this was no fluke. Einstein spent the last years of his life trying to prove the ability of Arteezy's farm existed within the laws of science. Critics laughed at his efforts, claiming that Arteezy's farm was an undeniable act of divine intervention. It wasn't until the end when Einstein found the answer. On his deathbed, Einstein spent the last seconds of his life jotting down what is now the world's most infamous scientific formula. r=tz²","tags":"#rtz#einstein#arteezy#dota2#gpm#farm","favourites":107,"__v":0,"created_on":"2015-01-14T04:42:15.444Z","score":0.004202048622663747}]