[{"_id":"54b59230e90c10d22e88b97e","id":126,"pasta":"ヽヽ༼༼ຈຈل͜ل͜ຈຈ༽༽ﾉﾉ HAFU TURN OFF THE VIBRATOR ヽヽ༼༼ຈຈل͜ل͜ຈຈ༽༽ﾉﾉ","tags":"#hearthstone#hafu#vibrator#donger","favourites":170,"__v":0,"created_on":"2015-01-13T21:46:19.211Z","score":0.0014213240286618468},{"_id":"54fb95f187d1bc685b1e9646","id":1001,"pasta":"Darude- status\n☐ Not Sandstorm\n☑ Sandstorm","tags":"#general#twitch#darude#sandstorm","favourites":170,"__v":0,"created_on":"2015-03-08T00:21:02.434Z","score":0.0019387359975372844},{"_id":"55090bc4b47c3d010fd965df","id":1172,"pasta":"Lindsay was 12 when it first started. One morning she awoke to find odd little crumbs in her bed. At first she thought they were crackers, but as she was getting dressed for school she noticed a small little tan 'O' laying on the floor next to her nightstand. It was a cheerio. She picked it up and looked at it for a moment, its wholesome oaty contours seeming perfectly harmless. She threw it away, assuming that her bratty older sister was responsible. Little did she know that it was an omen of the pure mind bending horror which was soon to follow. That weekend her mother went shopping.\n\nShe had gotten in the habit of doing all the grocery shopping for the month at once, so the kitchen was packed full of bags and boxes as the girls went about putting things away. Lindsay was disappointed when she noticed that the only cereal her mother had gotten was Cheerios. It was always Cheerios. Four economy-sized boxes worth, no less. Lindsay had never liked Cheerios, even though her sister seemed to love them. They were too plain. Too boring, She thrust the boxes carelessly up onto the shelf above the refrigerator and went searching through the other bags to see if her mother had gotten anything that was actually edible. Later that night she was tossing and turning in bed, her stomach full of slightly too much Butterfinger ice cream. The house was silent. Everyone else was in bed. Or should have been. Lindsay had almost dozed off when a soft, dry rustling sound brought her back to wakefulness. At first she thought it was the cat scratching at her door, but as she sat up she realized it was coming from somewhere inside the room. A twinge of fear shivered through her body. They'd never had rats or mice in the house before. Was it a bug?\n\nWhatever it was, it sounded big. Lindsay was scared. She felt the urge to huddle underneath her blankets and hide until it went away. Instead, she gathered her courage and reached out to turn on the lamp beside her bed. Just as she touched it, the noise suddenly stopped. She flicked it on and jumped back into the center of her bed, clutching the sheets tightly around her as light spilled out into the room. There was nothing there. She peeked carefully over the sides of her bed, seeing only the rug and a few Girls' Life magazines. Taking her heaviest pillow to use as a weapon, she got out of bed and padded slowly towards the door. Right as she reached it she froze. looking down. Peeking out from the crack beneath her round half-circle of a cheerio. Puzzled, she opened the door. Before her loomed a seven-foot wall of cheerios.\n\nThey covered the doorway completely as the entire hallway had been filled with them. And they were moving. They were alive and crawling over each other like a mass of legless insects, filling the air with the heavy smell of whole grain oats. Lindsay ran and jumped back onto her bed. She huddled and clutched the pillow over her head, and screamed. She was still screaming when her parents came in. Her mother soothed her, wanting to know what was the matter. The cheerios were gone. Lindsay told her that it was just a nightmare. She didn't want them to think she was crazy. After a little while her parents left, her father muttering something about 'night terrors' as they walked back upstairs.\n\nWhen they were gone, Lindsay stuffed her blanket under the crack of her door and sat up with the light on. She tried her best to stay awake all night, but after a few hours she finally fell asleep. When she awoke there were a handful of crumbs in her bed. For a few weeks afterward Lindsay was able to sleep on the floor in her sister Susan's room, though she had to use all of her allowance as a bribe. Then her parents found out and made her go back to her own room. Lindsay's dad got her a lock for the door, telling her it would help her to feel safe. It didn't.\n\nThe very first night she was back in her room, she heard the rustling noise again. She'd kept the lamp on but this time the light didn't seem to help. She huddled there, watching the door and hoping it would go away. Then the blanket moved. She'd stuffed it under the door again as tightly as she could, but now the corner of it was being pushed back into her room by something on the other side. Lindsay was pretty sure she knew that something was. The cheerios were coming for her. Just then the lamp went out and the room plunged into darkness. She stifled a scream, telling herself it was just a nightmare.\n\nCheerios couldn't move or unplug lights. They didn't come after people. Then something light and dry brushed against her cheek, and all rational thought left her mind as she was seized in the cold grip of terror. She opened her mouth to scream, gagging as it was immediately filled with tiny rings of cereal. She felt it moving all over her body. She bit and chewed and spit, trying to clear her mouth so she could call for help. But no matter how much of it she crunched up, more always took its place. The cheerios seemed to collect into narrow tendrils as they snaked over her body. She shuddered in shock and disbelief as she felt the buttons of her pajama top being pulled open one by one. Suddenly she was grabbed around the arms and ankles and lifted up above the bed, her face toward the ceiling.\n\nDry, searching fingers of cereal probed into the waistband of her pj bottoms and yanked them down just as her shirt was pulled up over her head. She was still too young to wear a bra, and she immediately felt the cheerios coil around her small, developing breasts and squeeze them roughly. Lindsay whimpered and kicked as her panties were stripped off. No, she thought, it couldn't want that. *Please* let it not be that... Her legs were quickly restrained while another tendril slid up slowly along her inner thigh. thousands more gripped her buttocks, holding her up and kneading her firm athletic flesh as more began circling over her nipples. Lindsay gasped through her nose, her mouth still full of cheerios. It was weird and horrible, but the touching felt good at the same time.\n\nThen she felt the tendril rubbing lightly over her exposed labia, and she thrashed about uselessly as it began nudging and probing at her most private spot. It caressed the lips of her young vulva almost tenderly for a few long minutes before she felt it nudge harder at the entrance to her vagina. Her body stiffened as she felt it pushing inside her. It felt rough, even though the surface had been moistened by her fearful sweat and the natural wetness within her. The cheerio tendril entered her slowly, relentlessly. It didn't thrust in and out like she'd expected it to, instead it seemed to be pouring itself into her, filling her vagina with tiny cereal O's.\n\nShe could feel them snapping and crunching inside her as she clenched down to try and keep them out. The tendrils on her body seemed to get stronger. groping at her breasts and ass and tugging hard at her nipples. She felt her pussy stretching as it was packed full of rapacious cheerios, the growing pressure sending mixed tingles of pain and pleasure rippling through her body. Then she felt the presence of yet another narrow tendril rubbing insistently against the tight pucker of her butthole. Lindsay came as it pushed inside her, her body shivering uncontrollably as she was reluctantly overcome by pulsing waves of ecstasy. At that moment there was a quiet knock on the door. Her mother's voice called out, asking if she was okay. The cheerios quickly drew away, vanishing into the darkness just as abruptly as they'd arrived.\n\nLindsay could still feel some remnants in her vagina and ass as she got up weakly and pulled her pjs back on. Her mother looked concerned when Lindsay opened the door, but the explanation of another nightmare seemed to put her at ease. When she'd gone back up to bed, Lindsay went into the bathroom and sat on the toilet, feeling ashamed and violated as she let the last of the soggy cereal mush drip out of her body. She still hated cheerios. Now more than ever.","tags":"#general#cheerios#rape#erotica#nonconsent#nsfw","favourites":168,"__v":0,"created_on":"2015-03-18T05:10:43.202Z","score":0.00205794481173684},{"_id":"5508c04db47c3d010fd9650b","id":1080,"pasta":"So ur with ur honey and yur making out wen the phone rigns. U anser it n the vioce is \"wut r u doing wit my daughter?\" U tell ur girl n she say \"my dad is ded\". THEN WHO WAS PHONE?","tags":"#4chan#creepy#who#was#phone","favourites":166,"__v":0,"created_on":"2015-03-17T23:39:39.694Z","score":0.0020341045709592847},{"_id":"54b2ee7bce7b585004706dc5","id":44,"pasta":"I sexually Identify as an Attack Helicopter. Ever since I was a boy I dreamed of soaring over the oilfields dropping hot sticky loads on disgusting foreigners. People say to me that a person being a helicopter is Impossible and I'm fucking retarded but I don't care, I'm beautiful. I'm having a plastic surgeon install rotary blades, 30 mm cannons and AMG-114 Hellfire missiles on my body. From now on I want you guys to call me \"Apache\" and respect my right to kill from above and kill needlessly. If you can't accept me you're a heliphobe and need to check your vehicle privilege. Thank you for being so understanding.","tags":"#general#tumblr#attack#helicopter#reynad","favourites":164,"__v":0,"created_on":"2015-01-11T21:42:07.663Z","score":0.0013649805976867146},{"_id":"54b2e7a4ce7b585004706d6f","id":1,"pasta":"☑ “This guy's deck is CRAZY!” ☑ “My deck can't win against a deck like that” ☑ \"He NEEDED precisely those two cards to win\" ☑ “He topdecked the only card that could beat me” ☑ \"He had the perfect cards\" ☑ “There was nothing I could do” ☑ “I played that perfectly\"","tags":"#hearthstone#kripp#checkboxes#topdeck#crazy","favourites":161,"__v":0,"created_on":"2015-01-11T21:14:04.886Z","score":0.001343878599244021},{"_id":"5508b608b47c3d010fd964ef","id":1070,"pasta":"Due to extensive research done by the University of Pittsburgh, diamond has been confirmed as the hardest metal known to man. The research is as follows. Pocket-protected scientists built a wall of iron and crashed a diamond car into it at 400 miles per hour, and the car was unharmed. They then built a wall out of diamond and crashed a car made of iron moving at 400 miles an hour into the wall, and the wall came out fine. They then crashed a diamond car made of 400 miles per hour into a wall, and there were no survivors. They crashed 400 miles per hour into a diamond traveling at iron car. Western New York was powerless for hours. They rammed a wall of metal into a 400 mile per hour made of diamond, and the resulting explosion shifted the earth's orbit 400 million miles away from the sun, saving the earth from a meteor the size of a small Washington suburb that was hurtling towards mid-western Prussia at 400 billion miles per hour. They shot a diamond made of iron at a car moving at 400 walls per hour, and as a result caused over 9000 wayward airplanes to lose track of their bearings, and make a fatal crash with over 9000 buildings in downtown New York. They spun 400 miles at diamond into iron per wall. The results were inconclusive. Finally, they placed 400 diamonds per hour in front of a car made of wall traveling at miles per iron, and the result proved without a doubt that diamonds were the hardest metal of all time, if not the hardest metal known to man.","tags":"#general#miles#per#iron#diamonds#metal","favourites":153,"__v":0,"created_on":"2015-03-17T23:10:49.326Z","score":0.0018993807918127577},{"_id":"5508bab5b47c3d010fd964f7","id":1073,"pasta":"Hey Faggots,\nMy name is John, and I hate every single one of you. All of you are fat, retarded, no-lifes who spend every second of their day looking at stupid ass pictures. You are everything bad in the world. Honestly, have any of you ever gotten any pussy? I mean, I guess it’s fun making fun of people because of your own insecurities, but you all take to a whole new level. This is even worse than jerking off to pictures on facebook.\nDon’t be a stranger. Just hit me with your best shot. I’m pretty much perfect. I was captain of the football team, and starter on my basketball team. What sports do you play, other than “jack off to naked drawn Japanese people”? I also get straight A’s, and have a banging hot girlfriend (She just blew me; Shit was SO cash). You are all faggots who should just kill yourselves. Thanks for listening.\nPic Related: It’s me and my bitch","tags":"#4chan#faggots#john#retarded","favourites":153,"__v":0,"created_on":"2015-03-17T23:35:04.296Z","score":0.0018996048944402918},{"_id":"54b2eb9ece7b585004706d97","id":17,"pasta":"Hello my name is Sing_sing and I am from the distant future. I am here to inform you, past Sing_sing that you must replace S4 on SECRET and travel with your new team to the TI5 EU Hub and play Mario Party for 2 weeks straight, if you fail to do this The Bankers will take over the world and it will descend into chaos. Thank you for listening to future Sing_sing. Please no pasta alfredo","tags":"#sing#singsing#dota2#secret","favourites":151,"__v":0,"created_on":"2015-01-11T21:24:27.532Z","score":0.0012735583118047122},{"_id":"54b472cd7622b32a1cea7b71","id":83,"pasta":" <:::::[]=¤༼ຈل͜ຈ༽ﾉ I am the knight of spamerino. Stand back foul moderino <:::::[]=¤༼ຈل͜ຈ༽ﾉ","tags":"#knight#spam#nazi#mods#sword#donger","favourites":144,"__v":0,"created_on":"2015-01-13T01:20:07.684Z","score":0.0012311850340673534},{"_id":"54bf29182d74781f04a603c1","id":341,"pasta":"ʕ ͡•ᴥ ͡• ʔ(_̅_̅_̅FISSURE_̅_̲̅_̅_̅_̅()","tags":"#dota2#earthshaker#fissure#bear#bare","favourites":141,"__v":0,"created_on":"2015-01-21T04:15:00.449Z","score":0.0012622777747217726},{"_id":"550894c265f4abef0cfbe4fe","id":1058,"pasta":"There were a lot of things we couldn't do in an SR-71 Blackbird, but we were the fastest guys on the block and loved reminding our fellow aviators of this fact. People often asked us if, because of this fact, it was fun to fly the jet. Fun would not be the first word I would use to describe flying this plane - intense, maybe, even cerebral. But there was one day in our Sled experience when we would have to say that it was pure fun to be the fastest guys out there, at least for a moment.\n\nIt occurred when Walt and I were flying our final training sortie. We needed 100 hours in the jet to complete our training and attain Mission Ready status. Somewhere over Colorado we had passed the century mark. We had made the turn in Arizona and the jet was performing flawlessly. My gauges were wired in the front seat and we were starting to feel pretty good about ourselves, not only because we would soon be flying real missions but because we had gained a great deal of confidence in the plane in the past ten months. Ripping across the barren deserts 80,000 feet below us, I could already see the coast of California from the Arizona border. I was, finally, after many humbling months of simulators and study, ahead of the jet. I was beginning to feel a bit sorry for Walter in the back seat.\n\nThere he was, with no really good view of the incredible sights before us, tasked with monitoring four different radios. This was good practice for him for when we began flying real missions, when a priority transmission from headquarters could be vital. It had been difficult, too, for me to relinquish control of the radios, as during my entire flying career I had controlled my own transmissions. But it was part of the division of duties in this plane and I had adjusted to it. I still insisted on talking on the radio while we were on the ground, however. Walt was so good at many things, but he couldn't match my expertise at sounding smooth on the radios, a skill that had been honed sharply with years in fighter squadrons where the slightest radio miscue was grounds for beheading. He understood that and allowed me that luxury. Just to get a sense of what Walt had to contend with, I pulled the radio toggle switches and monitored the frequencies along with him.\n\nThe predominant radio chatter was from Los Angeles Center, far below us, controlling daily traffic in their sector. While they had us on their scope (albeit briefly), we were in uncontrolled airspace and normally would not talk to them unless we needed to descend into their airspace. We listened as the shaky voice of a lone Cessna pilot who asked Center for a read-out of his ground speed. Center replied: “November Charlie 175, I'm showing you at ninety knots on the ground.”\n\nNow the thing to understand about Center controllers was that whether they were talking to a rookie pilot in a Cessna or to Air Force One, they always spoke in the exact same, calm, deep, professional tone that made one feel important. I referred to it as the \"Houston Center voice.\" I have always felt that after years of seeing documentaries on this country's space program and listening to the calm and distinct voice of the Houston controllers, that all other controllers since then wanted to sound like that and that they basically did. And it didn't matter what sector of the country we would be flying in, it always seemed like the same guy was talking. Over the years that tone of voice had become somewhat of a comforting sound to pilots everywhere. Conversely, over the years, pilots always wanted to ensure that, when transmitting, they sounded like Chuck Yeager, or at least like John Wayne. Better to die than sound bad on the radios. Just moments after the Cessna's inquiry, a Twin Beech piped up on frequency, in a rather superior tone, asking for his ground speed in Beech. “I have you at one hundred and twenty-five knots of ground speed.”\n\nBoy, I thought, the Beechcraft really must think he is dazzling his Cessna brethren. Then out of the blue, a navy F-18 pilot out of NAS Lemoore came up on frequency. You knew right away it was a Navy jock because he sounded very cool on the radios. “Center, Dusty 52 ground speed check.” Before Center could reply, I'm thinking to myself, hey, Dusty 52 has a ground speed indicator in that million-dollar cockpit, so why is he asking Center for a read-out? Then I got it, ol' Dusty here is making sure that every bug smasher from Mount Whitney to the Mojave knows what true speed is. He's the fastest dude in the valley today, and he just wants everyone to know how much fun he is having in his new Hornet. And the reply, always with that same, calm, voice, with more distinct alliteration than emotion: “Dusty 52, Center, we have you at 620 on the ground.”\n\nAnd I thought to myself, is this a ripe situation, or what? As my hand instinctively reached for the mic button, I had to remind myself that Walt was in control of the radios. Still, I thought, it must be done - in mere seconds we'll be out of the sector and the opportunity will be lost. That Hornet must die, and die now. I thought about all of our Sim training and how important it was that we developed well as a crew and knew that to jump in on the radios now would destroy the integrity of all that we had worked toward becoming. I was torn. Somewhere, 13 miles above Arizona, there was a pilot screaming inside his space helmet. \n\nThen, I heard it - the click of the mic button from the back seat. That was the very moment that I knew Walter and I had become a crew. Very professionally, and with no emotion, Walter spoke: “Los Angeles Center, Aspen 20, can you give us a ground speed check?” There was no hesitation, and the replay came as if was an everyday request. “Aspen 20, I show you at one thousand eight hundred and forty-two knots, across the ground.”\n\nI think it was the forty-two knots that I liked the best, so accurate and proud was Center to deliver that information without hesitation, and you just knew he was smiling. But the precise point at which I knew that Walt and I were going to be really good friends for a long time was when he keyed the mic once again to say, in his most fighter-pilot-like voice: “Ah, Center, much thanks, we're showing closer to nineteen hundred on the money.” For a moment Walter was a god. And we finally heard a little crack in the armor of the Houston Center voice, when L.A. came back with, “Roger that Aspen. Your equipment is probably more accurate than ours. You boys have a good one.”\n\nIt all had lasted for just moments, but in that short, memorable sprint across the southwest, the Navy had been flamed, all mortal airplanes on freq were forced to bow before the King of Speed, and more importantly, Walter and I had crossed the threshold of being a crew. A fine day's work. We never heard another transmission on that frequency all the way to the coast. For just one day, it truly was fun being the fastest guys out there.","tags":"#general#blackbird","favourites":139,"__v":0,"created_on":"2015-03-17T20:20:03.823Z","score":0.001750979072149379},{"_id":"54bf14322d74781f04a60379","id":311,"pasta":"Ｈｅｌｌｏ  Ｉ＇ｍ  Ｓｎｉｔｈ，  ｐｌａｙｉｎｇ  ｍｙ  ２０２１４３ｔｈ  ｇａｍｅ  ｏｎ  Ｃｈｅｎ．  Ｅｖｅｎ  ｔｈｏｕｇｈ  ｉｔ＇ｓ  ｔｈｅ  ｏｎｌｙ  ｈｅｒｏ  Ｉ  ｐｌａｙ  Ｉ  ｓｔｉｌｌ  ｓｕｃｋ  ａｔ  ｉｔ．  Ａｓ  ａ  ｃｏｍｐｅｎｓａｔｉｏｎ  ｆｏｒ  ｍｙ  ｌａｃｋ  ｏｆ  ｓｋｉｌｌ  Ｉ  ａｍ  ｇｏｉｎｇ  ｔｏ  ｂｕｙ  ａｌｌ  ｓｕｐｐｏｒｔ  ｉｔｅｍｓ  ａｎｄ  ｇａｎｋ  ｍｉｄ  ａｔ  ｌｖｌ  ２  ａｎｄ  ｆａｉｌ．  Ｔｈａｎｋｓ  ｆｏｒ  ｌｉｓｔｅｎｉｎｇ","tags":"#dota2#hello#snith#chen#only#hero#suck","favourites":135,"__v":0,"created_on":"2015-01-21T02:44:07.591Z","score":0.0012166228712103045},{"_id":"54b344916bd15d33165d28a9","id":55,"pasta":"My Grandfather smoked his whole life. I was about 10 years old when my mother said to him, 'If you ever want to see your grandchildren graduate, you have to stop immediately.'. Tears welled up in his eyes when he realized what exactly was at stake. He gave it up immediately. Three years later he died of lung cancer. It was really sad and destroyed me. My mother said to me- 'Don't ever smoke. Please don't put your family through what your Grandfather put us through.\" I agreed. At 28, I have never touched a cigarette. I must say, I feel a very slight sense of regret for never having done it, because your post gave me cancer anyway.","tags":"#reddit#cancer#post#smoking#grandpa","favourites":131,"__v":0,"created_on":"2015-01-12T03:03:39.683Z","score":0.0011317599572849039},{"_id":"550894c765f4abef0cfbe4ff","id":1059,"pasta":"Hearing the difference now isn’t the reason to encode to FLAC. FLAC uses\nlossless compression, while MP3 is ‘lossy’. What this means is that for\neach year the MP3 sits on your hard drive, it will lose roughly 12kbps,\nassuming you have SATA – it’s about 15kbps on IDE, but only 7kbps on\nSCSI, due to rotational velocidensity. You don’t want to know how much\nworse it is on CD-ROM or other optical media.\n\nI started\ncollecting MP3s in about 2001, and if I try to play any of the tracks I\ndownloaded back then, even the stuff I grabbed at 320kbps, they just\nsound like crap. The bass is terrible, the midrange…well don’t get me\nstarted. Some of those albums have degraded down to 32 or even 16kbps.\nFLAC rips from the same period still sound great, even if they weren’t\nstored correctly, in a cool, dry place. Seriously, stick to FLAC, you\nmay not be able to hear the difference now, but in a year or two, you’ll\nbe glad you did.","tags":"#general#audio#FLAC","favourites":128,"__v":0,"created_on":"2015-03-17T20:29:34.751Z","score":0.0016339480436499752}]