[{"_id":"54b5d1ff8ba53a7c3326b4e6","id":156,"pasta":"Well, I'm ready with my can of Monster Energy. I've got my CyberPowerPC turned on and my BenQ screen picture quality is perfect. My Razer headphones sound authentic and my DesignByHumans hoodie is super comfortable. I'm fully supported by my NeedForSeat chair and my computer commands are super fast thanks to HyperX RAM. Clinton \"Fear\" Loomis, take it away!","tags":"#dota2#eg#bleedblue#sellout#fear#oldman","favourites":79,"__v":0,"created_on":"2015-01-14T02:15:00.815Z","score":0.0009814583473417811},{"_id":"54b5592b34b44c1d2984b375","id":110,"pasta":"ʀᴇxxᴀʀ ᴅɪᴀʀʏ ɢᴠɢ ᴅᴀʏ 1: ᴇᴠᴇʀʏ ᴅᴇᴄᴋ ʀᴏʙᴏᴛ ɴᴏᴡ. ᴀᴍ ᴄᴏɴғᴜsᴇ. ᴛʀᴀᴅᴇ ᴏʀ ʜɪᴛ ғᴀᴄᴇ? ɪ ᴘʟᴀʏ ᴛ1 ᴜɴᴅᴇʀᴛᴀᴋᴇʀ ᴄᴏɪɴ ʟᴇᴘᴇʀ ɢɴᴏᴍᴇ? ɢᴠɢ ᴅᴀʏ 2: ᴍᴀɴʏ ᴛʜɪɴᴋɪɴɢ, ʙʀᴀɪɴ ʜᴜʀᴛ. ᴅᴇᴄɪᴅᴇ ᴛᴏ ᴋᴇᴇᴘ ᴜsɪɴɢ ᴏʟᴅ ᴅᴇᴄᴋ. ᴅᴇᴄɪᴅᴇ ᴋᴇᴇᴘ ᴜsᴇ ᴏʟᴅ ᴅᴇᴄᴋ ᴀɴᴅ ʜɪᴛ ғᴀᴄᴇ. ᴀᴍ ᴛʜɪɴᴋ ᴍᴀʏʙᴇ ᴀᴅᴅ ᴅᴇᴀᴛʜʀᴀᴛᴛʟᴇ ʀᴏʙᴏᴛ. ɢᴠɢ ᴅᴀʏ 3: ᴍᴇ sᴛɪʟʟ ᴡɪɴɴɪɴɢ.","tags":"#hearthstone#gvg#hunter#huntard#hit#face","favourites":78,"__v":0,"created_on":"2015-01-13T11:44:20.139Z","score":0.0009671909246197044},{"_id":"54c7be27f63c027608a745ee","id":586,"pasta":"Artour got out of the building. He was a bit frustrated. His team was making him play stupid heroes again. He wanted to play Naga and Terrorblade. Didn't they understand the main goal of Dota is to kill creeps?\nArtour whispered to himself, \"LMFAO wHo cAREAS HAHA Xd\". He sighed and crossed the street. Suddenly Artour's face went pale. On the other side of the street was the Cloud 9 squad. \"J-Jacky...\", he whispered. They were coming at him. He was frozen in place.\nEE looked at him and said \"Long time no see Artour.\" He was speechless as all of them passed by him. Only n0tail stayed there with him, his hands on his pockets. Artour didn't dare to say anything. He hadn't ever seen n0tail with such a grim look.\n\"Having fun with my old team, Artour?\" n0tail asked, a maniac grin growing in his face. \"The team who kicked me because of you.\"\nArtour was panicking. Who was that guy? He surely wasn't the BigDaddy he had met before.\" Don't worry Artour\", continued n0tail, \"I'm not gonna hurt you. In fact, I'm just having fun with my new best friend... Jacky.\"\nThat was it. Artour lost control. \"You'll never steal Jacky from me! Never!\" n0tail's grin got bigger. \"You've always been naive, Artour... I've watched your replays. I know how to please Jacky better than you now.\"\nArtour stared in disbelief. \"W-what...\". N0tail slowly took his hands out of his pockets. A golden glow filled the whole street. Artour fell to his knees as he saw not only one, but two hands of Midas. \"Good luck on the tournament, Artour...\" said n0tail while leaving. Artour sat in the ground, tears in his face. \"Jacky...\" He whispered.","tags":"#dota2#arteezy#rtz#ee#jacky#building#notail#bigdaddy","favourites":77,"__v":0,"created_on":"2015-01-27T16:04:51.524Z","score":0.001051639492654322},{"_id":"54f2b8cd87d1bc685b1e95c8","id":943,"pasta":"░░░░█▒▒▄▀▀▀▀▀▄▄▒▒▒▒▒▒▒▒▒▄▄▀▀▀▀▀▀▄\n░░▄▀▒▒▒▄█████▄▒█▒▒▒▒▒▒▒█▒▄█████▄▒█\n░█▒▒▒▒▐██▄████▌▒█▒▒▒▒▒█▒▐██▄████▌▒█\n▀▒▒▒▒▒▒▀█████▀▒▒█▒░▄▒▄█▒▒▀█████▀▒▒▒█\n▒▒▐▒▒▒░░░░▒▒▒▒▒█▒░▒▒▀▒▒█▒▒▒▒▒▒▒▒▒▒▒▒█\n▒▌▒▒▒░░░▒▒▒▒▒▄▀▒░▒▄█▄█▄▒▀▄▒▒▒▒▒▒▒▒▒▒▒▌\n▒▌▒▒▒▒░▒▒▒▒▒▒▀▄▒▒█▌▌▌▌▌█▄▀▒▒▒▒▒▒▒▒▒▒▒▐\n▒▐▒▒▒▒▒▒▒▒▒▒▒▒▒▌▒▒▀███▀▒▌▒▒▒▒▒▒▒▒▒▒▒▒▌\n▀▀▄▒▒▒▒▒▒▒▒▒▒▒▌▒▒▒▒▒▒▒▒▒▐▒▒▒▒▒▒▒▒▒▒▒█\n▀▄▒▀▄▒▒▒▒▒▒▒▒▐▒▒▒▒▒▒▒▒▒▄▄▄▄▒▒▒▒▒▒▄▄▀\n▒▒▀▄▒▀▄▀▀▀▄▀▀▀▀▄▄▄▄▄▄▄▀░░░░▀▀▀▀▀▀\n▒▒▒▒▀▄▐▒▒▒▒▒▒▒▒▒▒▒▒▒▐\n░▄▄▄░░▄░░▄░▄░░▄░░▄░░░░▄▄░▄▄░░░▄▄▄░░░▄▄▄\n█▄▄▄█░█▄▄█░█▄▄█░░█░░░█░░█░░█░█▄▄▄█░█░░░█\n█░░░█░░█░░░░█░░░░█░░░█░░█░░█░█░░░█░█░░░█\n▀░░░▀░░▀░░░░▀░░░░▀▀▀░░░░░░░░░▀░░░▀░▀▄▄▄▀﻿","tags":"#general#ayy#lmao#alien#ASCII","favourites":75,"__v":0,"created_on":"2015-03-01T06:59:21.552Z","score":0.0013198173821672597},{"_id":"54fa6ecc87d1bc685b1e9640","id":998,"pasta":" @ppdDota ＹＯＵ　ＦＵＣＫＩＮＧ　ＮＥＲＤ　．．：　Ｕ　ＷＩＬＬ　ＮＥＶＥＲ　ＭＡＫＥ　ＳＥＸ　ＩＮ　ＵＲ　ＬＩＦＥ　．．：　ＷＨＩＬＥ　ＩＮ　ＢＲＡＺＩＬ　Ｉ　ＨＡＶＥ　ＳＥＸ　３０　ＴＩＭＥＳ　ＥＡＣＨ　ＤＡＹ　ＡＴ　ＣＡＲＮＡＶＡＬ","tags":"#dota2#ppd#nerd#carnaval#make#sex","favourites":73,"__v":0,"created_on":"2015-03-07T01:15:00.583Z","score":0.0013557764019630348},{"_id":"54b4c805de79968e287f0c69","id":100,"pasta":" ☑ “This gentleman's deck is ABSURD!” ☑ “My deck cannot hope to prevail against a deck of that caliber” ☑ \"He REQUIRED those two cards in subsequent order to succeed\" ☑ “He extracted from his deck the only cards capable of defeating me” ☑ \"His cards defied logic\" ☑ “There was no manoeuvre at my disposal to secure victory” ☑ “I played impeccably”","tags":"#hearthstone#gentleman#kripp#checkboxes","favourites":69,"__v":0,"created_on":"2015-01-13T07:23:21.204Z","score":0.0008710074955281933},{"_id":"54c826aaf63c027608a745f6","id":587,"pasta":"In Portal 2, Valve attached a very sophisticated AI to a potato and it worked just fine. In DotA 2, they've made servers from potatoes but haven't had much success and I can't understand why.","tags":"#dota2#portal#valve#potato#servers","favourites":69,"__v":0,"created_on":"2015-01-27T22:30:23.184Z","score":0.0009603275005886243},{"_id":"54b558cc34b44c1d2984b371","id":106,"pasta":"(▀̿Ĺ̯▀̿ ̿) This is the 0-3 Police, You're coming with us Kripp. (▀̿Ĺ̯▀̿ ̿)","tags":"#police #donger","favourites":66,"__v":0,"created_on":"2015-01-13T11:50:23.224Z","score":0.0008398649651875879},{"_id":"54bf21222d74781f04a603ac","id":332,"pasta":"Hello Bulba, this is your mother. I write here to inform you that your father and I do not approve of your timewaste playing childrens game for the internet. Therefore we are sending you to India to marry your beautiful cousin Venkatanarasimharajuvaripeta and work as a train conductor.","tags":"#dota2#bulba#mother#childrens#games#india#train","favourites":66,"__v":0,"created_on":"2015-01-21T03:42:05.992Z","score":0.0008831177946988291},{"_id":"54b591a2e90c10d22e88b974","id":120,"pasta":"▌▌✈ ▌▌✈ ▌▌✈ ▌▌✈ ▌▌✈ ▌▌Sorry i dropped my bag of 9/11 ▌▌✈ ▌▌✈ ▌▌✈ ▌▌✈ ▌▌✈ ▌▌","tags":"#twitch#9/11#bag#airplane","favourites":65,"__v":0,"created_on":"2015-01-13T21:42:54.355Z","score":0.0008312806909028657},{"_id":"5514dfeeb79c00ce446ab073","id":1337,"pasta":"﻿ＳＩＮＧＳＩＮＧ，  ＨＯＷ  ＤＯ  ＹＯＵ  ＰＬＡＹ  ＭＥＥＰＯ？  ＤＯ  ＹＯＵ  ＭＡＸ  ＰＯＯＦ，  ＬＩＫＥ  ＹＯＵ  ＰＯＯＦＥＤ  ＯＵＴ  ＯＦ  ＲＥＬＥＶＡＮＣＥ？  ＯＲ  ＤＯ  ＹＯＵ  ＭＡＸ  ＮＥＴ，  ＬＩＫＥ  ＹＯＵ  ＮＥＴＴＥＤ  ＺＥＲＯ  ＬＡＮ  ＷＩＮＳ  ＩＮ  ２０１５？  ＭＹ  ＦＡＶＯＲＩＴＥ  ＢＵＩＬＤ  ＩＳ  ＭＡＸＩＮＧ  ＧＥＯＳＴＲＩＫＥ，  ＬＩＫＥ ＹＯＵ  ＳＴＲＵＣＫ  ＲＯＣＫ  ＢＯＴＴＯＭ．  ＰＬＥＡＳＥ  ＡＮＳＷＥＲ","tags":"#dota2#singsing#meepo#build","favourites":64,"__v":0,"created_on":"2015-03-27T03:40:30.309Z","score":0.0014680056293663768},{"_id":"54b2eb88ce7b585004706d88","id":2,"pasta":"( ° ͜ʖ͡°)╭∩╮ Hey Kripp, here's a \"brofist\" for you. ( ° ͜ʖ͡°)╭∩╮","tags":"#hearthstone#hey#kripp#finger#brofist#donger","favourites":61,"__v":0,"created_on":"2015-01-11T21:15:39.961Z","score":0.0007776319214112612},{"_id":"54b481c27622b32a1cea7b76","id":85,"pasta":"☑ “This nazi's holocaust is CRAZY!” ☑ “My jews can't survive against a concentration camp like that” ☑ \"He NEEDED precisely those two gas chambers to win\" ☑ “He built the only Auschwitz that could hold me” ☑ \"He had the perfect SS\" ☑ “There was nothing I could do” ☑ “Anne Frank hid in the attic perfectly\" ☑ \"What a joke\"","tags":"#hearthstone#nazi#holocaust#checkboxes","favourites":60,"__v":0,"created_on":"2015-01-13T02:17:48.452Z","score":0.0007727694600731782},{"_id":"5508c0d0b47c3d010fd9650f","id":1084,"pasta":"Dude you need to quit fucking snap chatting mckenna. Stop. She doesn't respond with anything meaningful for a reason and she's not interested in you.\n\nWho am I?\n\nThe man whom she is in love with.\n\nShe already told me not to worry, she's not interested in you. Sorry I bothered you kid.\n\nI've dated her since 2 summers ago. If you aren't trying to get at my woman or being inappropriate I don't care if you snap her occasionally.\n\nJust don't try anything man. You'll embarrass yourself and anger me.\n\nWe are in love and we're making love tomorrow. So if you have any ill intentions with my woman you can forget it right now. I'm the biggest and best she's ever had, only man she's ever loved and the only man who could truly satisfy her physically. You will never have her. And she loves me.\n\nI don't have any problems with you if you are over my woman and realize you will never be with or touch her again.\n\nI apologize for coming off as a dick, just me and kenna are really deep in love and we've been through a lot and I just moved back home and it makes me a little jealous and angry to see a man she used to date before me is snap chatting her....\n\nWe don't need any extra bullshit or drama right now, so don't bring us any please is all I ask friend.\n\nIf you try to talk to her any way but as a brother, or you try to see her at all, if she tells me you do anything inappropriate or anything outside of what a strict brother like friend would do,we are going to have a huge problem.\n\nI will leave you alone now dude if you're not trying to get at the woman who I love and whom is in love with me.\n\nThat entire summer she was with me. She left kyle for me. She's been with me ever since, she even loved me and made love to me before she EVER let anything happen with you. You didn't please her. She didn't have strong feelings for you at all. And she immediately ended shit with you for me once she knew I loved her too. So get any ideas of the past out of your head.\n\nNone of this truth should bug you if you're over her but I'm just making sure. I hate when my baby's friends have ill intentions and she thinks they are just friends and have no alternative motive. But idk if I trust you at all.\n\nIf I can trust you to not stress me and my baby or fuck with our love tell me.\n\nI will leave you alone and apologize.\n\nBut if you aren't over her and you're tryna \"get some\" or you're tryna get back in her life, it's NOT HAPPENING. She said you were nothing to her, and the sex was bad anyway haha. You're small and weak and she said it all felt wrong after being with me. She's been with me ever since. We're in love. And tomorrow me and her will be together in my room making love alll day how we always have together. If you have a problem speak up like a man or tell me our love doesn't bug you and I'll apologize, it's simple.\n\nSo??? What is it? You are after my woman then huh?!\n\nTell me the fucking truth man. Don't you dare be disrespectful and gross enough to bring it up, but if if you ask her about anything she shared with me about your weak ass, she may be nice and lie to you, or she may not care and tell you the truth. Either way. I'm her soullmate and her boyfriend of the past two years almost. And she tells me everything and NEVER lies to me. I don't care haha. Just stay away from my kenna.\n\nI sincerely apologize if you have no ill intentions and aren't trying to make moves with my woman. And i respect you as a guy in the service. I'm sure you're an ok dude. But just as a friend. You're nothing to my kenna but a brother like friend.\n\nI just wanna be sure you know it and don't forget it.\n\nFind a nice classy woman where you are stationed, marry her.... But back off of mine. You will never even compare to me in her eyes. Not even close haha.I just don't need you interfering with me and kenna's love. It's our lives man. It's really not cool....\n\nGoodbye man, good luck. Respect to you being in the service. Sorry to bring your day down with my crazy bullshit but. Me and kenna are head over heels.... I can't help but be crazy about her. I love her with all of my heart and I will protect her from her untrustworthy fake friends. Not saying you are one. But you're dodging telling me what's going on in your head so I'm questioning a lot right now.\n\nJust know I'm never gonna hurt her, I'm always going to have her back, I'd give my life for her without hesitation, and I will protect her from anything, everything, and anyone.\n\nShe is the love of my life. I fully intend to marry and give kenna my children. And we've talked a lot about it. Just don't make shit harder than it already is.\n\nI just moved back and me and her miss eachother so badly and we are FINALLY go to see eachother tomorrow and make love for the first time since halloween....\n\nI hope you don't hate me man. I'm a good dude. Just protective of the woman who holds my heart. And who's heart I hold and must protect.\n\nI hope you can understand.\n\nShe promised me there's nothing at all to worry about with you and that she's not interested:\"/ I wish I knew before I embarrassingly went off on you. I'm so sorry man.\n\nI'm sorry.\n\nPlease don't mention this to my baby:/ I'm really embarrassed and while she will understand, I just feel like an ass for attacking you when you have nothing with my kenna and no intention to.\n\nGood bye brother. I hope you find your one true love someday. It'll make you crazy, trust me, but you'll find her one day. I found mine when I was really young. And it's my kenna :)","tags":"#reddit#cringe#snapchat#mckenna#stop","favourites":60,"__v":0,"created_on":"2015-03-17T23:57:55.520Z","score":0.001269619212324191},{"_id":"54f00fb287d1bc685b1e95a4","id":927,"pasta":"░░░░░░░░░░░░░░░░.░░░░░░░░░░░░░░ \n░░░░░░░░░░░░░█░░░░░░░░░░░░░░░░░░ \n░░░░░░░░░░░░░█░░░░░░░░░░░░░░░░░░ \n░░░░░░░░░░░░█░█░░░░░░░░░░░░░░░░░ \n░░▄░░░░░░░░░█░█░░░░░░░░░▄▄░░░░░░ \n░░█▀▄░░░░░░█░░░█░░░░░░▄▀█░░░░░░░ \n░░▀▄░▀▄░░░░█░░░█░░░░▄▀░▄▀░░░░░░░ \n░░░█░░░▀▄░░█░░░█░░▄▀░░░█░░░░░░░░ \n░░░░█░░░░█░█░░░█░█░░░░█░░░░░░░░░ \n░░░░░█░░░░█░█░█░█░░░░█░░░░░░░░░░ \n█▄▄▄▄░▀▄░░░██░██░░░▄▀░▄▄▄▄▄▄░░░░ \n▀▄░░░▀▀▄█▄░▀█░█▀░▄█▄▀▀░░░▄▀░░░░░ \n░░▀▀▀▄▄▄▄▄███████▄▄▄▄▄▀▀▀░░░░░░░ \n░░░░░░░░▄▀▀░███░▀▀▄░░░░░░░░░░░░░ \n░░░░░░▄█▄▄▄▀░█░▀▄▄▄█░░▄░░▄▄░▄▄▄░ \n░░░░░░░░░░░░░▀▄░░░░▀▄▀█░█░░██░░█ \n░░░░░░░░░░░░░░▀░░░░█▄▄█▄░▄▀░█░░█ \n░░░░░░░░░░░░░░░░░░░░░░█░█▄▄▄▀▄▄▀","tags":"#general#ASCII#420#blaze#it#pot#weed#marijuana","favourites":59,"__v":0,"created_on":"2015-02-27T06:33:17.582Z","score":0.0010592033773370788}]