[{"_id":"55097608b47c3d010fd96603","id":1185,"pasta":"ヽ༼ຈل͜ຈ༽ﾉ ʀᴀɪsᴇ ᴜʀ ᴅᴏɴɢᴇʀs ヽ༼ຈل͜ຈ༽ﾉ\n(ง°ل͜°)ง I TRIED TO SILENCE MY DONGER ONCE; BOY THAT WENT WELL (ง°ل͜°)ง\nᕦ༼ຈل͜ຈ༽ᕤ Flex your dongers ᕦ༼ຈل͜ຈ༽ᕤ\nᕦ༼ຈل͜ຈ༽ᕤ ＤＯ ＹＯＵ ＥＶＥＮ ＤＯＮＧ? ᕦ༼ຈل͜ຈ༽ᕤ\n┌༼ຈل͜ຈ༽┐ lower your dongers ┌༼ຈل͜ຈ༽┐\n(ง ͠° ل͜ °)ง THE UNSEEN DONGER IS THE DEADLIEST (ง ͠° ل͜ °)ง\n(ง ͠° ل͜ °)ง heres a tip. And a dong behind it (ง ͠° ل͜ °)ง\n(ง ͠ ͠° ل͜ °)ง ᴛᴏ ᴅᴏɴɢᴇʀ, ᴏʀ ɴᴏᴛ ᴛᴏ ᴅᴏɴɢᴇʀ (ง ͠ ͠° ل͜ °)ง\n(ง ͠ ͠° ل͜ °)ง sᴏᴜɴᴅs ᴅᴏɴɢᴇʀᴏᴜs... ɪᴍ ɪɴ (ง ͠ ͠° ل͜ °)ง\n(ง ͠° ل͜ °)ง ᴍᴀsᴛᴇʀ ʏᴏᴜʀ ᴅᴏɴɢᴇʀ, ᴍᴀsᴛᴇʀ ᴛʜᴇ ᴇɴᴇᴍʏ (ง ͠° ل͜ °)ง\n(ง ͠ ͠° ل͜ °)ง ᴛʜᴇ ᴅᴏɴɢᴇʀ ᴀʟsᴏ ʀɪsᴇs (ง ͠ ͠° ل͜ °)ง\n(ง ͠ ͠° ل͜ °)ง YOUR DONGERS ARE INFERIOR (ง ͠ ͠° ل͜ °)ง\n(ง ͠ ͠° ل͜ °)ง MY RIGHT DONGER IS A LOT STRONGER THAN MY LEFT DONGER (ง ͠ ͠° ͟ل͜ ͡°)ง\n(ง ͠ ͠° ل͜ °)ง NEVER UNDERESTIMATE THE POWER OF THE DONGER (ง ͠ ͠° ل͜ °)ง\nヽ( ° ͜ʖ͡°)ﾉ ʀuʙ ᴍʏ ᴅᴏɴɢᴇʀ ヽ( ° ͜ʖ͡°)ﾉ\n(ง •̀_•́)ง focus your dongers (ง •̀_•́)ง\n༼ ºل͟º༼ ºل͟º༼ ºل͟º༼ ºل͟º ༽ºل͟º ༽ºل͟º ༽YOU CAME TO THE WRONG DONGERHOOD༼ ºل͟º༼ ºل͟º༼ ºل͟º༼ ºل͟º ༽ºل͟º ༽ºل͟º ༽\n༼ ºل͟º ༼ ºل͟º ༼ ºل͟º ༽ ºل͟º ༽ ºل͟º ༽ YOU PASTARINO'D THE WRONG DONGERINO ༼ ºل͟º ༼ ºل͟º ༼ ºل͟º ༽ ºل͟º ༽ ºل͟º ༽\n༼ ºل͟º༼ ºل͟º༽ºل͟º ༽ YOU COPERINO﻿ FRAPPUCCIONO PASTARINO'D THE WRONG DONGERINO ༼ ºل͟º༼ ºل͟º༽ºل͟º ༽\n༼ ºل͟º༼ ºل͟º༼ ºل͟º༼ ºل͟º ༽ºل͟º ༽ºل͟º ༽You either die a DONG, or live long enough to become the DONGER༼ ºل͟º༼ ºل͟º༼ ºل͟º༼ ºل͟º ༽ºل͟º ༽ºل͟º ༽\nᕙ༼ຈل͜ຈ༽ᕗ. ʜᴀʀᴅᴇʀ,﻿ ʙᴇᴛᴛᴇʀ, ғᴀsᴛᴇʀ, ᴅᴏɴɢᴇʀ .ᕙ༼ຈل͜ຈ༽ᕗ\n(ง ͠° ل͜ °)ง LET ME DEMONSTRATE DONGER DIPLOMACY (ง ͠° ل͜ °)ง\n(ง'̀-'́)ง ＤＯＮＧ ＯＲ ＤＩＥ (ง'̀-'́)ง\nヽ༼ຈل͜ຈ༽ﾉ raise your dongers ヽ༼ຈل͜ຈ༽ﾉ\nヽ༼ຈل͜ຈ༽ﾉ VOICE OF AN ANGEL ヽ༼ຈل͜ຈ༽ﾉ\nヽ༼ຈل͜ຈ༽ﾉ LETS GET DONGERATED ヽ༼ຈل͜ຈ༽ﾉ\nヽ༼ຈل͜ຈ༽ﾉ RAISE YOUR BARNO ヽ༼ຈل͜ຈ༽ﾉ\nヽ༼ຈل͜ຈ༽ﾉITS A HARD DONG LIFE ヽ༼ຈل͜ຈ༽ﾉ\nヽ༼ຈل͜ຈ༽ﾉ \"I have a dong\" ヽ༼ຈل͜ຈ༽ﾉ - Martin Luther King Jr.\nヽ༼ຈل͜ຈ༽ﾉ WHAT DOESNT KILL ME ONLY MAKES ME DONGER ᕙ༼ຈل͜ຈ༽ᕗ\nノ(ಠ_ಠノ ) ʟᴏᴡᴇʀ ʏᴏᴜʀ ᴅᴏɴɢᴇʀs ノ(ಠ_ಠノ)\nヽ༼Ὸل͜ຈ༽ﾉ HOIST THY DONGERS ヽ༼Ὸل͜ຈ༽ﾉ\n༼ ºل͟º ༽ I AM A DONG ༼ ºل͟º ༽\n༼ ºل͟º༽ I DIDN'T CHOOSE THE DONGLIFE, THE DONGLIFE CHOSE ME ༼ ºل͟º༽\n༼ ºل͟º༽ NO ONE CARED WHO I WAS UNTIL I PUT ON THE DONG ༼ ºل͟º༽\n༼ ºººººل͟ººººº ༽ I AM SUPER DONG ༼ ºººººل͟ººººº ༽\n┌∩┐༼ ºل͟º ༽┌∩┐ SUCK MY DONGER ┌∩┐༼ ºل͟º ༽┌∩┐\nζ༼Ɵ͆ل͜Ɵ͆༽ᶘ FINALLY A REAL DONG ζ༼Ɵ͆ل͜Ɵ͆༽ᶘ\n<ᴍᴇssᴀɢᴇ ᴅᴏɴɢᴇʀᴇᴅ>\nヽ༼ʘ̚ل͜ʘ̚༽ﾉIS THAT A DONGER IN YOUR POCKET?ヽ༼ʘ̚ل͜ʘ̚༽ﾉ\n༼ ͡■ل͜ ͡■༽ OPPA DONGER STYLE ༼ ͡■ل͜ ͡■༽\n( ° ͜ ʖ °) REGI OP ( ° ͜ ʖ °)\n(▀̿ ̿Ĺ̯̿̿▀̿ ̿) IM DONG,JAMES DONG (▀̿ ̿Ĺ̯̿̿▀̿ ̿)\n(ง⌐□ل͜□)ง WOULD YOU HIT A DONGER WITH GLASSES (ง⌐□ل͜□)ง\nʕ•ᴥ•ʔ CUDDLE UR DONGERS ʕ•ᴥ•ʔ\nლ(́◉◞౪◟◉‵ლ) let me hold your donger for a while ლ(́◉◞౪◟◉‵ლ)\nヽ༼ຈل͜ຈ༽ง MY RIGHT DONG IS ALOT STRONGER THAN MY LEFT ONE ヽ ༼ຈل͜ຈ༽ง\n(✌ﾟ∀ﾟ)☞ May the DONG be with you! ☚(ﾟヮﾟ☚)\nѰζ༼ᴼل͜ᴼ༽ᶘѰ HIT IT WITH THE FORK Ѱζ༼ᴼل͜ᴼ༽ᶘѰ\n(ง ͡ʘ ͜ʖ ͡ʘ)ง GO FABBBYYY GO (ง ͡ʘ ͜ʖ ͡ʘ)ง\n( ° ͡ ͜ ͡ʖ ͡ °)ﾉ RAISE YOUR GENJAS ヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉ\n༼ ºل͟º༼ ºل͟º༽ºل͟º ༽ Chester Cheeto Support our Dongers ༼ ºل͟º༼ ºل͟º༽ºل͟º ༽\nヽ༼ຈل͜ຈ༽ﾉ NEVER UNDERESTIMATE THE POWER OF THE DONG CODE ヽ༼ຈل͜ຈ༽ﾉ\nヽ༼° ل͜ °༽ﾉ DONGMACIA NOW AND FOREVER ヽ༼° ل͜ °༽ﾉ\n(ง ͠° ل͜ °)ง DON'T YOU DONG ME, SUMMONER?? (ง ͠° ل͜ °)ง\nง ͠° ل͜ °)ง MASTER YOUR DONGER, MASTER THE ENEMY (ง ͠° ل͜ °)ง\n(ง ͠° ل͜ °)ง FOR MY FATHER THE DONG (ง ͠° ل͜ °)ง\n╭∩╮( °﻿ ͜ʖ͡°)wнαт doeѕɴт ĸιll мe мαĸeѕ мe doɴɢer ( °﻿ ͜ʖ͡°)╭∩╮\n(ง ͠° ل͜ °)ง KNOWN IF THE DONGERS WERE TURNED I WOULD SHOW YOU NO DONG (ง ͠° ل͜ °)ง\n(っ◕‿◕)っpenetrate nintendude's anus (っ◕‿◕)っ\n(ง ͠° ل͜ °)ง Your donger belongs in a museum (ง ͠° ل͜ °)ง\nヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉ YOU CAME TO THE WRONG GENJAHOOD ヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉ\n( ° ͜ʖ͡°) Mom always said my donger was big for my age ( ° ͜ʖ͡°)\n( ° ͜ʖ͡°) I WAS BORN WITH A NEEDLESSLY LARGE DONGER ( ° ͜ʖ͡°)\n( ° ͜ʖ͡°) IS THAT A DONGER IN YOUR POCKET? ( ° ͜ʖ͡°)\n(ง ͠° ل͜ °)ง Vi? Stands For DONGER (ง ͠° ل͜ °)ง\nヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉ I BELIEVE I CAN DONGヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉ\nΨ༼ຈل͜ຈ༽Ψ﻿ HIT IT WITH A DONGER Ψ༼ຈل͜ຈ༽Ψ\n༼ʘ̚ل͜ʘ̚༽ I NEED A DONGTOR ༼ʘ̚ل͜ʘ̚༽\nヽ༼ຈل͜ຈ༽ﾉ Darude your Sandstorms ヽ༼ຈل͜ຈ༽ﾉ\n༼ ºل͟º༼ ºل͟º༼ ºل͟º༼ ºل͟º ༽ºل͟º ༽ºل͟º ༽ºل͟º ༽ 7 DEADLY DONGERS ༼ ºل͟º༼ ºل͟º༼ ºل͟º༼ ºل͟º ༽ºل͟º ༽ºل͟º ༽ºل͟º ༽\nヽ( ͝° ͜ʖ͡°)ﾉ IMAGINE IF I HAD A REAL DONGER ヽ( ͝° ͜ʖ͡°)ﾉ\n~(˘▾˘~) Wave Your Dongers (~˘▾˘)~\nwork it ᕙ༼ຈل͜ຈ༽ᕗ harder make it (ง •̀_•́)ง better do it ᕦ༼ຈل͜ຈ༽ᕤ faster raise ur ヽ༼ຈل͜ຈ༽ﾉ donger\nɳ༼ຈل͜ຈ༽ɲ more than ever hour after ɳ༼ຈل͜ຈ༽ɲ\nヽ ༼ຈل͜ຈ༽ﾉ our work is always dongers ヽ༼ຈل͜ຈ༽ﾉ\nヽ༼ຈل͜ຈ༽ﾉ FOREVER DONG ヽ༼ຈل͜ຈ༽ﾉ\n༼ ºل͟º ༼ ºل͟º ( ° ͡ ͜ ͡ʖ ͡ °) ºل͟º ༽ ºل͟º ༽ 5 MEN 1 DREAM 9 EYEBROWS ༼ ºل͟º ༼ ºل͟º( ° ͡ ͜ ͡ʖ ͡ °) ºل͟º ༽ ºل͟","tags":"#general#oh#god#the#dongers#long#list#all","favourites":344,"__v":0,"created_on":"2015-03-18T12:54:20.125Z","score":0.004367550425624399},{"_id":"54b59230e90c10d22e88b97e","id":126,"pasta":"ヽヽ༼༼ຈຈل͜ل͜ຈຈ༽༽ﾉﾉ HAFU TURN OFF THE VIBRATOR ヽヽ༼༼ຈຈل͜ل͜ຈຈ༽༽ﾉﾉ","tags":"#hearthstone#hafu#vibrator#donger","favourites":340,"__v":0,"created_on":"2015-01-13T21:46:19.211Z","score":0.0028311773916546447},{"_id":"54bf2af73b0a330105ff5bab","id":344,"pasta":"n0tail u r fuckin perfect m8.\nyou're a flower. you're also a rainbow and a river. you are the manifestation of all perfection and i want to i don't fucking know. i want this to not sound gay, but you are fucking perfect, n0tail.\nty for listening","tags":"#dota2#n0tail#fucking#perfect#perfection","favourites":338,"__v":0,"created_on":"2015-01-21T04:27:41.355Z","score":0.0029375127025361553},{"_id":"54b5dbdf70c589513562570e","id":173,"pasta":"He's a good player, a bit overated in my opinion. But defenitely okay to be in a top team! To say that he is one of the best solo mids etc is really exageration, he played like 10 games in a high level LAN, you need way more to compare him to Dendi, s4 or FATA","tags":"#dota2#rtz#7ckingmad#overrated#arteezy","favourites":325,"__v":0,"created_on":"2015-01-14T02:52:29.786Z","score":0.0027296688677656824},{"_id":"54b472cd7622b32a1cea7b71","id":83,"pasta":" <:::::[]=¤༼ຈل͜ຈ༽ﾉ I am the knight of spamerino. Stand back foul moderino <:::::[]=¤༼ຈل͜ຈ༽ﾉ","tags":"#knight#spam#nazi#mods#sword#donger","favourites":318,"__v":0,"created_on":"2015-01-13T01:20:07.684Z","score":0.0026643955260111625},{"_id":"54eb4710c200ce525fb25da2","id":902,"pasta":"10/10 quality thread, an emotional rollercoaster that kept me on the edge of my seat the entire time. I laughed, I cried, I learned 42 new ways to season and cook a pork shoulder. Truly a new standard has been set that all future threads will be held in comparison to.","tags":"#reddit#quality#thread#shit#post","favourites":296,"__v":0,"created_on":"2015-02-23T14:06:06.856Z","score":0.0032502265354638943},{"_id":"54b2e7a4ce7b585004706d6f","id":1,"pasta":"☑ “This guy's deck is CRAZY!” ☑ “My deck can't win against a deck like that” ☑ \"He NEEDED precisely those two cards to win\" ☑ “He topdecked the only card that could beat me” ☑ \"He had the perfect cards\" ☑ “There was nothing I could do” ☑ “I played that perfectly\"","tags":"#hearthstone#kripp#checkboxes#topdeck#crazy","favourites":275,"__v":0,"created_on":"2015-01-11T21:14:04.886Z","score":0.0023441637881177766},{"_id":"54b4ba70864e0cf426846c4f","id":94,"pasta":"ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ༼ຈل͜ຈ༽ﾉ☂ ɪᴛs ʀᴀɪɴɪɴɢ sᴀʟᴛ! ヽ༼ຈل͜ຈ༽ﾉ☂ ヽ｀ヽ｀、ヽヽ｀ヽ｀、｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ、ヽヽ｀ヽ","tags":"#raining#salt#donger","favourites":248,"__v":0,"created_on":"2015-01-13T06:25:48.202Z","score":0.0021667844566712387},{"_id":"54bf3ace3b0a330105ff5bd2","id":358,"pasta":"As Artour stood in the school library, the dean approached him:\n\"Artour\" He said \"This is your last exam, if you fail this you're out, Babaevsky.\"\n As he turned his face slowly, with a grin as large as his GPM, he responded with \nsuch elegance:\"LMFAO wHo cAREAS HAHA Xd\" ","tags":"#dota2#rtz#arteezy#school#library#dean#gpm","favourites":243,"__v":0,"created_on":"2015-01-21T05:27:38.041Z","score":0.002229666456067685},{"_id":"54b6b333f6a1885137f43d01","id":199,"pasta":"☐ Not REKT \n\n☑ REKT \n\n☑ REKTangle \n\n☑ SHREKT \n\n☑ REKT-it Ralph \n\n☑ Total REKTall \n\n☑ The Lord of the REKT \n\n☑ The Usual SusREKTs \n\n☑ North by NorthREKT \n\n☑ REKT to the Future \n\n☑ Once Upon a Time in the REKT \n\n☑ The Good, the Bad, and the REKT \n\n☑ LawREKT of Arabia \n\n☑ Tyrannosaurus REKT \n\n☑ eREKTile dysfunction","tags":"#general#twitch#rekt#checkboxes","favourites":240,"__v":0,"created_on":"2015-01-14T18:10:31.549Z","score":0.0021259591365399874},{"_id":"5508c04db47c3d010fd9650b","id":1080,"pasta":"So ur with ur honey and yur making out wen the phone rigns. U anser it n the vioce is \"wut r u doing wit my daughter?\" U tell ur girl n she say \"my dad is ded\". THEN WHO WAS PHONE?","tags":"#4chan#creepy#who#was#phone","favourites":240,"__v":0,"created_on":"2015-03-17T23:39:39.694Z","score":0.003218062799650004},{"_id":"55090bc4b47c3d010fd965df","id":1172,"pasta":"Lindsay was 12 when it first started. One morning she awoke to find odd little crumbs in her bed. At first she thought they were crackers, but as she was getting dressed for school she noticed a small little tan 'O' laying on the floor next to her nightstand. It was a cheerio. She picked it up and looked at it for a moment, its wholesome oaty contours seeming perfectly harmless. She threw it away, assuming that her bratty older sister was responsible. Little did she know that it was an omen of the pure mind bending horror which was soon to follow. That weekend her mother went shopping.\n\nShe had gotten in the habit of doing all the grocery shopping for the month at once, so the kitchen was packed full of bags and boxes as the girls went about putting things away. Lindsay was disappointed when she noticed that the only cereal her mother had gotten was Cheerios. It was always Cheerios. Four economy-sized boxes worth, no less. Lindsay had never liked Cheerios, even though her sister seemed to love them. They were too plain. Too boring, She thrust the boxes carelessly up onto the shelf above the refrigerator and went searching through the other bags to see if her mother had gotten anything that was actually edible. Later that night she was tossing and turning in bed, her stomach full of slightly too much Butterfinger ice cream. The house was silent. Everyone else was in bed. Or should have been. Lindsay had almost dozed off when a soft, dry rustling sound brought her back to wakefulness. At first she thought it was the cat scratching at her door, but as she sat up she realized it was coming from somewhere inside the room. A twinge of fear shivered through her body. They'd never had rats or mice in the house before. Was it a bug?\n\nWhatever it was, it sounded big. Lindsay was scared. She felt the urge to huddle underneath her blankets and hide until it went away. Instead, she gathered her courage and reached out to turn on the lamp beside her bed. Just as she touched it, the noise suddenly stopped. She flicked it on and jumped back into the center of her bed, clutching the sheets tightly around her as light spilled out into the room. There was nothing there. She peeked carefully over the sides of her bed, seeing only the rug and a few Girls' Life magazines. Taking her heaviest pillow to use as a weapon, she got out of bed and padded slowly towards the door. Right as she reached it she froze. looking down. Peeking out from the crack beneath her round half-circle of a cheerio. Puzzled, she opened the door. Before her loomed a seven-foot wall of cheerios.\n\nThey covered the doorway completely as the entire hallway had been filled with them. And they were moving. They were alive and crawling over each other like a mass of legless insects, filling the air with the heavy smell of whole grain oats. Lindsay ran and jumped back onto her bed. She huddled and clutched the pillow over her head, and screamed. She was still screaming when her parents came in. Her mother soothed her, wanting to know what was the matter. The cheerios were gone. Lindsay told her that it was just a nightmare. She didn't want them to think she was crazy. After a little while her parents left, her father muttering something about 'night terrors' as they walked back upstairs.\n\nWhen they were gone, Lindsay stuffed her blanket under the crack of her door and sat up with the light on. She tried her best to stay awake all night, but after a few hours she finally fell asleep. When she awoke there were a handful of crumbs in her bed. For a few weeks afterward Lindsay was able to sleep on the floor in her sister Susan's room, though she had to use all of her allowance as a bribe. Then her parents found out and made her go back to her own room. Lindsay's dad got her a lock for the door, telling her it would help her to feel safe. It didn't.\n\nThe very first night she was back in her room, she heard the rustling noise again. She'd kept the lamp on but this time the light didn't seem to help. She huddled there, watching the door and hoping it would go away. Then the blanket moved. She'd stuffed it under the door again as tightly as she could, but now the corner of it was being pushed back into her room by something on the other side. Lindsay was pretty sure she knew that something was. The cheerios were coming for her. Just then the lamp went out and the room plunged into darkness. She stifled a scream, telling herself it was just a nightmare.\n\nCheerios couldn't move or unplug lights. They didn't come after people. Then something light and dry brushed against her cheek, and all rational thought left her mind as she was seized in the cold grip of terror. She opened her mouth to scream, gagging as it was immediately filled with tiny rings of cereal. She felt it moving all over her body. She bit and chewed and spit, trying to clear her mouth so she could call for help. But no matter how much of it she crunched up, more always took its place. The cheerios seemed to collect into narrow tendrils as they snaked over her body. She shuddered in shock and disbelief as she felt the buttons of her pajama top being pulled open one by one. Suddenly she was grabbed around the arms and ankles and lifted up above the bed, her face toward the ceiling.\n\nDry, searching fingers of cereal probed into the waistband of her pj bottoms and yanked them down just as her shirt was pulled up over her head. She was still too young to wear a bra, and she immediately felt the cheerios coil around her small, developing breasts and squeeze them roughly. Lindsay whimpered and kicked as her panties were stripped off. No, she thought, it couldn't want that. *Please* let it not be that... Her legs were quickly restrained while another tendril slid up slowly along her inner thigh. thousands more gripped her buttocks, holding her up and kneading her firm athletic flesh as more began circling over her nipples. Lindsay gasped through her nose, her mouth still full of cheerios. It was weird and horrible, but the touching felt good at the same time.\n\nThen she felt the tendril rubbing lightly over her exposed labia, and she thrashed about uselessly as it began nudging and probing at her most private spot. It caressed the lips of her young vulva almost tenderly for a few long minutes before she felt it nudge harder at the entrance to her vagina. Her body stiffened as she felt it pushing inside her. It felt rough, even though the surface had been moistened by her fearful sweat and the natural wetness within her. The cheerio tendril entered her slowly, relentlessly. It didn't thrust in and out like she'd expected it to, instead it seemed to be pouring itself into her, filling her vagina with tiny cereal O's.\n\nShe could feel them snapping and crunching inside her as she clenched down to try and keep them out. The tendrils on her body seemed to get stronger. groping at her breasts and ass and tugging hard at her nipples. She felt her pussy stretching as it was packed full of rapacious cheerios, the growing pressure sending mixed tingles of pain and pleasure rippling through her body. Then she felt the presence of yet another narrow tendril rubbing insistently against the tight pucker of her butthole. Lindsay came as it pushed inside her, her body shivering uncontrollably as she was reluctantly overcome by pulsing waves of ecstasy. At that moment there was a quiet knock on the door. Her mother's voice called out, asking if she was okay. The cheerios quickly drew away, vanishing into the darkness just as abruptly as they'd arrived.\n\nLindsay could still feel some remnants in her vagina and ass as she got up weakly and pulled her pjs back on. Her mother looked concerned when Lindsay opened the door, but the explanation of another nightmare seemed to put her at ease. When she'd gone back up to bed, Lindsay went into the bathroom and sat on the toilet, feeling ashamed and violated as she let the last of the soggy cereal mush drip out of her body. She still hated cheerios. Now more than ever.","tags":"#general#cheerios#rape#erotica#nonconsent#nsfw","favourites":237,"__v":0,"created_on":"2015-03-18T05:10:43.202Z","score":0.0031901582742022644},{"_id":"54b5f438f6a1885137f43cda","id":184,"pasta":"Arteezy sat in a dark room. The words \"Dire Victory\" filled up the screen. Not even Arteezy's shadow fiend could win this game. 3/8/7 378 GPM. Tears filled Arteezy's eyes as he carassed his hand of midas. The sound of hard core gangster rap and crying filled the room. The door creaks open and EE-sama enters the room. \"You lost Artour.\" \"You do know what happens when you lose.\" Arteezy removed his clothes, wearing only one of EE's anime wigs. EE removed his clothes, \"You lost 23 MM. Thats how many hours your punishment will be.\" Arteezy spent the next 23 hours being furiously fucked by his mentor. After the punishment the semen covered Arteezy arised. \"Thank you master, I can't wait to return the favor when you lose.\" Envy smiled. \"So will I Artour.\"","tags":"#dota2#arteezy#rtz#eternalenvy#ee#midas#fanfic","favourites":229,"__v":0,"created_on":"2015-01-14T04:41:41.443Z","score":0.002037609904775381},{"_id":"54fb95f187d1bc685b1e9646","id":1001,"pasta":"Darude- status\n☐ Not Sandstorm\n☑ Sandstorm","tags":"#general#twitch#darude#sandstorm","favourites":229,"__v":0,"created_on":"2015-03-08T00:21:02.434Z","score":0.0028666068390143583},{"_id":"54bf29182d74781f04a603c1","id":341,"pasta":"ʕ ͡•ᴥ ͡• ʔ(_̅_̅_̅FISSURE_̅_̲̅_̅_̅_̅()","tags":"#dota2#earthshaker#fissure#bear#bare","favourites":222,"__v":0,"created_on":"2015-01-21T04:15:00.449Z","score":0.0020666141294326396}]