[{"_id":"57052eac709549ef048c49e2","id":2672,"pasta":"Look, if you had mom's spaghetti,Would you capture it or just let it slip? Yo His palms spaghetti, knees weak, arms spaghetti There's vomit on his sweater spaghetti, mom's spaghetti He's nervous, but on the surface he looks calm spaghetti to drop bombs, But he keeps on spaghetti what he wrote down, The whole crowd goes spaghetti He opens his mouth, but spaghetti won't come out He's choking how, everybody's joking now\nspaghetti run out, time's up, over, bloah! Snap back to spaghetti, Oh there goes spaghetti Oh, there goes spaghetti, bloah He's so mad, but he won't give up spaghetti, no. He won't have it, he knows he keeps on forgetting that mom's spaghetti's dope He knows that but he's broke He's so stagnant, he knows When he goes back to his mom's spaghetti, that's when it’s Back to the lab again, yo This whole spaghetti He better go capture spaghetti and hope it don't pass him You better lose yourself in mom's spaghetti, it's ready you better never let it go(go) You only get one spaghetti, do not miss your chance to blow cause spaghetti comes once in a lifetime yo You better lose yourself in mom's spaghetti, it's ready you better never let it go(go) You only get one spaghetti, do not miss your chance to blow cause spaghetti comes once in a lifetime yo (You better) The soul's escaping, through this hole that is gaping mom's spaghetti's mine for the taking Make me spaghetti, as we move toward a new world order A normal sweater is boring, but mom's spaghetti's close to post mortemIt only grows harder, spaghetti grows hotter He vomits all over. spaghetti's all on him Coast to coast shows, he blows his own daughter He only grows harder, only grows hotter He goes home and barely knows his own mom's spaghetti there's vomit on his mom's spaghetti His hoes don't want him no more, he's cold spaghetti They moved on to the next schmoe who flows man he knows his palms are sweaty ope hes calm and ready ope and unfolds I suppose it's old spaghetti chewed up and spit out he's chokin now You better lose yourself in mom's spaghetti, it's ready you better never let it go(go) You only get one spaghetti, do not miss your chance to blow cause spaghetti comes once in a lifetime yo You better lose yourself in mom's spaghetti, it's ready you better never let it go(go) You only get one spaghetti, do not miss your chance to blow cause spaghetti comes once in a lifetime yo (You better) No more games, I'ma change what you call spaghetti Tear this motherfucking roof off like two mom's spaghettis I was playing in the beginning, the mood all changed spaghetti chewed up and spit out and there's vomit on his sweater But I kept chewin and stepped right into the next cypher Hold your nose cause here goes the damn diaper All the vomit inside amplified by the fact That I keep on forgetting to make spaghetti And I can't provide the right type of spaghetti for my family Cause man, these goddamn food stamps don't buy spaghetti And it's no movie, there's no mom's spaghetti, this is my life And these palms are so sweaty, and i'm so hard My seed's escaping through this hole that is gaping caught up between being a father and a prima donna Baby vomit's on his sweater already Mom's spaghetti he's nervous bloah another day of monotony Has gotten me to the point, I'm like a momI've got to formulate spaghetti or I end up in jail or shot spaghetti is my only motherfucking option, vomit's not Mom, I love you, but this vomit's got to go ope ope, led de dome de dome led de dome de dome So here I go it's my shot. this may be the only mom's spaghetti that I got You better lose yourself in mom's spaghetti, it's ready you better never let it go(go) You only get one spaghetti, do not miss your chance to blow cause spaghetti comes once in a lifetime yo You better lose yourself in mom's spaghetti, it's ready you better never let it go(go) You only get one spaghetti, do not miss your chance to blow cause spaghetti comes once in a lifetime yo (You better) Mom's Spaghetti You can do anything man","tags":"#spaghetti#eminem#remix","favourites":185,"__v":0,"created_on":"2016-04-06T15:43:40.571Z","score":0.005000078196040879},{"_id":"54e02a0026efea8810640220","id":794,"pasta":" ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ༼ຈ ل͜ຈ༽ﾉ•︻̷┻̿═━一 ｈｏｈｏ　ｈａｈａ　ｓｈｒａｐｎｅｌヽ༼ຈل͜ຈ༽ﾉ•︻̷┻̿═━一 ヽ｀ヽ｀、ヽヽ｀ヽ｀、｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ、ヽヽ｀ヽ","tags":"#dota2#shrapnel#sniper","favourites":183,"__v":0,"created_on":"2015-02-15T05:02:49.424Z","score":0.0005940174378073266},{"_id":"56eb993b709549ef048c4902","id":2599,"pasta":"*A little girl walks into her mothers room*\n<\"Hey mommy?\"\n>\"Yes baby?\"\n<\"Where's daddy?\" \n*crippling loneliness hits the mother so hard she dies of a heart attack*","tags":"#4urkid#meme#happenstomeeveryday#story","favourites":183,"__v":0,"created_on":"2016-03-18T05:59:23.233Z","score":0.003913549551437816},{"_id":"55bd5fc5f300bfdf5990c0de","id":1947,"pasta":"──────────────██▒▒▒▒▒▒▒▒██─────── ─────────────██▒▒▒▒▒▒▒▒▒██─────── ────────────██▒▒▒▒▒▒▒▒▒▒██─────── ───────────██▒▒▒▒▒▒▒▒▒██▀──────── ──────────██▒▒▒▒▒▒▒▒▒▒██───────── ─────────██▒▒▒▒▒▒▒▒▒▒▒██───────── ────────██▒████▒████▒▒██───────── ────────██▒▒▒▒▒▒▒▒▒▒▒▒██───────── ────────██▒────▒▒────▒██───────── ────────██▒─██─▒▒─██─▒██───────── ────────██▒────▒▒────▒██───────── ────────██▒▒▒▒▒▒▒▒▒▒▒▒██───────── ───────██▒▒█▀▀▀▀▀▀▀█▒▒▒▒██─────── ─────██▒▒▒▒▒█▄▄▄▄▄█▒▒▒▒▒▒▒██───── ───██▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒██─── ─██▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒██─ █▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒█ █▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒█ █▒▒████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒████▒▒█ ▀████▒▒▒▒▒▒▒▒▒▓▓▓▓▒▒▒▒▒▒▒▒▒▒████▀ ──█▌▌▌▌▒▒▒▒▄▄▒▒▒▒▒▒▒▒▒▒▒▒▌▌▌███── ───█▌▌▌▌▌▌█░░▀▄▌▌▌▌▌▌▌▌▌▌▌▌▌█──── ───█▌▌▌▌▌▌▌▀▄░░▀▄▌▌▌▌▌▌▌▌▌▌▌█──── ────▀█▌▌▌▌▌▌▌▀▄░░▀▄▌▌▌▌▌▌██▀───── ─────█▌▌▌▌▌▌██▀░░░░█▌▌▌▌▌██────── ──────██▒▒██─▀▄▄▀▄▄▀██▒▒██─────── ──────▀████▀────────▀████▀─────","tags":"#ASCII#patrick#penis#spongebob#squarepants","favourites":182,"__v":0,"created_on":"2015-08-02T00:09:41.759Z","score":0.0009738174338859056},{"_id":"54b59324e90c10d22e88b982","id":128,"pasta":"Forsen enters his bedroom and notices something unusual. In his bed lays a 6/3 Reynad in stealth. Forsen has no answer for this play. He passes his turn and prepares himself for the donger of destiny.","tags":"#hearthstone#forsen#reynad#donger#bed","favourites":179,"__v":0,"created_on":"2015-01-13T21:50:00.027Z","score":0.0005400215410546892},{"_id":"54b4c0576ef754dd27d5fd9f","id":98,"pasta":"ヽ༼ຈل͜ຈ༽ﾉ NOW WE RIOT ヽ༼ຈل͜ຈ༽ﾉ","tags":"#riot#donger","favourites":177,"__v":0,"created_on":"2015-01-13T06:51:00.673Z","score":0.0005341914128856756},{"_id":"565b237914bb47530dfef2c0","id":2401,"pasta":"(◕‿◕✿) Kawaii in the streets. Senpai in the sheets ( ͝° ͜ʖ͡°)","tags":"#kawaii#senpai#general","favourites":177,"__v":0,"created_on":"2015-11-29T16:10:33.350Z","score":0.0016294859237779046},{"_id":"550960b8b47c3d010fd965f7","id":1177,"pasta":"The Black Rat, Rattus Rattus, was first described by Henrik Ahnberg in his 18th century work “A Dong’s guide to Dota”. An elusive and hardy creature, the rat excels at damaging structures and retreating at the first sign of danger, only to begin its attack anew once the threat has passed. Unlike many of his peers, Ahnberg greatly respected the rat, finding many of its features similar to his own. His love for the rat became so great that he soon left the world of men and descended into the sewers to live among the rats, eventually becoming their king.","tags":"#dota2#admiralbulldog#rat#bulldong","favourites":176,"__v":0,"created_on":"2015-03-18T07:41:43.933Z","score":0.000621987712663018},{"_id":"56faf180709549ef048c495f","id":2628,"pasta":"I sexually identify as Sonic the Hedgehog. Ever since I was a small child I played with myself all the time, I couldn't stop playing with myself, even when I had a job as a master baiter at a fish shop. So please start calling me Sonic, and if you don't I'm gonna go fast up ur anus.","tags":"#sexual#sonic#play#4urkid#imgonnafuckurmom","favourites":176,"__v":0,"created_on":"2016-03-29T21:20:00.744Z","score":0.0043398864604111825},{"_id":"54b2eb9ece7b585004706d97","id":17,"pasta":"Hello my name is Sing_sing and I am from the distant future. I am here to inform you, past Sing_sing that you must replace S4 on SECRET and travel with your new team to the TI5 EU Hub and play Mario Party for 2 weeks straight, if you fail to do this The Bankers will take over the world and it will descend into chaos. Thank you for listening to future Sing_sing. Please no pasta alfredo","tags":"#sing#singsing#dota2#secret","favourites":175,"__v":0,"created_on":"2015-01-11T21:24:27.532Z","score":0.0005274349333121286},{"_id":"56ea338e709549ef048c48db","id":2567,"pasta":"You are about to get spammed with 600 dank memes. Prepare all nukes and weapons for the Great Spam War. If you can contain the amount of spam I have, you will be granted with special powers that allow you to smoke weed 200 times harder. Not only that, but you will have a laggy as fuck laptop. You know how lucky you are?????? My laptop runs at 669FPS and it never lags or is slow. YOU LUCKY SON OF A GUN. You will pay the price by me giving you a link (Which shall contain a download) which will wipe all your memory off the face of this universe and overwrite it with my own software, Memesoftlocker2.0000.0. You are so damn lucky you know that? NOT EVEN I HAVE IT SLUT. But if you were able to read up to this point congratulations, you suck. But click this link www.mymom.;;;;;;/eeeeeeee.crash; and you will be taken to a memory erase phrase. You lucky slut, but you will get the best computer software ever that makes your computer lag so bad that you can't even use it. LIKE HOW AMAZING??? Yes, I promise you this is 420% legit. But if you spread this abusive software you have EARNED I will suck you off this living universe so be careful buddy. Now, Please stop reading this message as it ends now...","tags":"#imbor3d#general#meme","favourites":175,"__v":0,"created_on":"2016-03-17T04:33:18.885Z","score":0.003725868033161947},{"_id":"55ee4103496ad3a51db512a2","id":2117,"pasta":"ʷʰʸ ᵗʰᵉ fᵘͨᵏ ʸºᵘ ˡʸʸʸ'ⁿ, ʷʰʸ ʸºᵘ ᵃˡʷᵃʸˢ ˡʸʸʸ'ⁿ, ᵐᵐᵐᵐᵐᵐ ºʰ ᵐʸ ᵍºᵈ ˢᵗºp fᵘͨᵏ'ⁿ ˡʸʸʸ'ⁿ","tags":"#twitch#lying#stop","favourites":174,"__v":0,"created_on":"2015-09-08T01:59:31.879Z","score":0.0010824195234478804},{"_id":"55737b917d2300ce44f0cecf","id":1732,"pasta":"I once drank an entire bottle of soy sauce on a dare, which I thought was all well and good... until I developed extreme dehydration and Hypernatremia (http://en.wikipedia.org/wiki/Hypernatremia). They had to put an iv directly into my veins to rehydrate me. It was the closest I've ever been to dying.\nWhat I'm getting at is, even that was not nearly as salty as you are right now.","tags":"#dota2#ppd#peter#dager#salt","favourites":173,"__v":0,"created_on":"2015-06-06T03:28:43.092Z","score":0.000770089947043402},{"_id":"55fc57307831e444174c309c","id":2161,"pasta":"NO PLEASE DON'T VACCINATE ME I DON'T WANT THE AUTIS- fnaf is the best game ever and anyone who disagrees is ghey","tags":"#twitch#fnaf#vaccines#autism#fake","favourites":173,"__v":0,"created_on":"2015-09-18T18:25:52.021Z","score":0.0011263066478136264},{"_id":"54d7c1544cdf1142657fb74e","id":735,"pasta":"Arteezy gets first blood on Suma1L mid and he says, \"That's how you do it, son.\" Then Universe comes down the lane, hand in hand with his princess, Aui_2000, and proclaims, \"Don't you talk to my nephew that way.\" But then Fear rolls down midlane in his wheelchair -- old man, Father Fear -- looks directly into Arteezy, his son's eyes and softly says, \"Where am I?\"","tags":"#dota2#sumail#eg#rtz#arteezy#first#blood","favourites":172,"__v":0,"created_on":"2015-02-08T19:17:32.926Z","score":0.0005552108799691772}]