[{"_id":"55097608b47c3d010fd96603","id":1185,"pasta":"ヽ༼ຈل͜ຈ༽ﾉ ʀᴀɪsᴇ ᴜʀ ᴅᴏɴɢᴇʀs ヽ༼ຈل͜ຈ༽ﾉ\n(ง°ل͜°)ง I TRIED TO SILENCE MY DONGER ONCE; BOY THAT WENT WELL (ง°ل͜°)ง\nᕦ༼ຈل͜ຈ༽ᕤ Flex your dongers ᕦ༼ຈل͜ຈ༽ᕤ\nᕦ༼ຈل͜ຈ༽ᕤ ＤＯ ＹＯＵ ＥＶＥＮ ＤＯＮＧ? ᕦ༼ຈل͜ຈ༽ᕤ\n┌༼ຈل͜ຈ༽┐ lower your dongers ┌༼ຈل͜ຈ༽┐\n(ง ͠° ل͜ °)ง THE UNSEEN DONGER IS THE DEADLIEST (ง ͠° ل͜ °)ง\n(ง ͠° ل͜ °)ง heres a tip. And a dong behind it (ง ͠° ل͜ °)ง\n(ง ͠ ͠° ل͜ °)ง ᴛᴏ ᴅᴏɴɢᴇʀ, ᴏʀ ɴᴏᴛ ᴛᴏ ᴅᴏɴɢᴇʀ (ง ͠ ͠° ل͜ °)ง\n(ง ͠ ͠° ل͜ °)ง sᴏᴜɴᴅs ᴅᴏɴɢᴇʀᴏᴜs... ɪᴍ ɪɴ (ง ͠ ͠° ل͜ °)ง\n(ง ͠° ل͜ °)ง ᴍᴀsᴛᴇʀ ʏᴏᴜʀ ᴅᴏɴɢᴇʀ, ᴍᴀsᴛᴇʀ ᴛʜᴇ ᴇɴᴇᴍʏ (ง ͠° ل͜ °)ง\n(ง ͠ ͠° ل͜ °)ง ᴛʜᴇ ᴅᴏɴɢᴇʀ ᴀʟsᴏ ʀɪsᴇs (ง ͠ ͠° ل͜ °)ง\n(ง ͠ ͠° ل͜ °)ง YOUR DONGERS ARE INFERIOR (ง ͠ ͠° ل͜ °)ง\n(ง ͠ ͠° ل͜ °)ง MY RIGHT DONGER IS A LOT STRONGER THAN MY LEFT DONGER (ง ͠ ͠° ͟ل͜ ͡°)ง\n(ง ͠ ͠° ل͜ °)ง NEVER UNDERESTIMATE THE POWER OF THE DONGER (ง ͠ ͠° ل͜ °)ง\nヽ( ° ͜ʖ͡°)ﾉ ʀuʙ ᴍʏ ᴅᴏɴɢᴇʀ ヽ( ° ͜ʖ͡°)ﾉ\n(ง •̀_•́)ง focus your dongers (ง •̀_•́)ง\n༼ ºل͟º༼ ºل͟º༼ ºل͟º༼ ºل͟º ༽ºل͟º ༽ºل͟º ༽YOU CAME TO THE WRONG DONGERHOOD༼ ºل͟º༼ ºل͟º༼ ºل͟º༼ ºل͟º ༽ºل͟º ༽ºل͟º ༽\n༼ ºل͟º ༼ ºل͟º ༼ ºل͟º ༽ ºل͟º ༽ ºل͟º ༽ YOU PASTARINO'D THE WRONG DONGERINO ༼ ºل͟º ༼ ºل͟º ༼ ºل͟º ༽ ºل͟º ༽ ºل͟º ༽\n༼ ºل͟º༼ ºل͟º༽ºل͟º ༽ YOU COPERINO﻿ FRAPPUCCIONO PASTARINO'D THE WRONG DONGERINO ༼ ºل͟º༼ ºل͟º༽ºل͟º ༽\n༼ ºل͟º༼ ºل͟º༼ ºل͟º༼ ºل͟º ༽ºل͟º ༽ºل͟º ༽You either die a DONG, or live long enough to become the DONGER༼ ºل͟º༼ ºل͟º༼ ºل͟º༼ ºل͟º ༽ºل͟º ༽ºل͟º ༽\nᕙ༼ຈل͜ຈ༽ᕗ. ʜᴀʀᴅᴇʀ,﻿ ʙᴇᴛᴛᴇʀ, ғᴀsᴛᴇʀ, ᴅᴏɴɢᴇʀ .ᕙ༼ຈل͜ຈ༽ᕗ\n(ง ͠° ل͜ °)ง LET ME DEMONSTRATE DONGER DIPLOMACY (ง ͠° ل͜ °)ง\n(ง'̀-'́)ง ＤＯＮＧ ＯＲ ＤＩＥ (ง'̀-'́)ง\nヽ༼ຈل͜ຈ༽ﾉ raise your dongers ヽ༼ຈل͜ຈ༽ﾉ\nヽ༼ຈل͜ຈ༽ﾉ VOICE OF AN ANGEL ヽ༼ຈل͜ຈ༽ﾉ\nヽ༼ຈل͜ຈ༽ﾉ LETS GET DONGERATED ヽ༼ຈل͜ຈ༽ﾉ\nヽ༼ຈل͜ຈ༽ﾉ RAISE YOUR BARNO ヽ༼ຈل͜ຈ༽ﾉ\nヽ༼ຈل͜ຈ༽ﾉITS A HARD DONG LIFE ヽ༼ຈل͜ຈ༽ﾉ\nヽ༼ຈل͜ຈ༽ﾉ \"I have a dong\" ヽ༼ຈل͜ຈ༽ﾉ - Martin Luther King Jr.\nヽ༼ຈل͜ຈ༽ﾉ WHAT DOESNT KILL ME ONLY MAKES ME DONGER ᕙ༼ຈل͜ຈ༽ᕗ\nノ(ಠ_ಠノ ) ʟᴏᴡᴇʀ ʏᴏᴜʀ ᴅᴏɴɢᴇʀs ノ(ಠ_ಠノ)\nヽ༼Ὸل͜ຈ༽ﾉ HOIST THY DONGERS ヽ༼Ὸل͜ຈ༽ﾉ\n༼ ºل͟º ༽ I AM A DONG ༼ ºل͟º ༽\n༼ ºل͟º༽ I DIDN'T CHOOSE THE DONGLIFE, THE DONGLIFE CHOSE ME ༼ ºل͟º༽\n༼ ºل͟º༽ NO ONE CARED WHO I WAS UNTIL I PUT ON THE DONG ༼ ºل͟º༽\n༼ ºººººل͟ººººº ༽ I AM SUPER DONG ༼ ºººººل͟ººººº ༽\n┌∩┐༼ ºل͟º ༽┌∩┐ SUCK MY DONGER ┌∩┐༼ ºل͟º ༽┌∩┐\nζ༼Ɵ͆ل͜Ɵ͆༽ᶘ FINALLY A REAL DONG ζ༼Ɵ͆ل͜Ɵ͆༽ᶘ\n<ᴍᴇssᴀɢᴇ ᴅᴏɴɢᴇʀᴇᴅ>\nヽ༼ʘ̚ل͜ʘ̚༽ﾉIS THAT A DONGER IN YOUR POCKET?ヽ༼ʘ̚ل͜ʘ̚༽ﾉ\n༼ ͡■ل͜ ͡■༽ OPPA DONGER STYLE ༼ ͡■ل͜ ͡■༽\n( ° ͜ ʖ °) REGI OP ( ° ͜ ʖ °)\n(▀̿ ̿Ĺ̯̿̿▀̿ ̿) IM DONG,JAMES DONG (▀̿ ̿Ĺ̯̿̿▀̿ ̿)\n(ง⌐□ل͜□)ง WOULD YOU HIT A DONGER WITH GLASSES (ง⌐□ل͜□)ง\nʕ•ᴥ•ʔ CUDDLE UR DONGERS ʕ•ᴥ•ʔ\nლ(́◉◞౪◟◉‵ლ) let me hold your donger for a while ლ(́◉◞౪◟◉‵ლ)\nヽ༼ຈل͜ຈ༽ง MY RIGHT DONG IS ALOT STRONGER THAN MY LEFT ONE ヽ ༼ຈل͜ຈ༽ง\n(✌ﾟ∀ﾟ)☞ May the DONG be with you! ☚(ﾟヮﾟ☚)\nѰζ༼ᴼل͜ᴼ༽ᶘѰ HIT IT WITH THE FORK Ѱζ༼ᴼل͜ᴼ༽ᶘѰ\n(ง ͡ʘ ͜ʖ ͡ʘ)ง GO FABBBYYY GO (ง ͡ʘ ͜ʖ ͡ʘ)ง\n( ° ͡ ͜ ͡ʖ ͡ °)ﾉ RAISE YOUR GENJAS ヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉ\n༼ ºل͟º༼ ºل͟º༽ºل͟º ༽ Chester Cheeto Support our Dongers ༼ ºل͟º༼ ºل͟º༽ºل͟º ༽\nヽ༼ຈل͜ຈ༽ﾉ NEVER UNDERESTIMATE THE POWER OF THE DONG CODE ヽ༼ຈل͜ຈ༽ﾉ\nヽ༼° ل͜ °༽ﾉ DONGMACIA NOW AND FOREVER ヽ༼° ل͜ °༽ﾉ\n(ง ͠° ل͜ °)ง DON'T YOU DONG ME, SUMMONER?? (ง ͠° ل͜ °)ง\nง ͠° ل͜ °)ง MASTER YOUR DONGER, MASTER THE ENEMY (ง ͠° ل͜ °)ง\n(ง ͠° ل͜ °)ง FOR MY FATHER THE DONG (ง ͠° ل͜ °)ง\n╭∩╮( °﻿ ͜ʖ͡°)wнαт doeѕɴт ĸιll мe мαĸeѕ мe doɴɢer ( °﻿ ͜ʖ͡°)╭∩╮\n(ง ͠° ل͜ °)ง KNOWN IF THE DONGERS WERE TURNED I WOULD SHOW YOU NO DONG (ง ͠° ل͜ °)ง\n(っ◕‿◕)っpenetrate nintendude's anus (っ◕‿◕)っ\n(ง ͠° ل͜ °)ง Your donger belongs in a museum (ง ͠° ل͜ °)ง\nヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉ YOU CAME TO THE WRONG GENJAHOOD ヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉ\n( ° ͜ʖ͡°) Mom always said my donger was big for my age ( ° ͜ʖ͡°)\n( ° ͜ʖ͡°) I WAS BORN WITH A NEEDLESSLY LARGE DONGER ( ° ͜ʖ͡°)\n( ° ͜ʖ͡°) IS THAT A DONGER IN YOUR POCKET? ( ° ͜ʖ͡°)\n(ง ͠° ل͜ °)ง Vi? Stands For DONGER (ง ͠° ل͜ °)ง\nヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉ I BELIEVE I CAN DONGヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉ\nΨ༼ຈل͜ຈ༽Ψ﻿ HIT IT WITH A DONGER Ψ༼ຈل͜ຈ༽Ψ\n༼ʘ̚ل͜ʘ̚༽ I NEED A DONGTOR ༼ʘ̚ل͜ʘ̚༽\nヽ༼ຈل͜ຈ༽ﾉ Darude your Sandstorms ヽ༼ຈل͜ຈ༽ﾉ\n༼ ºل͟º༼ ºل͟º༼ ºل͟º༼ ºل͟º ༽ºل͟º ༽ºل͟º ༽ºل͟º ༽ 7 DEADLY DONGERS ༼ ºل͟º༼ ºل͟º༼ ºل͟º༼ ºل͟º ༽ºل͟º ༽ºل͟º ༽ºل͟º ༽\nヽ( ͝° ͜ʖ͡°)ﾉ IMAGINE IF I HAD A REAL DONGER ヽ( ͝° ͜ʖ͡°)ﾉ\n~(˘▾˘~) Wave Your Dongers (~˘▾˘)~\nwork it ᕙ༼ຈل͜ຈ༽ᕗ harder make it (ง •̀_•́)ง better do it ᕦ༼ຈل͜ຈ༽ᕤ faster raise ur ヽ༼ຈل͜ຈ༽ﾉ donger\nɳ༼ຈل͜ຈ༽ɲ more than ever hour after ɳ༼ຈل͜ຈ༽ɲ\nヽ ༼ຈل͜ຈ༽ﾉ our work is always dongers ヽ༼ຈل͜ຈ༽ﾉ\nヽ༼ຈل͜ຈ༽ﾉ FOREVER DONG ヽ༼ຈل͜ຈ༽ﾉ\n༼ ºل͟º ༼ ºل͟º ( ° ͡ ͜ ͡ʖ ͡ °) ºل͟º ༽ ºل͟º ༽ 5 MEN 1 DREAM 9 EYEBROWS ༼ ºل͟º ༼ ºل͟º( ° ͡ ͜ ͡ʖ ͡ °) ºل͟º ༽ ºل͟","tags":"#general#oh#god#the#dongers#long#list#all","favourites":858,"__v":0,"created_on":"2015-03-18T12:54:20.125Z","score":0.0023387312789649142},{"_id":"5508934e65f4abef0cfbe4fa","id":1054,"pasta":"What the dank did you just blazing say about me, you little meme? I’ll have you know I ayy’d top of my lmao in the Dank Memers, and I’ve been involved in numerous secret raids on 9GAG, and I have over 420 confirmed memes. I am trained in gnome warfare and I’m the top sweglord in the entire /r/dank_meme forces. You are nothing to me but just another 9Fag. I will smoke you the fuck out with memes the likes of which have never been seen before on this Earth, mark my fucking words. You think you can get away with saying that shit to me over the Internet? Think again, memer. As we speak I am posting my secret network of dank memes across reddit and your karma is being rekt right now so you better prepare for the storm, shitposter. The storm that wipes out the pathetic little thing you call your karma. You’re fucking downvoted, kid. I can meme anywhere, anytime, and I can dank you in over sixty nine ways, and that’s just with non-dank memes. Not only am I extensively trained in danked memeing, but I have access to the entire stash of Snoop’s dankest kush and I will use it to its full extent to blaze your miserable memes off the face of the thread, you little shit. If only you could have known what unholy retribution your little “clever” comment was about to bring down upon you, maybe you wouldn’t have posted those shitty memes. But you did, you had to, and now you’re paying the price, you little 4chan. I will blow my dank smoke all over you and you will choke in it. You’re fucking memed, kiddo.","tags":"#general#navy#seal#dank#memes","favourites":819,"__v":0,"created_on":"2015-03-17T20:32:08.749Z","score":0.0022456954402315234},{"_id":"54b5cde48ba53a7c3326b4d5","id":151,"pasta":"EE. when u break up with someone you should probably tell them why, else you end up the bad guy. I know u havent had a gf yet but in time u will meet a nice gurl and when u do, you cant abuse her like u have done aui2000 or PLD.u have been abused, i know loda hurt u. he broke ur heart. But you cant go around doing it to other gurls after u were scared","tags":"#dota2#ee#eternalenvy#loda","favourites":802,"__v":0,"created_on":"2015-01-14T02:00:55.626Z","score":0.0018920358042739391},{"_id":"54bc36b17a2aab2665bc536d","id":256,"pasta":"卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐\n Repost this windmill of friendship if you think \n\n     Europe should embrace racial diversity \n卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐","tags":"#twitch#reddit#windmill#friendship","favourites":719,"__v":0,"created_on":"2015-01-18T20:11:47.655Z","score":0.001746326656237385},{"_id":"5508cd9cb47c3d010fd96548","id":1106,"pasta":"(╯°□°）╯︵ ┻━┻","tags":"#twitch#general#flip#table","favourites":708,"__v":0,"created_on":"2015-03-18T00:48:54.478Z","score":0.0019896406175108536},{"_id":"5508948165f4abef0cfbe4fb","id":1055,"pasta":"Who is this\n>Semen Demon\n>Jizz Genie\n>Baby Batter Bringer\n>Cum Caresser\n>Lovegoo Lass\n>Sperm Summoner\n>Ejaculate Empress\n>Mayonnaise Maiden\n>Jizz Jockey\n>Spunk Monk\n>Sodomy Sentinel\n>Penile Perpetrator\n>Erection Confection\n>Salami Tsunami\n>Boner Condoner\n>Fluid Druid\n>Urethral Umpire\n>Wang Wizard\n>Knackers Knight\n>Prick Pirate\n>Dong Dominator\n>Cock Khan\n>Stiffy Sultan\n>Sausage Sergeant\n>Middle Leg Major\n>Pole Privateer\n>Shaft Specialist\n>Pecker Prodigy\n>Boner Benefactor\n>Baloney Poney Behemoth\n>Dick Juice Masseuse\n>Tallywhacker Smacker\n>Man Muscle Steam Shovel\n>Baby Batter Bladder\n>Willy Ghillie\n>Butt Hut\n>Glans Fans\n>Spooge Scrooge\n>Ejaculate Advocate\n>Skeet Treat\n>Wang Wrangler\n>Jism Prism\n>Smegma Savant\n>Anal Aficionado\n>Testicular Temptress","tags":"#general#alliteration#love","favourites":684,"__v":0,"created_on":"2015-03-17T20:32:39.158Z","score":0.0019322979326010649},{"_id":"54bf09572619c58503a1dc5e","id":301,"pasta":"I'm here to speak with you about a very important issue that we in the Dota2 community face everyday, memes.  Memes are infiltrating our ranked queues. Memes are infiltrating our in-houses.  Memes are raping our mothers and killing our fathers.  The World Health Organization has traced the source to a subset of extremely toxic streamers.  This group of streamers is led by the one called SirActionSlacks.  If you ever come in contact with SirActionSlacks, please do a 360 and moonwalk away from his stream.  Unfollow and unsubscribe.  If you do this, we may still have a chance.  I dream of a future where Dota2 is played in parks and playgrounds, in office and student lounges, and even in the bedroom, completely free of memes.  Please support our cause.","tags":"#dota2#siractionslacks#memes#important#issue","favourites":682,"__v":0,"created_on":"2015-01-21T01:55:52.213Z","score":0.0016797506379060475},{"_id":"5508814c9c40b758059984a6","id":1052,"pasta":"Omg hai ___^ I’m anon-san and I absolutely luuuv @__@ anime <3 and my fav is naurto!!! Okies so anyways, im going to tell you about the BEST day of my life when I met my hot husband sasuke!! <333333333 OMFGZ HE WAS SOOOOO FREAKIN KAWAII IN PERSON!!! Supa kawaii desu!!!!!!!! ^___________________________________^\nWhen I walked onto Tokyo street =____=I looked up and saw…SASUKE!!!!!!!!!!!!!!! <33333333333333333333333333333333333333333333333333333333333333!!!! “ KONNICHIWA OMGZZZZZZZZZZZZZZZZ SUPA SUPA SUPA KAWAII SASUKE-SAMA!!!!!” I yelled n____n then he turned chibi then un-chibi!! he looked at me [O.O;;;;;;;;;;;] and then he saw how hot I am *___* he grabbed my hand and winked ~_^ then pulled me behind a pocky shop o_o and started to kiss me!!!!!! [OMG!!! HIS TOUNGE TASTED LIKE RAMEN!!! RLY!! >.> <.< >.< (O) (O) (O)] then I saw some baka fat bitch watching us and I could tell she was undressing him with her eyes!!!!!!! [ -___________-;;;;; OMG I COULDN’T BELIEVE IT EITHER!!! (ò_ó) (ò_ó) (ò_ó)] so I yelled “UH UH BAKA NEKO THAT’S MY MAN WHY DON’T YOU GO HOOK UP WITH NARUTO CAUSE SASUKE-SAMA LOVES ME!!! (ò_ó)” then sasuke held me close =^= and said he would only ever love me and kissed me again!!!!!!! ** (O)/ then we went to his apartment and banged all night long and made 42 babies and they all became ninjas!!!!!!!!!!!!!!! Nyaaaaa!!! (^___<) ^______________;;;;;;;;;;;;;;;;","tags":"#general#weeaboo#naruto#sasuke","favourites":631,"__v":0,"created_on":"2015-03-17T19:31:35.042Z","score":0.001806311259589636},{"_id":"550517d487d1bc685b1e9686","id":1029,"pasta":"I sexually Identify as a steel beam. Ever since 9/11 I dreamed of getting drawn closer and closer to my melting point by jet fuel under the Twin Tower letting them drop on disgusting foreigners. People say to me that a person being a steel beam is Impossible and I’m fucking retarded but I don’t care, I’m beautiful. I’m having a plastic surgeon install steel beams and jet fuel on my body. From now on I want you guys to call me “Steel Beam” and respect my right to not melt by jet fuel and kill needlessly. If you can’t accept me you’re a steeliphobe and need to check your metallic privilege. Thank you for being so understanding.","tags":"#general#sexually#identify#steel#beam","favourites":630,"__v":0,"created_on":"2015-03-15T05:25:32.492Z","score":0.0017918212108055743},{"_id":"54bfd48e3b0a330105ff5c9a","id":404,"pasta":"HEY IXMIKE ( ° ͜ʖ͡°)╭∩╮","tags":"#dota2#ixmike#dongers","favourites":628,"__v":0,"created_on":"2015-01-21T08:52:19.947Z","score":0.0015690569687309324},{"_id":"54b5d2158ba53a7c3326b4eb","id":161,"pasta":"༼ᕗຈل͜ຈ༽ᕗ RAISE YOUR DONGERS ༼ᕗຈل͜ຈ༽ᕗ","tags":"#admiralbulldog#dota2#donger#dongerino#raise","favourites":620,"__v":0,"created_on":"2015-01-14T02:16:50.276Z","score":0.0015263549109680702},{"_id":"54bf141d2d74781f04a60378","id":310,"pasta":"10 years since sing strim. i walk through the empty streets trying to think of something else but my path always leads to the stream. i stare at the screen for hours and try to summon the lord. i watch other asian girls streaming but it is no good. i flame dendi in his channel and try to resist the nazi mods but it is all meaningless. the end is near.i then usually watch some old sing vods and cry myself to sleep.","tags":"#dota2#singsing#10#years#since#strim","favourites":614,"__v":0,"created_on":"2015-01-21T02:41:12.893Z","score":0.001538879342987608},{"_id":"54b591a2e90c10d22e88b974","id":120,"pasta":"▌▌✈ ▌▌✈ ▌▌✈ ▌▌✈ ▌▌✈ ▌▌Sorry i dropped my bag of 9/11 ▌▌✈ ▌▌✈ ▌▌✈ ▌▌✈ ▌▌✈ ▌▌","tags":"#twitch#9/11#bag#airplane","favourites":569,"__v":0,"created_on":"2015-01-13T21:42:54.355Z","score":0.0014201899291491746},{"_id":"5666179114bb47530dfef2eb","id":2415,"pasta":"Here in my garage with my pasta linguini, but you know what I like more than pasta linguini?  Macaroni.  That's why I bought 7 new cupboards and filled them with over 2,000 new Kraft macaroni and cheese boxes.  It's like the master chef Betty Crocker said, \"the more you eat, the more you pasta.\"  Now maybe you've seen my ted ex talk where I talk about how I eat a box of mac and cheese a day.  You know, I eat a box of mac and cheese once a day not to show off, again it's about the pasta.  In fact, the real reason I keep this pasta linguini isn't to show off.  It's a reminder that wet noodle dreams are still possible.  Not long ago, I was in a little town across the country, eating spaghetti scrap from an italian restaurant dumpster, no culinary arts degree to my name.  But you know what, something happened that day that changed my life.  I bumped into our lord and savior, the flying spaghetti monster, hallowed be his name.  He showed me what he did to become a true pasta lord.  Now this isn't a \"get pasta quick scheme\".  I'm not promising you that tomorrow you're gonna go out and buy yourself some pasta linguini, but what I am telling you is, it can happen faster than you think if you know the proven steps.  So, I record a little two minute video on my website.  Not too impressive, like I said, it's on my iphone, but it's real.  So, I'm gonna give you the three most important things you can do today.  Invest in macaroni.  Always start your pasta cooking with a rolling boil.  Don't be a crooked noodle.","tags":"#general#here#in#my#garage#macaroni#pasta","favourites":559,"__v":0,"created_on":"2015-12-07T23:34:41.543Z","score":0.004470126779627662},{"_id":"55087e299c40b758059984a1","id":1050,"pasta":"Here's the thing. You said a \"jackdaw is a crow.\"\n\nIs it in the same family? Yes. No one's arguing that.\n\nAs someone who is a scientist who studies crows, I am telling you, specifically, in science, no one calls jackdaws crows. If you want to be \"specific\" like you said, then you shouldn't either. They're not the same thing.\n\nIf you're saying \"crow family\" you're referring to the taxonomic grouping of Corvidae, which includes things from nutcrackers to blue jays to ravens.\n\nSo your reasoning for calling a jackdaw a crow is because random people \"call the black ones crows?\" Let's get grackles and blackbirds in there, then, too.\n\nAlso, calling someone a human or an ape? It's not one or the other, that's not how taxonomy works. They're both. A jackdaw is a jackdaw and a member of the crow family. But that's not what you said. You said a jackdaw is a crow, which is not true unless you're okay with calling all members of the crow family crows, which means you'd call blue jays, ravens, and other birds crows, too. Which you said you don't.\n\nIt's okay to just admit you're wrong, you know?","tags":"#reddit#unidan#jackdaw#crow#wrong","favourites":528,"__v":0,"created_on":"2015-03-17T18:38:13.871Z","score":0.0015564757015114263}]