[{"_id":"54b3239ec17052750ece1b3e","id":46,"pasta":"What the fuck did you just fucking say about me, you little bitch? I’ll have you know I graduated top of my class in the Navy Seals, and I’ve been involved in numerous secret raids on Al-Quaeda, and I have over 300 confirmed kills. I am trained in gorilla warfare and I’m the top sniper in the entire US armed forces. You are nothing to me but just another target. I will wipe you the fuck out with precision the likes of which has never been seen before on this Earth, mark my fucking words. You think you can get away with saying that shit to me over the Internet? Think again, fucker. As we speak I am contacting my secret network of spies across the USA and your IP is being traced right now so you better prepare for the storm, maggot. The storm that wipes out the pathetic little thing you call your life. You’re fucking dead, kid. I can be anywhere, anytime, and I can kill you in over seven hundred ways, and that’s just with my bare hands. Not only am I extensively trained in unarmed combat, but I have access to the entire arsenal of the United States Marine Corps and I will use it to its full extent to wipe your miserable ass off the face of the continent, you little shit. If only you could have known what unholy retribution your little “clever” comment was about to bring down upon you, maybe you would have held your fucking tongue. But you couldn’t, you didn’t, and now you’re paying the price, you goddamn idiot. I will shit fury all over you and you will drown in it. You’re fucking dead, kiddo.","tags":"#general#navy#seal#kiddo#gorilla#warfare","favourites":610,"__v":0,"created_on":"2015-01-12T01:30:01.410Z","score":0.004565367650879654},{"_id":"54bfd48e3b0a330105ff5c9a","id":404,"pasta":"HEY IXMIKE ( ° ͜ʖ͡°)╭∩╮","tags":"#dota2#ixmike#dongers","favourites":571,"__v":0,"created_on":"2015-01-21T08:52:19.947Z","score":0.0045566975784294425},{"_id":"54bf141d2d74781f04a60378","id":310,"pasta":"10 years since sing strim. i walk through the empty streets trying to think of something else but my path always leads to the stream. i stare at the screen for hours and try to summon the lord. i watch other asian girls streaming but it is no good. i flame dendi in his channel and try to resist the nazi mods but it is all meaningless. the end is near.i then usually watch some old sing vods and cry myself to sleep.","tags":"#dota2#singsing#10#years#since#strim","favourites":551,"__v":0,"created_on":"2015-01-21T02:41:12.893Z","score":0.004416411918364513},{"_id":"5508cd9cb47c3d010fd96548","id":1106,"pasta":"(╯°□°）╯︵ ┻━┻","tags":"#twitch#general#flip#table","favourites":538,"__v":0,"created_on":"2015-03-18T00:48:54.478Z","score":0.00632033117740994},{"_id":"5508934e65f4abef0cfbe4fa","id":1054,"pasta":"What the dank did you just blazing say about me, you little meme? I’ll have you know I ayy’d top of my lmao in the Dank Memers, and I’ve been involved in numerous secret raids on 9GAG, and I have over 420 confirmed memes. I am trained in gnome warfare and I’m the top sweglord in the entire /r/dank_meme forces. You are nothing to me but just another 9Fag. I will smoke you the fuck out with memes the likes of which have never been seen before on this Earth, mark my fucking words. You think you can get away with saying that shit to me over the Internet? Think again, memer. As we speak I am posting my secret network of dank memes across reddit and your karma is being rekt right now so you better prepare for the storm, shitposter. The storm that wipes out the pathetic little thing you call your karma. You’re fucking downvoted, kid. I can meme anywhere, anytime, and I can dank you in over sixty nine ways, and that’s just with non-dank memes. Not only am I extensively trained in danked memeing, but I have access to the entire stash of Snoop’s dankest kush and I will use it to its full extent to blaze your miserable memes off the face of the thread, you little shit. If only you could have known what unholy retribution your little “clever” comment was about to bring down upon you, maybe you wouldn’t have posted those shitty memes. But you did, you had to, and now you’re paying the price, you little 4chan. I will blow my dank smoke all over you and you will choke in it. You’re fucking memed, kiddo.","tags":"#general#navy#seal#dank#memes","favourites":513,"__v":0,"created_on":"2015-03-17T20:32:08.749Z","score":0.00606561264298825},{"_id":"54b5d2158ba53a7c3326b4eb","id":161,"pasta":"༼ᕗຈل͜ຈ༽ᕗ RAISE YOUR DONGERS ༼ᕗຈل͜ຈ༽ᕗ","tags":"#admiralbulldog#dota2#donger#dongerino#raise","favourites":497,"__v":0,"created_on":"2015-01-14T02:16:50.276Z","score":0.003891912426098681},{"_id":"55087e299c40b758059984a1","id":1050,"pasta":"Here's the thing. You said a \"jackdaw is a crow.\"\n\nIs it in the same family? Yes. No one's arguing that.\n\nAs someone who is a scientist who studies crows, I am telling you, specifically, in science, no one calls jackdaws crows. If you want to be \"specific\" like you said, then you shouldn't either. They're not the same thing.\n\nIf you're saying \"crow family\" you're referring to the taxonomic grouping of Corvidae, which includes things from nutcrackers to blue jays to ravens.\n\nSo your reasoning for calling a jackdaw a crow is because random people \"call the black ones crows?\" Let's get grackles and blackbirds in there, then, too.\n\nAlso, calling someone a human or an ape? It's not one or the other, that's not how taxonomy works. They're both. A jackdaw is a jackdaw and a member of the crow family. But that's not what you said. You said a jackdaw is a crow, which is not true unless you're okay with calling all members of the crow family crows, which means you'd call blue jays, ravens, and other birds crows, too. Which you said you don't.\n\nIt's okay to just admit you're wrong, you know?","tags":"#reddit#unidan#jackdaw#crow#wrong","favourites":467,"__v":0,"created_on":"2015-03-17T18:38:13.871Z","score":0.00560445688726369},{"_id":"54bf03b9bd6b1a11037e7c89","id":293,"pasta":"༼ つ ◕_◕ ༽つ Give DIRETIDE ༼ つ ◕_◕ ༽つ","tags":"#dota2#diretide#2013#donger","favourites":433,"__v":0,"created_on":"2015-01-21T01:28:47.149Z","score":0.0036102970957432564},{"_id":"54bc36b17a2aab2665bc536d","id":256,"pasta":"卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐\n Repost this windmill of friendship if you think \n\n     Europe should embrace racial diversity \n卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐","tags":"#twitch#reddit#windmill#friendship","favourites":413,"__v":0,"created_on":"2015-01-18T20:11:47.655Z","score":0.0034260112514153144},{"_id":"54b5920de90c10d22e88b97c","id":125,"pasta":"Hey Forsen, I want to play control warrior but I'm missing: Grommash, Alexstrasza, Harrison, Sylvanas, Baron Geddon, Shield Slam, Brawl, Naxx, and the Hearthstone game. Can you suggest replacements?","tags":"#hearthstone#control#warrior#forsenlol","favourites":410,"__v":0,"created_on":"2015-01-13T21:45:41.666Z","score":0.0033105668134961906},{"_id":"5508814c9c40b758059984a6","id":1052,"pasta":"Omg hai ___^ I’m anon-san and I absolutely luuuv @__@ anime <3 and my fav is naurto!!! Okies so anyways, im going to tell you about the BEST day of my life when I met my hot husband sasuke!! <333333333 OMFGZ HE WAS SOOOOO FREAKIN KAWAII IN PERSON!!! Supa kawaii desu!!!!!!!! ^___________________________________^\nWhen I walked onto Tokyo street =____=I looked up and saw…SASUKE!!!!!!!!!!!!!!! <33333333333333333333333333333333333333333333333333333333333333!!!! “ KONNICHIWA OMGZZZZZZZZZZZZZZZZ SUPA SUPA SUPA KAWAII SASUKE-SAMA!!!!!” I yelled n____n then he turned chibi then un-chibi!! he looked at me [O.O;;;;;;;;;;;] and then he saw how hot I am *___* he grabbed my hand and winked ~_^ then pulled me behind a pocky shop o_o and started to kiss me!!!!!! [OMG!!! HIS TOUNGE TASTED LIKE RAMEN!!! RLY!! >.> <.< >.< (O) (O) (O)] then I saw some baka fat bitch watching us and I could tell she was undressing him with her eyes!!!!!!! [ -___________-;;;;; OMG I COULDN’T BELIEVE IT EITHER!!! (ò_ó) (ò_ó) (ò_ó)] so I yelled “UH UH BAKA NEKO THAT’S MY MAN WHY DON’T YOU GO HOOK UP WITH NARUTO CAUSE SASUKE-SAMA LOVES ME!!! (ò_ó)” then sasuke held me close =^= and said he would only ever love me and kissed me again!!!!!!! ** (O)/ then we went to his apartment and banged all night long and made 42 babies and they all became ninjas!!!!!!!!!!!!!!! Nyaaaaa!!! (^___<) ^______________;;;;;;;;;;;;;;;;","tags":"#general#weeaboo#naruto#sasuke","favourites":404,"__v":0,"created_on":"2015-03-17T19:31:35.042Z","score":0.004966987841166401},{"_id":"550517d487d1bc685b1e9686","id":1029,"pasta":"I sexually Identify as a steel beam. Ever since 9/11 I dreamed of getting drawn closer and closer to my melting point by jet fuel under the Twin Tower letting them drop on disgusting foreigners. People say to me that a person being a steel beam is Impossible and I’m fucking retarded but I don’t care, I’m beautiful. I’m having a plastic surgeon install steel beams and jet fuel on my body. From now on I want you guys to call me “Steel Beam” and respect my right to not melt by jet fuel and kill needlessly. If you can’t accept me you’re a steeliphobe and need to check your metallic privilege. Thank you for being so understanding.","tags":"#general#sexually#identify#steel#beam","favourites":398,"__v":0,"created_on":"2015-03-15T05:25:32.492Z","score":0.004806938614724997},{"_id":"5508948165f4abef0cfbe4fb","id":1055,"pasta":"Who is this\n>Semen Demon\n>Jizz Genie\n>Baby Batter Bringer\n>Cum Caresser\n>Lovegoo Lass\n>Sperm Summoner\n>Ejaculate Empress\n>Mayonnaise Maiden\n>Jizz Jockey\n>Spunk Monk\n>Sodomy Sentinel\n>Penile Perpetrator\n>Erection Confection\n>Salami Tsunami\n>Boner Condoner\n>Fluid Druid\n>Urethral Umpire\n>Wang Wizard\n>Knackers Knight\n>Prick Pirate\n>Dong Dominator\n>Cock Khan\n>Stiffy Sultan\n>Sausage Sergeant\n>Middle Leg Major\n>Pole Privateer\n>Shaft Specialist\n>Pecker Prodigy\n>Boner Benefactor\n>Baloney Poney Behemoth\n>Dick Juice Masseuse\n>Tallywhacker Smacker\n>Man Muscle Steam Shovel\n>Baby Batter Bladder\n>Willy Ghillie\n>Butt Hut\n>Glans Fans\n>Spooge Scrooge\n>Ejaculate Advocate\n>Skeet Treat\n>Wang Wrangler\n>Jism Prism\n>Smegma Savant\n>Anal Aficionado\n>Testicular Temptress","tags":"#general#alliteration#love","favourites":387,"__v":0,"created_on":"2015-03-17T20:32:39.158Z","score":0.004793363139337477},{"_id":"54b5dbd270c589513562570d","id":172,"pasta":"Learn the ways of the Russians, speak their language for a while, they might think you are one of them. Then maybe join their team, success might come and fighting for last drink of vodka will be your next objective. Do not give up, you have Dota tournament ahead of you. Then win TI1, but don't stop now, you have to go deeper. Spend 3 more years trying to solve the puzzle of russki power of motherland and then leave the team with full knowledge of understanding of strenght of ROSSIA and PROMISE URSELF THET YU WILL NEVER LOS TO RUS AND KNOW OF COLLAPSING STRONG EMPIRE OF RUSKILAND.\nthats basically what I did","tags":"#dota2#puppey#navi#russia","favourites":368,"__v":0,"created_on":"2015-01-14T02:51:06.084Z","score":0.0030283667303833634},{"_id":"54b591a2e90c10d22e88b974","id":120,"pasta":"▌▌✈ ▌▌✈ ▌▌✈ ▌▌✈ ▌▌✈ ▌▌Sorry i dropped my bag of 9/11 ▌▌✈ ▌▌✈ ▌▌✈ ▌▌✈ ▌▌✈ ▌▌","tags":"#twitch#9/11#bag#airplane","favourites":366,"__v":0,"created_on":"2015-01-13T21:42:54.355Z","score":0.00301096405530772}]