[{"_id":"5508db5bb47c3d010fd9656f","id":1122,"pasta":"I hear \"ho ho, ha ha!\" in my sleep. I'm constantly on edge around short people. My dad was watching American Sniper this weekend and I had PTSD.","tags":"#dota2#fuck#sniper#hoho#haha","favourites":58,"__v":0,"created_on":"2015-03-18T01:54:44.085Z","score":0.000652484260162657},{"_id":"54b4c0576ef754dd27d5fd9f","id":98,"pasta":"ヽ༼ຈل͜ຈ༽ﾉ NOW WE RIOT ヽ༼ຈل͜ຈ༽ﾉ","tags":"#riot#donger","favourites":57,"__v":0,"created_on":"2015-01-13T06:51:00.673Z","score":0.0004665446472096175},{"_id":"55096116b47c3d010fd965f9","id":1179,"pasta":">my face when Americans call chips “french fries”\n>my face when Americans call crisps “chips”\n>my face when Americans call lifts “elevators”\n>my face when Americans call chocolate globbernaughts “candy bars”\n>my face when Americans call merry fizzlebombs “fireworks”\n>my face when Americans call wunderbahboxes a “computer”\n>my face when Americans call meat water “gravy”\n>my face when Americans call electro-rope “power cables”\n>my face when Americans call beef wellington ensemble with lettuce a “burger”\n>my face when Americans call whimsy flimsy mark and scribblies “pens”\n>my face when Americans call twisting plankhandles “doorknobs”\n>my face when Americans call breaddystack a “sandwich”\n>my face when Americans call their hoghity toghity tippy typers “keyboards”\n>my face when Americans call nutty-gum and fruit spleggings “PB&J”\n>my face when Americans call an upsy stairsy an “escalator”\n>my face when Americans call a knittedy wittedy sheepity sleepity a “sweater”\n>my face when Americans call a rickity-pop a “gear shift”\n>my face when Americans call a choco chip bucky wicky a “cookie”\n>my face when Americans call peepee friction pleasure “sex”\n>my face when Americans call a pip pip gollywock a “screwdriver”\n>my face when Americans call a rooty tooty point-n-shooty a “gun” \n>my face when Americans call ceiling-bright a “lightbulb”\n>my face when Americans call blimpy bounce bounce a “ball”\n>my face when Americans call a slippery dippery long reppy a “snake”\n>my face when Americans call cobble-stone-clippity-clops “roads”","tags":"#4chan#british#mfw#americans","favourites":57,"__v":0,"created_on":"2015-03-18T06:55:24.746Z","score":0.0006437011060134164},{"_id":"54b5d5858ba53a7c3326b4f3","id":165,"pasta":"work it ᕙ༼ຈل͜ຈ༽ᕗ harder  \nmake it (ง •̀_•́)ง better  \ndo it ᕦ༼ຈل͜ຈ༽ᕤ faster  \nraise ur ヽ༼ຈل͜ຈ༽ﾉ donger  ","tags":"#dongers#harder#better#faster#stronger","favourites":56,"__v":0,"created_on":"2015-01-14T02:31:49.010Z","score":0.0004612680562594162},{"_id":"5509039bb47c3d010fd965d6","id":1168,"pasta":"I sexually identify as a shitposter. Ever since I was a serious poster I dreamed of spamming ironic memes and posting copypastas. Moderators message me saying that shitposting is against the rules and they'll ban me, but I don't care, they're Nazis. I'm having the Chinese take ownership of my alt accounts, spam multiple threads for me, and hide my IP address behind several proxies. From now on I want you guys to call me \"#Swagefrog\" and respect my right to funpost above all and funpost needlessly. If you report me you're just mad cuz rekt and need to check to see if you've been posting memes lately.","tags":"#general#sexually#identify#shit#poster","favourites":55,"__v":0,"created_on":"2015-03-18T04:23:09.383Z","score":0.0006241069740506976},{"_id":"54b4882137a4eb53220afd35","id":87,"pasta":"༼ つ ◕_◕ ༽つAMENO༼ つ ◕_◕ ༽つ","tags":"#ameno#donger","favourites":53,"__v":0,"created_on":"2015-01-13T02:51:06.867Z","score":0.00043828029411282224},{"_id":"54bf61013b0a330105ff5c19","id":388,"pasta":"EG, VG, Secret, C9. Long ago, the four teams played together in harmony. Then, everything changed when the Great Immigration happened. Only Arteezy, master of all four roles, could stop them, but when EG needed him most, he vanished. A hundred years passed and my brother and I discovered the new Arteezy, a potato farmer named Artour. And although his midas skills are great, he has a lot to learn before he's ready to win anything.","tags":"#dota2#rtz#arteezy#eg#vg#secret#c9#harmony","favourites":52,"__v":0,"created_on":"2015-01-21T08:15:48.331Z","score":0.00044749597990088543},{"_id":"54b59295e90c10d22e88b980","id":127,"pasta":"This is the best possible chat. The combination of intelligence and tolerance, it's just crazy. I never thought I'd ever say this, but you guys make me proud I'm a member of twitch chat.","tags":"#antipasta#twitch#chat","favourites":51,"__v":0,"created_on":"2015-01-13T21:48:01.824Z","score":0.0004256758583905721},{"_id":"54b5f449f6a1885137f43cdc","id":186,"pasta":"What the sproink did you just enchant me with, you little jungle creep? I’ll have you know I graduated top of my class in the fluffy tails institute, and I’ve been involved in numerous secret raids on Dire-side, and I have over 300 confirmed kills on my socketed gems. I am trained in jungle warfare and I’m the top ganker in the entire Radiant hero pool. You are nothing to me but just another fawn to enchant. I will heal you the sproink up with precision the likes of which has never been seen before on the shady lanes and sunny glades, mark my fluffy tail. You think you can get away with running that slow from me with my movespeed? Think again, my lovely. As we speak I am contacting my secret network of enchanted creeps across the river and your icon is being pinged right now so you better prepare for the darkened dapples, doe. The hoofprints that wipe out the lovely little thing you call your hp bar. Don't think I wasn't fawned of you, flower. I can be anywhere, anytime, and I can heal you in over seven hundred nature attendants, and that’s just with my bare sproink. Not only am I extensively trained in unarmed healing, but I have access to the entire arsenal of new tracks to follow and I will use them to their full extent to wipe your miserable frown upside down, you little thing you. If only you could have known what racked retribution your little “fast\" auto attacks was about to bring down upon you, maybe you would have healed your golden tongue. But you couldn’t, you didn’t, and now the buck stops here, points for trying though! I will impetus spears all over you and you will buckle down. Ready or not, here I come!","tags":"#dota2#enchantress#sproink#creep#navy#seal","favourites":51,"__v":0,"created_on":"2015-01-14T04:42:49.209Z","score":0.0004262213435158237},{"_id":"5508c7c2b47c3d010fd96534","id":1099,"pasta":"Hi! Few things to start off with =] 1. Yes I added you because you are a female gamer, 'tis a great thing to see! 2. I'm Brian 3. Don't be intimidated, but I'm not a stereotypical guy. If anything, I'll be the one in the kitchen =D.","tags":"#general#female#xbox#kitchen#gamer","favourites":51,"__v":0,"created_on":"2015-03-18T00:24:10.837Z","score":0.0005847804555350888},{"_id":"54b5d2198ba53a7c3326b4ec","id":162,"pasta":"This is probably going to come off pretty White Knight-y but that can't be helped. Some of the over the top sexual/sexist talk with Sheever/Jess/other women are on screen in EU hub is really fucking disgusting. I can't be the only one ashamed of this behavior out of the community. I know the morning Sheever came out in a dress she seemed fairly perturbed, though maybe I misjudged her reaction. I hopped on the stream briefly this morning and there was a 3rd woman present (short red hair? don't know her name) and chat was going ape shit begging for orgies and shit. There is a reason this hobby is so male dominated, and it's repugnant behavior like this. Grow the fuck up. I'm not saying everyone has have great manners and be super respectful all the time, but the shit that's come out of chat is fucking awful and it's embarrassing.","tags":"#sjw#fedorapasta#sheever#dota2#euhub","favourites":50,"__v":0,"created_on":"2015-01-14T02:17:34.149Z","score":0.0004189177522757367},{"_id":"54bf0661bd6b1a11037e7c97","id":299,"pasta":"¸. * ● ¸ .　...somewhere　　　° ☾ ° 　¸. ● ¸ .　　★　° :.　 . • ° 　 .　 *　:.　.in a parallel universe* ● ¸ 　　　　° ☾ °☆ 　. * ¸.　　　★　★ ° . .　　　　.　☾ °☆ 　. * ● ¸ ...singsing..° ☾　★ °● ¸ .　　　★　° :.　 . • ○ ° ★　 .　 * ..strim♥ ☾　★ °● ¸ .　　　★","tags":"#dota2#singsing#sing#parallel#strim","favourites":49,"__v":0,"created_on":"2015-01-21T01:50:14.920Z","score":0.0004249304704376074},{"_id":"54e6192e8a06216f0557ec86","id":854,"pasta":"(◕‿◕✿) HEY I JUST MET YOU , AND THIS IS CRAZY , MY NAME IS WILLIAM , BUT CALL ME AMY (◕‿◕✿)","tags":"#hearthstone#magicamy#fake#william#call","favourites":49,"__v":0,"created_on":"2015-02-19T17:03:39.102Z","score":0.0004902569409946584},{"_id":"54f51a3c87d1bc685b1e95e1","id":954,"pasta":"What the fuck are you doing in my fucking swamp you little Farquaad? I'll have you know I graduated top of my class in the brogres, and I've been involved in numerous secret raids on your anus, and have ogre 300 confirmed layers. I am trained in making early 2000's pop cultural references, and am the top ogre in the entire far far away armed forces. You are nothing to me but another Drek. I will wipe you out with precision the likes of which have never been seen in Dreamworks, mark my fucking words. You think you can get away with saying that dreck to me over the swamp? Think again, fucker. As we speak I am contacting my secret network of fairy tale creatures across Far Far Away and your IP is being traced right now so you better prepare for the storm, Farquaad. The storm that will end your fucking life. It's fucking ogre, Donkey. I can be anywhere, anytime, and I can kill you in over seven hundred ways, and that's just with my bare asscheeks. Not only am I shrextensively trained in onionade combat, but I have access to the entire arsenal of the Fairy Godmothers Factory and I will use it to its full shrextent to wipe your miserable little ass of of the face of mah swamp, you little shit. If only you could have known what unholy retribution your little clever comment was about to bring down upon you, maybe you would have held your fucking tongue. But you couldn't, you didn't, and now you're paying the price, you goddamn Rumpelstiltskin. I will shrek fury all ogre you and you will drown in it. You're fucking dead, Pinocchio.","tags":"#general#shrek#navy#seal#farquaad","favourites":49,"__v":0,"created_on":"2015-03-03T02:19:36.439Z","score":0.0005203699033644995},{"_id":"551076e5e176d8400420cf56","id":1294,"pasta":"ＨＥＹ Ｓ４， Ｉ＇Ｍ ＴＲＹＩＮＧ ＴＯ ＬＥＡＲＮ ＴＯ ＰＬＡＹ ＭＡＧＮＵＳ． Ｉ ＪＵＳＴ ＨＡＶＥ Ａ ＱＵＥＳＴＩＯＮ ＡＢＯＵＴ ＴＨＥ ＳＫＩＬＬ ＢＵＩＬＤ： ＳＨＯＵＬＤ Ｉ ＭＡＸ ＳＨＯＣＫＷＡＶＥ ＬＩＫＥ ＹＯＵ ＳＨＯＣＫＥＤ ＥＶＥＲＹＯＮＥ ＷＨＥＮ ＹＯＵ ＬＥＦＴ ＡＬＬＩＡＮＣＥ， ＳＫＥＷＥＲ ＳＯ Ｉ ＣＡＮ ＥＳＣＡＰＥ ＬＩＫＥ ＹＯＵ ＥＳＣＡＰＥＤ ＡＬＬＩＡＮＣＥ， ＯＲ ＥＭＰＯＷＥＲ ＳＯ Ｉ ＣＡＮ ＣＬＥＡＶＥ ＬＩＫＥ ＹＯＵ ＣＬＥＡＶＥＤ ＬＯＤＡ＇Ｓ ＨＥＡＲＴ","tags":"#dota2#s4#learn#magnus#skill#build","favourites":49,"__v":0,"created_on":"2015-03-23T20:05:21.369Z","score":0.0005846506292460264}]