[{"_id":"5514dfeeb79c00ce446ab073","id":1337,"pasta":"﻿ＳＩＮＧＳＩＮＧ，  ＨＯＷ  ＤＯ  ＹＯＵ  ＰＬＡＹ  ＭＥＥＰＯ？  ＤＯ  ＹＯＵ  ＭＡＸ  ＰＯＯＦ，  ＬＩＫＥ  ＹＯＵ  ＰＯＯＦＥＤ  ＯＵＴ  ＯＦ  ＲＥＬＥＶＡＮＣＥ？  ＯＲ  ＤＯ  ＹＯＵ  ＭＡＸ  ＮＥＴ，  ＬＩＫＥ  ＹＯＵ  ＮＥＴＴＥＤ  ＺＥＲＯ  ＬＡＮ  ＷＩＮＳ  ＩＮ  ２０１５？  ＭＹ  ＦＡＶＯＲＩＴＥ  ＢＵＩＬＤ  ＩＳ  ＭＡＸＩＮＧ  ＧＥＯＳＴＲＩＫＥ，  ＬＩＫＥ ＹＯＵ  ＳＴＲＵＣＫ  ＲＯＣＫ  ＢＯＴＴＯＭ．  ＰＬＥＡＳＥ  ＡＮＳＷＥＲ","tags":"#dota2#singsing#meepo#build","favourites":100,"__v":0,"created_on":"2015-03-27T03:40:30.309Z","score":0.001663502523450515},{"_id":"55628e8fd2c875b036466652","id":1673,"pasta":"Listen kid you don't want to see my other side. I have a wolf inside me with a muzzle on, but the muzzle is about to come off. You broke her heart, and I will break yours. She is a nice girl, how dare you use her like this. How come people like you get to date her? Then people like me have to sit in the shadows and be the shoulders to cry on. Listen Kid, I don't have time for FUCKING games. I am a nice guy, but when you make a nice guy angry; the world shakes. Don't do it again. ... You will regret this the next FULL MOON. You mess with me you mess with the pack bud. FUCK you. Get ready.","tags":"#tumblr#general#wolfkin","favourites":100,"__v":0,"created_on":"2015-05-24T15:47:34.295Z","score":0.0031013990542368844},{"_id":"54bfde0f3b0a330105ff5cb4","id":422,"pasta":" are you >implying every single joke on reddit hasn't been overdone 1000 times?\n\nclears throat\n\nTo be fair, I did nazi that coming. I came here to say this but boy, that escalated quickly so to the top with you! Lost it at 'This is why we can't have nice things' and then my faith in humanity was restored, my mind blown, and manly tears were shed. Well said. As a 'murican, I can confirm this gem has just won the internet and is doing it right. Just sayin', I know that feel, bro, and while that was a risky click, this post was a 9/10. 10/10 with rice xd, would read again. I see what you did there and it feels good man. You're doing God's work, son. I laughed way harder than I should have at your list that seems legit and totally nailed it. You - I like you. You magnificent bastard; you, sir, are so brave, a gentleman and a scholar, and seeing how you are a redditor for 4 years, this checks out, so I'll allow it. I regret that I only have one upvote to give for this cool story, bro. CTRL+F \"about tree fiddy\" was not disappointed. Wait, why do I have you tagged as \"NOPE NOPE NOPE\"? Nice try, you monster. What did I just read? Dafuq? I read that as \"YOU HAD ONE JOB\". I can't fap to this. No true scotsman could see that this relevant XKCD was bad, and you should feel bad. You must be new to reddit, so I'll see your cakeday and raise you a karma train. One does not simply rustle my jimmies, not even once. This stahp gave me cancer for science, so that's enough internet for me today. OP is a fag, 2/10, would not bang. What is this I don't even know how is this wtf? Circlejerk must be leaking. This will get buried but brace yourselves, some men want to watch the world burn right in the feels. When you see it, they'll KILL IT WITH FIRE! But this has nothing to do with atheism. Lawyer up, delete facebook, hit the gym, and SHUT UP AND TAKE MY MONEY, said no one ever, so you wouldn't download a strawman. Damn onions, you scary like a BOSS. whoosh. Since rule #1 is 'be attractive', I'll just leave this here: This is my [f]irst post, be gentle. I have the weirdest boner right now, so I'll be in my bunk with dat ass. Oh, you! ...now KISS!!! I know you should never stick your dick in crazy, but DM;HS. ...this kills the redditor.\n\nOP will surely deliver. op pls, pls op pls respond that link is staying blue.\n\nIn the meantime, I'll show myself out.\n\nDirected by M. Night Shamallama.\n\nAs long as the 'fad' for plagiarising other peoples' witty comments doesn't die out, I guess I'm cool.\n\n*edit: I accidentally a word\n\nthis community is fucking shit, every comment section of every top post has some variation of this garbage re-iterated as the top comment. and you unoriginal idiots upvote it like it's the punniest thing you have ever seen. low effort jokes all day long.\n\nedit: LOL THX FRONT PAGE POST OBLIGATORY XDDDDD\n\nactual edit: removed thanks for the gold.\n\nDank memes","tags":"#reddit#le#dank#memes#meta#implying#repost","favourites":99,"__v":0,"created_on":"2015-01-21T11:31:06.134Z","score":0.0010512907605562869},{"_id":"54b59746e90c10d22e88b986","id":130,"pasta":" (_̅_̅_̅_̅_̲м̲a̲я̲i̲j­̲u̲a̲n̲a̲_̅_̅_̅()ด้็็็็็้็็็็็้็็็็็้็็็็็้็็็็็้็็็็็้็็็็็","tags":"#general#marijuana#weed#joint","favourites":96,"__v":0,"created_on":"2015-01-13T22:08:02.381Z","score":0.0009808607038511352},{"_id":"54b558cc34b44c1d2984b371","id":106,"pasta":"(▀̿Ĺ̯▀̿ ̿) This is the 0-3 Police, You're coming with us Kripp. (▀̿Ĺ̯▀̿ ̿)","tags":"#police #donger","favourites":95,"__v":0,"created_on":"2015-01-13T11:50:23.224Z","score":0.0009698987043058571},{"_id":"54bf5e573b0a330105ff5c0e","id":379,"pasta":"Mason got into his car in a hurry as he was late to work at McDonalds. As he pulled out of his driveway, he saw a beautiful vixen approaching him . She had long brown flowing hair that rustled gently in the wind. Mason's heart rate accelerated and he began dripping with sweat from every pore of his all-American 350 pound body. He hadn't been this aroused since the last all you can eat pancake buffet at Denny's. This girl was the most beautiful human he'd ever laid his eyes on. As he got closer to her, he rolled down his window, and whispered \"h-hey\". Zai cleared the brown hair from his eyes and replied \"shut the fuck up mason i thought we booted u\"","tags":"#dota2#mason#zai#car#mcdonalds","favourites":94,"__v":0,"created_on":"2015-01-21T07:06:36.602Z","score":0.0010053191225734756},{"_id":"54b6c77cf6a1885137f43d0a","id":202,"pasta":"( ͡° ͜ʖ ͡°)╯╲___卐卐卐卐 Don't mind me just taking the mods out for a walk﻿","tags":"#twitch#general#nazi#mods#walk#donger","favourites":94,"__v":0,"created_on":"2015-01-14T19:17:03.523Z","score":0.0009684404037783278},{"_id":"54b8557f5003512e438e7417","id":221,"pasta":"When a girl gets a vibrator, it's seen as a bit of naughty fun. BUT when a guy orders a 240 Volt ScrewMaster Pro 5000 blowup latex doll with 6 speed pulsating vagina, elasticized anus with non-drip semen collection pouch, together with optional built-in realistic orgasm scream surround sound system, he's called a pervert!","tags":"#general#vibrator#screwmaster#pervert#orgasm","favourites":93,"__v":0,"created_on":"2015-01-15T23:41:01.591Z","score":0.0009662343970759553},{"_id":"54b481c27622b32a1cea7b76","id":85,"pasta":"☑ “This nazi's holocaust is CRAZY!” ☑ “My jews can't survive against a concentration camp like that” ☑ \"He NEEDED precisely those two gas chambers to win\" ☑ “He built the only Auschwitz that could hold me” ☑ \"He had the perfect SS\" ☑ “There was nothing I could do” ☑ “Anne Frank hid in the attic perfectly\" ☑ \"What a joke\"","tags":"#hearthstone#nazi#holocaust#checkboxes","favourites":92,"__v":0,"created_on":"2015-01-13T02:17:48.452Z","score":0.0009419221743473859},{"_id":"54b5fc11f6a1885137f43cf2","id":195,"pasta":"EE. I will be your bodygaurd at any major lan you attend. In fact I will protect all of C9. Seriously. I am a former pro fighter(undefeated) and I will happily punch Arise really hard for you. I just require transportation and Dota coaching. Pls no copy pastarino","tags":"#dota2#ee#eternalenvy#bodyguard#arise","favourites":92,"__v":0,"created_on":"2015-01-14T05:17:29.918Z","score":0.0009479183032828853},{"_id":"54bf0ba02619c58503a1dc63","id":303,"pasta":"Guys, it's not nice to make fun of sing_sing. Being a gay player in the DOTA 2 scene is really hard sometimes because a lot of the guys are ugly. Plus, ever since he got kicked from C9 by known homophobe Envy (who insists that \"Futa isn't gay, it's Kawaii\"), he doesn't get to cuddle with AUI anymore and has to settle for Tucker \"The Fucker,\" who's really rough and makes him cry sometimes. ","tags":"#dota2#singsing#not#nice#gay#envy","favourites":90,"__v":0,"created_on":"2015-01-21T02:14:19.863Z","score":0.0009680066437122741},{"_id":"54c826aaf63c027608a745f6","id":587,"pasta":"In Portal 2, Valve attached a very sophisticated AI to a potato and it worked just fine. In DotA 2, they've made servers from potatoes but haven't had much success and I can't understand why.","tags":"#dota2#portal#valve#potato#servers","favourites":90,"__v":0,"created_on":"2015-01-27T22:30:23.184Z","score":0.0010081240055266438},{"_id":"54b2ee74ce7b585004706dc0","id":39,"pasta":"                 ▄▄▄▀▀▀▄▄███▄ ░░░░░▄▀▀░░░░░░░▐░▀██▌ ░░░▄▀░░░░▄▄███░▌▀▀░▀█ ░░▄█░░▄▀▀▒▒▒▒▒▄▐░░░░█▌ ░▐█▀▄▀▄▄▄▄▀▀▀▀▌░░░░░▐█▄ ░▌▄▄▀▀░░░░░░░░▌░░░░▄███████▄ ░░░░░░░░░░░░░▐░░░░▐███████████▄ ░░░░░le░░░░░░░▐░░░░▐█████████████▄ ░░░░toucan░░░░░░▀▄░░░▐██████████████▄ ░░░░░░has░░░░░░░░▀▄▄████████████████▄ ░░░░░arrived░░░░░░░░░░░░█▀██████","tags":"#le#toucan#has#arrived#ASCII","favourites":88,"__v":0,"created_on":"2015-01-11T21:37:22.545Z","score":0.0009012276674909726},{"_id":"554bccab525664a17d1581d2","id":1597,"pasta":"Yᴏᴜ ᴀʀᴇ ᴘʟᴀʏɪɴɢ ᴀɢᴀɪɴsᴛ Aʟʟɪᴀɴᴄᴇ. Yᴏᴜ ᴅᴏ ɴᴏᴛ ʙᴀɴ Fᴜʀɪᴏɴ ʙᴇᴄᴀᴜsᴇ ʏᴏᴜ ᴄᴀɴ ᴄᴏᴜɴᴛᴇʀ ɪᴛ. Aʟʟɪᴀɴᴄᴇ ɪɴsᴛᴀɴᴛʟʏ ᴘɪᴄᴋs Fᴜʀɪᴏɴ. Yᴏᴜ ʟᴏsᴇ ᴀɢᴀɪɴsᴛ Aʟʟɪᴀɴᴄᴇ. Yᴏᴜ ʙᴀɴ Fᴜʀɪᴏɴ ɴᴇxᴛ ᴛɪᴍᴇ ʏᴏᴜ ᴘʟᴀʏ ᴀɢᴀɪɴsᴛ Aʟʟɪᴀɴᴄᴇ ʙᴇᴄᴀᴜsᴇ ʏᴏᴜ'ʀᴇ ɴᴏᴛ sᴛᴜᴘɪᴅ.","tags":"#dota2#alliance#bulldog#furion","favourites":88,"__v":0,"created_on":"2015-05-07T19:27:46.555Z","score":0.0022499846951196134},{"_id":"55737b917d2300ce44f0cecf","id":1732,"pasta":"I once drank an entire bottle of soy sauce on a dare, which I thought was all well and good... until I developed extreme dehydration and Hypernatremia (http://en.wikipedia.org/wiki/Hypernatremia). They had to put an iv directly into my veins to rehydrate me. It was the closest I've ever been to dying.\nWhat I'm getting at is, even that was not nearly as salty as you are right now.","tags":"#dota2#ppd#peter#dager#salt","favourites":88,"__v":0,"created_on":"2015-06-06T03:28:43.092Z","score":0.003352217730158452}]