[{"_id":"54fb95f187d1bc685b1e9646","id":1001,"pasta":"Darude- status\n☐ Not Sandstorm\n☑ Sandstorm","tags":"#general#twitch#darude#sandstorm","favourites":170,"__v":0,"created_on":"2015-03-08T00:21:02.434Z","score":0.0015264499743115275},{"_id":"5508bab5b47c3d010fd964f7","id":1073,"pasta":"Hey Faggots,\nMy name is John, and I hate every single one of you. All of you are fat, retarded, no-lifes who spend every second of their day looking at stupid ass pictures. You are everything bad in the world. Honestly, have any of you ever gotten any pussy? I mean, I guess it’s fun making fun of people because of your own insecurities, but you all take to a whole new level. This is even worse than jerking off to pictures on facebook.\nDon’t be a stranger. Just hit me with your best shot. I’m pretty much perfect. I was captain of the football team, and starter on my basketball team. What sports do you play, other than “jack off to naked drawn Japanese people”? I also get straight A’s, and have a banging hot girlfriend (She just blew me; Shit was SO cash). You are all faggots who should just kill yourselves. Thanks for listening.\nPic Related: It’s me and my bitch","tags":"#4chan#faggots#john#retarded","favourites":153,"__v":0,"created_on":"2015-03-17T23:35:04.296Z","score":0.0014776524549441558},{"_id":"5508b608b47c3d010fd964ef","id":1070,"pasta":"Due to extensive research done by the University of Pittsburgh, diamond has been confirmed as the hardest metal known to man. The research is as follows. Pocket-protected scientists built a wall of iron and crashed a diamond car into it at 400 miles per hour, and the car was unharmed. They then built a wall out of diamond and crashed a car made of iron moving at 400 miles an hour into the wall, and the wall came out fine. They then crashed a diamond car made of 400 miles per hour into a wall, and there were no survivors. They crashed 400 miles per hour into a diamond traveling at iron car. Western New York was powerless for hours. They rammed a wall of metal into a 400 mile per hour made of diamond, and the resulting explosion shifted the earth's orbit 400 million miles away from the sun, saving the earth from a meteor the size of a small Washington suburb that was hurtling towards mid-western Prussia at 400 billion miles per hour. They shot a diamond made of iron at a car moving at 400 walls per hour, and as a result caused over 9000 wayward airplanes to lose track of their bearings, and make a fatal crash with over 9000 buildings in downtown New York. They spun 400 miles at diamond into iron per wall. The results were inconclusive. Finally, they placed 400 diamonds per hour in front of a car made of wall traveling at miles per iron, and the result proved without a doubt that diamonds were the hardest metal of all time, if not the hardest metal known to man.","tags":"#general#miles#per#iron#diamonds#metal","favourites":153,"__v":0,"created_on":"2015-03-17T23:10:49.326Z","score":0.0014775098641201185},{"_id":"550894c265f4abef0cfbe4fe","id":1058,"pasta":"There were a lot of things we couldn't do in an SR-71 Blackbird, but we were the fastest guys on the block and loved reminding our fellow aviators of this fact. People often asked us if, because of this fact, it was fun to fly the jet. Fun would not be the first word I would use to describe flying this plane - intense, maybe, even cerebral. But there was one day in our Sled experience when we would have to say that it was pure fun to be the fastest guys out there, at least for a moment.\n\nIt occurred when Walt and I were flying our final training sortie. We needed 100 hours in the jet to complete our training and attain Mission Ready status. Somewhere over Colorado we had passed the century mark. We had made the turn in Arizona and the jet was performing flawlessly. My gauges were wired in the front seat and we were starting to feel pretty good about ourselves, not only because we would soon be flying real missions but because we had gained a great deal of confidence in the plane in the past ten months. Ripping across the barren deserts 80,000 feet below us, I could already see the coast of California from the Arizona border. I was, finally, after many humbling months of simulators and study, ahead of the jet. I was beginning to feel a bit sorry for Walter in the back seat.\n\nThere he was, with no really good view of the incredible sights before us, tasked with monitoring four different radios. This was good practice for him for when we began flying real missions, when a priority transmission from headquarters could be vital. It had been difficult, too, for me to relinquish control of the radios, as during my entire flying career I had controlled my own transmissions. But it was part of the division of duties in this plane and I had adjusted to it. I still insisted on talking on the radio while we were on the ground, however. Walt was so good at many things, but he couldn't match my expertise at sounding smooth on the radios, a skill that had been honed sharply with years in fighter squadrons where the slightest radio miscue was grounds for beheading. He understood that and allowed me that luxury. Just to get a sense of what Walt had to contend with, I pulled the radio toggle switches and monitored the frequencies along with him.\n\nThe predominant radio chatter was from Los Angeles Center, far below us, controlling daily traffic in their sector. While they had us on their scope (albeit briefly), we were in uncontrolled airspace and normally would not talk to them unless we needed to descend into their airspace. We listened as the shaky voice of a lone Cessna pilot who asked Center for a read-out of his ground speed. Center replied: “November Charlie 175, I'm showing you at ninety knots on the ground.”\n\nNow the thing to understand about Center controllers was that whether they were talking to a rookie pilot in a Cessna or to Air Force One, they always spoke in the exact same, calm, deep, professional tone that made one feel important. I referred to it as the \"Houston Center voice.\" I have always felt that after years of seeing documentaries on this country's space program and listening to the calm and distinct voice of the Houston controllers, that all other controllers since then wanted to sound like that and that they basically did. And it didn't matter what sector of the country we would be flying in, it always seemed like the same guy was talking. Over the years that tone of voice had become somewhat of a comforting sound to pilots everywhere. Conversely, over the years, pilots always wanted to ensure that, when transmitting, they sounded like Chuck Yeager, or at least like John Wayne. Better to die than sound bad on the radios. Just moments after the Cessna's inquiry, a Twin Beech piped up on frequency, in a rather superior tone, asking for his ground speed in Beech. “I have you at one hundred and twenty-five knots of ground speed.”\n\nBoy, I thought, the Beechcraft really must think he is dazzling his Cessna brethren. Then out of the blue, a navy F-18 pilot out of NAS Lemoore came up on frequency. You knew right away it was a Navy jock because he sounded very cool on the radios. “Center, Dusty 52 ground speed check.” Before Center could reply, I'm thinking to myself, hey, Dusty 52 has a ground speed indicator in that million-dollar cockpit, so why is he asking Center for a read-out? Then I got it, ol' Dusty here is making sure that every bug smasher from Mount Whitney to the Mojave knows what true speed is. He's the fastest dude in the valley today, and he just wants everyone to know how much fun he is having in his new Hornet. And the reply, always with that same, calm, voice, with more distinct alliteration than emotion: “Dusty 52, Center, we have you at 620 on the ground.”\n\nAnd I thought to myself, is this a ripe situation, or what? As my hand instinctively reached for the mic button, I had to remind myself that Walt was in control of the radios. Still, I thought, it must be done - in mere seconds we'll be out of the sector and the opportunity will be lost. That Hornet must die, and die now. I thought about all of our Sim training and how important it was that we developed well as a crew and knew that to jump in on the radios now would destroy the integrity of all that we had worked toward becoming. I was torn. Somewhere, 13 miles above Arizona, there was a pilot screaming inside his space helmet. \n\nThen, I heard it - the click of the mic button from the back seat. That was the very moment that I knew Walter and I had become a crew. Very professionally, and with no emotion, Walter spoke: “Los Angeles Center, Aspen 20, can you give us a ground speed check?” There was no hesitation, and the replay came as if was an everyday request. “Aspen 20, I show you at one thousand eight hundred and forty-two knots, across the ground.”\n\nI think it was the forty-two knots that I liked the best, so accurate and proud was Center to deliver that information without hesitation, and you just knew he was smiling. But the precise point at which I knew that Walt and I were going to be really good friends for a long time was when he keyed the mic once again to say, in his most fighter-pilot-like voice: “Ah, Center, much thanks, we're showing closer to nineteen hundred on the money.” For a moment Walter was a god. And we finally heard a little crack in the armor of the Houston Center voice, when L.A. came back with, “Roger that Aspen. Your equipment is probably more accurate than ours. You boys have a good one.”\n\nIt all had lasted for just moments, but in that short, memorable sprint across the southwest, the Navy had been flamed, all mortal airplanes on freq were forced to bow before the King of Speed, and more importantly, Walter and I had crossed the threshold of being a crew. A fine day's work. We never heard another transmission on that frequency all the way to the coast. For just one day, it truly was fun being the fastest guys out there.","tags":"#general#blackbird","favourites":139,"__v":0,"created_on":"2015-03-17T20:20:03.823Z","score":0.0013622754781778253},{"_id":"550894c765f4abef0cfbe4ff","id":1059,"pasta":"Hearing the difference now isn’t the reason to encode to FLAC. FLAC uses\nlossless compression, while MP3 is ‘lossy’. What this means is that for\neach year the MP3 sits on your hard drive, it will lose roughly 12kbps,\nassuming you have SATA – it’s about 15kbps on IDE, but only 7kbps on\nSCSI, due to rotational velocidensity. You don’t want to know how much\nworse it is on CD-ROM or other optical media.\n\nI started\ncollecting MP3s in about 2001, and if I try to play any of the tracks I\ndownloaded back then, even the stuff I grabbed at 320kbps, they just\nsound like crap. The bass is terrible, the midrange…well don’t get me\nstarted. Some of those albums have degraded down to 32 or even 16kbps.\nFLAC rips from the same period still sound great, even if they weren’t\nstored correctly, in a cool, dry place. Seriously, stick to FLAC, you\nmay not be able to hear the difference now, but in a year or two, you’ll\nbe glad you did.","tags":"#general#audio#FLAC","favourites":128,"__v":0,"created_on":"2015-03-17T20:29:34.751Z","score":0.0012712137183712303},{"_id":"550960b8b47c3d010fd965f7","id":1177,"pasta":"The Black Rat, Rattus Rattus, was first described by Henrik Ahnberg in his 18th century work “A Dong’s guide to Dota”. An elusive and hardy creature, the rat excels at damaging structures and retreating at the first sign of danger, only to begin its attack anew once the threat has passed. Unlike many of his peers, Ahnberg greatly respected the rat, finding many of its features similar to his own. His love for the rat became so great that he soon left the world of men and descended into the sewers to live among the rats, eventually becoming their king.","tags":"#dota2#admiralbulldog#rat#bulldong","favourites":126,"__v":0,"created_on":"2015-03-18T07:41:43.933Z","score":0.0012578710037584107},{"_id":"54b5f438f6a1885137f43cda","id":184,"pasta":"Arteezy sat in a dark room. The words \"Dire Victory\" filled up the screen. Not even Arteezy's shadow fiend could win this game. 3/8/7 378 GPM. Tears filled Arteezy's eyes as he carassed his hand of midas. The sound of hard core gangster rap and crying filled the room. The door creaks open and EE-sama enters the room. \"You lost Artour.\" \"You do know what happens when you lose.\" Arteezy removed his clothes, wearing only one of EE's anime wigs. EE removed his clothes, \"You lost 23 MM. Thats how many hours your punishment will be.\" Arteezy spent the next 23 hours being furiously fucked by his mentor. After the punishment the semen covered Arteezy arised. \"Thank you master, I can't wait to return the favor when you lose.\" Envy smiled. \"So will I Artour.\"","tags":"#dota2#arteezy#rtz#eternalenvy#ee#midas#fanfic","favourites":182,"__v":0,"created_on":"2015-01-14T04:41:41.443Z","score":0.001245757576781218},{"_id":"54bf3ace3b0a330105ff5bd2","id":358,"pasta":"As Artour stood in the school library, the dean approached him:\n\"Artour\" He said \"This is your last exam, if you fail this you're out, Babaevsky.\"\n As he turned his face slowly, with a grin as large as his GPM, he responded with \nsuch elegance:\"LMFAO wHo cAREAS HAHA Xd\" ","tags":"#dota2#rtz#arteezy#school#library#dean#gpm","favourites":175,"__v":0,"created_on":"2015-01-21T05:27:38.041Z","score":0.0012442901836080616},{"_id":"55097608b47c3d010fd96603","id":1185,"pasta":"ヽ༼ຈل͜ຈ༽ﾉ ʀᴀɪsᴇ ᴜʀ ᴅᴏɴɢᴇʀs ヽ༼ຈل͜ຈ༽ﾉ\n(ง°ل͜°)ง I TRIED TO SILENCE MY DONGER ONCE; BOY THAT WENT WELL (ง°ل͜°)ง\nᕦ༼ຈل͜ຈ༽ᕤ Flex your dongers ᕦ༼ຈل͜ຈ༽ᕤ\nᕦ༼ຈل͜ຈ༽ᕤ ＤＯ ＹＯＵ ＥＶＥＮ ＤＯＮＧ? ᕦ༼ຈل͜ຈ༽ᕤ\n┌༼ຈل͜ຈ༽┐ lower your dongers ┌༼ຈل͜ຈ༽┐\n(ง ͠° ل͜ °)ง THE UNSEEN DONGER IS THE DEADLIEST (ง ͠° ل͜ °)ง\n(ง ͠° ل͜ °)ง heres a tip. And a dong behind it (ง ͠° ل͜ °)ง\n(ง ͠ ͠° ل͜ °)ง ᴛᴏ ᴅᴏɴɢᴇʀ, ᴏʀ ɴᴏᴛ ᴛᴏ ᴅᴏɴɢᴇʀ (ง ͠ ͠° ل͜ °)ง\n(ง ͠ ͠° ل͜ °)ง sᴏᴜɴᴅs ᴅᴏɴɢᴇʀᴏᴜs... ɪᴍ ɪɴ (ง ͠ ͠° ل͜ °)ง\n(ง ͠° ل͜ °)ง ᴍᴀsᴛᴇʀ ʏᴏᴜʀ ᴅᴏɴɢᴇʀ, ᴍᴀsᴛᴇʀ ᴛʜᴇ ᴇɴᴇᴍʏ (ง ͠° ل͜ °)ง\n(ง ͠ ͠° ل͜ °)ง ᴛʜᴇ ᴅᴏɴɢᴇʀ ᴀʟsᴏ ʀɪsᴇs (ง ͠ ͠° ل͜ °)ง\n(ง ͠ ͠° ل͜ °)ง YOUR DONGERS ARE INFERIOR (ง ͠ ͠° ل͜ °)ง\n(ง ͠ ͠° ل͜ °)ง MY RIGHT DONGER IS A LOT STRONGER THAN MY LEFT DONGER (ง ͠ ͠° ͟ل͜ ͡°)ง\n(ง ͠ ͠° ل͜ °)ง NEVER UNDERESTIMATE THE POWER OF THE DONGER (ง ͠ ͠° ل͜ °)ง\nヽ( ° ͜ʖ͡°)ﾉ ʀuʙ ᴍʏ ᴅᴏɴɢᴇʀ ヽ( ° ͜ʖ͡°)ﾉ\n(ง •̀_•́)ง focus your dongers (ง •̀_•́)ง\n༼ ºل͟º༼ ºل͟º༼ ºل͟º༼ ºل͟º ༽ºل͟º ༽ºل͟º ༽YOU CAME TO THE WRONG DONGERHOOD༼ ºل͟º༼ ºل͟º༼ ºل͟º༼ ºل͟º ༽ºل͟º ༽ºل͟º ༽\n༼ ºل͟º ༼ ºل͟º ༼ ºل͟º ༽ ºل͟º ༽ ºل͟º ༽ YOU PASTARINO'D THE WRONG DONGERINO ༼ ºل͟º ༼ ºل͟º ༼ ºل͟º ༽ ºل͟º ༽ ºل͟º ༽\n༼ ºل͟º༼ ºل͟º༽ºل͟º ༽ YOU COPERINO﻿ FRAPPUCCIONO PASTARINO'D THE WRONG DONGERINO ༼ ºل͟º༼ ºل͟º༽ºل͟º ༽\n༼ ºل͟º༼ ºل͟º༼ ºل͟º༼ ºل͟º ༽ºل͟º ༽ºل͟º ༽You either die a DONG, or live long enough to become the DONGER༼ ºل͟º༼ ºل͟º༼ ºل͟º༼ ºل͟º ༽ºل͟º ༽ºل͟º ༽\nᕙ༼ຈل͜ຈ༽ᕗ. ʜᴀʀᴅᴇʀ,﻿ ʙᴇᴛᴛᴇʀ, ғᴀsᴛᴇʀ, ᴅᴏɴɢᴇʀ .ᕙ༼ຈل͜ຈ༽ᕗ\n(ง ͠° ل͜ °)ง LET ME DEMONSTRATE DONGER DIPLOMACY (ง ͠° ل͜ °)ง\n(ง'̀-'́)ง ＤＯＮＧ ＯＲ ＤＩＥ (ง'̀-'́)ง\nヽ༼ຈل͜ຈ༽ﾉ raise your dongers ヽ༼ຈل͜ຈ༽ﾉ\nヽ༼ຈل͜ຈ༽ﾉ VOICE OF AN ANGEL ヽ༼ຈل͜ຈ༽ﾉ\nヽ༼ຈل͜ຈ༽ﾉ LETS GET DONGERATED ヽ༼ຈل͜ຈ༽ﾉ\nヽ༼ຈل͜ຈ༽ﾉ RAISE YOUR BARNO ヽ༼ຈل͜ຈ༽ﾉ\nヽ༼ຈل͜ຈ༽ﾉITS A HARD DONG LIFE ヽ༼ຈل͜ຈ༽ﾉ\nヽ༼ຈل͜ຈ༽ﾉ \"I have a dong\" ヽ༼ຈل͜ຈ༽ﾉ - Martin Luther King Jr.\nヽ༼ຈل͜ຈ༽ﾉ WHAT DOESNT KILL ME ONLY MAKES ME DONGER ᕙ༼ຈل͜ຈ༽ᕗ\nノ(ಠ_ಠノ ) ʟᴏᴡᴇʀ ʏᴏᴜʀ ᴅᴏɴɢᴇʀs ノ(ಠ_ಠノ)\nヽ༼Ὸل͜ຈ༽ﾉ HOIST THY DONGERS ヽ༼Ὸل͜ຈ༽ﾉ\n༼ ºل͟º ༽ I AM A DONG ༼ ºل͟º ༽\n༼ ºل͟º༽ I DIDN'T CHOOSE THE DONGLIFE, THE DONGLIFE CHOSE ME ༼ ºل͟º༽\n༼ ºل͟º༽ NO ONE CARED WHO I WAS UNTIL I PUT ON THE DONG ༼ ºل͟º༽\n༼ ºººººل͟ººººº ༽ I AM SUPER DONG ༼ ºººººل͟ººººº ༽\n┌∩┐༼ ºل͟º ༽┌∩┐ SUCK MY DONGER ┌∩┐༼ ºل͟º ༽┌∩┐\nζ༼Ɵ͆ل͜Ɵ͆༽ᶘ FINALLY A REAL DONG ζ༼Ɵ͆ل͜Ɵ͆༽ᶘ\n<ᴍᴇssᴀɢᴇ ᴅᴏɴɢᴇʀᴇᴅ>\nヽ༼ʘ̚ل͜ʘ̚༽ﾉIS THAT A DONGER IN YOUR POCKET?ヽ༼ʘ̚ل͜ʘ̚༽ﾉ\n༼ ͡■ل͜ ͡■༽ OPPA DONGER STYLE ༼ ͡■ل͜ ͡■༽\n( ° ͜ ʖ °) REGI OP ( ° ͜ ʖ °)\n(▀̿ ̿Ĺ̯̿̿▀̿ ̿) IM DONG,JAMES DONG (▀̿ ̿Ĺ̯̿̿▀̿ ̿)\n(ง⌐□ل͜□)ง WOULD YOU HIT A DONGER WITH GLASSES (ง⌐□ل͜□)ง\nʕ•ᴥ•ʔ CUDDLE UR DONGERS ʕ•ᴥ•ʔ\nლ(́◉◞౪◟◉‵ლ) let me hold your donger for a while ლ(́◉◞౪◟◉‵ლ)\nヽ༼ຈل͜ຈ༽ง MY RIGHT DONG IS ALOT STRONGER THAN MY LEFT ONE ヽ ༼ຈل͜ຈ༽ง\n(✌ﾟ∀ﾟ)☞ May the DONG be with you! ☚(ﾟヮﾟ☚)\nѰζ༼ᴼل͜ᴼ༽ᶘѰ HIT IT WITH THE FORK Ѱζ༼ᴼل͜ᴼ༽ᶘѰ\n(ง ͡ʘ ͜ʖ ͡ʘ)ง GO FABBBYYY GO (ง ͡ʘ ͜ʖ ͡ʘ)ง\n( ° ͡ ͜ ͡ʖ ͡ °)ﾉ RAISE YOUR GENJAS ヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉ\n༼ ºل͟º༼ ºل͟º༽ºل͟º ༽ Chester Cheeto Support our Dongers ༼ ºل͟º༼ ºل͟º༽ºل͟º ༽\nヽ༼ຈل͜ຈ༽ﾉ NEVER UNDERESTIMATE THE POWER OF THE DONG CODE ヽ༼ຈل͜ຈ༽ﾉ\nヽ༼° ل͜ °༽ﾉ DONGMACIA NOW AND FOREVER ヽ༼° ل͜ °༽ﾉ\n(ง ͠° ل͜ °)ง DON'T YOU DONG ME, SUMMONER?? (ง ͠° ل͜ °)ง\nง ͠° ل͜ °)ง MASTER YOUR DONGER, MASTER THE ENEMY (ง ͠° ل͜ °)ง\n(ง ͠° ل͜ °)ง FOR MY FATHER THE DONG (ง ͠° ل͜ °)ง\n╭∩╮( °﻿ ͜ʖ͡°)wнαт doeѕɴт ĸιll мe мαĸeѕ мe doɴɢer ( °﻿ ͜ʖ͡°)╭∩╮\n(ง ͠° ل͜ °)ง KNOWN IF THE DONGERS WERE TURNED I WOULD SHOW YOU NO DONG (ง ͠° ل͜ °)ง\n(っ◕‿◕)っpenetrate nintendude's anus (っ◕‿◕)っ\n(ง ͠° ل͜ °)ง Your donger belongs in a museum (ง ͠° ل͜ °)ง\nヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉ YOU CAME TO THE WRONG GENJAHOOD ヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉ\n( ° ͜ʖ͡°) Mom always said my donger was big for my age ( ° ͜ʖ͡°)\n( ° ͜ʖ͡°) I WAS BORN WITH A NEEDLESSLY LARGE DONGER ( ° ͜ʖ͡°)\n( ° ͜ʖ͡°) IS THAT A DONGER IN YOUR POCKET? ( ° ͜ʖ͡°)\n(ง ͠° ل͜ °)ง Vi? Stands For DONGER (ง ͠° ل͜ °)ง\nヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉ I BELIEVE I CAN DONGヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉ\nΨ༼ຈل͜ຈ༽Ψ﻿ HIT IT WITH A DONGER Ψ༼ຈل͜ຈ༽Ψ\n༼ʘ̚ل͜ʘ̚༽ I NEED A DONGTOR ༼ʘ̚ل͜ʘ̚༽\nヽ༼ຈل͜ຈ༽ﾉ Darude your Sandstorms ヽ༼ຈل͜ຈ༽ﾉ\n༼ ºل͟º༼ ºل͟º༼ ºل͟º༼ ºل͟º ༽ºل͟º ༽ºل͟º ༽ºل͟º ༽ 7 DEADLY DONGERS ༼ ºل͟º༼ ºل͟º༼ ºل͟º༼ ºل͟º ༽ºل͟º ༽ºل͟º ༽ºل͟º ༽\nヽ( ͝° ͜ʖ͡°)ﾉ IMAGINE IF I HAD A REAL DONGER ヽ( ͝° ͜ʖ͡°)ﾉ\n~(˘▾˘~) Wave Your Dongers (~˘▾˘)~\nwork it ᕙ༼ຈل͜ຈ༽ᕗ harder make it (ง •̀_•́)ง better do it ᕦ༼ຈل͜ຈ༽ᕤ faster raise ur ヽ༼ຈل͜ຈ༽ﾉ donger\nɳ༼ຈل͜ຈ༽ɲ more than ever hour after ɳ༼ຈل͜ຈ༽ɲ\nヽ ༼ຈل͜ຈ༽ﾉ our work is always dongers ヽ༼ຈل͜ຈ༽ﾉ\nヽ༼ຈل͜ຈ༽ﾉ FOREVER DONG ヽ༼ຈل͜ຈ༽ﾉ\n༼ ºل͟º ༼ ºل͟º ( ° ͡ ͜ ͡ʖ ͡ °) ºل͟º ༽ ºل͟º ༽ 5 MEN 1 DREAM 9 EYEBROWS ༼ ºل͟º ༼ ºل͟º( ° ͡ ͜ ͡ʖ ͡ °) ºل͟º ༽ ºل͟","tags":"#general#oh#god#the#dongers#long#list#all","favourites":124,"__v":0,"created_on":"2015-03-18T12:54:20.125Z","score":0.001242625016415142},{"_id":"54b59230e90c10d22e88b97e","id":126,"pasta":"ヽヽ༼༼ຈຈل͜ل͜ຈຈ༽༽ﾉﾉ HAFU TURN OFF THE VIBRATOR ヽヽ༼༼ຈຈل͜ل͜ຈຈ༽༽ﾉﾉ","tags":"#hearthstone#hafu#vibrator#donger","favourites":170,"__v":0,"created_on":"2015-01-13T21:46:19.211Z","score":0.0011750323243901418},{"_id":"54b2ee7bce7b585004706dc5","id":44,"pasta":"I sexually Identify as an Attack Helicopter. Ever since I was a boy I dreamed of soaring over the oilfields dropping hot sticky loads on disgusting foreigners. People say to me that a person being a helicopter is Impossible and I'm fucking retarded but I don't care, I'm beautiful. I'm having a plastic surgeon install rotary blades, 30 mm cannons and AMG-114 Hellfire missiles on my body. From now on I want you guys to call me \"Apache\" and respect my right to kill from above and kill needlessly. If you can't accept me you're a heliphobe and need to check your vehicle privilege. Thank you for being so understanding.","tags":"#general#tumblr#attack#helicopter#reynad","favourites":164,"__v":0,"created_on":"2015-01-11T21:42:07.663Z","score":0.0011300929290997256},{"_id":"54b2e7a4ce7b585004706d6f","id":1,"pasta":"☑ “This guy's deck is CRAZY!” ☑ “My deck can't win against a deck like that” ☑ \"He NEEDED precisely those two cards to win\" ☑ “He topdecked the only card that could beat me” ☑ \"He had the perfect cards\" ☑ “There was nothing I could do” ☑ “I played that perfectly\"","tags":"#hearthstone#kripp#checkboxes#topdeck#crazy","favourites":161,"__v":0,"created_on":"2015-01-11T21:14:04.886Z","score":0.0011126377879808345},{"_id":"54b2eb9ece7b585004706d97","id":17,"pasta":"Hello my name is Sing_sing and I am from the distant future. I am here to inform you, past Sing_sing that you must replace S4 on SECRET and travel with your new team to the TI5 EU Hub and play Mario Party for 2 weeks straight, if you fail to do this The Bankers will take over the world and it will descend into chaos. Thank you for listening to future Sing_sing. Please no pasta alfredo","tags":"#sing#singsing#dota2#secret","favourites":151,"__v":0,"created_on":"2015-01-11T21:24:27.532Z","score":0.001054412023530397},{"_id":"54bf29182d74781f04a603c1","id":341,"pasta":"ʕ ͡•ᴥ ͡• ʔ(_̅_̅_̅FISSURE_̅_̲̅_̅_̅_̅()","tags":"#dota2#earthshaker#fissure#bear#bare","favourites":141,"__v":0,"created_on":"2015-01-21T04:15:00.449Z","score":0.0010378566414048131},{"_id":"54b472cd7622b32a1cea7b71","id":83,"pasta":" <:::::[]=¤༼ຈل͜ຈ༽ﾉ I am the knight of spamerino. Stand back foul moderino <:::::[]=¤༼ຈل͜ຈ༽ﾉ","tags":"#knight#spam#nazi#mods#sword#donger","favourites":144,"__v":0,"created_on":"2015-01-13T01:20:07.684Z","score":0.001018472899862007}]