[{"_id":"56ea338e709549ef048c48db","id":2567,"pasta":"You are about to get spammed with 600 dank memes. Prepare all nukes and weapons for the Great Spam War. If you can contain the amount of spam I have, you will be granted with special powers that allow you to smoke weed 200 times harder. Not only that, but you will have a laggy as fuck laptop. You know how lucky you are?????? My laptop runs at 669FPS and it never lags or is slow. YOU LUCKY SON OF A GUN. You will pay the price by me giving you a link (Which shall contain a download) which will wipe all your memory off the face of this universe and overwrite it with my own software, Memesoftlocker2.0000.0. You are so damn lucky you know that? NOT EVEN I HAVE IT SLUT. But if you were able to read up to this point congratulations, you suck. But click this link www.mymom.;;;;;;/eeeeeeee.crash; and you will be taken to a memory erase phrase. You lucky slut, but you will get the best computer software ever that makes your computer lag so bad that you can't even use it. LIKE HOW AMAZING??? Yes, I promise you this is 420% legit. But if you spread this abusive software you have EARNED I will suck you off this living universe so be careful buddy. Now, Please stop reading this message as it ends now...","tags":"#imbor3d#general#meme","favourites":175,"__v":0,"created_on":"2016-03-17T04:33:18.885Z","score":0.003725726030123202},{"_id":"564dbcfd14bb47530dfef241","id":2323,"pasta":">A girl I knew in class was a total attention whore.\n>Never arrived to class on time and always made sure to make a huge fuss about it.\n>Didn't talk to her all that much, but I had a few conversations with her.\n>Her wrists had cuts and burns all over them. She wore t-shirts so she never hid them.\n>I asked her why she would hurt herself like that.\n>She said \"No one loves me and my life is painful\" etc., etc.\n>\"No one loves you? What about your parents or your boyfriend?\"\n>Answer she gave me was something like \"They actually don't love me,\" or some shit like that.\n>Made a point to not interact with her too much after that, because she's too much of an attention whore.\n>End of the school year, she came up to me and asked if I wanted to go somewhere with her that Sunday.\n>I'm not good with these situations, so I couldn't say no, even though I didn't like her.\n>Sunday came, and we went to one of those tower car parks.\n>Just as we got to the top, she told me that she wanted me to be here as a witness for her suicide.\n>\"Oh shit,\" I thought. She was going to jump and was forcing me to watch!\n>Had I known that she was going to do this, I wouldn't have gone with her.\n>\"Not watching unless you do a flip.\" I said that to try and shock her into realizing this was stupid.\n>Complete shock was written all over her face. She thought I'd try and stop her.\n>\"E-eh? You're not going to stop me?\"\n>\"No, go on ahead. If you really wanted to live, you'd stop yourself.\"\n>After a while, she got off the ledge.\n\nShe walked up to me afterwards and tried to hug me with tears in her eyes, but I told her I loved someone else. She asked me who, and I told her to read the first letter of every line.","tags":"#vine#johncena#john#cena#general","favourites":502,"__v":0,"created_on":"2015-11-19T12:13:49.462Z","score":0.003684574667751638},{"_id":"572c9db7709549ef048c4afe","id":2754,"pasta":"You know, you guys are the most intolerant people I've seen. /b/ is full of racists, sexist, and otherkin haters. My mom told me I could be anything I wanted... but she wouldn't let me. I begun discovering myself at a young age, flashbacks of my past life flooded my mind. I thought what I was feeling was wrong and stupid, until I discovered the internet. Tumblr quickly came to my aid, and that's when I knew it was time. I identify as a wooden Minecraft button (pronouns button/buttonself). I remember my life vividly. I was placed in multiple places in this beautiful base. It was singleplayer, 1.5. I remember it very well. I was placed on a verticle acacia log wall, acacia leaf roof with oak wood plank floors. I was crafted on a sunny day. I, along with my wood button brothers, were placed. Just, placed. Not always for doors, not always for decor, sometimes just to be pushed. I felt so free. Soon.. the world was opened up and someone else came on. I was griefed by a player with a rainbow skin, it triggers me to this day. It's so sickening to see you guys just push off that buttons have rights too, I want to puke. You button racists just go on being horrible, I'll embrace my true self in the meantime.","tags":"#otherkin#rant#stabme","favourites":72,"__v":0,"created_on":"2016-05-06T13:35:51.456Z","score":0.0036626456177761466},{"_id":"574a35fd709549ef048c4bb8","id":2817,"pasta":"░░░▄██████████████▄░░░░░░░\n░░░░▄██████████████████▄░░░░░\n░░░█▀░░░░░░░░░░░▀▀███████░░░░\n░░█▌░░░░░░░░░░░░░░░▀██████░░░\n░█▌░░░░░░░░░░░░░░░░███████▌░░\n░█░░░░░░░░░░░░░░░░░████████░░\n▐▌░░░░░░░░░░░░░░░░░▀██████▌░░\n░▌▄███▌░░░░▀████▄░░░░▀████▌░░\n▐▀▀▄█▄░▌░░░▄██▄▄▄▀░░░░████▄▄░\n▐░▀░░═▐░░░░░░══░░▀░░░░▐▀░▄▀▌▌\n▐░░░░░▌░░░░░░░░░░░░░░░▀░▀░░▌▌\n▐░░░▄▀░░░▀░▌░░░░░░░░░░░░▌█░▌▌\n░▌░░▀▀▄▄▀▀▄▌▌░░░░░░░░░░▐░▀▐▐░\n░▌░░▌░▄▄▄▄░░░▌░░░░░░░░▐░░▀▐░░\n░█░▐▄██████▄░▐░░░░░░░░█▀▄▄▀░░\n░▐░▌▌░░░░░░▀▀▄▐░░░░░░█▌░░░░░░\n░░█░░▄▀▀▀▀▄░▄═╝▄░░░▄▀░▌░░░░░░\n░░░▌▐░░░░░░▌░▀▀░░▄▀░░▐░░░░░░░\n░░░▀▄░░░░░░░░░▄▀▀░░░░█░░░░░░░\n░░░▄█▄▄▄▄▄▄▄▀▀░░░░░░░▌▌░░░░░░\n░░▄▀▌▀▌░░░░░░░░░░░░░▄▀▀▄░░░░░\n▄▀░░▌░▀▄░░░░░░░░░░▄▀░░▌░▀▄░░░\n░░░░▌█▄▄▀▄░░░░░░▄▀░░░░▌░░░▌▄▄\n░░░▄▐██████▄▄░▄▀░░▄▄▄▄▌░░░░▄░\n░░▄▌████████▄▄▄███████▌░░░░░▄\n░▄▀░██████████████████▌▀▄░░░░\n▀░░░█████▀▀░░░▀███████░░░▀▄░░\n░░░░▐█▀░░░▐░░░░░▀████▌░░░░▀▄░\n░░░░░░▌░░░▐░░░░▐░░▀▀█░░░░░░░▀\n░░░░░░▐░░░░▌░░░▐░░░░░▌░░░░░░░\n░╔╗║░╔═╗░═╦═░░░░░╔╗░░╔═╗░╦═╗░\n░║║║░║░║░░║░░░░░░╠╩╗░╠═╣░║░║░\n░║╚╝░╚═╝░░║░░░░░░╚═╝░║░║░╩═╝░\n░░░░░░░░░░░░░░░░░░░░░░░░░░▐╬▌","tags":"#obama#twitch#ascii#not#bad","favourites":37,"__v":0,"created_on":"2016-05-29T00:21:17.750Z","score":0.0035867170495260756},{"_id":"56f83b59709549ef048c4944","id":2614,"pasta":"8, bl8, br8, c8, ch8, cr8, d8, 8, f8, g8, h8, k8, kr8, l8, n8, p8, pl8, pr8, r8, r8t, r8, s8e, s8, sc8, sk8, sl8, sp8, sp8, st8, str8, sw8, t8, thw8, tr8, tw8, w8,, ab8, airfr8, allst8, arz8, au f8, aw8, backd8, bank r8, bathg8, baud r8, bay st8, bel8, benl8, ber8, birthr8, birth r8, blind d8, br8hw8, breakm8, breastpl8, castr8, change st8, charge pl8, cheapsk8, checkm8, classm8, clean sl8, co8, coll8, confl8, corest8, cre8, crime r8, cut r8, deadw8, deb8, defl8, dict8, dig8, dil8, don8, dose r8, downst8, duck p8, due d8, el8, equ8, est, est8, fileg8, first m8, first st8, fix8, floodg8, flow r8, free st8, fr8 r8, frustr8, garthw8e, gem st8, gest8, goldthw8e, gold pl8, gray sk8, ground b8, growth r8, gyr8, head g8, heart r8, holg8, homest8, home pl8, hot pl8, hydr8, icesk8, ice sk8, infl8, inm8, inn8, ir8, iw8, kuw8, lightw8, loc8, lose w8, m-8, magn8, mand8, mccr8, mcf8, migr8, misst8, mut8, namepl8, narr8, neg8, nitr8, northg8, not l8, obl8, of l8, orn8, or g8, outd8, pay r8, peach st8, phonem8, playm8, poor r8, postd8, pred8, prel8, prim8, prob8, pror8, prost8, punct8, rain d8, reb8, refl8, rel8, rest8, roomm8, rot8, sash w8, schoolm8, seag8, sed8, serr8, shipm8, shoem8, shum8, slave st8, sleep l8, soul m8, soup pl8, southg8, southst8, speedsk8, speed sk8, stagfl8, stagn8, stalem8, starg8, steel pl8, substr8, sulf8, sulph8, sumg8, sunst8, tailg8, tail g8, tax r8, teamm8, te8, tin pl8, to d8, transl8, tri-st8, trist8, troy w8, trunc8, upd8, upst8, wall pl8, westg8, wing8, abdic8, abrog8, acclim8, acet8, activ8, actu8, adequ8, adul8, advoc8, aggrav8, agit8, aguac8, alien8, alloc8, altern8, amput8, angul8, anim8, annot8, antiqu8, appell8, appleg8, arbitr8, armor pl8, armour pl8, arrog8, aspir8, autom8, badger st8, balkan st8, baltic st8, bargain r8, beaver st8, beehive st8, bering str8, bifurc8, bishopsg8, bluegrass st8, body w8, boilerpl8, buckeye st8, buffer st8, caffein8, calcul8, calibr8, captiv8, caraf8, carbon8, castig8, celebr8, change of st8, chief of st8, chinese d8, chlorin8, circul8, city st8, cogit8, commut8, compens8, complic8, concentr8, condens8, confisc8, congreg8, conjug8, consecr8, constip8, consumm8, contempl8, cooper8, copul8, correl8, corrug8, counterw8, cover pl8, cowperthw8e, crenel8, culmin8, cultiv8, data r8, decim8, decor8, dedic8, deleg8, demonstr8, denigr8, deprec8, desecr8, design8, desol8, dessert pl8, deton8, devast8, devi8, diamond st8, dichrom8, dinner pl8, discount r8, disinfl8, dissip8, distill8, domin8, duplic8, educ8, elev8, eman8, emigr8, emir8, emul8, escal8, estim8, excav8, exchange r8, expi8, explic8, extirp8, extric8, fabric8, fascin8, fashion pl8, featherw8, feder8, figure 8, figure sk8, finger pl8, first est8, flagell8, fluctu8, foli8, formul8, fourth est8, fulmin8, fumig8, garden st8, gastrul8, gemin8, gener8, germin8, glaci8, glutam8, golden g8, golden st8, gopher st8, gradu8, granite st8, gravit8, great lakes st8, gross est8, hawkeye st8, head of st8, heavyw8, herni8, hesit8, hibern8, hoosier st8, hundredw8, hyphen8, id est, illustr8, imit8, immigr8, immol8, implic8, impregn8, incarn8, incub8, inculc8, indic8, infiltr8, innov8, instig8, insul8, integr8, interest r8, interst8, intim8, intrast8, inund8, irang8, iraqg8, irrig8, irrit8, isol8, judic8, keystone st8, lacer8, lamin8, latin8, legisl8, levit8, liber8, license pl8, lie in w8, life est8, lime hydr8, line of f8, liquid8, litig8, little sk8, lubric8, magistr8, marin8, masterb8, masterg8, masturb8, medi8, medic8, medit8, menstru8, mental st8, middlew8, milit8, mithrid8, mitig8, moder8, monocl8, mormon st8, motiv8, mountain st8, multim8, multist8, mutil8, nause8, navig8, net est8, new york st8, nomin8, north star st8, nutmeg st8, obfusc8, oblig8, obvi8, ocean st8, old line st8, old north st8, oper8, orchestr8, oscill8, over8, overr8, overst8, overw8, paperm8, paperw8, payment r8, penetr8, percol8, perfor8, perme8, permut8, perpetr8, piece of 8, pine tree st8, police st8, pollin8, popul8, postul8, potent8, prairie st8, predic8, procre8, proflig8, propag8, punctu8, quarter pl8, radi8, realest8, real est8, recre8, regul8, reinst8, releg8, renov8, replic8, reson8, rider pl8, roller sk8, rumin8, running m8, sagebrush st8, salad pl8, saliv8, sandwich pl8, satur8, section 8, segreg8, separ8, show me st8, silic8, silverpl8, silver pl8, silver st8, simul8, situ8, solid-st8, sooner st8, sparring m8, specul8, spin the pl8, starting g8, stimul8, stipul8, strangul8, subjug8, suffoc8, sunshine st8, surrog8, syncop8, syndic8, tabul8, tar heel st8, teler8, termin8, tessel8, third est8, thorny sk8, threshold g8, titan8, titill8, toler8, travelg8, treasure st8, underr8, underst8, underw8, undul8, unim8, urin8, vacill8, veget8, vener8, ventil8, vertebr8, w8rg8, w8r g8, welfare st8, welterw8, wicket g8, zinc sulf8, zinc sulph8, abbrevi8, absentee r8, acceler8, accommod8, accumul8, adjudic8, administr8, adulter8, affili8, agglomer8, agglutin8, allevi8, aloha st8, amalgam8, amelior8, annihil8, anticip8, appreci8, appropri8, approxim8, articul8, asphyxi8, assassin8, assimil8, associ8, atomic w8, attenu8, attrition r8, at any r8, australian st8, authentic8, battle born st8, carbohydr8, coagul8, cogener8, cognitive st8, collabor8, collection pl8, combining w8, commemor8, commiser8, communic8, conc8n8, confeder8, congratul8, consolid8, contamin8, coordin8, copper sulf8, copper sulph8, corrobor8, coyote st8, cross-pollin8, deactiv8, debilit8, decaffein8, decapit8, deceler8, degener8, deliber8, deline8, demodul8, denomin8, depopul8, depreci8, desegreg8, determin8, devalu8, dilapid8, discrimin8, disintegr8, dissemin8, domestic8, ecstatic st8, effectu8, ejacul8, elabor8, electropl8, elimin8, elucid8, emaci8, emancip8, emascul8, empire st8, encapsul8, enumer8, enunci8, equivoc8, eradic8, evacu8, evalu8, evapor8, evergreen st8, eviscer8, exacerb8, exagger8, exasper8, excori8, excursion r8, exhilar8, exoner8, expatri8, expropri8, extenu8, extermin8, extortion8, extrapol8, facilit8, felicit8, figure of 8, glucosam8, grand canyon st8, green mountain st8, halogen8, humili8, hydrogen8, imperson8, inactiv8, inadequ8, incarcer8, inciner8, incorpor8, incrimin8, inebri8, infatu8, inflation r8, infuri8, ingrati8, initi8, innocul8, inocul8, insemin8, installment r8, instanti8, interestr8, interpol8, interrel8, interrog8, intimid8, intoxic8, invalid8, invertebr8, investig8, irish free st8, irradi8, italian8, junior lightw8, koreag8, korean str8, korea str8, lanceol8, landed est8, lead acet8, lead carbon8, light heavyw8, long hundredw8, lying in w8, magnolia st8, manipul8, methotrex8, misalloc8, miscalcul8, mount rushmore st8, natural st8, necessit8, negoti8, obliter8, offici8, opinion8, origin8, oxygen8, palmetto st8, particip8, peace garden st8, pelican st8, perpetu8, pontific8, precipit8, predomin8, prefabric8, premedit8, prime interest r8, procrastin8, prognostic8, prolifer8, public deb8, reactiv8, recalcul8, reciproc8, recrimin8, recuper8, redecor8, rededic8, reeduc8, reformul8, refriger8, regener8, regurgit8, reincarn8, reintegr8, reiter8, rejuven8, remedi8, remuner8, renomin8, renunci8, repatri8, repayment r8, reporting w8, repudi8, reregul8, resuscit8, retali8, sailor's breastpl8, second est8, self-pollin8, short hundredw8, silver nitr8, sophistic8, subordin8, substanti8, sunflower st8, trimetrex8, turnover r8, unalloc8, uncompens8, uncomplic8, vacancy r8, volunteer st8, wolverine st8, american st8, atmospheric st8, at an equal r8, barium sulph8, calcium hydr8, calcium nitr8, calcium sulph8, cellulose nitr8, centennial st8, circumnavig8, constitution st8, decontamin8, department of st8, deterior8, differenti8, emotional st8, equality st8, equivalent w8, ethyl acet8, excommunic8, exercising w8, fertility r8, incapacit8, insubordin8, isocyan8, junior featherw8, junior middlew8, junior welterw8, maturity d8, metabolic r8, metric hundredw8, misappropri8, miscommunic8, molecular w8, mortality r8, multicandid8, occupancy r8, old dominion st8, overestim8, overregul8, personal est8, photographic pl8, plantlike flagell8, polychlorin8, recapitul8, reevalu8, rehabilit8, reincorpor8, reinvigor8, renegoti8, self-perpetu8, sodium nitr8, sodium sulph8, temporary st8, unaffili8, underestim8, unemployment r8, walking deleg8, a42128, ammonium nitr8, amphetamine sulph8, aquatic vertebr8, calcium carbon8, capital of kuw8, cellulose acet8, depreciation r8, hydrogen carbon8, lithium carbon8, magnesium sulf8, mercury fulmin8, potassium nitr8, psychological st8, secretary of st8, sedimentation r8, sodium carbon8, sodium dichrom8, tomato concentr8, aluminosilic8, ammonium carbon8, basal metabolic r8, infant mortality r8, physiological st8, polyvinyl acet8, potassium carbon8, potassium dichrom8, gr8, b8, m8","tags":"#gr8#b8#m8","favourites":143,"__v":0,"created_on":"2016-03-27T19:58:17.807Z","score":0.0035555972012813125},{"_id":"56aee8cc8264708746ae9a80","id":2497,"pasta":"┻┳|\n┳┻|_\n┻┳| •.•) Daddy,Are The Spammers Gone?\n┳┻|⊂ﾉ\n┻┳|\n/﹋\\\n(҂`_´) -NOPE,SON GET BACK IN YOUR BEDROOM\n<,︻╦╤─ ҉\n/﹋\\","tags":"#twitch#spammers#donger","favourites":272,"__v":0,"created_on":"2016-02-01T05:10:36.114Z","score":0.00355547574560008},{"_id":"5508b111b47c3d010fd964e4","id":1065,"pasta":"Gr8 b8, m8. I rel8, str8 appreci8, and congratul8. I r8 this b8 an 8/8. Plz no h8, I'm str8 ir8. Cr8 more, can't w8. We should convers8, I won't ber8, my number is 8888888, ask for N8. No calls l8 or out of st8. If on a d8, ask K8 to loc8. Even with a full pl8, I always have time to communic8 so don't hesit8. dont forget to medit8 and particip8 and masturb8 to allevi8 your ability to tabul8 the f8. We should meet up m8 and convers8 on how we can cre8 more gr8 b8, I'm sure everyone would appreci8, no h8. I don't mean to defl8 your hopes, but its hard to dict8 where the b8 will rel8 and we may end up with out being appreci8d, I'm sure you can rel8. We can cre8 b8 like alexander the gr8, stretch posts longer than the Nile's str8s. We'll be the captains of b8, 4chan our first m8s the growth r8 will spread to reddit and like real est8 and be a flow r8 of gr8 b8, like a blind d8 we'll coll8, meet me upst8 where we can convers8, or ice sk8 or lose w8 infl8 our hot air baloons and fly, tail g8. We could land in Kuw8, eat a soup pl8 followed by a dessert pl8 the payment r8 won't be too ir8 and hopefully our currency won't defl8. We'll head to the Israeli-St8, taker over like Herod the gr8 and b8 the jewish masses, 8 million, m8. We could interrel8 communism, thought it's past it's maturity d8, a department of st8, volunteer st8. reduce the infant mortality r8, all in the name of making gr8 b8 m8.","tags":"#general#8#gr8#b8#m8","favourites":1398,"__v":0,"created_on":"2015-03-17T22:51:37.615Z","score":0.0035088050822221464},{"_id":"574a35e7709549ef048c4bb6","id":2815,"pasta":"! ! ! ATTENTION 2003 KIDS ! ! ! This 👇 is the last year of being a kid 👦👧! Because NEXT 👉YEAR! We gon be T33N4G3RS💁💅!! PARTYING 🎉💃 DRINKING 🍻🍸🍹🍷 MAKING OUT AND SEX 👅💦O_O PERIODS ☹🍫 HEARTBREAKS 💔☹ MIDDLE SCHOOL SOPHOMORES (7️⃣TH GRADE)","tags":"#general#emoji#teenagers#2003","favourites":36,"__v":0,"created_on":"2016-05-29T00:20:55.573Z","score":0.0035034695272104584},{"_id":"54b5d2228ba53a7c3326b4ed","id":163,"pasta":"ＨＥＹ　ＲＴＺ，　Ｉ’Ｍ　ＴＲＹＩＮＧ　ＴＯ　ＬＥＡＲＮ　ＴＯ　ＰＬＡＹ　ＲＩＫＩ．　Ｉ　ＪＵＳＴ　ＨＡＶＥ　Ａ　ＱＵＥＳＴＩＯＮ　ＡＢＯＵＴ　ＴＨＥ　ＳＫＩＬＬ　ＢＵＩＬＤ：　ＳＨＯＵＬＤ　Ｉ　ＭＡＸ　ＢＡＣＫＳＴＡＢ　ＬＩＫＥ　ＹＯＵ　ＢＡＣＫＳＴＡＢＢＥＤ　ＥＧ，　ＳＭＯＫＥＳＣＲＥＥＮ　ＳＯ　ＴＨＥＹ　ＭＩＳＳ　ＭＥ　ＬＩＫＥ　ＥＧ　ＭＩＳＳ　ＹＯＵ　７０％　ＯＦ　ＴＨＥ　ＴＩＭＥ，　ＯＲ　ＰＥＲＭＡＮＥＴ　ＩＮＶＩＳＩＢＩＬＩＴＹ　ＳＯ　Ｉ　ＣＯＵＬＤ　ＤＩＳＡＰＰＥＡＲ　ＬＩＫＥ　ＹＯＵ　ＤＩＳＡＰＰＥＡＲＥＤ　ＦＲＯＭ　ＥＧ","tags":"#dota2#rtz#arteezy#riki#eg","favourites":1667,"__v":0,"created_on":"2015-01-14T02:18:08.093Z","score":0.0034831585379963906},{"_id":"5508a27e0ec6f6600dbaacba","id":1063,"pasta":"What the ( ͡° ͜ʖ ͡°) did you just ( ͡° ͜ʖ ͡°) say about me, you little ( ͡° ͜ʖ ͡°)? I'll have you know I graduated top of my ( ͡° ͜ʖ ͡°) in the ( ͡° ͜ʖ ͡°), and I've been involved in numerous secret ( ͡° ͜ʖ ͡°) on ( ͡° ͜ʖ ͡°), and I have over 300 confirmed ( ͡° ͜ʖ ͡°). I am trained in ( ͡° ͜ʖ ͡°) warfare and I'm the top ( ͡° ͜ʖ ͡°) in the entire US armed ( ͡° ͜ʖ ͡°). You are nothing to me but just another ( ͡° ͜ʖ ͡°). I will wipe you the ( ͡° ͜ʖ ͡°) out with precision the ( ͡° ͜ʖ ͡°) of which has never been seen before on this ( ͡° ͜ʖ ͡°), mark my ( ͡° ͜ʖ ͡°) words. ( ͡° ͜ʖ ͡°) think ( ͡° ͜ʖ ͡°) can get away with saying that ( ͡° ͜ʖ ͡°) to me over the ( ͡° ͜ʖ ͡°)? Think again, ( ͡° ͜ʖ ͡°). As we speak I am contacting my secret network of ( ͡° ͜ʖ ͡°) across the ( ͡° ͜ʖ ͡°) and your ( ͡° ͜ʖ ͡°) is being ( ͡° ͜ʖ ͡°) right now so you better ( ͡° ͜ʖ ͡°) for the ( ͡° ͜ʖ ͡°), ( ͡° ͜ʖ ͡°). The ( ͡° ͜ʖ ͡°) that wipes out the pathetic little thing you call ( ͡° ͜ʖ ͡°). You're ( ͡° ͜ʖ ͡°) dead, ( ͡° ͜ʖ ͡°). I can be ( ͡° ͜ʖ ͡°), anytime, and I can ( ͡° ͜ʖ ͡°) you in over seven hundred ( ͡° ͜ʖ ͡°), and that's just with my bare ( ͡° ͜ʖ ͡°). Not only am I extensively trained in ( ͡° ͜ʖ ͡°) combat, but I have access to the entire ( ͡° ͜ʖ ͡°) of the United States ( ͡° ͜ʖ ͡°) and I will use it to its full extent to wipe your miserable ( ͡° ͜ʖ ͡°) off the face of the ( ͡° ͜ʖ ͡°), you little ( ͡° ͜ʖ ͡°). If only you could have known what unholy retribution your little ( ͡° ͜ʖ ͡°) comment was about to bring down upon ( ͡° ͜ʖ ͡°), maybe you would have held your ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°). But you couldn't, you didn't, and now you're paying the price, you ( ͡° ͜ʖ ͡°). I will ( ͡° ͜ʖ ͡°) fury all over ( ͡° ͜ʖ ͡°) and ( ͡° ͜ʖ ͡°) will ( ͡° ͜ʖ ͡°) in it. You're ( ͡° ͜ʖ ͡°) dead, ( ͡° ͜ʖ ͡°).","tags":"#general#donger#navy#seal#lenny","favourites":1385,"__v":0,"created_on":"2015-03-17T21:47:22.372Z","score":0.0034811688840794865},{"_id":"54b344916bd15d33165d28a9","id":55,"pasta":"My Grandfather smoked his whole life. I was about 10 years old when my mother said to him, 'If you ever want to see your grandchildren graduate, you have to stop immediately.'. Tears welled up in his eyes when he realized what exactly was at stake. He gave it up immediately. Three years later he died of lung cancer. It was really sad and destroyed me. My mother said to me- 'Don't ever smoke. Please don't put your family through what your Grandfather put us through.\" I agreed. At 28, I have never touched a cigarette. I must say, I feel a very slight sense of regret for never having done it, because your post gave me cancer anyway.","tags":"#reddit#cancer#post#smoking#grandpa","favourites":1647,"__v":0,"created_on":"2015-01-12T03:03:39.683Z","score":0.003432687577513386},{"_id":"5703dd1d709549ef048c49b7","id":2640,"pasta":"*sniffs room*\nHmm... Something smells like daddy issues.\n","tags":"#forgotmydadinthemagicstore#4urkid#sin","favourites":120,"__v":0,"created_on":"2016-04-05T15:43:25.562Z","score":0.0034312357469834472},{"_id":"57401ba4709549ef048c4b54","id":2763,"pasta":"͕͗𝔻͕͕͗͗𝕠͕͕͗͗𝕟͕͕͗͗'͕͕͗͗𝕥͕͗ ͕͗𝕥͕͕͗͗𝕒͕͕͗͗𝕝͕͕͗͗𝕜͕͗ ͕͗𝕥͕͕͗͗𝕠͕͗ ͕͗𝕞͕͕͗͗𝕖͕͗ ͕͗𝕠͕͕͗͗𝕣͕͗ ͕͗𝕞͕͕͗͗𝕪͕͗ ͕͗𝕤͕͕͗͗𝕠͕͕͗͗𝕟͕͗ ͕͗𝕖͕͕͗͗𝕧͕͕͗͗𝕖͕͕͗͗𝕣͕͗ ͕͗𝕒͕͕͗͗𝕘͕͕͗͗𝕒͕͕͗͗𝕚͕͕͗͗𝕟͕͗","tags":"#general#ascii#me#or#my#son","favourites":45,"__v":0,"created_on":"2016-05-21T08:26:12.550Z","score":0.0034233752099350817},{"_id":"5670ca0bc41d20f176ef70f1","id":2434,"pasta":"I sexually Identify as a spicy memer. Ever since I was a boy I dreamed of filling every web page in the known universe with my spicy memes. People say to me that posting memes is a disgusting habit and I'm a pleb but I don't care, I'm beautiful. I'm having a plastic surgeon install pepe's on my face and 100 dongers on my body. From now on I want you guys to call me \"spicy memer\" and respect my right to fill your browser history with cancer. If you can't accept me, you're a filthy tumblr newb and need to refresh your browser. Thank you for being so understanding.","tags":"#general#sexually#identify#spicy#memer","favourites":376,"__v":0,"created_on":"2015-12-16T02:18:51.974Z","score":0.0033685916019869926},{"_id":"574a34cc709549ef048c4ba6","id":2799,"pasta":"▄█▀ █▬█ █ ▀█▀","tags":"#ASCII#Shit#twitter#Shitpost","favourites":34,"__v":0,"created_on":"2016-05-29T00:16:12.762Z","score":0.0033354927185367546}]