[{"_id":"54b5f43df6a1885137f43cdb","id":185,"pasta":"Albert Einstein, one of the greatest minds to ever live, was once perplexed by the speed at which Arteezy was able to farm. Seemingly impossible GPMs of 800+ every game were consistently observed, leading to the hypothesis that this was no fluke. Einstein spent the last years of his life trying to prove the ability of Arteezy's farm existed within the laws of science. Critics laughed at his efforts, claiming that Arteezy's farm was an undeniable act of divine intervention. It wasn't until the end when Einstein found the answer. On his deathbed, Einstein spent the last seconds of his life jotting down what is now the world's most infamous scientific formula. r=tz²","tags":"#rtz#einstein#arteezy#dota2#gpm#farm","favourites":107,"__v":0,"created_on":"2015-01-14T04:42:15.444Z","score":0.0036542279765699186},{"_id":"54c7be27f63c027608a745ee","id":586,"pasta":"Artour got out of the building. He was a bit frustrated. His team was making him play stupid heroes again. He wanted to play Naga and Terrorblade. Didn't they understand the main goal of Dota is to kill creeps?\nArtour whispered to himself, \"LMFAO wHo cAREAS HAHA Xd\". He sighed and crossed the street. Suddenly Artour's face went pale. On the other side of the street was the Cloud 9 squad. \"J-Jacky...\", he whispered. They were coming at him. He was frozen in place.\nEE looked at him and said \"Long time no see Artour.\" He was speechless as all of them passed by him. Only n0tail stayed there with him, his hands on his pockets. Artour didn't dare to say anything. He hadn't ever seen n0tail with such a grim look.\n\"Having fun with my old team, Artour?\" n0tail asked, a maniac grin growing in his face. \"The team who kicked me because of you.\"\nArtour was panicking. Who was that guy? He surely wasn't the BigDaddy he had met before.\" Don't worry Artour\", continued n0tail, \"I'm not gonna hurt you. In fact, I'm just having fun with my new best friend... Jacky.\"\nThat was it. Artour lost control. \"You'll never steal Jacky from me! Never!\" n0tail's grin got bigger. \"You've always been naive, Artour... I've watched your replays. I know how to please Jacky better than you now.\"\nArtour stared in disbelief. \"W-what...\". N0tail slowly took his hands out of his pockets. A golden glow filled the whole street. Artour fell to his knees as he saw not only one, but two hands of Midas. \"Good luck on the tournament, Artour...\" said n0tail while leaving. Artour sat in the ground, tears in his face. \"Jacky...\" He whispered.","tags":"#dota2#arteezy#rtz#ee#jacky#building#notail#bigdaddy","favourites":77,"__v":0,"created_on":"2015-01-27T16:04:51.524Z","score":0.0034544991335733644},{"_id":"54bf5e573b0a330105ff5c0e","id":379,"pasta":"Mason got into his car in a hurry as he was late to work at McDonalds. As he pulled out of his driveway, he saw a beautiful vixen approaching him . She had long brown flowing hair that rustled gently in the wind. Mason's heart rate accelerated and he began dripping with sweat from every pore of his all-American 350 pound body. He hadn't been this aroused since the last all you can eat pancake buffet at Denny's. This girl was the most beautiful human he'd ever laid his eyes on. As he got closer to her, he rolled down his window, and whispered \"h-hey\". Zai cleared the brown hair from his eyes and replied \"shut the fuck up mason i thought we booted u\"","tags":"#dota2#mason#zai#car#mcdonalds","favourites":85,"__v":0,"created_on":"2015-01-21T07:06:36.602Z","score":0.0033656949233573023},{"_id":"54bf0ba02619c58503a1dc63","id":303,"pasta":"Guys, it's not nice to make fun of sing_sing. Being a gay player in the DOTA 2 scene is really hard sometimes because a lot of the guys are ugly. Plus, ever since he got kicked from C9 by known homophobe Envy (who insists that \"Futa isn't gay, it's Kawaii\"), he doesn't get to cuddle with AUI anymore and has to settle for Tucker \"The Fucker,\" who's really rough and makes him cry sometimes. ","tags":"#dota2#singsing#not#nice#gay#envy","favourites":84,"__v":0,"created_on":"2015-01-21T02:14:19.863Z","score":0.003321185141983893},{"_id":"54b35f78d74d4ff016825273","id":66,"pasta":"Kripparian grunts and sighs after finally managing to finish inside Hafu after numerous pre-mature ejaculations. He lights a cig while laying in bed. \"Was that as good for you as it was for me, Hafu?\" Kripp asks. \"I'm not Hafu,\" replies Trump. As Kripp recoils in horror, Trump smirks. \"It seems you've tucked Frump.\"","tags":"#kripp#hafu#tuck#frump#fuck#trump","favourites":96,"__v":0,"created_on":"2015-01-12T05:45:17.959Z","score":0.0032397902218052363},{"_id":"54bf0f9a2d74781f04a6036f","id":307,"pasta":"Hey 2gd ( ° ͜ʖ͡°)╭∩╮","tags":"#dota2#hey#2gd#donger","favourites":81,"__v":0,"created_on":"2015-01-21T02:31:00.022Z","score":0.00322145527444734},{"_id":"54c826aaf63c027608a745f6","id":587,"pasta":"In Portal 2, Valve attached a very sophisticated AI to a potato and it worked just fine. In DotA 2, they've made servers from potatoes but haven't had much success and I can't understand why.","tags":"#dota2#portal#valve#potato#servers","favourites":69,"__v":0,"created_on":"2015-01-27T22:30:23.184Z","score":0.0031638928651422545},{"_id":"54b5fc11f6a1885137f43cf2","id":195,"pasta":"EE. I will be your bodygaurd at any major lan you attend. In fact I will protect all of C9. Seriously. I am a former pro fighter(undefeated) and I will happily punch Arise really hard for you. I just require transportation and Dota coaching. Pls no copy pastarino","tags":"#dota2#ee#eternalenvy#bodyguard#arise","favourites":90,"__v":0,"created_on":"2015-01-14T05:17:29.918Z","score":0.0031600377054333763},{"_id":"54b4ba70864e0cf426846c4f","id":94,"pasta":"ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ༼ຈل͜ຈ༽ﾉ☂ ɪᴛs ʀᴀɪɴɪɴɢ sᴀʟᴛ! ヽ༼ຈل͜ຈ༽ﾉ☂ ヽ｀ヽ｀、ヽヽ｀ヽ｀、｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ、ヽヽ｀ヽ","tags":"#raining#salt#donger","favourites":84,"__v":0,"created_on":"2015-01-13T06:25:48.202Z","score":0.0029393092442362655},{"_id":"54b59324e90c10d22e88b982","id":128,"pasta":"Forsen enters his bedroom and notices something unusual. In his bed lays a 6/3 Reynad in stealth. Forsen has no answer for this play. He passes his turn and prepares himself for the donger of destiny.","tags":"#hearthstone#forsen#reynad#donger#bed","favourites":83,"__v":0,"created_on":"2015-01-13T21:50:00.027Z","score":0.0029377799406879435},{"_id":"54b38180dcf3ad6e17833537","id":76,"pasta":"The Ghost of Gaming Future shows Kripp a nice house in the Toronto suburbs. Inside, Kripp, Rania and their sons are happily gaming as a family. \"This isn't so bad,\" says Kripp. \"Look closer,\" speaks the Ghost. Kripp looks in horror to see his sons are using tablets and playing browser cash-shop games. \"This is your future Casualarrian.\"","tags":"#hearthstone#kripp#succubus#casualarrian#children","favourites":84,"__v":0,"created_on":"2015-01-12T08:10:38.090Z","score":0.002899278617379015},{"_id":"54b5d1ff8ba53a7c3326b4e6","id":156,"pasta":"Well, I'm ready with my can of Monster Energy. I've got my CyberPowerPC turned on and my BenQ screen picture quality is perfect. My Razer headphones sound authentic and my DesignByHumans hoodie is super comfortable. I'm fully supported by my NeedForSeat chair and my computer commands are super fast thanks to HyperX RAM. Clinton \"Fear\" Loomis, take it away!","tags":"#dota2#eg#bleedblue#sellout#fear#oldman","favourites":79,"__v":0,"created_on":"2015-01-14T02:15:00.815Z","score":0.0028256535656909732},{"_id":"54b5592b34b44c1d2984b375","id":110,"pasta":"ʀᴇxxᴀʀ ᴅɪᴀʀʏ ɢᴠɢ ᴅᴀʏ 1: ᴇᴠᴇʀʏ ᴅᴇᴄᴋ ʀᴏʙᴏᴛ ɴᴏᴡ. ᴀᴍ ᴄᴏɴғᴜsᴇ. ᴛʀᴀᴅᴇ ᴏʀ ʜɪᴛ ғᴀᴄᴇ? ɪ ᴘʟᴀʏ ᴛ1 ᴜɴᴅᴇʀᴛᴀᴋᴇʀ ᴄᴏɪɴ ʟᴇᴘᴇʀ ɢɴᴏᴍᴇ? ɢᴠɢ ᴅᴀʏ 2: ᴍᴀɴʏ ᴛʜɪɴᴋɪɴɢ, ʙʀᴀɪɴ ʜᴜʀᴛ. ᴅᴇᴄɪᴅᴇ ᴛᴏ ᴋᴇᴇᴘ ᴜsɪɴɢ ᴏʟᴅ ᴅᴇᴄᴋ. ᴅᴇᴄɪᴅᴇ ᴋᴇᴇᴘ ᴜsᴇ ᴏʟᴅ ᴅᴇᴄᴋ ᴀɴᴅ ʜɪᴛ ғᴀᴄᴇ. ᴀᴍ ᴛʜɪɴᴋ ᴍᴀʏʙᴇ ᴀᴅᴅ ᴅᴇᴀᴛʜʀᴀᴛᴛʟᴇ ʀᴏʙᴏᴛ. ɢᴠɢ ᴅᴀʏ 3: ᴍᴇ sᴛɪʟʟ ᴡɪɴɴɪɴɢ.","tags":"#hearthstone#gvg#hunter#huntard#hit#face","favourites":78,"__v":0,"created_on":"2015-01-13T11:44:20.139Z","score":0.0027702541451574336},{"_id":"54bf21222d74781f04a603ac","id":332,"pasta":"Hello Bulba, this is your mother. I write here to inform you that your father and I do not approve of your timewaste playing childrens game for the internet. Therefore we are sending you to India to marry your beautiful cousin Venkatanarasimharajuvaripeta and work as a train conductor.","tags":"#dota2#bulba#mother#childrens#games#india#train","favourites":66,"__v":0,"created_on":"2015-01-21T03:42:05.992Z","score":0.002711793962436415},{"_id":"54d81ddcb898625b08cd362a","id":741,"pasta":"i expect us to win every lan\" - s4 2015","tags":"#dota2#s4#lan#tournament","favourites":43,"__v":0,"created_on":"2015-02-09T02:36:25.354Z","score":0.002694862599274688}]