[{"_id":"54bf14322d74781f04a60379","id":311,"pasta":"Ｈｅｌｌｏ  Ｉ＇ｍ  Ｓｎｉｔｈ，  ｐｌａｙｉｎｇ  ｍｙ  ２０２１４３ｔｈ  ｇａｍｅ  ｏｎ  Ｃｈｅｎ．  Ｅｖｅｎ  ｔｈｏｕｇｈ  ｉｔ＇ｓ  ｔｈｅ  ｏｎｌｙ  ｈｅｒｏ  Ｉ  ｐｌａｙ  Ｉ  ｓｔｉｌｌ  ｓｕｃｋ  ａｔ  ｉｔ．  Ａｓ  ａ  ｃｏｍｐｅｎｓａｔｉｏｎ  ｆｏｒ  ｍｙ  ｌａｃｋ  ｏｆ  ｓｋｉｌｌ  Ｉ  ａｍ  ｇｏｉｎｇ  ｔｏ  ｂｕｙ  ａｌｌ  ｓｕｐｐｏｒｔ  ｉｔｅｍｓ  ａｎｄ  ｇａｎｋ  ｍｉｄ  ａｔ  ｌｖｌ  ２  ａｎｄ  ｆａｉｌ．  Ｔｈａｎｋｓ  ｆｏｒ  ｌｉｓｔｅｎｉｎｇ","tags":"#dota2#hello#snith#chen#only#hero#suck","favourites":135,"__v":0,"created_on":"2015-01-21T02:44:07.591Z","score":0.0009998732280702871},{"_id":"54b344916bd15d33165d28a9","id":55,"pasta":"My Grandfather smoked his whole life. I was about 10 years old when my mother said to him, 'If you ever want to see your grandchildren graduate, you have to stop immediately.'. Tears welled up in his eyes when he realized what exactly was at stake. He gave it up immediately. Three years later he died of lung cancer. It was really sad and destroyed me. My mother said to me- 'Don't ever smoke. Please don't put your family through what your Grandfather put us through.\" I agreed. At 28, I have never touched a cigarette. I must say, I feel a very slight sense of regret for never having done it, because your post gave me cancer anyway.","tags":"#reddit#cancer#post#smoking#grandpa","favourites":131,"__v":0,"created_on":"2015-01-12T03:03:39.683Z","score":0.0009364062160834302},{"_id":"54e02a0026efea8810640220","id":794,"pasta":" ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ༼ຈ ل͜ຈ༽ﾉ•︻̷┻̿═━一 ｈｏｈｏ　ｈａｈａ　ｓｈｒａｐｎｅｌヽ༼ຈل͜ຈ༽ﾉ•︻̷┻̿═━一 ヽ｀ヽ｀、ヽヽ｀ヽ｀、｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ、ヽヽ｀ヽ","tags":"#dota2#shrapnel#sniper","favourites":107,"__v":0,"created_on":"2015-02-15T05:02:49.424Z","score":0.000927347231429478},{"_id":"54bf066ebd6b1a11037e7c98","id":300,"pasta":"\"Sheever, ravage!\" Singsing shouts, infuriated at yet another of Sheever's antics. Sheever upon hearing this retreats to her room, tears streaming down her cheeks.Singsing doesn't notice until hours later, after losing to pubs for the third time in a row and switching off his stream.He finds Sheever in a ball on her bed, tear marks on the sheets and her eyes red and swollen. \"What's wrong, Sheever-chan?\" Singsing asks.\"You.. you yelled at me!\"","tags":"#dota2#singsing#sheever#fanfic","favourites":118,"__v":0,"created_on":"2015-01-21T01:50:16.708Z","score":0.000892836155454782},{"_id":"54bf32603b0a330105ff5bc2","id":353,"pasta":"ʜᴇʟʟᴏ ʙᴜʟʟᴅᴏɢᴇ I ᴀᴍ ғᴀᴍᴏᴜs ᴘᴏʀɴ ᴅɪʀᴇᴄᴛᴏʀ, ᴛᴏɴʏ ᴘᴀsᴛᴇʀɪɴᴏ. ᴡᴇ ᴡᴏᴜʟᴅ ʟɪᴋᴇ ʏᴏᴜ ᴀɴᴅ sʜᴇᴇᴠᴇʀ ᴛᴏ ᴘᴀʀᴛɪᴄɪᴘᴀᴛᴇ ɪɴ ᴏᴜʀ ɴᴇᴡ ᴠɪᴅᴇᴏ \" ʜᴏᴏᴋɪɴ' ɴ ᴊᴜᴋᴇɪɴ' \" sʜᴇᴇᴠᴇʀ ᴡᴏᴜʟᴅ ʙᴇ ᴡɪɴᴅʀᴜɴɴᴇʀ ᴀɴᴅ ʏᴏᴜ sᴀʏ ɴᴏ ᴊᴜᴋᴇʀɪɴᴏ ᴀɴᴅ ʙᴀᴄᴋᴅᴏᴏʀ ʜᴇʀ.","tags":"#dota2#admiralbulldog#porn#sheever#jukerino#backdoor","favourites":108,"__v":0,"created_on":"2015-01-21T04:42:26.764Z","score":0.0008292271583736848},{"_id":"54b5f43df6a1885137f43cdb","id":185,"pasta":"Albert Einstein, one of the greatest minds to ever live, was once perplexed by the speed at which Arteezy was able to farm. Seemingly impossible GPMs of 800+ every game were consistently observed, leading to the hypothesis that this was no fluke. Einstein spent the last years of his life trying to prove the ability of Arteezy's farm existed within the laws of science. Critics laughed at his efforts, claiming that Arteezy's farm was an undeniable act of divine intervention. It wasn't until the end when Einstein found the answer. On his deathbed, Einstein spent the last seconds of his life jotting down what is now the world's most infamous scientific formula. r=tz²","tags":"#rtz#einstein#arteezy#dota2#gpm#farm","favourites":107,"__v":0,"created_on":"2015-01-14T04:42:15.444Z","score":0.0007972251474895229},{"_id":"54d7c1544cdf1142657fb74e","id":735,"pasta":"Arteezy gets first blood on Suma1L mid and he says, \"That's how you do it, son.\" Then Universe comes down the lane, hand in hand with his princess, Aui_2000, and proclaims, \"Don't you talk to my nephew that way.\" But then Fear rolls down midlane in his wheelchair -- old man, Father Fear -- looks directly into Arteezy, his son's eyes and softly says, \"Where am I?\"","tags":"#dota2#sumail#eg#rtz#arteezy#first#blood","favourites":90,"__v":0,"created_on":"2015-02-08T19:17:32.926Z","score":0.0007765841514544326},{"_id":"5514dfeeb79c00ce446ab073","id":1337,"pasta":"﻿ＳＩＮＧＳＩＮＧ，  ＨＯＷ  ＤＯ  ＹＯＵ  ＰＬＡＹ  ＭＥＥＰＯ？  ＤＯ  ＹＯＵ  ＭＡＸ  ＰＯＯＦ，  ＬＩＫＥ  ＹＯＵ  ＰＯＯＦＥＤ  ＯＵＴ  ＯＦ  ＲＥＬＥＶＡＮＣＥ？  ＯＲ  ＤＯ  ＹＯＵ  ＭＡＸ  ＮＥＴ，  ＬＩＫＥ  ＹＯＵ  ＮＥＴＴＥＤ  ＺＥＲＯ  ＬＡＮ  ＷＩＮＳ  ＩＮ  ２０１５？  ＭＹ  ＦＡＶＯＲＩＴＥ  ＢＵＩＬＤ  ＩＳ  ＭＡＸＩＮＧ  ＧＥＯＳＴＲＩＫＥ，  ＬＩＫＥ ＹＯＵ  ＳＴＲＵＣＫ  ＲＯＣＫ  ＢＯＴＴＯＭ．  ＰＬＥＡＳＥ  ＡＮＳＷＥＲ","tags":"#dota2#singsing#meepo#build","favourites":64,"__v":0,"created_on":"2015-03-27T03:40:30.309Z","score":0.0007479213836697615},{"_id":"54fa6ecc87d1bc685b1e9640","id":998,"pasta":" @ppdDota ＹＯＵ　ＦＵＣＫＩＮＧ　ＮＥＲＤ　．．：　Ｕ　ＷＩＬＬ　ＮＥＶＥＲ　ＭＡＫＥ　ＳＥＸ　ＩＮ　ＵＲ　ＬＩＦＥ　．．：　ＷＨＩＬＥ　ＩＮ　ＢＲＡＺＩＬ　Ｉ　ＨＡＶＥ　ＳＥＸ　３０　ＴＩＭＥＳ　ＥＡＣＨ　ＤＡＹ　ＡＴ　ＣＡＲＮＡＶＡＬ","tags":"#dota2#ppd#nerd#carnaval#make#sex","favourites":73,"__v":0,"created_on":"2015-03-07T01:15:00.583Z","score":0.0007453230568936941},{"_id":"54f2b8cd87d1bc685b1e95c8","id":943,"pasta":"░░░░█▒▒▄▀▀▀▀▀▄▄▒▒▒▒▒▒▒▒▒▄▄▀▀▀▀▀▀▄\n░░▄▀▒▒▒▄█████▄▒█▒▒▒▒▒▒▒█▒▄█████▄▒█\n░█▒▒▒▒▐██▄████▌▒█▒▒▒▒▒█▒▐██▄████▌▒█\n▀▒▒▒▒▒▒▀█████▀▒▒█▒░▄▒▄█▒▒▀█████▀▒▒▒█\n▒▒▐▒▒▒░░░░▒▒▒▒▒█▒░▒▒▀▒▒█▒▒▒▒▒▒▒▒▒▒▒▒█\n▒▌▒▒▒░░░▒▒▒▒▒▄▀▒░▒▄█▄█▄▒▀▄▒▒▒▒▒▒▒▒▒▒▒▌\n▒▌▒▒▒▒░▒▒▒▒▒▒▀▄▒▒█▌▌▌▌▌█▄▀▒▒▒▒▒▒▒▒▒▒▒▐\n▒▐▒▒▒▒▒▒▒▒▒▒▒▒▒▌▒▒▀███▀▒▌▒▒▒▒▒▒▒▒▒▒▒▒▌\n▀▀▄▒▒▒▒▒▒▒▒▒▒▒▌▒▒▒▒▒▒▒▒▒▐▒▒▒▒▒▒▒▒▒▒▒█\n▀▄▒▀▄▒▒▒▒▒▒▒▒▐▒▒▒▒▒▒▒▒▒▄▄▄▄▒▒▒▒▒▒▄▄▀\n▒▒▀▄▒▀▄▀▀▀▄▀▀▀▀▄▄▄▄▄▄▄▀░░░░▀▀▀▀▀▀\n▒▒▒▒▀▄▐▒▒▒▒▒▒▒▒▒▒▒▒▒▐\n░▄▄▄░░▄░░▄░▄░░▄░░▄░░░░▄▄░▄▄░░░▄▄▄░░░▄▄▄\n█▄▄▄█░█▄▄█░█▄▄█░░█░░░█░░█░░█░█▄▄▄█░█░░░█\n█░░░█░░█░░░░█░░░░█░░░█░░█░░█░█░░░█░█░░░█\n▀░░░▀░░▀░░░░▀░░░░▀▀▀░░░░░░░░░▀░░░▀░▀▄▄▄▀﻿","tags":"#general#ayy#lmao#alien#ASCII","favourites":75,"__v":0,"created_on":"2015-03-01T06:59:21.552Z","score":0.0007392340660021731},{"_id":"54b35f78d74d4ff016825273","id":66,"pasta":"Kripparian grunts and sighs after finally managing to finish inside Hafu after numerous pre-mature ejaculations. He lights a cig while laying in bed. \"Was that as good for you as it was for me, Hafu?\" Kripp asks. \"I'm not Hafu,\" replies Trump. As Kripp recoils in horror, Trump smirks. \"It seems you've tucked Frump.\"","tags":"#kripp#hafu#tuck#frump#fuck#trump","favourites":96,"__v":0,"created_on":"2015-01-12T05:45:17.959Z","score":0.0007213784000574475},{"_id":"54b5fc11f6a1885137f43cf2","id":195,"pasta":"EE. I will be your bodygaurd at any major lan you attend. In fact I will protect all of C9. Seriously. I am a former pro fighter(undefeated) and I will happily punch Arise really hard for you. I just require transportation and Dota coaching. Pls no copy pastarino","tags":"#dota2#ee#eternalenvy#bodyguard#arise","favourites":90,"__v":0,"created_on":"2015-01-14T05:17:29.918Z","score":0.0006892313981295818},{"_id":"54bf5e573b0a330105ff5c0e","id":379,"pasta":"Mason got into his car in a hurry as he was late to work at McDonalds. As he pulled out of his driveway, he saw a beautiful vixen approaching him . She had long brown flowing hair that rustled gently in the wind. Mason's heart rate accelerated and he began dripping with sweat from every pore of his all-American 350 pound body. He hadn't been this aroused since the last all you can eat pancake buffet at Denny's. This girl was the most beautiful human he'd ever laid his eyes on. As he got closer to her, he rolled down his window, and whispered \"h-hey\". Zai cleared the brown hair from his eyes and replied \"shut the fuck up mason i thought we booted u\"","tags":"#dota2#mason#zai#car#mcdonalds","favourites":85,"__v":0,"created_on":"2015-01-21T07:06:36.602Z","score":0.0006780860656951636},{"_id":"5508c0d0b47c3d010fd9650f","id":1084,"pasta":"Dude you need to quit fucking snap chatting mckenna. Stop. She doesn't respond with anything meaningful for a reason and she's not interested in you.\n\nWho am I?\n\nThe man whom she is in love with.\n\nShe already told me not to worry, she's not interested in you. Sorry I bothered you kid.\n\nI've dated her since 2 summers ago. If you aren't trying to get at my woman or being inappropriate I don't care if you snap her occasionally.\n\nJust don't try anything man. You'll embarrass yourself and anger me.\n\nWe are in love and we're making love tomorrow. So if you have any ill intentions with my woman you can forget it right now. I'm the biggest and best she's ever had, only man she's ever loved and the only man who could truly satisfy her physically. You will never have her. And she loves me.\n\nI don't have any problems with you if you are over my woman and realize you will never be with or touch her again.\n\nI apologize for coming off as a dick, just me and kenna are really deep in love and we've been through a lot and I just moved back home and it makes me a little jealous and angry to see a man she used to date before me is snap chatting her....\n\nWe don't need any extra bullshit or drama right now, so don't bring us any please is all I ask friend.\n\nIf you try to talk to her any way but as a brother, or you try to see her at all, if she tells me you do anything inappropriate or anything outside of what a strict brother like friend would do,we are going to have a huge problem.\n\nI will leave you alone now dude if you're not trying to get at the woman who I love and whom is in love with me.\n\nThat entire summer she was with me. She left kyle for me. She's been with me ever since, she even loved me and made love to me before she EVER let anything happen with you. You didn't please her. She didn't have strong feelings for you at all. And she immediately ended shit with you for me once she knew I loved her too. So get any ideas of the past out of your head.\n\nNone of this truth should bug you if you're over her but I'm just making sure. I hate when my baby's friends have ill intentions and she thinks they are just friends and have no alternative motive. But idk if I trust you at all.\n\nIf I can trust you to not stress me and my baby or fuck with our love tell me.\n\nI will leave you alone and apologize.\n\nBut if you aren't over her and you're tryna \"get some\" or you're tryna get back in her life, it's NOT HAPPENING. She said you were nothing to her, and the sex was bad anyway haha. You're small and weak and she said it all felt wrong after being with me. She's been with me ever since. We're in love. And tomorrow me and her will be together in my room making love alll day how we always have together. If you have a problem speak up like a man or tell me our love doesn't bug you and I'll apologize, it's simple.\n\nSo??? What is it? You are after my woman then huh?!\n\nTell me the fucking truth man. Don't you dare be disrespectful and gross enough to bring it up, but if if you ask her about anything she shared with me about your weak ass, she may be nice and lie to you, or she may not care and tell you the truth. Either way. I'm her soullmate and her boyfriend of the past two years almost. And she tells me everything and NEVER lies to me. I don't care haha. Just stay away from my kenna.\n\nI sincerely apologize if you have no ill intentions and aren't trying to make moves with my woman. And i respect you as a guy in the service. I'm sure you're an ok dude. But just as a friend. You're nothing to my kenna but a brother like friend.\n\nI just wanna be sure you know it and don't forget it.\n\nFind a nice classy woman where you are stationed, marry her.... But back off of mine. You will never even compare to me in her eyes. Not even close haha.I just don't need you interfering with me and kenna's love. It's our lives man. It's really not cool....\n\nGoodbye man, good luck. Respect to you being in the service. Sorry to bring your day down with my crazy bullshit but. Me and kenna are head over heels.... I can't help but be crazy about her. I love her with all of my heart and I will protect her from her untrustworthy fake friends. Not saying you are one. But you're dodging telling me what's going on in your head so I'm questioning a lot right now.\n\nJust know I'm never gonna hurt her, I'm always going to have her back, I'd give my life for her without hesitation, and I will protect her from anything, everything, and anyone.\n\nShe is the love of my life. I fully intend to marry and give kenna my children. And we've talked a lot about it. Just don't make shit harder than it already is.\n\nI just moved back and me and her miss eachother so badly and we are FINALLY go to see eachother tomorrow and make love for the first time since halloween....\n\nI hope you don't hate me man. I'm a good dude. Just protective of the woman who holds my heart. And who's heart I hold and must protect.\n\nI hope you can understand.\n\nShe promised me there's nothing at all to worry about with you and that she's not interested:\"/ I wish I knew before I embarrassingly went off on you. I'm so sorry man.\n\nI'm sorry.\n\nPlease don't mention this to my baby:/ I'm really embarrassed and while she will understand, I just feel like an ass for attacking you when you have nothing with my kenna and no intention to.\n\nGood bye brother. I hope you find your one true love someday. It'll make you crazy, trust me, but you'll find her one day. I found mine when I was really young. And it's my kenna :)","tags":"#reddit#cringe#snapchat#mckenna#stop","favourites":60,"__v":0,"created_on":"2015-03-17T23:57:55.520Z","score":0.0006711956919376277},{"_id":"54bf0ba02619c58503a1dc63","id":303,"pasta":"Guys, it's not nice to make fun of sing_sing. Being a gay player in the DOTA 2 scene is really hard sometimes because a lot of the guys are ugly. Plus, ever since he got kicked from C9 by known homophobe Envy (who insists that \"Futa isn't gay, it's Kawaii\"), he doesn't get to cuddle with AUI anymore and has to settle for Tucker \"The Fucker,\" who's really rough and makes him cry sometimes. ","tags":"#dota2#singsing#not#nice#gay#envy","favourites":84,"__v":0,"created_on":"2015-01-21T02:14:19.863Z","score":0.0006707309900509184}]