[{"_id":"54b5fc11f6a1885137f43cf2","id":195,"pasta":"EE. I will be your bodygaurd at any major lan you attend. In fact I will protect all of C9. Seriously. I am a former pro fighter(undefeated) and I will happily punch Arise really hard for you. I just require transportation and Dota coaching. Pls no copy pastarino","tags":"#dota2#ee#eternalenvy#bodyguard#arise","favourites":90,"__v":0,"created_on":"2015-01-14T05:17:29.918Z","score":0.0009252131734423617},{"_id":"54bf5e573b0a330105ff5c0e","id":379,"pasta":"Mason got into his car in a hurry as he was late to work at McDonalds. As he pulled out of his driveway, he saw a beautiful vixen approaching him . She had long brown flowing hair that rustled gently in the wind. Mason's heart rate accelerated and he began dripping with sweat from every pore of his all-American 350 pound body. He hadn't been this aroused since the last all you can eat pancake buffet at Denny's. This girl was the most beautiful human he'd ever laid his eyes on. As he got closer to her, he rolled down his window, and whispered \"h-hey\". Zai cleared the brown hair from his eyes and replied \"shut the fuck up mason i thought we booted u\"","tags":"#dota2#mason#zai#car#mcdonalds","favourites":85,"__v":0,"created_on":"2015-01-21T07:06:36.602Z","score":0.0009181195548694642},{"_id":"54bf0ba02619c58503a1dc63","id":303,"pasta":"Guys, it's not nice to make fun of sing_sing. Being a gay player in the DOTA 2 scene is really hard sometimes because a lot of the guys are ugly. Plus, ever since he got kicked from C9 by known homophobe Envy (who insists that \"Futa isn't gay, it's Kawaii\"), he doesn't get to cuddle with AUI anymore and has to settle for Tucker \"The Fucker,\" who's really rough and makes him cry sometimes. ","tags":"#dota2#singsing#not#nice#gay#envy","favourites":84,"__v":0,"created_on":"2015-01-21T02:14:19.863Z","score":0.0009079303159787907},{"_id":"54bf0f9a2d74781f04a6036f","id":307,"pasta":"Hey 2gd ( ° ͜ʖ͡°)╭∩╮","tags":"#dota2#hey#2gd#donger","favourites":81,"__v":0,"created_on":"2015-01-21T02:31:00.022Z","score":0.0008805586876410318},{"_id":"551076e5e176d8400420cf56","id":1294,"pasta":"ＨＥＹ Ｓ４， Ｉ＇Ｍ ＴＲＹＩＮＧ ＴＯ ＬＥＡＲＮ ＴＯ ＰＬＡＹ ＭＡＧＮＵＳ． Ｉ ＪＵＳＴ ＨＡＶＥ Ａ ＱＵＥＳＴＩＯＮ ＡＢＯＵＴ ＴＨＥ ＳＫＩＬＬ ＢＵＩＬＤ： ＳＨＯＵＬＤ Ｉ ＭＡＸ ＳＨＯＣＫＷＡＶＥ ＬＩＫＥ ＹＯＵ ＳＨＯＣＫＥＤ ＥＶＥＲＹＯＮＥ ＷＨＥＮ ＹＯＵ ＬＥＦＴ ＡＬＬＩＡＮＣＥ， ＳＫＥＷＥＲ ＳＯ Ｉ ＣＡＮ ＥＳＣＡＰＥ ＬＩＫＥ ＹＯＵ ＥＳＣＡＰＥＤ ＡＬＬＩＡＮＣＥ， ＯＲ ＥＭＰＯＷＥＲ ＳＯ Ｉ ＣＡＮ ＣＬＥＡＶＥ ＬＩＫＥ ＹＯＵ ＣＬＥＡＶＥＤ ＬＯＤＡ＇Ｓ ＨＥＡＲＴ","tags":"#dota2#s4#learn#magnus#skill#build","favourites":49,"__v":0,"created_on":"2015-03-23T20:05:21.369Z","score":0.0008779761228498935},{"_id":"54c7be27f63c027608a745ee","id":586,"pasta":"Artour got out of the building. He was a bit frustrated. His team was making him play stupid heroes again. He wanted to play Naga and Terrorblade. Didn't they understand the main goal of Dota is to kill creeps?\nArtour whispered to himself, \"LMFAO wHo cAREAS HAHA Xd\". He sighed and crossed the street. Suddenly Artour's face went pale. On the other side of the street was the Cloud 9 squad. \"J-Jacky...\", he whispered. They were coming at him. He was frozen in place.\nEE looked at him and said \"Long time no see Artour.\" He was speechless as all of them passed by him. Only n0tail stayed there with him, his hands on his pockets. Artour didn't dare to say anything. He hadn't ever seen n0tail with such a grim look.\n\"Having fun with my old team, Artour?\" n0tail asked, a maniac grin growing in his face. \"The team who kicked me because of you.\"\nArtour was panicking. Who was that guy? He surely wasn't the BigDaddy he had met before.\" Don't worry Artour\", continued n0tail, \"I'm not gonna hurt you. In fact, I'm just having fun with my new best friend... Jacky.\"\nThat was it. Artour lost control. \"You'll never steal Jacky from me! Never!\" n0tail's grin got bigger. \"You've always been naive, Artour... I've watched your replays. I know how to please Jacky better than you now.\"\nArtour stared in disbelief. \"W-what...\". N0tail slowly took his hands out of his pockets. A golden glow filled the whole street. Artour fell to his knees as he saw not only one, but two hands of Midas. \"Good luck on the tournament, Artour...\" said n0tail while leaving. Artour sat in the ground, tears in his face. \"Jacky...\" He whispered.","tags":"#dota2#arteezy#rtz#ee#jacky#building#notail#bigdaddy","favourites":77,"__v":0,"created_on":"2015-01-27T16:04:51.524Z","score":0.0008770396718239576},{"_id":"54b4ba70864e0cf426846c4f","id":94,"pasta":"ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ༼ຈل͜ຈ༽ﾉ☂ ɪᴛs ʀᴀɪɴɪɴɢ sᴀʟᴛ! ヽ༼ຈل͜ຈ༽ﾉ☂ ヽ｀ヽ｀、ヽヽ｀ヽ｀、｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ、ヽヽ｀ヽ","tags":"#raining#salt#donger","favourites":84,"__v":0,"created_on":"2015-01-13T06:25:48.202Z","score":0.0008682757934189603},{"_id":"5508c7c2b47c3d010fd96534","id":1099,"pasta":"Hi! Few things to start off with =] 1. Yes I added you because you are a female gamer, 'tis a great thing to see! 2. I'm Brian 3. Don't be intimidated, but I'm not a stereotypical guy. If anything, I'll be the one in the kitchen =D.","tags":"#general#female#xbox#kitchen#gamer","favourites":51,"__v":0,"created_on":"2015-03-18T00:24:10.837Z","score":0.0008670430860139357},{"_id":"54b38180dcf3ad6e17833537","id":76,"pasta":"The Ghost of Gaming Future shows Kripp a nice house in the Toronto suburbs. Inside, Kripp, Rania and their sons are happily gaming as a family. \"This isn't so bad,\" says Kripp. \"Look closer,\" speaks the Ghost. Kripp looks in horror to see his sons are using tablets and playing browser cash-shop games. \"This is your future Casualarrian.\"","tags":"#hearthstone#kripp#succubus#casualarrian#children","favourites":84,"__v":0,"created_on":"2015-01-12T08:10:38.090Z","score":0.0008637835220916062},{"_id":"54b59324e90c10d22e88b982","id":128,"pasta":"Forsen enters his bedroom and notices something unusual. In his bed lays a 6/3 Reynad in stealth. Forsen has no answer for this play. He passes his turn and prepares himself for the donger of destiny.","tags":"#hearthstone#forsen#reynad#donger#bed","favourites":83,"__v":0,"created_on":"2015-01-13T21:50:00.027Z","score":0.0008626520968560737},{"_id":"54f00fb287d1bc685b1e95a4","id":927,"pasta":"░░░░░░░░░░░░░░░░.░░░░░░░░░░░░░░ \n░░░░░░░░░░░░░█░░░░░░░░░░░░░░░░░░ \n░░░░░░░░░░░░░█░░░░░░░░░░░░░░░░░░ \n░░░░░░░░░░░░█░█░░░░░░░░░░░░░░░░░ \n░░▄░░░░░░░░░█░█░░░░░░░░░▄▄░░░░░░ \n░░█▀▄░░░░░░█░░░█░░░░░░▄▀█░░░░░░░ \n░░▀▄░▀▄░░░░█░░░█░░░░▄▀░▄▀░░░░░░░ \n░░░█░░░▀▄░░█░░░█░░▄▀░░░█░░░░░░░░ \n░░░░█░░░░█░█░░░█░█░░░░█░░░░░░░░░ \n░░░░░█░░░░█░█░█░█░░░░█░░░░░░░░░░ \n█▄▄▄▄░▀▄░░░██░██░░░▄▀░▄▄▄▄▄▄░░░░ \n▀▄░░░▀▀▄█▄░▀█░█▀░▄█▄▀▀░░░▄▀░░░░░ \n░░▀▀▀▄▄▄▄▄███████▄▄▄▄▄▀▀▀░░░░░░░ \n░░░░░░░░▄▀▀░███░▀▀▄░░░░░░░░░░░░░ \n░░░░░░▄█▄▄▄▀░█░▀▄▄▄█░░▄░░▄▄░▄▄▄░ \n░░░░░░░░░░░░░▀▄░░░░▀▄▀█░█░░██░░█ \n░░░░░░░░░░░░░░▀░░░░█▄▄█▄░▄▀░█░░█ \n░░░░░░░░░░░░░░░░░░░░░░█░█▄▄▄▀▄▄▀","tags":"#general#ASCII#420#blaze#it#pot#weed#marijuana","favourites":59,"__v":0,"created_on":"2015-02-27T06:33:17.582Z","score":0.0008537666583742907},{"_id":"5510b6e632d34a8e3c3ec406","id":1297,"pasta":"Dota's comeback mechanics are just genius, I think every sports needs to have similar mechanics in the future. For example in football your goal could be made bigger by moving the goalposts if your team is winning a lot. Or maybe they could count one goal as two goals for the team that is behind. Or maybe punish leading team more for their mistakes. Red card instead of yellow and so on.\nI think comeback mechanics are the future of all competitions, as they make watching much more pleasant experience since you can't be sure if the best team wins or loses.","tags":"#dota2#comeback#satire#football","favourites":46,"__v":0,"created_on":"2015-03-24T00:39:29.761Z","score":0.0008332965146267768},{"_id":"54b5d1ff8ba53a7c3326b4e6","id":156,"pasta":"Well, I'm ready with my can of Monster Energy. I've got my CyberPowerPC turned on and my BenQ screen picture quality is perfect. My Razer headphones sound authentic and my DesignByHumans hoodie is super comfortable. I'm fully supported by my NeedForSeat chair and my computer commands are super fast thanks to HyperX RAM. Clinton \"Fear\" Loomis, take it away!","tags":"#dota2#eg#bleedblue#sellout#fear#oldman","favourites":79,"__v":0,"created_on":"2015-01-14T02:15:00.815Z","score":0.0008282965694521964},{"_id":"54b5592b34b44c1d2984b375","id":110,"pasta":"ʀᴇxxᴀʀ ᴅɪᴀʀʏ ɢᴠɢ ᴅᴀʏ 1: ᴇᴠᴇʀʏ ᴅᴇᴄᴋ ʀᴏʙᴏᴛ ɴᴏᴡ. ᴀᴍ ᴄᴏɴғᴜsᴇ. ᴛʀᴀᴅᴇ ᴏʀ ʜɪᴛ ғᴀᴄᴇ? ɪ ᴘʟᴀʏ ᴛ1 ᴜɴᴅᴇʀᴛᴀᴋᴇʀ ᴄᴏɪɴ ʟᴇᴘᴇʀ ɢɴᴏᴍᴇ? ɢᴠɢ ᴅᴀʏ 2: ᴍᴀɴʏ ᴛʜɪɴᴋɪɴɢ, ʙʀᴀɪɴ ʜᴜʀᴛ. ᴅᴇᴄɪᴅᴇ ᴛᴏ ᴋᴇᴇᴘ ᴜsɪɴɢ ᴏʟᴅ ᴅᴇᴄᴋ. ᴅᴇᴄɪᴅᴇ ᴋᴇᴇᴘ ᴜsᴇ ᴏʟᴅ ᴅᴇᴄᴋ ᴀɴᴅ ʜɪᴛ ғᴀᴄᴇ. ᴀᴍ ᴛʜɪɴᴋ ᴍᴀʏʙᴇ ᴀᴅᴅ ᴅᴇᴀᴛʜʀᴀᴛᴛʟᴇ ʀᴏʙᴏᴛ. ɢᴠɢ ᴅᴀʏ 3: ᴍᴇ sᴛɪʟʟ ᴡɪɴɴɪɴɢ.","tags":"#hearthstone#gvg#hunter#huntard#hit#face","favourites":78,"__v":0,"created_on":"2015-01-13T11:44:20.139Z","score":0.0008166583097119309},{"_id":"55106830e176d8400420cf53","id":1293,"pasta":"Shrapnel is named after Major-General Henry Shrapnel (1761–1842), a British artillery officer, whose experiments, initially conducted in his own time and at his own expense, culminated in the design and development of a new type of artillery shell ending with his famous catchphrase \"Hoho Haha\"","tags":"#dota2#sniper#henry#shrapnel#hoho#haha","favourites":45,"__v":0,"created_on":"2015-03-23T18:58:30.301Z","score":0.0008162589812267543}]