[{"_id":"54bf03b9bd6b1a11037e7c89","id":293,"pasta":"༼ つ ◕_◕ ༽つ Give DIRETIDE ༼ つ ◕_◕ ༽つ","tags":"#dota2#diretide#2013#donger","favourites":433,"__v":0,"created_on":"2015-01-21T01:28:47.149Z","score":0.0036102239237028135},{"_id":"558f79077bc415727ec982ee","id":1817,"pasta":"Hello, cykas and cykettes! Welcome to \"Blyat or Nyat!\" I'm your host, Chuck Wunderfukh!","tags":"#dota2#gameshow#cyka#blyat#ruskie#hailhydra","favourites":59,"__v":0,"created_on":"2015-06-27T16:32:29.079Z","score":0.003579556129319717},{"_id":"55cee16a2698f7be3d0ad88c","id":2007,"pasta":"|| TriHard || TriHard || TriHard || TriHard || TriHard || Let's build a prision","tags":"#twitch#prison","favourites":4,"__v":0,"created_on":"2015-08-15T06:51:22.027Z","score":0.0035271405501102154},{"_id":"55c1b65ce573e77679a4b17d","id":1969,"pasta":"Is there a character that could even possibly EVEN TOUCH Madara Uchiha? Let alone defeat him. And I'm not talking about Edo Tensei Uchiha Madara. I'm not talking about Gedou Rinne Tensei Uchiha Madara either. Hell, I'm not even talking about Juubi Jinchuuriki Gedou Rinne Tensei Uchiha Madara with the Eternal Mangekyou Sharingan and Rinnegan doujutsus (with the rikodou abilities and being capable of both Amateratsu and Tsukuyomi genjutsu), equipped with his Gunbai, a perfect Susano'o, control of the juubi and Gedou Mazou, with Hashirama Senju's DNA implanted in him so he has mokuton kekkei genkai and can perform yin yang release ninjutsu while being an expert in kenjutsu and taijutsu. I’m also not talking about Kono Yo no Kyūseishu Futarime no Rikudō Juubi Jinchuuriki Gedou Rinne Tensei Uchiha Madara with the Eternal Mangekyou Sharingan (which is capable of Enton Amaterasu, Izanagi, Izanami and the Tsyukuyomi Genjutsu), his two original Rinnegan (which grant him Chikushōdō, Shuradō, Tendō, Ningendō, Jigokudō, Gakidō, Gedō, Banshō Ten’in, Chibaku Tensei, Shinra Tensei, Tengai Shinsei and Banbutsu Sōzō) and a third Tomoe Rinnegan on his forehead, capable of using Katon, Fūton, Raiton, Doton, Suiton, Mokuton, Ranton, Inton, Yōton and even Onmyōton Jutsu, equipped with his Gunbai(capable of using Uchihagaeshi) and a Shakujō because he is a master in kenjutsu and taijutsu, a perfect Susano’o (that can use Yasaka no Magatama ), control of both the Juubi and the Gedou Mazou, with Hashirama Senju’s DNA and face implanted on his chest, his four Rinbo Hengoku Clones guarding him and nine Gudōdama floating behind him AFTER he absorbed Senjutsu from the First Hokage, entered Rikudō Senjutsu Mode, cast Mugen Tsukuyomi on everybody and used Shin: Jukai Kōtan so he can use their Chakra while they are under Genjutsu. I'm definitely NOT Talking about sagemode sage of the six paths Juubi Jinchuuriki Gedou Rinne Tensei Super Saiyan 4 Uchiha Madara with the Eternal Mangekyou Sharingan, Rinnegan, Mystic Eyes of Death Perception, and Geass doujutsus, equipped with Shining Trapezohedron while casting Super Tengen Toppa Gurren Lagann as his Susanoo, controlling the Gold Experience Requiem stand, having become the original vampire after Alucard, able to tap into the speedforce, wearing the Kamen Rider Black RX suit and Gedou Mazou, with Hashirama Senju's DNA implanted in him so he has mokuton kekkei genkai and can perform yin yang release ninjutsu while being an expert in kenjutsu and taijutsu and having eaten Popeye's spinach. I'm talking about sagemode sage of the six paths Juubi Jinchuuriki Gedou Rinne Tensei Legendary Super Saiyan 4 Uchiha Madara with the Eternal Mangekyou Sharingan, Rinnegan, Mystic Eyes of Death Perception, and Geass doujutsus, equipped with his Shining Trapezohedron while casting Super Tengen Toppa Gurren Lagann as his Susanoo, controlling the Gold Experience Requiem stand, having become the original vampire after having absorbed Alucard as well as a God Hand, able to tap into the speedforce, wearing the Kamen Rider Black RX suit, with Kryptonian DNA implanted in him and having eaten Popeye's spinach while possessing quantum powers like Dr. Manhattan and having mastered Hokuto Shinken.","tags":"#general#naruto#godtiercopypasta#weaboo","favourites":11,"__v":0,"created_on":"2015-08-05T07:08:12.732Z","score":0.003476033431487662},{"_id":"55a849824587967e7ca6a8a4","id":1889,"pasta":"████████████████████████████\n██▓▓▓▓▓▓▓▓▓▓▓██▓▓▓▓▓▓▓▓▓▓▓██\n██▓▓1▓▓▓▓▓▓▓▓██▓▓▓▓▓▓▓▓▓▓▓██\n██▓▓▓▓▓▓▓▓▓▓▓██▓▓▓▓▓▓▓▓▓▓▓██\n██▓▓▓▓2▓▓▓▓▓▓██▓▓▓▓▓▓▓▓▓▓▓██\n██▓▓▓▓▓▓▓▓▓▓▓██▓▓▓▓▓▓▓▓▓▓▓██\n██▓▓▓▓▓▓▓3▓▓▓██▓▓▓▓▓▓▓▓▓▓▓██\n██▓▓▓▓▓▓▓▓▓▓▓██▓▓▓▓▓▓▓▓▓▓▓██\n██▓▓▓▓▓▓▓▓▓▓▓██▓▓▓▓▓▓▓▓▓▓▓██\n██▓▓▓▓▓▓▓▓▓▓▓██▓▓▓▓▓▓▓▓▓▓▓██\n████████████████████████████\n██▓▓▓▓▓▓▓▓▓▓▓██▓▓▓▓▓▓▓▓▓▓▓██\n██▓▓▓D▓▓▓▓▓▓▓██▓▓▓▓▓▓▓▓▓▓▓██\n██▓▓▓O▓▓▓▓▓▓▓██▓▓▓▓▓▓▓▓▓▓▓██\n██▓▓▓O▓▓▓G▓▓▓██▓▓▓▓▓████▓▓██\n██▓▓▓R▓▓▓I▓▓▓██▓▓▓▓▓████▓▓██\n██▓▓▓▓▓▓▓V▓▓▓██▓▓▓▓▓████▓▓██\n██▓▓▓▓▓▓▓E▓▓▓██▓▓▓▓▓▓▓▓▓▓▓██\n██▓▓▓▓▓▓▓A▓▓▓██▓▓▓▓▓▓▓▓▓▓▓██\n██▓▓▓▓▓▓▓W▓▓▓██▓▓▓▓▓▓▓▓▓▓▓██\n██▓▓▓▓▓▓▓A▓▓▓██▓▓▓▓▓▓▓▓▓▓▓██\n██▓▓▓▓▓▓▓Y▓▓▓██▓▓▓▓▓▓▓▓▓▓▓██\n██▓▓▓▓▓▓▓▓▓▓▓██▓▓▓▓▓▓▓▓▓▓▓██\n██▓▓▓▓▓▓▓▓▓▓▓██▓▓▓▓▓▓▓▓▓▓▓██\n██▓▓▓▓▓▓▓▓▓▓▓██▓▓▓▓▓▓▓▓▓▓▓██\n████████████████████████████","tags":"#twitch#ascii#door#giveaway","favourites":33,"__v":0,"created_on":"2015-07-15T06:57:28.412Z","score":0.0034758699360726048},{"_id":"54bc36b17a2aab2665bc536d","id":256,"pasta":"卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐\n Repost this windmill of friendship if you think \n\n     Europe should embrace racial diversity \n卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐","tags":"#twitch#reddit#windmill#friendship","favourites":413,"__v":0,"created_on":"2015-01-18T20:11:47.655Z","score":0.0034259425268315636},{"_id":"55737b917d2300ce44f0cecf","id":1732,"pasta":"I once drank an entire bottle of soy sauce on a dare, which I thought was all well and good... until I developed extreme dehydration and Hypernatremia (http://en.wikipedia.org/wiki/Hypernatremia). They had to put an iv directly into my veins to rehydrate me. It was the closest I've ever been to dying.\nWhat I'm getting at is, even that was not nearly as salty as you are right now.","tags":"#dota2#ppd#peter#dager#salt","favourites":88,"__v":0,"created_on":"2015-06-06T03:28:43.092Z","score":0.003352031380592031},{"_id":"55cc125d2ccec12862a3e7b9","id":1988,"pasta":"I saw Artstyle walking into the event this afternoon and asked him to sign my badge. He agreed and signed it. It wasn't until he was walking away I noticed my badge wasn't signed. I was confused until I looked over at him and saw he had autographed his own badge.","tags":"#dota2#artstyle#shallowgrave#navibacktoukraine","favourites":5,"__v":0,"created_on":"2015-08-13T03:43:25.006Z","score":0.0033306454069121877},{"_id":"54b5920de90c10d22e88b97c","id":125,"pasta":"Hey Forsen, I want to play control warrior but I'm missing: Grommash, Alexstrasza, Harrison, Sylvanas, Baron Geddon, Shield Slam, Brawl, Naxx, and the Hearthstone game. Can you suggest replacements?","tags":"#hearthstone#control#warrior#forsenlol","favourites":410,"__v":0,"created_on":"2015-01-13T21:45:41.666Z","score":0.0033105018854010506},{"_id":"55922d8fdd62532d34ee3733","id":1824,"pasta":"DO IT, just DO IT! Don't let your dreams be dreams. Yesterday, you said tomorrow. So just. DO IT! Make. your dreams. COME TRUE! Just... do it! Some people dream of success, while you're gonna wake up and work HARD at it! NOTHING IS IMPOSSIBLE!You should get to the point where anyone else would quit, and you're not gonna stop there. NO! What are you waiting for? ... DO IT! Just... DO IT! Yes you can! Just do it! If you're tired of starting over, stop. giving. up.","tags":"#general#shia#leboeuf#motivational#just#do#it","favourites":50,"__v":0,"created_on":"2015-06-30T03:38:01.367Z","score":0.003288319647545154},{"_id":"54eb4710c200ce525fb25da2","id":902,"pasta":"10/10 quality thread, an emotional rollercoaster that kept me on the edge of my seat the entire time. I laughed, I cried, I learned 42 new ways to season and cook a pork shoulder. Truly a new standard has been set that all future threads will be held in comparison to.","tags":"#reddit#quality#thread#shit#post","favourites":296,"__v":0,"created_on":"2015-02-23T14:06:06.856Z","score":0.0032501484352738426},{"_id":"5508c04db47c3d010fd9650b","id":1080,"pasta":"So ur with ur honey and yur making out wen the phone rigns. U anser it n the vioce is \"wut r u doing wit my daughter?\" U tell ur girl n she say \"my dad is ded\". THEN WHO WAS PHONE?","tags":"#4chan#creepy#who#was#phone","favourites":240,"__v":0,"created_on":"2015-03-17T23:39:39.694Z","score":0.003217974527081971},{"_id":"558e468b63aff1a558465efb","id":1813,"pasta":"HE!1!!!!!!11!!!!!!!!!!!!!!!!!!1111111111!!11 KEK!! KEK!! KEK!!\nWHATA Meme MAN xD i just fall of my chair cuz i couldnt and i CANT stop laugh xDXDXDXDXDDDDDXXXXXXDDDDDD OMGOSH DDDDDXXXXXDDDDD DDDDDD LOOOOOOOLLLLL I CANT JUST STOP LAUGHING CAUSE HE HE HE HE HE JUST TO FUNNY MAN!!!1!11!\nHOOOOOOOOLLLLLLYYYYY poo i just fall of chair!!!! simply le epic so ebin dae le epin win xD pwn’d ftw le bacon narwhale xP upboated good sir i tip my fedora to you! tips fedora, le any1 athiest? LOL\nGOOD MEME\nSORRY I MEAN\nGREAT MEME\nGR88888 MEME BRO I WISH I COULD STOP LAUGHING BUT I CANT MAN!!!!\nNICE MEME IMMA REPOST TO REDDIT LELELELELE TY FOR LE KARMA XDDDDDDDDDDDDDDDD\nXD\nLE UPBOAT\nXD\nWAIT TIL LE DERPINA HEARS ABOUT THIS\nXDDDDDDDDDDDDDDDDDDDDDD\nEPIC MEMEING /b/ro BAZINGA BAZINGA BAZINGAAAAAAAAAAAAAAAAA ZIMBABWE is this a le new epic meme? screen kapped for dat sweet karma xD. FUS ROH DAH!!!!!1 i used to be a christmas but then i took an arrow 2 da knee : BAZINGA BAZINGA ZIMBABWE. top kek, toppest of keks. le nyan cat? hahahaha le mayonaise. epic meme i love that meme so much man wait let me just gets crack pipe out smoke some of that good 420: rips a bongAHHHHHHHHH YES!!!!!!!!!!!!!!!\nthat sure hit the spot ok now repeat that epic M E M E","tags":"#reddit#cancer#weeaboo#nerd","favourites":55,"__v":0,"created_on":"2015-06-25T11:39:00.935Z","score":0.003215207407509067},{"_id":"55090bc4b47c3d010fd965df","id":1172,"pasta":"Lindsay was 12 when it first started. One morning she awoke to find odd little crumbs in her bed. At first she thought they were crackers, but as she was getting dressed for school she noticed a small little tan 'O' laying on the floor next to her nightstand. It was a cheerio. She picked it up and looked at it for a moment, its wholesome oaty contours seeming perfectly harmless. She threw it away, assuming that her bratty older sister was responsible. Little did she know that it was an omen of the pure mind bending horror which was soon to follow. That weekend her mother went shopping.\n\nShe had gotten in the habit of doing all the grocery shopping for the month at once, so the kitchen was packed full of bags and boxes as the girls went about putting things away. Lindsay was disappointed when she noticed that the only cereal her mother had gotten was Cheerios. It was always Cheerios. Four economy-sized boxes worth, no less. Lindsay had never liked Cheerios, even though her sister seemed to love them. They were too plain. Too boring, She thrust the boxes carelessly up onto the shelf above the refrigerator and went searching through the other bags to see if her mother had gotten anything that was actually edible. Later that night she was tossing and turning in bed, her stomach full of slightly too much Butterfinger ice cream. The house was silent. Everyone else was in bed. Or should have been. Lindsay had almost dozed off when a soft, dry rustling sound brought her back to wakefulness. At first she thought it was the cat scratching at her door, but as she sat up she realized it was coming from somewhere inside the room. A twinge of fear shivered through her body. They'd never had rats or mice in the house before. Was it a bug?\n\nWhatever it was, it sounded big. Lindsay was scared. She felt the urge to huddle underneath her blankets and hide until it went away. Instead, she gathered her courage and reached out to turn on the lamp beside her bed. Just as she touched it, the noise suddenly stopped. She flicked it on and jumped back into the center of her bed, clutching the sheets tightly around her as light spilled out into the room. There was nothing there. She peeked carefully over the sides of her bed, seeing only the rug and a few Girls' Life magazines. Taking her heaviest pillow to use as a weapon, she got out of bed and padded slowly towards the door. Right as she reached it she froze. looking down. Peeking out from the crack beneath her round half-circle of a cheerio. Puzzled, she opened the door. Before her loomed a seven-foot wall of cheerios.\n\nThey covered the doorway completely as the entire hallway had been filled with them. And they were moving. They were alive and crawling over each other like a mass of legless insects, filling the air with the heavy smell of whole grain oats. Lindsay ran and jumped back onto her bed. She huddled and clutched the pillow over her head, and screamed. She was still screaming when her parents came in. Her mother soothed her, wanting to know what was the matter. The cheerios were gone. Lindsay told her that it was just a nightmare. She didn't want them to think she was crazy. After a little while her parents left, her father muttering something about 'night terrors' as they walked back upstairs.\n\nWhen they were gone, Lindsay stuffed her blanket under the crack of her door and sat up with the light on. She tried her best to stay awake all night, but after a few hours she finally fell asleep. When she awoke there were a handful of crumbs in her bed. For a few weeks afterward Lindsay was able to sleep on the floor in her sister Susan's room, though she had to use all of her allowance as a bribe. Then her parents found out and made her go back to her own room. Lindsay's dad got her a lock for the door, telling her it would help her to feel safe. It didn't.\n\nThe very first night she was back in her room, she heard the rustling noise again. She'd kept the lamp on but this time the light didn't seem to help. She huddled there, watching the door and hoping it would go away. Then the blanket moved. She'd stuffed it under the door again as tightly as she could, but now the corner of it was being pushed back into her room by something on the other side. Lindsay was pretty sure she knew that something was. The cheerios were coming for her. Just then the lamp went out and the room plunged into darkness. She stifled a scream, telling herself it was just a nightmare.\n\nCheerios couldn't move or unplug lights. They didn't come after people. Then something light and dry brushed against her cheek, and all rational thought left her mind as she was seized in the cold grip of terror. She opened her mouth to scream, gagging as it was immediately filled with tiny rings of cereal. She felt it moving all over her body. She bit and chewed and spit, trying to clear her mouth so she could call for help. But no matter how much of it she crunched up, more always took its place. The cheerios seemed to collect into narrow tendrils as they snaked over her body. She shuddered in shock and disbelief as she felt the buttons of her pajama top being pulled open one by one. Suddenly she was grabbed around the arms and ankles and lifted up above the bed, her face toward the ceiling.\n\nDry, searching fingers of cereal probed into the waistband of her pj bottoms and yanked them down just as her shirt was pulled up over her head. She was still too young to wear a bra, and she immediately felt the cheerios coil around her small, developing breasts and squeeze them roughly. Lindsay whimpered and kicked as her panties were stripped off. No, she thought, it couldn't want that. *Please* let it not be that... Her legs were quickly restrained while another tendril slid up slowly along her inner thigh. thousands more gripped her buttocks, holding her up and kneading her firm athletic flesh as more began circling over her nipples. Lindsay gasped through her nose, her mouth still full of cheerios. It was weird and horrible, but the touching felt good at the same time.\n\nThen she felt the tendril rubbing lightly over her exposed labia, and she thrashed about uselessly as it began nudging and probing at her most private spot. It caressed the lips of her young vulva almost tenderly for a few long minutes before she felt it nudge harder at the entrance to her vagina. Her body stiffened as she felt it pushing inside her. It felt rough, even though the surface had been moistened by her fearful sweat and the natural wetness within her. The cheerio tendril entered her slowly, relentlessly. It didn't thrust in and out like she'd expected it to, instead it seemed to be pouring itself into her, filling her vagina with tiny cereal O's.\n\nShe could feel them snapping and crunching inside her as she clenched down to try and keep them out. The tendrils on her body seemed to get stronger. groping at her breasts and ass and tugging hard at her nipples. She felt her pussy stretching as it was packed full of rapacious cheerios, the growing pressure sending mixed tingles of pain and pleasure rippling through her body. Then she felt the presence of yet another narrow tendril rubbing insistently against the tight pucker of her butthole. Lindsay came as it pushed inside her, her body shivering uncontrollably as she was reluctantly overcome by pulsing waves of ecstasy. At that moment there was a quiet knock on the door. Her mother's voice called out, asking if she was okay. The cheerios quickly drew away, vanishing into the darkness just as abruptly as they'd arrived.\n\nLindsay could still feel some remnants in her vagina and ass as she got up weakly and pulled her pjs back on. Her mother looked concerned when Lindsay opened the door, but the explanation of another nightmare seemed to put her at ease. When she'd gone back up to bed, Lindsay went into the bathroom and sat on the toilet, feeling ashamed and violated as she let the last of the soggy cereal mush drip out of her body. She still hated cheerios. Now more than ever.","tags":"#general#cheerios#rape#erotica#nonconsent#nsfw","favourites":237,"__v":0,"created_on":"2015-03-18T05:10:43.202Z","score":0.0031900706397455345},{"_id":"55a849214587967e7ca6a89c","id":1881,"pasta":"sign me the FUCK up 👌👀👌👀👌👀👌👀👌👀 good shit go౦ԁ sHit👌 thats ✔ some good👌👌shit right👌👌th 👌 ere👌👌👌 right✔there ✔✔if i do ƽaү so my selｆ 💯 i say so 💯 thats what im talking about right there right there (chorus: ʳᶦᵍʰᵗ ᵗʰᵉʳᵉ) mMMMMᎷМ💯 👌👌 👌НO0ОଠＯOOＯOОଠଠOoooᵒᵒᵒᵒᵒᵒᵒᵒᵒ👌 👌👌 👌 💯 👌 👀 👀👀 👌👌Good shit﻿","tags":"#tumblr#goodshit#good#shit","favourites":33,"__v":0,"created_on":"2015-07-12T07:18:41.615Z","score":0.003169286483801512}]