[{"_id":"5504fdc887d1bc685b1e9684","id":1028,"pasta":"It's time to get angry at 4K MMR players, the best time of the day. Every fucking day. I play scrims, I get depressed. Even though I win them. And then I play these 4k MMR games and I lose hope in humanity. That's my life. Every day. I play on my smurf and I lose hope in myself, and then I play on my main account and I lose hope in everybody else. And at the end of the day I have no friends. That's life. The life of Jacky Mao.","tags":"#dota2#ee#jacky#mao#angry#4k","favourites":48,"__v":0,"created_on":"2015-03-15T02:43:04.189Z","score":0.0008050757367516243},{"_id":"54c826aaf63c027608a745f6","id":587,"pasta":"In Portal 2, Valve attached a very sophisticated AI to a potato and it worked just fine. In DotA 2, they've made servers from potatoes but haven't had much success and I can't understand why.","tags":"#dota2#portal#valve#potato#servers","favourites":69,"__v":0,"created_on":"2015-01-27T22:30:23.184Z","score":0.000800686737492929},{"_id":"55088335da039e130c5dc5ba","id":1053,"pasta":"Ever since I got the kinky idea to jam my Longshot up my girlfriend's pussy, she won't have my cock anymore. Sometimes I come home from work and I hear her moaning upstairs. She tries to hide it, she even pretended to be having an affair to throw me off the track, and justify her not wanting to have sex with me. But I know that she's been fucking that Longshot every day while I'm not there. It smells like her pussy whenever I use it, too. Sometimes while I'm out nerfing with my buddies, and I'm camped out in a sniper position, I get the urge to lick her dried pussy juices off my Longshot. One time I actually spent the entire game hidden in the bushes licking my Longshot all over. In some sick way my Longshot has become the sexual link between my girlfriend and I.","tags":"#general#longshot","favourites":45,"__v":0,"created_on":"2015-03-17T19:36:50.633Z","score":0.0007782091534467528},{"_id":"55087f8a9c40b758059984a4","id":1051,"pasta":"Look who it is again, ID Heaven. I'm fed up with your shit faggot. The other day when you called me a newfag, yeah, haven't forgotten about that yet.\nFuck you I've been on here for months and probably get on here more than you anyways. Don't you know that you make yourself look like a newfag when you call others newfag?\nJust because you learned how to hack your name and change it to \"Heaven\" does not give you the right to disrespect anyone at any time.","tags":"#4chan#heaven#newfag#shit","favourites":45,"__v":0,"created_on":"2015-03-17T19:20:14.776Z","score":0.0007781388288169578},{"_id":"55087de59c40b7580599849e","id":1047,"pasta":"My name is nick and I dream of becoming a dragon. People tell me I'm a dragonkin and I like the ring of that. I'm saving up money to have wings made out of my ribs and skin attached to my back. I've recently began drinking pure ethanol and swallowing matches. Nothing has happened yet, except I've had to have my stomach pumped 4 times; and the doctors are telling me to stop ingesting ethanol. Can you believe those cis white males in the STEM field? They're telling me to give up on my dream? This is why I need feminism, so I can't be discriminated against for drinking ethanol so I can be a dragon. I thought this was 2015? Social justice should be all over this. Anyways, I told those doctors they were scum, and to check their privilege. I then went on Tumblr and posted about it, inciting a response from other rational, like-minded people; who then emailed the hospital, informing them of the oppression and getting those monster “doctors” fired. Being thankful to the awesome tumblr community, I bravely volunteered to spy on an internet cesspit known as 4chan. I was promptly triggered and asked them to stop, to which they proceeded to call me offensive words and posted even more triggering material. I then self-diagnosed myself with PTSD and told Tumblr about it. I was amazed with the outcome! They started a hashtag called #stop4Chan. That's when I decided to use the pronouns xe/xim/xer to describe my self. As well, I've started to wear some classier clothes, so now I wear a fedora. With great class comes great privilege, so I tell 4chan I'll hack them. That's how I decided I'm a dragonkin.","tags":"#general#dragonkin#dream#dragon","favourites":44,"__v":0,"created_on":"2015-03-17T18:43:00.099Z","score":0.0007632184180165071},{"_id":"5508d9dbb47c3d010fd96568","id":1119,"pasta":"geraffes are so dumb.\nEDIT: sorry, the only reason i say this is that this geraffe in this picture is trying to eat a painting. i should say that this one particular geraffe is dumb.\nEDIT: hey asshats quit downvoting me i am not the one who tried to eat the wall.\nEDIT: hey before you hit that down arrow why don't you ask yourself why you can't take a joke you losers. jesus the pc crap has extended to long horses? because that is all those things are, and no one was bawling when that chimp got shot for eating that lady's face. so are you racist for long horses over gorillas? hippocrites.\nEDIT: is it a bunch of peta lamebrains doing this? did my one little joke hit some kind of tree-hugger blog or some shit? i have never so much as even spit on a geraffe! wtf? i ate lion one time, it was in a burger; i had alligator, and something they told me was eagle but i'm positive it was just chicken. whatever anyone is saying about me and geraffes is not even true. but go on farteaters, downvote away. it shows how stupid you are.\nEDIT: spelling.\nEDIT: this is such shit. i have never received as much as one single downvote in my life and you peckers are jumping on this stupid geraffe-loving bandwagon. that is a dumb goddamn wall-licking geraffe and that is all. i'm not going to apologize to you idiots any more.\nEDIT: you know, now my feelings are hurt. the amount of downvotes piled on me is just excessive. god for-fucking-bid i had commented on a post about an antteater, i would be at -1000 by now. you people are horrible","tags":"#reddit#giraffes#geraffes#long#horses","favourites":43,"__v":0,"created_on":"2015-03-18T01:48:59.267Z","score":0.0007501375757520668},{"_id":"54f51a3c87d1bc685b1e95e1","id":954,"pasta":"What the fuck are you doing in my fucking swamp you little Farquaad? I'll have you know I graduated top of my class in the brogres, and I've been involved in numerous secret raids on your anus, and have ogre 300 confirmed layers. I am trained in making early 2000's pop cultural references, and am the top ogre in the entire far far away armed forces. You are nothing to me but another Drek. I will wipe you out with precision the likes of which have never been seen in Dreamworks, mark my fucking words. You think you can get away with saying that dreck to me over the swamp? Think again, fucker. As we speak I am contacting my secret network of fairy tale creatures across Far Far Away and your IP is being traced right now so you better prepare for the storm, Farquaad. The storm that will end your fucking life. It's fucking ogre, Donkey. I can be anywhere, anytime, and I can kill you in over seven hundred ways, and that's just with my bare asscheeks. Not only am I shrextensively trained in onionade combat, but I have access to the entire arsenal of the Fairy Godmothers Factory and I will use it to its full shrextent to wipe your miserable little ass of of the face of mah swamp, you little shit. If only you could have known what unholy retribution your little clever comment was about to bring down upon you, maybe you would have held your fucking tongue. But you couldn't, you didn't, and now you're paying the price, you goddamn Rumpelstiltskin. I will shrek fury all ogre you and you will drown in it. You're fucking dead, Pinocchio.","tags":"#general#shrek#navy#seal#farquaad","favourites":49,"__v":0,"created_on":"2015-03-03T02:19:36.439Z","score":0.0007492756358411559},{"_id":"54bf21222d74781f04a603ac","id":332,"pasta":"Hello Bulba, this is your mother. I write here to inform you that your father and I do not approve of your timewaste playing childrens game for the internet. Therefore we are sending you to India to marry your beautiful cousin Venkatanarasimharajuvaripeta and work as a train conductor.","tags":"#dota2#bulba#mother#childrens#games#india#train","favourites":66,"__v":0,"created_on":"2015-01-21T03:42:05.992Z","score":0.0007408592717612177},{"_id":"54b4c805de79968e287f0c69","id":100,"pasta":" ☑ “This gentleman's deck is ABSURD!” ☑ “My deck cannot hope to prevail against a deck of that caliber” ☑ \"He REQUIRED those two cards in subsequent order to succeed\" ☑ “He extracted from his deck the only cards capable of defeating me” ☑ \"His cards defied logic\" ☑ “There was no manoeuvre at my disposal to secure victory” ☑ “I played impeccably”","tags":"#hearthstone#gentleman#kripp#checkboxes","favourites":69,"__v":0,"created_on":"2015-01-13T07:23:21.204Z","score":0.0007355530877190693},{"_id":"5508c796b47c3d010fd96531","id":1097,"pasta":" └( ° ͜ʖ͡°)┐Born too late to explore the Earth, born too soon to explore the Galaxy. Born just in time to T U C K F R U M P└( ° ͜ʖ͡°)┐","tags":"#hearthstone#born#explore#earth#galaxy#tuck#frump","favourites":42,"__v":0,"created_on":"2015-03-18T00:28:26.832Z","score":0.0007349012598307361},{"_id":"5508e2adb47c3d010fd96580","id":1130,"pasta":"nicememe\nOHHohhihoHhee! You tickled my MEME bone! One uUPSWAGpswag for le fine gentleruser ͡ʘ ͜ʖ ͡ʘ)ง (ง ͡ʘ ͜ʖ ͡ʘ)ง (ง ͡ʘ ͜ʖ ͡ʘ)ง (ง ͡ʘ\n͜ʖ ͡ʘ)ง\nit seems >>>(you)have contracted DUBS-ITIS!!(ง ͡ʘ* ͜ʖ ͡ʘ)ง(ง ͡ʘ ͜ʖ ͡ʘ)ง(ง ͡ʘ ͜ʖ ͡ʘ)งvv(ง ͡ʘ ͜ʖ ͡ʘ)ง! LR*L CZECH 'EM OHOOGOOGOREE XDDdd >if (you) BROWS this MEME past the front page (you) must comment FOR YOU ,and\nWHATA ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) v( ͡° ͜ʖ ͡°) vv ( ͡° ͜ʖ ͡°) v( ͡° ͜ʖ ͡°) vv( ͡° ͜ʖ ͡°) (ง ͡ʘ ͜ʖ ͡ʘ)ง(ง ͡ʘ ͜ʖ ͡ʘ)งv(ง ͡ʘ ͜ʖ ͡ʘ)ง( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) v ( ͡° ͜ʖ ͡°) v( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°)(ง ͡ʘ ͜ʖ ͡ʘ)งv(ง ͡ʘ ͜ʖ ͡ʘ)ง(*ง ͡ʘ ͜ʖ ͡ʘ)ง v( ͡° ͜ʖ ͡°) v (ง ͡ʘ ͜ʖ ͡ʘ)ง (ง ͡ʘ ͜ʖ ͡ʘ)ง *\nFUCK MAN xD i just fall of my chair cuz i couldnt and i CANT stop laugh xDXDXDXDXDDDDDXXXXXXDDDDDD OMGOSH DDDDDXXXX(ง ͡ʘ ͜ʖ ͡ʘ)งXDDDDD DDDDDD LOOOOOOOLLLLL ( ͡° ͜ʖ ͡°) ( ͡°(ง ͡ʘ ͜ʖ ͡ʘ)ง ͜ʖ ͡°) ( ͡° ͜ʖ ͡°(ง ͡ʘ ͜ʖ ͡ʘ)ง(ง ͡ʘ ͜ʖ ͡ʘ)งv) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) le nyan cat? hahahaha le mayonaise. fucking epic ass meme i love that fucking meme so much man wait let me just gets crack pipe out smoke some of ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) that good 420 shit :) rips a bong AHHHHHHHHH YES!!!!!!!!!!!!!!! FUCKI(ง ͡ʘ ͜ʖ ͡ʘ)ง(ง ͡ʘ ͜ʖ ͡ʘ)งN HOLY SHITTTT I CANT JUST STOP LAUGHIN(ง ͡ʘ ͜ʖ ͡ʘ)ง(ง ͡ʘ ͜ʖ ͡ʘ)งG CAUSE HE HE HE HE HE JUST TO FUNNY MAN!!!1\nEPIC MEMEING /b/ro (ง ͡ʘ ͜ʖ ͡ʘ)งBAZINGA BAZINGA BAZINGAAAAAAAAAAAAAAAAA ZIMBABWE is this a le new epic meme? screen kappeD!!1011!!(ง ͡ʘ ͜ʖ ͡ʘ)ง ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) vvvvvv( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) vvv( ͡° ͜ʖ ͡°) vv\nCLICK THE \"\"\"\"SHARE\"\"\"\" BUTTON TO ENSURE PROPER BREADING OF YOUR TENDIES ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡+ ͜ʖ ͡+) ( ͡+ ͜ʖ ͡+)( ͡+ ͜ʖ ͡+) ( ͡° ͜ʖ ͡°)","tags":"#general#nice#meme#memed#shit#post","favourites":41,"__v":0,"created_on":"2015-03-18T02:27:53.446Z","score":0.0007204026875867764},{"_id":"550866ac9c40b75805998494","id":1045,"pasta":"Hello I'm Synderen. I sexually identify as a pig molester. Ever since I was a boy I dreamed of walking through pigsties, diddling sexy piglets. People say to me that having sex with pigs is illegal and I'm retarded but I don't care, I'm Danish. I’m having a plastic surgeon implant pig tails, ears and a snout on my body. From now on I want you to call me “Porky” and respect my right to be sexually aroused by mammals that serve as food for millions all over the world. If you can’t accept me you’re a swinophobe and need to check your sus privilege. I'm moving back to Denmark so I can marry my favorite pig, which I've always fantasized about. Thank you for being so understanding.","tags":"#dota2#synderen#pig#molester#porky","favourites":41,"__v":0,"created_on":"2015-03-17T17:29:19.442Z","score":0.0007182918879730887},{"_id":"54b558cc34b44c1d2984b371","id":106,"pasta":"(▀̿Ĺ̯▀̿ ̿) This is the 0-3 Police, You're coming with us Kripp. (▀̿Ĺ̯▀̿ ̿)","tags":"#police #donger","favourites":66,"__v":0,"created_on":"2015-01-13T11:50:23.224Z","score":0.0007091468098083862},{"_id":"54b591a2e90c10d22e88b974","id":120,"pasta":"▌▌✈ ▌▌✈ ▌▌✈ ▌▌✈ ▌▌✈ ▌▌Sorry i dropped my bag of 9/11 ▌▌✈ ▌▌✈ ▌▌✈ ▌▌✈ ▌▌✈ ▌▌","tags":"#twitch#9/11#bag#airplane","favourites":65,"__v":0,"created_on":"2015-01-13T21:42:54.355Z","score":0.0007016632875182236},{"_id":"55097effb47c3d010fd9660d","id":1190,"pasta":"Just held the door for an Asian guy and he said \"sank you\"... So I punched him in the face. I can't believe somebody brought up Pearl Harbor like that.","tags":"#general#asian#pearl#harbor#sank","favourites":39,"__v":0,"created_on":"2015-03-18T13:30:17.613Z","score":0.0006927605693498729}]