[{"_id":"55b960dea92005fc4d048602","id":1927,"pasta":"░░░░░░░░░░░░░░░▄▀▄░░░░░░░░░░░░░░░ ░░░░░░░░░░░░░▄▀░░░▀▄░░░░░░░░░░░░░ ░░░░░░░░░░░▄▀ Kappa ▄▀█░░░░░░░░░░░░░ ░░░░░░░░░▄▀ Kappa ▄▀░▄▀░▄▀▄░░░░░░░░░ ░░░░░░░▄▀ Kappa ▄▀░▄▀░▄▀ Kappa ▀▄░░░░░░ ░░░░░░░█▀▄ Kappa ▀█░▄▀ Kappa Kappa ▀▄░░░░ ░░░▄▀▄░▀▄░▀▄ Kappa ▀ Kappa ▄█▄ Kappa ▀▄░░░ ░▄▀░░░▀▄░▀▄░▀▄░ Kappa ▄▀░█░▀▄ Kappa ▀▄░ ░█▀▄ Kappa ▀▄░█▀ Kappa Kappa ▀█░▀▄░▀▄░▄▀█ ░▀▄░▀▄ Kappa ▀ Kappa ▄█▄ Kappa ▀▄░▀▄░█░▄▀░ ░░░▀▄░▀▄░ Kappa ▄▀░█░▀▄ Kappa ▀▄░░▀█▀░░ ░░░░░▀▄░▀▄░▄▀░▄▀░█▀ Kappa ▄▀█░░░░░░░ ░░░░░░░▀▄░█░▄▀░▄▀ Kappa ▄▀░▄▀░░░░░░░ ░░░░░░░░░▀█▀░▄▀ Kappa ▄▀░▄▀░░░░░░░░░ ░░░░░░░░░░░░░█▀▄░▄▀░▄▀░░░░░░░░░░░ ░░░░░░░░░░░░░▀▄░█░▄▀░░░░░░░░░░░░░ ░░░░░░░░░░░░░░░▀█▀░░░░░░░░░░░░░░░:","tags":"#Kappa#dota2#singsing#mods#core54#nazi#ascii","favourites":15,"__v":0,"created_on":"2015-07-29T23:25:18.540Z","score":0.003154371902138571},{"_id":"55628e8fd2c875b036466652","id":1673,"pasta":"Listen kid you don't want to see my other side. I have a wolf inside me with a muzzle on, but the muzzle is about to come off. You broke her heart, and I will break yours. She is a nice girl, how dare you use her like this. How come people like you get to date her? Then people like me have to sit in the shadows and be the shoulders to cry on. Listen Kid, I don't have time for FUCKING games. I am a nice guy, but when you make a nice guy angry; the world shakes. Don't do it again. ... You will regret this the next FULL MOON. You mess with me you mess with the pack bud. FUCK you. Get ready.","tags":"#tumblr#general#wolfkin","favourites":100,"__v":0,"created_on":"2015-05-24T15:47:34.295Z","score":0.0031012504173738974},{"_id":"54b5dbd270c589513562570d","id":172,"pasta":"Learn the ways of the Russians, speak their language for a while, they might think you are one of them. Then maybe join their team, success might come and fighting for last drink of vodka will be your next objective. Do not give up, you have Dota tournament ahead of you. Then win TI1, but don't stop now, you have to go deeper. Spend 3 more years trying to solve the puzzle of russki power of motherland and then leave the team with full knowledge of understanding of strenght of ROSSIA and PROMISE URSELF THET YU WILL NEVER LOS TO RUS AND KNOW OF COLLAPSING STRONG EMPIRE OF RUSKILAND.\nthats basically what I did","tags":"#dota2#puppey#navi#russia","favourites":368,"__v":0,"created_on":"2015-01-14T02:51:06.084Z","score":0.0030283072799332992},{"_id":"54b591a2e90c10d22e88b974","id":120,"pasta":"▌▌✈ ▌▌✈ ▌▌✈ ▌▌✈ ▌▌✈ ▌▌Sorry i dropped my bag of 9/11 ▌▌✈ ▌▌✈ ▌▌✈ ▌▌✈ ▌▌✈ ▌▌","tags":"#twitch#9/11#bag#airplane","favourites":366,"__v":0,"created_on":"2015-01-13T21:42:54.355Z","score":0.00301090500365247},{"_id":"54bf2af73b0a330105ff5bab","id":344,"pasta":"n0tail u r fuckin perfect m8.\nyou're a flower. you're also a rainbow and a river. you are the manifestation of all perfection and i want to i don't fucking know. i want this to not sound gay, but you are fucking perfect, n0tail.\nty for listening","tags":"#dota2#n0tail#fucking#perfect#perfection","favourites":338,"__v":0,"created_on":"2015-01-21T04:27:41.355Z","score":0.002937453131660307},{"_id":"54fb95f187d1bc685b1e9646","id":1001,"pasta":"Darude- status\n☐ Not Sandstorm\n☑ Sandstorm","tags":"#general#twitch#darude#sandstorm","favourites":229,"__v":0,"created_on":"2015-03-08T00:21:02.434Z","score":0.002866532868107229},{"_id":"54b59230e90c10d22e88b97e","id":126,"pasta":"ヽヽ༼༼ຈຈل͜ل͜ຈຈ༽༽ﾉﾉ HAFU TURN OFF THE VIBRATOR ヽヽ༼༼ຈຈل͜ل͜ຈຈ༽༽ﾉﾉ","tags":"#hearthstone#hafu#vibrator#donger","favourites":340,"__v":0,"created_on":"2015-01-13T21:46:19.211Z","score":0.002831121865418105},{"_id":"5508b608b47c3d010fd964ef","id":1070,"pasta":"Due to extensive research done by the University of Pittsburgh, diamond has been confirmed as the hardest metal known to man. The research is as follows. Pocket-protected scientists built a wall of iron and crashed a diamond car into it at 400 miles per hour, and the car was unharmed. They then built a wall out of diamond and crashed a car made of iron moving at 400 miles an hour into the wall, and the wall came out fine. They then crashed a diamond car made of 400 miles per hour into a wall, and there were no survivors. They crashed 400 miles per hour into a diamond traveling at iron car. Western New York was powerless for hours. They rammed a wall of metal into a 400 mile per hour made of diamond, and the resulting explosion shifted the earth's orbit 400 million miles away from the sun, saving the earth from a meteor the size of a small Washington suburb that was hurtling towards mid-western Prussia at 400 billion miles per hour. They shot a diamond made of iron at a car moving at 400 walls per hour, and as a result caused over 9000 wayward airplanes to lose track of their bearings, and make a fatal crash with over 9000 buildings in downtown New York. They spun 400 miles at diamond into iron per wall. The results were inconclusive. Finally, they placed 400 diamonds per hour in front of a car made of wall traveling at miles per iron, and the result proved without a doubt that diamonds were the hardest metal of all time, if not the hardest metal known to man.","tags":"#general#miles#per#iron#diamonds#metal","favourites":202,"__v":0,"created_on":"2015-03-17T23:10:49.326Z","score":0.002785131446662386},{"_id":"55cfb102f8c3a69c48797cf2","id":2018,"pasta":" ───────────────▄████████▄──────── ──────────────██▒▒▒▒▒▒▒▒██─────── ─────────────██▒▒▒▒▒▒▒▒▒██─────── ────────────██▒▒▒▒▒▒▒▒▒▒██─────── ───────────██▒▒▒▒▒▒▒▒▒██▀──────── ──────────██▒▒▒▒▒▒▒▒▒▒██───────── ─────────██▒▒▒▒▒▒▒▒▒▒▒██───────── ────────██▒████▒████▒▒██───────── ────────██▒▒▒▒▒▒▒▒▒▒▒▒██───────── ────────██▒────▒▒────▒██───────── ────────██▒─██─▒▒─██─▒██───────── ────────██▒────▒▒────▒██───────── ────────██▒▒▒▒▒██▒▒▒▒▒██───────── ───────██▒▒█▀▀▀▀▀▀▀█▒▒▒▒██─────── ─────██▒▒▒▒▒█▄▄▄▄▄█▒▒▒▒▒▒▒██───── ───██▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒██─── ─██▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒██─ █▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒█ █▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒█ █▒▒████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒████▒▒█ ▀████▒▒▒▒▒▒▒▒▒▓▓▓▓▒▒▒▒▒▒▒▒▒▒████▀ ──█▌▌▌▌▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▌▌▌███── ───█▌▌▌▌█ BabyRage ▀▄▌▌▌▌▌▌▌▌▌▌▌▌▌█──── ───█▌▌▌▌▌▌▌▀▄░░▀▄▌▌▌▌▌▌▌▌▌▌▌█──── ────▀█▌▌▌▌▌▌▌▀▄░░▀▄▌▌▌▌▌▌██▀───── ─────█▌▌▌▌▌▌██▀░░░░█▌▌▌▌▌██────── ──────██▒▒██─▀▄▄▀▄▄▀██▒▒██─────── ──────▀████▀────────▀████▀─","tags":"#Patrick#BabyRage","favourites":3,"__v":0,"created_on":"2015-08-15T21:37:06.968Z","score":0.002782544854934929},{"_id":"55cfb0d4f8c3a69c48797ceb","id":2011,"pasta":" ▓▓▓▓▓▓▓▓▓▓▄ ░░▄▀▓▓▓▓▓▓SINGX2▓▓▓▓▓▓▀ ▄▀▓▓▓▓▓▓▄▓▓▓▓▓▓▓▄▓▓▓▓▓ ▓▓▓▓▓▓▄▄▀▄▄▌▓▐▄▄▀▄▄▓▓▓ ▓▓▓▓▄▀░░░░░▌▓▐░░░░░▀▄▓ ▓▓▄▀░░░▄▄▄▄▌▓▐▄▄▄▄░░░▀ ▄▀░░▐▄▀▀▒▒▒▀▄▀▒▒▒▀▀▄▌░ █░░░█▌▒▒▒▒▒▒▒▒▒▒▒▒▒▐█░ █░░█▀▌▒▒▒SHEEVER▒▒▒▐▀█ ▌▄▀▒▄▀▄▒▒▒▒▒▒▒▒▒▒▒▄▀▄▒ ▐▒▒▐░░░▀▌▒▒▒▌▒▒▒▐▀░░░▌ █▒▒▀▄░░░▌▒▒▒▒▒▄██▄░░▄▀ ░▀▄▒▒▀▄░▌▒▒▒▄▀▄▒▀██▀▒▒ ░░░▀▄▒▒▀▒▒▒▐▒▒▒▒▄▒██▄▀ ░░░░░▀▄▄▄▄▄▐▒▄█▒▒▄▀▀░░","tags":"#dota2#ASCII#fuck#dick","favourites":3,"__v":0,"created_on":"2015-08-15T21:36:20.336Z","score":0.0027822886633768495},{"_id":"55b1939289b52e986e2b40d5","id":1904,"pasta":"PogChamp BOB PogChamp SAGET PogChamp RAPED PogChamp AND PogChamp KILLED PogChamp A PogChamp GIRL PogChamp IN PogChamp 1990 PogChamp","tags":"#hearthstone#bobsaget#1990#raped#girl#forsen#cancer","favourites":18,"__v":0,"created_on":"2015-07-23T10:09:31.975Z","score":0.0027500708957966425},{"_id":"54b5dbdf70c589513562570e","id":173,"pasta":"He's a good player, a bit overated in my opinion. But defenitely okay to be in a top team! To say that he is one of the best solo mids etc is really exageration, he played like 10 games in a high level LAN, you need way more to compare him to Dendi, s4 or FATA","tags":"#dota2#rtz#7ckingmad#overrated#arteezy","favourites":325,"__v":0,"created_on":"2015-01-14T02:52:29.786Z","score":0.0027296152808760537},{"_id":"55b55fb1f12af4492558aaff","id":1923,"pasta":"ຈل͜ຈ ɪ ᴄᴛʀʟ ᴠ ᴛʜɪɴɢs ɪɴᴛᴏ ᴄʜᴀᴛ ʙᴇᴄᴀᴜsᴇ ɪ ᴀᴍ ᴀ ᴍɪɴᴅʟᴇss ʀᴇᴛᴀʀᴅ ຈل͜ຈ","tags":"#twitch#antipasta#paste#mindless","favourites":15,"__v":0,"created_on":"2015-07-26T22:31:13.884Z","score":0.0027217690830752084},{"_id":"55c05fb6ccc3f041309573ee","id":1963,"pasta":"It's true. I wasn't able to find this show the big bang theory funny until I went to school and studied theoretical physics for 8 years. I used to watch it in highschool but I never really understood the humour in it that my classmates did (I was never the smartest in the class, at that time I must add). So I began to work my ass off, studying under Mr. Einstein himself to figure out some of the biggest unanswered questions of the world; \"What exactly makes a dank meme?\", \"What makes Sheldon such a smart and funny character?\", \"Why are all engineers Jews?\". It wasn't until my thesis when I was doing some light reading on string theory (I already memorized all written literature on the topic at the time, I guess you could just say I was bored) when I began to piece it all together. I don't really know how to explain it to anyone else, because my heightened sense of intelligence was able to grasp it so easily, I understood the humour in the show in more than just the shallow laughs that my old classmates had when watching it. I'm still catching up on all the episodes to this date but I have to limit myself each day to a certain amount of episodes or I exhaust myself from laughter. So you can trust me when I say this, it takes a heightened (if not elite) sense of intelligence to even begin to comprehend just how funny this show is.","tags":"#bazinga#zimbabwe#bigbangtheory#all#reddit","favourites":9,"__v":0,"created_on":"2015-08-04T06:46:14.778Z","score":0.0026941759431003826},{"_id":"552f79f808a10d48190510c9","id":1469,"pasta":"You pick Lycan. You tell your team that you will jungle. You tell your team that you will never fight with them. You tell your team that you will split push. You do this in a nice way because you are Lycan picker and you want to win. You buy stout, quelling, tangoes in that exact order. You go jungle. You get: level 7, 4-0-2-1 skill build. You have: vlads, quelling, stout, smoke. You smoke and take rosh before 10 minutes. You time that motherfucker. You buy brown boots. You go push a lane or take ancients if there is no safe lane to push. You repeat until game is won. You never fight with your team ever. You never fight without your team ever. Wolves need no armour. Why do wolves need no armour you may ask? Wolves need no armour because wolves never fight; wolves split push. This is why wolves need no armour. Your team dying 4 mid? You do not fight with them. You do not teleport to them. You do not flame them. You are Lycan and you want to win. You have teleportation scrolls but you use them to get to lanes as far away from danger as possible and push. You tell your team to fight under tower. You tell your team not to come to your lane. You do this in a nice way because even though wolves need no armour wolves want to win games. If you are getting ganked (you should be looking at the mini map and not be in a situation where you’re getting ganked) but if you are getting ganked you know what to do: you listen to Lycan and Lycan tells you what? That’s right you sonofabitch: Lycan tells you that \"the wolf runs\". You pop that ultimate, you back off and you TP out. You push another lane or you farm jungle/farm ancients/smoke roshan. If you don't know what to do then what do you do? That's right; you listen to Lycan again and Lycan tells you that \"the wolf runs\" and that \"wolves need no armour\". This does not mean \"the wolf fights\"; it means that the wolf go split push. You are on a lane preferably furthest away from danger. You are in the jungle or at the ancients farming. You are at roshan getting that aegis timing that shit. You get necro 1, 2, 3. You upgrade your brown boots into boots of travel. You do it in this exact order. You keep that split push going. You smoke rosh whenever he's up. You keep telling your team not to be with you or come to your lanes. You are Lycan. You are nice about it. You are split push. You are objectives. You are win. You remember that \"wolves love to battle\" against structures because then wolves will need no armour and wolves can run in circles around the structures. You never fight. You end the game with 0-0-0 and the highest building damage ever conceived by man.","tags":"#DotA2#lycan#jungle","favourites":142,"__v":0,"created_on":"2015-04-16T04:21:23.687Z","score":0.0026749794819836224}]