[{"_id":"5508e2adb47c3d010fd96580","id":1130,"pasta":"nicememe\nOHHohhihoHhee! You tickled my MEME bone! One uUPSWAGpswag for le fine gentleruser ͡ʘ ͜ʖ ͡ʘ)ง (ง ͡ʘ ͜ʖ ͡ʘ)ง (ง ͡ʘ ͜ʖ ͡ʘ)ง (ง ͡ʘ\n͜ʖ ͡ʘ)ง\nit seems >>>(you)have contracted DUBS-ITIS!!(ง ͡ʘ* ͜ʖ ͡ʘ)ง(ง ͡ʘ ͜ʖ ͡ʘ)ง(ง ͡ʘ ͜ʖ ͡ʘ)งvv(ง ͡ʘ ͜ʖ ͡ʘ)ง! LR*L CZECH 'EM OHOOGOOGOREE XDDdd >if (you) BROWS this MEME past the front page (you) must comment FOR YOU ,and\nWHATA ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) v( ͡° ͜ʖ ͡°) vv ( ͡° ͜ʖ ͡°) v( ͡° ͜ʖ ͡°) vv( ͡° ͜ʖ ͡°) (ง ͡ʘ ͜ʖ ͡ʘ)ง(ง ͡ʘ ͜ʖ ͡ʘ)งv(ง ͡ʘ ͜ʖ ͡ʘ)ง( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) v ( ͡° ͜ʖ ͡°) v( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°)(ง ͡ʘ ͜ʖ ͡ʘ)งv(ง ͡ʘ ͜ʖ ͡ʘ)ง(*ง ͡ʘ ͜ʖ ͡ʘ)ง v( ͡° ͜ʖ ͡°) v (ง ͡ʘ ͜ʖ ͡ʘ)ง (ง ͡ʘ ͜ʖ ͡ʘ)ง *\nFUCK MAN xD i just fall of my chair cuz i couldnt and i CANT stop laugh xDXDXDXDXDDDDDXXXXXXDDDDDD OMGOSH DDDDDXXXX(ง ͡ʘ ͜ʖ ͡ʘ)งXDDDDD DDDDDD LOOOOOOOLLLLL ( ͡° ͜ʖ ͡°) ( ͡°(ง ͡ʘ ͜ʖ ͡ʘ)ง ͜ʖ ͡°) ( ͡° ͜ʖ ͡°(ง ͡ʘ ͜ʖ ͡ʘ)ง(ง ͡ʘ ͜ʖ ͡ʘ)งv) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) le nyan cat? hahahaha le mayonaise. fucking epic ass meme i love that fucking meme so much man wait let me just gets crack pipe out smoke some of ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) that good 420 shit :) rips a bong AHHHHHHHHH YES!!!!!!!!!!!!!!! FUCKI(ง ͡ʘ ͜ʖ ͡ʘ)ง(ง ͡ʘ ͜ʖ ͡ʘ)งN HOLY SHITTTT I CANT JUST STOP LAUGHIN(ง ͡ʘ ͜ʖ ͡ʘ)ง(ง ͡ʘ ͜ʖ ͡ʘ)งG CAUSE HE HE HE HE HE JUST TO FUNNY MAN!!!1\nEPIC MEMEING /b/ro (ง ͡ʘ ͜ʖ ͡ʘ)งBAZINGA BAZINGA BAZINGAAAAAAAAAAAAAAAAA ZIMBABWE is this a le new epic meme? screen kappeD!!1011!!(ง ͡ʘ ͜ʖ ͡ʘ)ง ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) vvvvvv( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) vvv( ͡° ͜ʖ ͡°) vv\nCLICK THE \"\"\"\"SHARE\"\"\"\" BUTTON TO ENSURE PROPER BREADING OF YOUR TENDIES ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡+ ͜ʖ ͡+) ( ͡+ ͜ʖ ͡+)( ͡+ ͜ʖ ͡+) ( ͡° ͜ʖ ͡°)","tags":"#general#nice#meme#memed#shit#post","favourites":41,"__v":0,"created_on":"2015-03-18T02:27:53.446Z","score":0.00048578968858662964},{"_id":"550866ac9c40b75805998494","id":1045,"pasta":"Hello I'm Synderen. I sexually identify as a pig molester. Ever since I was a boy I dreamed of walking through pigsties, diddling sexy piglets. People say to me that having sex with pigs is illegal and I'm retarded but I don't care, I'm Danish. I’m having a plastic surgeon implant pig tails, ears and a snout on my body. From now on I want you to call me “Porky” and respect my right to be sexually aroused by mammals that serve as food for millions all over the world. If you can’t accept me you’re a swinophobe and need to check your sus privilege. I'm moving back to Denmark so I can marry my favorite pig, which I've always fantasized about. Thank you for being so understanding.","tags":"#dota2#synderen#pig#molester#porky","favourites":41,"__v":0,"created_on":"2015-03-17T17:29:19.442Z","score":0.0004847504191411492},{"_id":"55097effb47c3d010fd9660d","id":1190,"pasta":"Just held the door for an Asian guy and he said \"sank you\"... So I punched him in the face. I can't believe somebody brought up Pearl Harbor like that.","tags":"#general#asian#pearl#harbor#sank","favourites":39,"__v":0,"created_on":"2015-03-18T13:30:17.613Z","score":0.00046669245745541583},{"_id":"54b4c0576ef754dd27d5fd9f","id":98,"pasta":"ヽ༼ຈل͜ຈ༽ﾉ NOW WE RIOT ヽ༼ຈل͜ຈ༽ﾉ","tags":"#riot#donger","favourites":57,"__v":0,"created_on":"2015-01-13T06:51:00.673Z","score":0.0004665446472096175},{"_id":"54b5d5858ba53a7c3326b4f3","id":165,"pasta":"work it ᕙ༼ຈل͜ຈ༽ᕗ harder  \nmake it (ง •̀_•́)ง better  \ndo it ᕦ༼ຈل͜ຈ༽ᕤ faster  \nraise ur ヽ༼ຈل͜ຈ༽ﾉ donger  ","tags":"#dongers#harder#better#faster#stronger","favourites":56,"__v":0,"created_on":"2015-01-14T02:31:49.010Z","score":0.0004612680562594162},{"_id":"54f8d51e87d1bc685b1e9616","id":978,"pasta":"I like to raise my Donger <༼ຈل͜ຈ༽> \nI do it all the time ヽ༼ຈل͜ຈ༽ﾉ \nand every time its lowered┌༼ຈل͜ຈ༽┐ \nI cry and start to whine ┌༼@ل͜@༽┐\nBut never need to worry ༼ ºل͟º༽ \nmy Donger’s staying strong ヽ༼ຈل͜ຈ༽ﾉ\nA Donger saved is a Donger earned so sing the Donger song! ᕦ༼ຈل͜ຈ༽ᕤ‏﻿","tags":"#donger#dong#song","favourites":41,"__v":0,"created_on":"2015-03-05T12:59:42.509Z","score":0.0004529503352425085},{"_id":"54bf61013b0a330105ff5c19","id":388,"pasta":"EG, VG, Secret, C9. Long ago, the four teams played together in harmony. Then, everything changed when the Great Immigration happened. Only Arteezy, master of all four roles, could stop them, but when EG needed him most, he vanished. A hundred years passed and my brother and I discovered the new Arteezy, a potato farmer named Artour. And although his midas skills are great, he has a lot to learn before he's ready to win anything.","tags":"#dota2#rtz#arteezy#eg#vg#secret#c9#harmony","favourites":52,"__v":0,"created_on":"2015-01-21T08:15:48.331Z","score":0.00044749597990088543},{"_id":"550863e69c40b75805998490","id":1042,"pasta":"ヽ(◉◡◔)ﾉ•︻̷┻̿═━一 HO HO! HA HA! I HAVE DOWN SYNDROME ヽ(◉◡◔)ﾉ•︻̷┻̿═━一","tags":"#dota2#sniper#down#syndrome#shrapnel","favourites":37,"__v":0,"created_on":"2015-03-17T11:05:27.224Z","score":0.0004433278172746972},{"_id":"54b4882137a4eb53220afd35","id":87,"pasta":"༼ つ ◕_◕ ༽つAMENO༼ つ ◕_◕ ༽つ","tags":"#ameno#donger","favourites":53,"__v":0,"created_on":"2015-01-13T02:51:06.867Z","score":0.00043828029411282224},{"_id":"54b5f449f6a1885137f43cdc","id":186,"pasta":"What the sproink did you just enchant me with, you little jungle creep? I’ll have you know I graduated top of my class in the fluffy tails institute, and I’ve been involved in numerous secret raids on Dire-side, and I have over 300 confirmed kills on my socketed gems. I am trained in jungle warfare and I’m the top ganker in the entire Radiant hero pool. You are nothing to me but just another fawn to enchant. I will heal you the sproink up with precision the likes of which has never been seen before on the shady lanes and sunny glades, mark my fluffy tail. You think you can get away with running that slow from me with my movespeed? Think again, my lovely. As we speak I am contacting my secret network of enchanted creeps across the river and your icon is being pinged right now so you better prepare for the darkened dapples, doe. The hoofprints that wipe out the lovely little thing you call your hp bar. Don't think I wasn't fawned of you, flower. I can be anywhere, anytime, and I can heal you in over seven hundred nature attendants, and that’s just with my bare sproink. Not only am I extensively trained in unarmed healing, but I have access to the entire arsenal of new tracks to follow and I will use them to their full extent to wipe your miserable frown upside down, you little thing you. If only you could have known what racked retribution your little “fast\" auto attacks was about to bring down upon you, maybe you would have healed your golden tongue. But you couldn’t, you didn’t, and now the buck stops here, points for trying though! I will impetus spears all over you and you will buckle down. Ready or not, here I come!","tags":"#dota2#enchantress#sproink#creep#navy#seal","favourites":51,"__v":0,"created_on":"2015-01-14T04:42:49.209Z","score":0.0004262213435158237},{"_id":"54b59295e90c10d22e88b980","id":127,"pasta":"This is the best possible chat. The combination of intelligence and tolerance, it's just crazy. I never thought I'd ever say this, but you guys make me proud I'm a member of twitch chat.","tags":"#antipasta#twitch#chat","favourites":51,"__v":0,"created_on":"2015-01-13T21:48:01.824Z","score":0.0004256758583905721},{"_id":"54bf0661bd6b1a11037e7c97","id":299,"pasta":"¸. * ● ¸ .　...somewhere　　　° ☾ ° 　¸. ● ¸ .　　★　° :.　 . • ° 　 .　 *　:.　.in a parallel universe* ● ¸ 　　　　° ☾ °☆ 　. * ¸.　　　★　★ ° . .　　　　.　☾ °☆ 　. * ● ¸ ...singsing..° ☾　★ °● ¸ .　　　★　° :.　 . • ○ ° ★　 .　 * ..strim♥ ☾　★ °● ¸ .　　　★","tags":"#dota2#singsing#sing#parallel#strim","favourites":49,"__v":0,"created_on":"2015-01-21T01:50:14.920Z","score":0.0004249304704376074},{"_id":"54b5d2198ba53a7c3326b4ec","id":162,"pasta":"This is probably going to come off pretty White Knight-y but that can't be helped. Some of the over the top sexual/sexist talk with Sheever/Jess/other women are on screen in EU hub is really fucking disgusting. I can't be the only one ashamed of this behavior out of the community. I know the morning Sheever came out in a dress she seemed fairly perturbed, though maybe I misjudged her reaction. I hopped on the stream briefly this morning and there was a 3rd woman present (short red hair? don't know her name) and chat was going ape shit begging for orgies and shit. There is a reason this hobby is so male dominated, and it's repugnant behavior like this. Grow the fuck up. I'm not saying everyone has have great manners and be super respectful all the time, but the shit that's come out of chat is fucking awful and it's embarrassing.","tags":"#sjw#fedorapasta#sheever#dota2#euhub","favourites":50,"__v":0,"created_on":"2015-01-14T02:17:34.149Z","score":0.0004189177522757367},{"_id":"54d81ddcb898625b08cd362a","id":741,"pasta":"i expect us to win every lan\" - s4 2015","tags":"#dota2#s4#lan#tournament","favourites":43,"__v":0,"created_on":"2015-02-09T02:36:25.354Z","score":0.00041596115814212506},{"_id":"54f811f887d1bc685b1e960b","id":974,"pasta":"This is bullshit - you're oversimplifying a complex situation to the point of no longer adding anything useful to the discussion","tags":"#reddit#bullshit#oversimplifying#complex","favourites":37,"__v":0,"created_on":"2015-03-05T05:55:44.998Z","score":0.00041421601952847803}]