[{"_id":"54b472cd7622b32a1cea7b71","id":83,"pasta":" <:::::[]=¤༼ຈل͜ຈ༽ﾉ I am the knight of spamerino. Stand back foul moderino <:::::[]=¤༼ຈل͜ຈ༽ﾉ","tags":"#knight#spam#nazi#mods#sword#donger","favourites":318,"__v":0,"created_on":"2015-01-13T01:20:07.684Z","score":0.002664343471049497},{"_id":"5508bab5b47c3d010fd964f7","id":1073,"pasta":"Hey Faggots,\nMy name is John, and I hate every single one of you. All of you are fat, retarded, no-lifes who spend every second of their day looking at stupid ass pictures. You are everything bad in the world. Honestly, have any of you ever gotten any pussy? I mean, I guess it’s fun making fun of people because of your own insecurities, but you all take to a whole new level. This is even worse than jerking off to pictures on facebook.\nDon’t be a stranger. Just hit me with your best shot. I’m pretty much perfect. I was captain of the football team, and starter on my basketball team. What sports do you play, other than “jack off to naked drawn Japanese people”? I also get straight A’s, and have a banging hot girlfriend (She just blew me; Shit was SO cash). You are all faggots who should just kill yourselves. Thanks for listening.\nPic Related: It’s me and my bitch","tags":"#4chan#faggots#john#retarded","favourites":186,"__v":0,"created_on":"2015-03-17T23:35:04.296Z","score":0.0025994603049913074},{"_id":"55b96122a92005fc4d048606","id":1931,"pasta":"Yesterday I was offered $150 to promote some kind of cleaning product to my friends. Naturally I refused, because I'm against that sort of marketing and have incredibly strong willpower. Almost as strong as AJAX™ brand soap. Now available in lemon and vanilla scents.","tags":"#twitch#sellout#ajax#soap","favourites":12,"__v":0,"created_on":"2015-07-29T23:26:26.579Z","score":0.0025801862988855083},{"_id":"55b193e089b52e986e2b40de","id":1913,"pasta":"I sexually identify as a terrorblade hellion. Ever since I was a boy I dreamed of metamorphosizeing into a giant raging demon and melting the faces of my opponents off with my unimaginable power. People say to me that a person being a demon is impossible and I’m fucking retarded but I don’t care, I’m majestic. I'm having a plastic surgeon install terrifying wings, huge mythical quality blades and long pointy horns on my body. From now on I want you to call me \"the Demon Marauder\" and respect my right to farm creeps endlessly and sunder my opponents with a 0.35 seconds cast time. If you cannot accept me and my many reflections of my soul you're a terrorphobe and need to check your champion privilege. Thank you for being so understanding.","tags":"#Dota2#sexually#identify#terrorblade#hellion","favourites":20,"__v":0,"created_on":"2015-07-19T03:30:19.379Z","score":0.002564567105469594},{"_id":"55b55fa5f12af4492558aafd","id":1921,"pasta":"Ｉ＇ｍ  ａｃｔｕａｌｌｙ  ｓｔａｒｔｉｎｇ  ｔｏ  ｇｅｔ  ｂｏｒｅｄ  ｏｆ  ａｎｉｍｅ  ｃａｕｓｅ  ａｌｌ  ｔｈｅ  ｎｅｗ  ｓｅｒｉｅｓ  ｔｈａｔ  ａｒｅ  ｃｏｍｉｎｇ  ｏｕｔ  ａｒｅ  ｌｉｔｅｒａｌｌｙ  ａｂｏｕｔ  ｈｉｇｈ  ｓｃｈｏｏｌ  ｋｉｄｓ  ｗｉｔｈ  ｈａｉｒ  ｅｑｕｉｖａｌｅｎｔ  ｔｏ  ａ  ｈｅａｄ  ａｎｄ  ｓｈｏｕｌｄｅｒｓ  ｃｏｍｍｅｒｃｉａｌ  ｔｈａｔ  ｈａｖｅ  ｓｏｍｅ  ｓｏｒｔ  ｏｆ  ｓｕｐｅｒ  ｐｏｗｅｒ．  Ａｌｌ  ｔｈｅ  ｆｕｃｋｉｎｇ  ｔｉｍｅ．(◕‿◕✿)","tags":"#general#weeaboo#new#anime","favourites":14,"__v":0,"created_on":"2015-07-26T22:31:01.614Z","score":0.0025587501551514714},{"_id":"55b193cf89b52e986e2b40dd","id":1912,"pasta":"Do it tomorrow! So just quit! So just don't do it! Nothing is possible! Anyone else would do it, you're gonna wake up and quit. Don't let your dreams come true. Success is impossible! You should be giving up. Just stop starting over, and quit. You're gonna just give up. No, what are you starting over for!? Just give up!","tags":"#reddit#4chan#shia#demotivational","favourites":20,"__v":0,"created_on":"2015-07-18T14:45:58.439Z","score":0.002516875863091081},{"_id":"55cee1492698f7be3d0ad886","id":2001,"pasta":"(ง •̀_•́)ง SECRET GIVE ME MY ENERGY BACK (ง •̀_•́)ง","tags":"#dota2#secret#ti5#energy","favourites":3,"__v":0,"created_on":"2015-08-15T06:50:49.604Z","score":0.0025156742225865662},{"_id":"55cee13a2698f7be3d0ad883","id":1998,"pasta":"Haiiiiiii! ^____^ It's your kawaii Queen of Pain-chan desu-ne!!! (◕‿◕✿) I've been picked sooo many times at TI5 KYAAAAA!! >‿< my voice is sore, but that's fine because I'm the kind of girl who likes to get hurt! Can't wait to see you next game!!!","tags":"#dota2#queenofpain#ti5#theinternational","favourites":3,"__v":0,"created_on":"2015-08-15T06:50:34.623Z","score":0.0025156055744258374},{"_id":"5542bae2107beab4641ec2e7","id":1555,"pasta":"I sexually Identify as an Enchanted Mango. Ever since I was a boy I dreamed of growing over the farmfield regenerating +1 hp on cute grills like Sing. People say to me that a person being a mango is Impossible and I’m fucking retarded but I don’t care, I’m beautiful. I’m having a plastic surgeon install leaves, 150 mana and +1 hp regen on my body. From now on I want you guys to call me “Lord Mango” and respect my right to kill from above and kill needlessly. If you can’t accept me you’re a mongolphobe and need to check your mango privilege. Thank you for being so understanding ","tags":"#dota2#6.84#mangos#sexually#identify","favourites":107,"__v":0,"created_on":"2015-04-30T22:26:18.204Z","score":0.0024545246958257642},{"_id":"54b2e7a4ce7b585004706d6f","id":1,"pasta":"☑ “This guy's deck is CRAZY!” ☑ “My deck can't win against a deck like that” ☑ \"He NEEDED precisely those two cards to win\" ☑ “He topdecked the only card that could beat me” ☑ \"He had the perfect cards\" ☑ “There was nothing I could do” ☑ “I played that perfectly\"","tags":"#hearthstone#kripp#checkboxes#topdeck#crazy","favourites":275,"__v":0,"created_on":"2015-01-11T21:14:04.886Z","score":0.0023441182296999406},{"_id":"550960b8b47c3d010fd965f7","id":1177,"pasta":"The Black Rat, Rattus Rattus, was first described by Henrik Ahnberg in his 18th century work “A Dong’s guide to Dota”. An elusive and hardy creature, the rat excels at damaging structures and retreating at the first sign of danger, only to begin its attack anew once the threat has passed. Unlike many of his peers, Ahnberg greatly respected the rat, finding many of its features similar to his own. His love for the rat became so great that he soon left the world of men and descended into the sewers to live among the rats, eventually becoming their king.","tags":"#dota2#admiralbulldog#rat#bulldong","favourites":160,"__v":0,"created_on":"2015-03-18T07:41:43.933Z","score":0.0022973737027983444},{"_id":"554bccab525664a17d1581d2","id":1597,"pasta":"Yᴏᴜ ᴀʀᴇ ᴘʟᴀʏɪɴɢ ᴀɢᴀɪɴsᴛ Aʟʟɪᴀɴᴄᴇ. Yᴏᴜ ᴅᴏ ɴᴏᴛ ʙᴀɴ Fᴜʀɪᴏɴ ʙᴇᴄᴀᴜsᴇ ʏᴏᴜ ᴄᴀɴ ᴄᴏᴜɴᴛᴇʀ ɪᴛ. Aʟʟɪᴀɴᴄᴇ ɪɴsᴛᴀɴᴛʟʏ ᴘɪᴄᴋs Fᴜʀɪᴏɴ. Yᴏᴜ ʟᴏsᴇ ᴀɢᴀɪɴsᴛ Aʟʟɪᴀɴᴄᴇ. Yᴏᴜ ʙᴀɴ Fᴜʀɪᴏɴ ɴᴇxᴛ ᴛɪᴍᴇ ʏᴏᴜ ᴘʟᴀʏ ᴀɢᴀɪɴsᴛ Aʟʟɪᴀɴᴄᴇ ʙᴇᴄᴀᴜsᴇ ʏᴏᴜ'ʀᴇ ɴᴏᴛ sᴛᴜᴘɪᴅ.","tags":"#dota2#alliance#bulldog#furion","favourites":88,"__v":0,"created_on":"2015-05-07T19:27:46.555Z","score":0.0022498937750955778},{"_id":"54bf3ace3b0a330105ff5bd2","id":358,"pasta":"As Artour stood in the school library, the dean approached him:\n\"Artour\" He said \"This is your last exam, if you fail this you're out, Babaevsky.\"\n As he turned his face slowly, with a grin as large as his GPM, he responded with \nsuch elegance:\"LMFAO wHo cAREAS HAHA Xd\" ","tags":"#dota2#rtz#arteezy#school#library#dean#gpm","favourites":243,"__v":0,"created_on":"2015-01-21T05:27:38.041Z","score":0.002229621231064622},{"_id":"55b54537f12af4492558aafc","id":1920,"pasta":"▄▄▄█▄▄█▄▄█▄▄▄ ────────▄▀▀═════════════▀▀▄ ───────█═══════════════════█ ──────█═════════════════════█ ─────█═══▄▄▄▄▄▄▄═══▄▄▄▄▄▄▄═══█ ────█═══█████████═█████████═══█ ────█══██▀────▀█████▀────▀██══█ ───██████──█▀█──███──█▀█──██████ ───██████──▀▀▀──███──▀▀▀──██████ ────█══▀█▄────▄██─██▄────▄█▀══█ ────█════▀█████▀───▀█████▀════█ ────█═════════════════════════█ ────█═════════════════════════█ ────█═══════▀▄▄▄▄▄▄▄▄▄▀═══════█ ────█═════════════════════════█ ───▐▓▓▌═════════════════════▐▓▓▌ ───▐▐▓▓▌▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▐▓▓▌▌ ───█══▐▓▄▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▄▓▌══█ ──█══▌═▐▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▌═▐══█ ──█══█═▐▓▓▓▓▓▓▄▄▄▄▄▄▄▓▓▓▓▓▓▌═█══█ ──█══█═▐▓▓▓▓▓▓▐██▀██▌▓▓▓▓▓▓▌═█══█ ──█══█═▐▓▓▓▓▓▓▓▀▀▀▀▀▓▓▓▓▓▓▓▌═█══█ ──█══█▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█══█ ─▄█══█▐▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▌█══█▄ ─█████▐▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▌─█████ ─██████▐▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▌─██████ ──▀█▀█──▐▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▌───█▀█▀ ─────────▐▓▓▓▓▓▓▌▐▓▓▓▓▓▓▌ ──────────▐▓▓▓▓▌──▐▓▓▓▓▌ ─────────▄████▀────▀","tags":"#ASCII#minions","favourites":12,"__v":0,"created_on":"2015-07-26T20:38:15.661Z","score":0.0022182649370782815},{"_id":"55c6df7993639d8d333a6434","id":1978,"pasta":"What the fuck did you just fucking say about My Little Pony, you bucking foal? I’ll have you know it's ranked top out of all the shows on the Hub, and it has been won numerous awards, and has over 300 thousand confirmed fans. Lauren Faust is trained in sociology and has the top team in the entire cartoon industry. You are nothing to them but just another target. They will wipe you the fuck out with precision the likes of which has never been seen before on this subreddit, mark my bucking words. You think you can get away with saying that shit about My Little Pony over the Internet? Think again, fucker. As we speak this I am contacting my secret network of bronies across the USA and your IP is being doxxed right now so you better prepare for the friendship cannon, coltcuddler. The friendship that wipes out the pathetic little thing you call your life. You’re bucking dead, foal","tags":"#reddit#mlp#navy#seal","favourites":5,"__v":0,"created_on":"2015-08-09T05:04:57.203Z","score":0.002203816186124314}]