[{"_id":"54dd051fa43a9c0e1c527fdb","id":773,"pasta":"Here's the thing. You said a \"wyvern is a dragon.\" Is it in the same family? Yes. No one's arguing that. As someone who is a 1k MMR feeder who studies dragons, I am telling you, specifically, in dota, no one calls wyverns dragons. If you want to be \"specific\" like you said, then you shouldn't either. They're not the same thing. If you're saying \"dragon family\" you're referring to the taxonomic grouping of Varanidae, which includes things from wyverns to eldwurms to drakes. So your reasoning for calling a wyvern a dragon is because random people \"call the flying lizards dragons?\" Let's get gyarados and charizards in there, then, too. Also, calling someone a noob or a feeder? It's not one or the other, that's not how taxonomy works. They're both. A wyvern is a wyvern and a member of the dragon family. But that's not what you said. You said a wyvern is a dragon, which is not true unless you're okay with calling all members of the dragon family dragons, which means you'd call eldwurms, drakes, and other flying lizards dragons, too. Which you said you don't. It's okay to just admit you're wrong, you know?","tags":"#dota2#reddit#unidan#winter#wyvern#dragon","favourites":1,"__v":0,"created_on":"2015-02-12T11:24:44.577Z","score":0},{"_id":"54dc4e63a43a9c0e1c527fd8","id":772,"pasta":"So sad. Today Twitch disabled the use of Κappa. Everybody spam Κappa in remembrance of every shitposter's favorite word.","tags":"#twitch#kappa#broken#disabled","favourites":2,"__v":0,"created_on":"2015-02-12T06:26:25.057Z","score":0.000128430285644949},{"_id":"54dc4411a43a9c0e1c527fd6","id":771,"pasta":"Merlini stop playing <insert hero>. You should play a mage ... BECAUSE YOU'RE ONLY GOOD AT CASTING HAHAHAHAHA","tags":"#dota2#merlini#mage#only#casting","favourites":2,"__v":0,"created_on":"2015-02-12T04:56:33.282Z","score":0.00012824519818651695},{"_id":"54dc2a4fa43a9c0e1c527fd4","id":770,"pasta":"To be fair, I did Nazi that coming. I came here to say this but boy, that escalated quickly so to the top with you! Lost it at 'This is why we can't have nice things' and then my faith in humanity was restored, my mind blown, and manly tears were shed. Well said. As a 'Merican, I can confirm this gem has just won the internet and is doing it right. Just sayin', I know that feel, bro, and while that was a risky click, this post was a 9/10, would read again. I see what you did there and it feels good man. You're doing God's work, son. Yes. I get this reference. I laughed way harder than I should have at your list that seems legit and totally nailed it. You must be a hit at parties. I like you. Doctors hate you! Instructions unclear. Dick caught in you magnificent bastard; you, sir, are so brave, a gentleman and a scholar, and seeing how you are a redditor for 4 years, this checks out, so I'll allow it. I regret that I only have one upvote to give for this cool story, bro. CTRL+F \"about tree fiddy\" was not disappointed. Wait, why do I have you tagged as \"NOPE NOPE NOPE\"? Nice try, you monster. What did I just read? Dafuq? I read that as \"YOU HAD ONE JOB\". I can't fap to this. No true scotsman could see that this relevant XKCD was bad, and you should feel bad. As a black man and as a gay man and as a woman, black people suck, gay people are gross and women are bitches. You must be new to Reddit, so I'll see your cakeday and raise you a karma train. One does not simply rustle my jimmies, not even once, and it's almost as if Reddit is composed of millions of individuals with different opinions and outlooks. This stahp gave me cancer for science, so that's enough internet for me today. OP is a bundle of sticks, 2/10, would not bang, not with that attitude. What is this I don't even know how is this wtf? Circlejerk must be leaking. This will get buried but brace yourselves, some men want to watch the world burn right in the feels. When you see it, they'll KILL IT WITH FIRE! I really sympathize with pedophiles, but that has nothing to do with atheism. Lawyer up, delete facebook, hit the gym, and SHUT UP AND TAKE MY MONEY, said no one ever, so you wouldn't download a strawman. Damn onions, you scary like a BOSS. whoosh. Since rule #1 is 'be attractive', I'll just leave this here: This is my [f]irst post, be gentle. I have the weirdest boner right now. OP will surely deliver, unless he's a cop, in which case he'll just shoot your dog.","tags":"#reddit#satire#circlejerk#every#meme#nazi#coming","favourites":1,"__v":0,"created_on":"2015-02-12T04:21:31.630Z","score":0},{"_id":"54dc2a33a43a9c0e1c527fd2","id":769,"pasta":"༼ ╥ ل ╥ ༽I SURVIVED Reynad Banwave 2015 ༼ ╥ ل ╥ ༽","tags":"#hearthstone#survived#reynad#banwave","favourites":2,"__v":0,"created_on":"2015-02-12T03:06:59.890Z","score":0.00012802019705187252},{"_id":"54dc000e1be342ad121ed766","id":768,"pasta":"Kripp's concrete face was buried between Tyggbar's perfect breasts while Forsen kneeled behind her eating out her asshole. \"Fuck me you imbeciles\" she said before dropping to her knees and presenting herself to them. Soon her whole body shuddered as a powerful orgasm was gifted to her by Kripperino's donger. \"Now that's value\" said Trump as he masturbated in the corner.","tags":"#hearthstone#kripp#tyggbar#forsen#trump#fanfic","favourites":0,"__v":0,"created_on":"2015-02-12T00:15:03.718Z","score":0},{"_id":"54dc00001be342ad121ed765","id":767,"pasta":"“I don’t care if Sumail is the Year Beast,” said EG captain and American sniper Peter ‘PPD’ Dager. “All I know is he’s definitely not Arteezy, who probably would not be mistaken as the Year Beast because he did not win this tournament like I did.”","tags":"#dota2#EG#DAC#sumail#ppd#year#beast\n","favourites":3,"__v":0,"created_on":"2015-02-11T23:40:44.445Z","score":0.00022735471553972118},{"_id":"54daf46bace6a4147ec598d3","id":766,"pasta":"Your comment has been dongered! ヽ༼ຈل͜ຈ༽ﾉ\nAnother user liked your comment so much that they dongered it, giving you reddit dongers.\nreddit dongers is reddit's premium dongership program. Here are the benefits:\nExtra site dongers\nExtra dongers\nDiscuss and get help on the features and perks at /r/dongerbenefits[1]\nGrab a drink and join us in /r/dongerlounge[2] , the super-secret dongers-only community that may or may not exist.\nDid you know: Most dongers—78 percent of the yearly dongers supply—is made into fedoras. Other industries, mostly electronics, medical, and dental, require about 12 percent. The remaining 10 percent of the yearly dongers supply is used in financial transactions.","tags":"#reddit#dongered#gold#circlejerk","favourites":1,"__v":0,"created_on":"2015-02-11T06:19:19.345Z","score":0},{"_id":"54daf2e5ace6a4147ec598d1","id":765,"pasta":"Storm died while being the last man running. Dimitri(some random russian) was yelling all the time:\n\n\"Sturm kill you self!\"\n\n\"Sturm kill you self!\"\n\n\"My god sturm, pleas kill you self!\"\n\nThat must have hit home because Storm replied almost crying over mic saying he did not mean to fuck up but its not a reason to tell someone to kill himself.\n\nDimitri answered:\n\n\"No Sturm! Not kill you. Use Blyatstone!\"","tags":"#dota2#storm#strum#russian#blyatstone#yourself","favourites":0,"__v":0,"created_on":"2015-02-11T05:15:38.824Z","score":0},{"_id":"54dae1bffcaa94b67a3e9cfe","id":764,"pasta":"Hahaha\nEDIT: uhm i mean \"epic lel\" for the downvoters\nEDIT2: Wow, reddit gold! Thanks, kind stranger!\nEDIT3: Wow. Inbox blowing up. Amazing day. Thank you guys, responding as fast as I can!!!\nEDIT4: Got an agent to help me with all of this. Should reply much faster now. Also, front page. Thanks guys!\nEDIT5: Just fucked Oprah\nEDIT6: Just reached Mars\nEDIT7: Just ate a taco\nEDIT8: Just bought taco bell with all the money from your comments/gold, thank you guys!!! I'll turn it around :) xD\nEDIT9: Corporate treasuries, and buying Wendy's now. Let's see how this turns out. 2X GOLD??? :o It is my lucky day. Truly blessed. Thank you guys.\nEDIT10: Just reached mars\nEDIT11: Wow, what an amazing day. Heading in for the night. Thanks guys! I'll be sure to reply to all the messages later. RIP my inbox. Asking for a friend. Street lamp LeMap. Macklemore. Vaccines!!! #freeleinternet. Games! Ha!!! Am I right?????","tags":"#reddit#satire#circlejerk#hahaha","favourites":2,"__v":0,"created_on":"2015-02-11T04:59:38.984Z","score":0.00012534960281474107},{"_id":"54dad61f0f0039b56e3fef1f","id":763,"pasta":">mouz is kill.\n>i esk for new mouz from gret paper\n>he sey \"but what abot clobal elit?\"\n>i sey \"how to globel lit if mouz is kill?\"\n>i giff good money for mouz\n>i say giff me mouz plz, so mouz is no kill\n>he say\n>fuck u\n>mouz is kill\n>i walk the streets of CSGO reddit finding a mouz but no returns \n>my bets are daed\n>globel elit is daed\n>mous is kill\n>i cri at home when i lek at inventory\n>chrisJ cri because\n>mouz\n>is \n>kill","tags":"#csgo#mouse#is#kill","favourites":2,"__v":0,"created_on":"2015-02-11T03:59:56.101Z","score":0.00012523181671989636},{"_id":"54dace570f0039b56e3fef1d","id":762,"pasta":"Tyggbar was already 9 months in, while Forsen was streaming, she begun washing the dishes of last night's romantic dinner, when all of the sudden, contractions begun, the baby finally was coming out! Forsen began screaming in panic, Tyggbar told him to calm down, everything was going to be fine, and asked him to pick up the keys and drive her to the nearest hospital. Little did they know, that was their last conversation.","tags":"#forsen#h1z1#tyggbar#driving#baby","favourites":3,"__v":0,"created_on":"2015-02-11T02:47:07.470Z","score":0.00022288231286911978},{"_id":"54dace420f0039b56e3fef1c","id":761,"pasta":"(◉◡◔)ﾉ✇ FORSEN TAKE THE WHEEL (◉◡◔)ﾉ✇","tags":"#forsen#h1z1#driving#wheel","favourites":3,"__v":0,"created_on":"2015-02-11T02:44:08.650Z","score":0.00022287186916127843},{"_id":"54daad1e0f0039b56e3fef19","id":760,"pasta":"All I want in my life is to stay in the cancer room forever. Oh, the pleasing Sanic theme, the FOOOOOOORSEEEEEN shouts, so good. Every time Forsen gets there i just close my eyes and have fun and I cum very quickly..","tags":"#forsen#h1z1#cancer#room#cum#sanic","favourites":0,"__v":0,"created_on":"2015-02-11T00:53:36.351Z","score":0},{"_id":"54da82790f0039b56e3fef17","id":759,"pasta":"✈ ▌▌ ¦҉▌▌ ▄ ▌ ▄✈▌ ▄ ¦҉▌ ▄ ▄ merry 9/11 everyone!","tags":"#general#ASCII#911#merry","favourites":3,"__v":0,"created_on":"2015-02-10T21:46:15.717Z","score":0.0002218324538190878}]