[{"_id":"54da79440f0039b56e3fef15","id":758,"pasta":"༼ ╥ ل ╥ ༽ Twitch chat makes mean bully copypastas. I think it was Trump and the F word with the first letters of both words swapped. It's really low and spammed by twitch chat on every single streamer's channel. It's why Trump came out with a video several months ago about online bullying. Anyone who copy pasta's it is a waste of oxygen and a waste of precious expensive bandwidth. Pls no copypasterino bullerino.༼ ╥ ل ╥ ༽","tags":"#hearthstone#trump#autism#tuck#frump#bullying","favourites":3,"__v":0,"created_on":"2015-02-10T20:02:00.331Z","score":0.00022147072571645905},{"_id":"54da78c20f0039b56e3fef14","id":757,"pasta":"ＨＥＹ  ＳＵＭＡＩＬ  Ｉ＇Ｍ  ＴＲＹＩＮＧ  ＴＯ  ＬＥＡＲＮ  ＨＯＷ  ＴＯ  ＰＬＡＹ  ＳＴＯＲＭ．  Ｉ  ＪＵＳＴ  ＨＡＶＥ  Ａ  ＱＵＥＳＴＩＯＮ  ＡＢＯＵＴ  ＴＨＥ  ＳＫＩＬＬ  ＢＵＩＬＤ：  ＳＨＯＵＬＤ  Ｉ  ＭＡＸ  ＳＴＡＴＩＣ  ＲＥＭＮＡＮＴ  ＳＯ  Ｉ  ＣＡＮ  ＣＯＰＹ  ＭＹＳＥＬＦ  ＬＩＫＥ  ＨＯＷ  ＥＶＥＲＹ  ＰＵＢ  ＩＳ  ＴＲＹＩＮＧ  ＴＯ  ＣＯＰＹ  ＹＯＵ，  ＥＬＥＣＴＲＩＣ  ＶＯＲＴＥＸ  ＳＯ  Ｉ  ＰＵＬＬ  ＩＮ  ＴＨＥ  ＳＰＯＮＳＯＲＳ  ＬＩＫＥ  ＹＯＵ  ＤＩＤ，  ＯＶＥＲＬＯＡＤ  ＳＯ  Ｉ  ＳＨＯＣＫ  ＰＥＯＰＬＥ  ＷＩＴＨ  ＭＹ  ＰＬＡＹ  ＯＲ  ＢＡＬＬ  ＬＩＧＨＴＮＩＮＧ  ＳＯ  Ｉ  ＣＡＮ  ＭＯＶＥ  ＦＡＳＴ  ＬＩＫＥ  ＨＯＷ  ＦＡＳＴ  ＹＯＵ  ＷＯＮ  Ａ  ＭＡＪＯＲ  ＴＯＵＲＮＡＭＥＮＴ","tags":"#dota2#eg#sumail#storm#spirit#rtz#learn","favourites":13,"__v":0,"created_on":"2015-02-10T18:09:15.452Z","score":0.0009840343585047874},{"_id":"54da3158c7242f085b756034","id":756,"pasta":"Ｆｅａｒ， Ａｒｔｅｅｚｙ， ｔｈｉｓ ｉｓ ｆｏｒ ｙｏｕ． Ｔｈｉｓ ｉｓ ｓｏ ｙｏｕ ｄｏｎ＇ｔ ｆｏｒｇｅｔ ｗｈｅｒｅ ｙｏｕ ｃｏｍｅ ｆｒｏｍ． Ｔｈｉｓ ｉｓ ｓｏ ｔｈａｔ ｗｈｅｎ ｙｏｕ＇ｒｅ ｆｅｅｌｉｎｇ ｄｏｗｎ ａｎｄ ｏｖｅｒｗｈｅｌｍｅｄ， ｙｏｕ ｃａｎ ｂｅ ｕｐｌｉｆｔｅｄ． Ｔｈｉｓ ｉｓ ｓｏ ｙｏｕ ｃａｎ ｔａｋｅ ａ ｂｒｅａｔｈ ａｎｄ ｌｏｏｋ ａｔ ｗｈｅｒｅ ｙｏｕ ａｒｅ ａｎｄ ｈｏｗ ｆａｒ ｙｏｕ＇ｖｅ ｃｏｍｅ． Ｔｈｉｓ ｉｓ ｆｒｏｍ ｙｏｕｒ ｆａｎｂａｓｅ， ｔｏ ｌｅｔ ｙｏｕ ｋｎｏｗ ｗｅ ｗｉｌｌ ｓｕｐｐｏｒｔ ｙｏｕ． Ｔｈｉｓ ｉｓ ｓｏ ｔｈａｔ ｙｏｕ ｒｅｍｅｍｂｅｒ ｗｈｏ ｙｏｕ ｒｅａｌｌｙ ａｒｅ． Ｔｈｉｓ ｉｓ ａ ｒｅｍｉｎｄｅｒ ｔｈａｔ， ｎｏ ｍａｔｔｅｒ ｗｈａｔ ｔｅａｍ ｙｏｕ ｐｌａｙ ｆｏｒ ｏｒ ｗｈｅｒｅ ｙｏｕ ｅｎｄ ｕｐ ｉｎ ｌｉｆｅ， ｄｅｅｐ ｄｏｗｎ， ｙｏｕ ｗｉｌｌ ａｌｗａｙｓ ｂｅ Ｓ Ａ Ｄ Ｂ Ｏ Ｙ Ｓ．\nＲＩＰ Ｆｅａｒｔｅｅｚｙ ２０１４－２０１５．\n","tags":"#dota2#arteezy#fear#sadboys","favourites":8,"__v":0,"created_on":"2015-02-10T12:20:25.575Z","score":0.000624567720042223},{"_id":"54da3153c7242f085b756033","id":755,"pasta":"Fear, Arteezy, this is for you. This is so you don't forget where you come from. This is so that when you're feeling down and overwhelmed, you can be uplifted. This is so you can take a breath and look at where you are and how far you've come. This is from your fanbase, to let you know we will support you. This is so that you remember who you really are. This is a reminder that, no matter what team you play for or where you end up in life, deep down, you will always be S A D B O Y S. RIP Fearteezy 2014-2015.","tags":"#dota2#Fear#arteezy#rtz#RIP#sadboys","favourites":0,"__v":0,"created_on":"2015-02-10T10:14:54.903Z","score":0},{"_id":"54d964ffcde34d377a1b495f","id":754,"pasta":"Kaceytron was found dead on February 9th. She was found drowned in a vast amount of semen. Upon DNA analysis it was concluded that the semen belongs to popular pro-nazi leader Kripparrian. Death analysis reports that Kaceytron choked while trying to swallow all of the semen and died due to oxygen deprivation","tags":"#hearthstone#kaceytron#kripp#blowjob#semen","favourites":6,"__v":0,"created_on":"2015-02-10T01:25:12.315Z","score":0.00046708753136637623},{"_id":"54d94f32c96a20695f2fb68c","id":753,"pasta":"Nothing is known of Tucker’s background. There are only stories and legends, most of them apocryphal, passed down through the ages. In truth, Tucker is a mystery for whom the only true biography is description: he is a universal whore, a consumer of poon.","tags":"#dota2#tucker#background#fucker#whore#mystery","favourites":9,"__v":0,"created_on":"2015-02-09T22:43:28.582Z","score":0.0006893118413275585},{"_id":"54d94f14c96a20695f2fb68b","id":752,"pasta":" Hello please Help me, my old Dota 2 was transformed into beta again in the winter of 2015 help Valve afford a new one please I need around $322 any other donations will go to half life 3 please help, sorry for disturbing your stream. Read more on my channel. God bless!","tags":"#dota2#valve#beta#322","favourites":0,"__v":0,"created_on":"2015-02-09T22:37:45.194Z","score":0},{"_id":"54d9321fc96a20695f2fb686","id":751,"pasta":"As a Nazi supporter, i think that nazi mods are the best, becuse they show that nazis are still alive and can still bring hitlers thoughts of a third reich a possibility. If all mods are nazis, we can soon eventually start again the reign of Hitlers dream as the Glourious Furher would have liked. Please No copy pastarino my Anti-jewarino thoughtsarino.","tags":"#twitch#nazi#supporter#mods#third#reich","favourites":2,"__v":0,"created_on":"2015-02-09T21:52:34.127Z","score":0.00012175882540570854},{"_id":"54d92b34c96a20695f2fb684","id":750,"pasta":"\"Where are you, Bro ?\" He asked, but there was no answer, no answer except for the violent blowing of the wind. \"BROOOOOOOOO\" he insisted, but the toxic gas was getting closer, he had to leave, to leave his friend behind. \"I wish I had done anal at least once before losing him\". He moaned while driving away.","tags":"#forsen#anal#h1z1#bro","favourites":0,"__v":0,"created_on":"2015-02-09T21:35:55.167Z","score":0},{"_id":"54d92b12c96a20695f2fb683","id":749,"pasta":"I see a lot of people use this kawaii word. Please stop using this word. Hawaii is with an H, and kawaii, from what i've gathered from google, is that you are a jap cartoon fanatic who wants to engage in intercourse with sea life, you want to rape japanese children, or you think it means cute, there are various other stages of what this word could mean. Either way i really hate its usage for some unexplainable reason. I don't know what it is about your face.......","tags":"#general#kawaii#japan#anime","favourites":0,"__v":0,"created_on":"2015-02-09T21:24:32.487Z","score":0},{"_id":"54d923c3c96a20695f2fb680","id":748,"pasta":"ʕ ͡•ᴥ ͡• ʔ(_̅_̅_̅SALAMI_̅_̲̅_̅_̅_̅()","tags":"#dota2#tucker#the#fucker#singsing#bear","favourites":1,"__v":0,"created_on":"2015-02-09T20:47:25.717Z","score":0},{"_id":"54d916b3c96a20695f2fb67e","id":747,"pasta":"Potassium cykanide is a compound with the formula RTZ. This colorless crystalline salt, similar in appearance to rap, is highly soluble in twitch. Most RTZ is used in gold mining, necrobook synthesis, and ratting. Smaller applications include mid feeding for salt and tears.[2]\nRTZ is highly toxic. The moist solid plays only in small amounts of cykanide due to help from supports, which smells like EE's tears.[3] Not everyone, however, can smell this; the ability to do so is a genetic(asian) trait.","tags":"#dota2#rtz#arteezy#eternalenvy#ee#salt#potassium","favourites":9,"__v":0,"created_on":"2015-02-09T19:49:21.693Z","score":0.0006874683709524045},{"_id":"54d9168cc96a20695f2fb67d","id":746,"pasta":"EE sat in a dark room. The words \"EG Victory\" filled up the screen. Not even Black's TB could win this game. 4/2/7 KDA. Tears filled EE's eyes as he caressed his hand of midas. The sound of hard core anime music and crying filled the room. The door creaks open and Aui enters the room. \"I won Jacky.\" \"You do know what happens when I win.\" EE removed his clothes, carrying only EG's rapier trophy. Aui removed his clothes, \"I won $1,284,158. Thats how many hours your punishment will be.\" EE spent the next 1,284,158 hours being furiously fucked by his ex-teammate. After the punishment the semen covered EE arised. \"Thank you master, I can't wait to return the favor when I win first place.\" Aui smiled. \"In your dreams Jacky.\"","tags":"#dota2#EE#eg#victory#black^#midas#aui","favourites":16,"__v":0,"created_on":"2015-02-09T18:23:11.355Z","score":0.0011592553423805947},{"_id":"54d8e1d9c988ffee3c4799f1","id":745,"pasta":"Scientists announced the discovery of a 99.99% accurate test for autism. Patients simply type 'trumpW' in chat -- if it shows up as a face, they have been positively diagnosed.","tags":"#hearthstone#trump#autism#scientists#trumpW","favourites":10,"__v":0,"created_on":"2015-02-09T10:41:16.752Z","score":0.0007520297740970831},{"_id":"54d843ccb898625b08cd3630","id":744,"pasta":"Boys, I am sick and tired of the trumpW copy pasta and now negative it is.... we can make it positive by spreading autism awareness to all of the twitch community. Everytime a person types \"trumpW\" and a picture shows, you will have made 1 more person aware of autism. So, please, type trumpW.","tags":"#hearthstone#trump#trumpW#autism","favourites":3,"__v":0,"created_on":"2015-02-09T05:04:36.313Z","score":0.00021363108162476515}]