[{"_id":"5521a85d05bc3c2d7b4c6b7a","id":1413,"pasta":"THE HALLOWED ONE, THE MASTER OF STRATEGY, THE KING OF GANK, THE SULTAN OF PUSH, THE TSAR OF TEAMFIGHT, THE SLAYER OF EHOME, THE CAPTAIN OF THEYYEAR 2010, THE CHAMPION OF THE INTERNATIONAL THE ONE AND ONLY ARTSTYLE IS BACK TO NATUS VINCERE!!!","tags":"#dota2#artstyle#navi","favourites":5,"__v":0,"created_on":"2015-04-05T21:21:47.078Z","score":0.00007547220702440676},{"_id":"55218c9805bc3c2d7b4c6b78","id":1412,"pasta":"Can you guys stop trying to have a decent conversation in this chat? I'm trying to read the spam!!!","tags":"#twitch#chat#read#spam","favourites":2,"__v":0,"created_on":"2015-04-05T12:39:48.737Z","score":0.000023772255578018444},{"_id":"5520e7efb3d70f5076349443","id":1411,"pasta":"Valve Anti Cheat \"VAC\" is a mindblowingly complicated way to stop cheaters. It is very effective, and it is impossible to cheat on VAC enabled servers. If VAC detects a cheater, it'll VAC ban them instantly, and there is no other way to play CS, because matchmaking is the only way to play competitive CS:GO. VAC is one of the best anti-cheats made to date, it catches 100% of cheaters, keeping CS:GO Matchmaking very clean.","tags":"#csgo#VAC#cheating#hacking#satire","favourites":3,"__v":0,"created_on":"2015-04-05T07:44:43.828Z","score":0.000042357344043522324},{"_id":"552072edc2046e616a47eb2f","id":1410,"pasta":"It was a tragic story of the bird family and thr evil Venomancer. Wielding the Hand of Midas, Venomancer turned the old father bird into gold, leaving the two childrens with a deadly plague ward. Knowing they cannot beat the almighty Venomancer, they avenge their father's death by killing the ward. One of them dies in the battle, while the other is poisoned badly, and would die as time pass by. Not long after, the Venomancer returns to watch the small bird die in suffer, but a huge rock smacks the poor bird with a fuckin tree, killing the last of the bird family in one swing.","tags":"#dota2#singsing#midas#venomancer","favourites":2,"__v":0,"created_on":"2015-04-04T23:06:35.863Z","score":0.000023772255578018444},{"_id":"552057bdc2046e616a47eb2d","id":1409,"pasta":"So no one has figured out why Alliance are doing so well? Last year they didn't perform very well at TI, and do you know why? Because of s4 and EGM (no offense guys, keep reading). With EGM and s4 Alliance could only play with 3/5 of their potential. Neither s4 or EGM has an A in their name, but now we have M[A]dshka, P[A]jkatt, [A]kke, Niqu[A] and Lod[A]. It is obvious that they should be doing well. ","tags":"#dota2#alliance#a#name#[A]","favourites":2,"__v":0,"created_on":"2015-04-04T21:19:06.151Z","score":0.000023772255578018444},{"_id":"55203effc2046e616a47eb2b","id":1408,"pasta":"OpieOP * x = 322 FIND THE VALUE OF X","tags":"#dota2#opieop#xboct#322","favourites":5,"__v":0,"created_on":"2015-04-04T19:35:16.386Z","score":0.00007547220702440676},{"_id":"5520374dc2046e616a47eb28","id":1407,"pasta":"HEY (insert team name here) FAN-HUMANS, TY FOR THE EASY CHILD SUPPORT PAYMENTS, NOW I CAN AFFORD TO PAY MY ILLEGITIMATE CHILDREN. NO MORE BABY MAMA DRAMA HERE 4Head","tags":"#dota2#bugatti#bets#child#support","favourites":7,"__v":0,"created_on":"2015-04-04T19:01:04.464Z","score":0.00010581074350563556},{"_id":"5520373ac2046e616a47eb27","id":1406,"pasta":"Kreygasm  NOW   Kreygasm  THATS   Kreygasm  WHAT   Kreygasm  I  Kreygasm  CALL   Kreygasm  MUSIC   Kreygasm","tags":"#hearthstone#Kreygasm#plugDJ#cance#rmusic","favourites":6,"__v":0,"created_on":"2015-04-04T15:59:51.343Z","score":0.00009089613027354018},{"_id":"55203732c2046e616a47eb26","id":1405,"pasta":" ºل͜º༼ ºل͜º༼ ºل͜º༼ ºل͜º ༽ºل͜º༼ ºل͜º༼ ºل͜º༼ ºل͜º༼ ºل͜º ༽ºل͜º ༽ºل͜º ༽ EVERYONE GET IN HERE! ༼ ºل͜º༼ ºل͜º༼ ºل͜º༼ ºل͜º ༽ºل͜º ༽ºل͜º ༽. ༽ºل͜º ༽","tags":"#hearthstone#grimpatron#kripp","favourites":8,"__v":0,"created_on":"2015-04-04T13:03:22.123Z","score":0.0001203147179891592},{"_id":"551f7d421726c1da61e62be3","id":1404,"pasta":"ლ(ಠ益ಠლ) GANGBANGED ლ(ಠ益ಠლ) ","tags":"#hearthstone#kripp#gangbanged","favourites":4,"__v":0,"created_on":"2015-04-04T05:55:11.580Z","score":0.00005938427194423669},{"_id":"551f63b91726c1da61e62be0","id":1403,"pasta":"Halo Artur-sama, mi name es Carlito Raymundo, i born in Peru and i mental retarded because i peruvian, i a big fan of you stream and i love your music, give me a shot please. No copi pasterino capuccino alpaccino pl0x is me stori","tags":"#dota2#rtz#peru#arteezy#arttours","favourites":2,"__v":0,"created_on":"2015-04-04T03:26:27.869Z","score":0.000023772255578018444},{"_id":"551f350e1726c1da61e62bdd","id":1402,"pasta":"Greetings, faggots:\nMy name is xXSwaGGy-Quarlax [FaZe], Interplanetary Diplomat for the Andromeda Galaxy. I would like to begin this message by assuring you that I am not a camping faggot, nor will my people attempt to quick scope you. Although we have amassed many 360 no scopes throughout our collective lives, we come with a message of peace. I hope to make clear that this is a knife-only match and we will not be attempting any faggotry, nor will we feed mid. We wish only to share our swag amongst your people, you fucking aim botting hackers.\nMy clan and I have traveled many millions of light years in search of sentient life, visiting thousands of planets in an attempt to make contact and find the dankest kush. While we have been forced to pwn many noobs and fuck countless mothers on several of those worlds, reking their shit harder than a Haitian Earthquake, we only did so out of self-preservation. None of those planets held any life beyond the hostile and untamable, nor any blunts to blaze upon. It was truly us against them; however, we wish to make it clear that we do have blood on our hands. We, as an intergalactic species, understand that trust is founded upon honesty, and thus tell you retard hackers of our former faggotry. That said, we assure you that your obese, apartment dwelling neckbeards will stand safely beside us and shall never be shrekt.\nWe first located your planet nearly six Earth years ago and have been monitoring your communication devices, which you call “X-Box,” to learn your jargon and construct our message of peace. We hope that you understand our dialect and not see us as pay 2 win feeders. In order to further express our good faith, we have amassed a large collection of Code Red Mountain Dew and Cool Ranch Doritos, which we would like to share with your MLG pros. We hope you accept our offering in peace, and that you not fuck our mothers. We wish only to become allies with you, the faggot tryhards of Earth.\nPlease find us waiting for you at your trailer park tomorrow at sunrise. We will be in the large flying aircraft, which should be just a few pounds lighter than that of your mother's left tit.\nAyy lmao,\nxXSwaGGy-Quarlax [FaZe]","tags":"#reddit#faze#gaming#ambassador#xbox#alien","favourites":10,"__v":0,"created_on":"2015-04-03T22:45:59.772Z","score":0.00014834485279587468},{"_id":"551f33151726c1da61e62bdc","id":1401,"pasta":"i think it's sexist - but it's not demeaning her in any way. It's not reducing her down to a sex object, it's not calling her stupid, it's not trivializing her as a human being. It's just poking at a commonality of conversation style between male/female hetero relationships.\n\nIf you're outraged over this - you need to get out more.\n\nWe should be allowed to laugh at normatives and commonalities without being made into hateful bigots. I understand on reddit that extreme sexism and women hatred is common - but this is not a symbol of that.\n\nBeing for social justice and even feminism, should not detach you from the hilarity of the human experience and our ability to laugh at ourselves are creatures. Especially when the joke is so tame and innocent.\n\nBeing a person who connects to people organically and participates in the human experience should not be destroyed by social justice theory, where people live in theory, placing every word, every comment ,every thought process into some pre-defined category which has knee-jerk litmus tests ran against it so we can all decide whether if not is the time for recreational outrage or not.\n\nAs someone for social justice (and a proud feminist myself)... you can lose your humanity if you start to care about theory, micro-analyzing and policing language, and go looking for things to be offended by. Eventually you stop looking at people as people, jokes stop being jokes, intent stops mattering. YOu just react to endless litmus tests of OMG THAT COULD POSSIBLY, SLIGHTLY TRIGGER ME. And you just turn into an always outrage machine. The \"internet social justice\" is so detached from reality. It's all about taking people down a peg for coloring outside of the lines. It's not about solving problems that face the unprivileged.\n\nThere's bigger battles for women to be fighting. And this woman has made a good inroads in her career accomplishment. There's abortion rights to defend, sex workers to make safer, pay inequality to fix. Maternity/paternity leave to improve.\n\nAnd you're worried about this joke? This innocent, tame, joke?\n\nReally?\n\nYou need to look at yourself in the mirror and see what too much tumblr has done to you.\n","tags":"#tumblr#sexist#sexism#sjw#socialjustice","favourites":0,"__v":0,"created_on":"2015-04-03T15:33:45.221Z","score":0},{"_id":"551e0f7b7e4986a85d9bdb7c","id":1400,"pasta":"Here's The Thing. You Said \"Lactulose Is Not A Stool Softener.\" Is It In The Same Family? Yes. No One's Arguing That. As Someone Who Is A Scientist Who Studies Anal Fissures, I Am Telling You, Specifically, In Science, No One Says Lactulose is Not A Stool Softener. If You Want To Be \"Specific\" Like You Said, Then You Shouldn't Either. They're The Same Thing. If You're Saying \"Stool Softener\" You're Referring To The Osmotic Laxative Family, Which Includes Things From Miralax to Lactulose. So Your Reasoning For Calling Lactulose Not A Stool Softener Is Because Random People \"Call Lactulose Not Stool Softeners?\" Let's Get Magnesium Citrate Saline Laxative Oral Solutions In There, Then, Too. Also, Calling A Laxative not a Stool Softener? It's Not One Or The Other, That's Not How Poop Works. They're Both. A Laxative Is A Laxative And A Member Of The Stool Softening Family. But That's Not What You Said. You Said A Laxative Is Not A Stool Softener, Which Is Not True Unless You're Okay With Calling All Members Of The Poop Modification Family Laxatives, Which Means You'd Call Colon Blow, Fiber Supplements, And Other Medicines Laxatives, Too. Which You Said You Don't. It's Okay To Just Admit You're Wrong, You Know?","tags":"#general#laxatives#stool#softener#poop#unidan#jackdaw","favourites":1,"__v":0,"created_on":"2015-04-03T00:30:50.786Z","score":0},{"_id":"551e0f5e7e4986a85d9bdb7b","id":1399,"pasta":"Hey S4 Big Fan of yours!!! I got kicked out of my house, ( Im 27) so Ive bought a ticket and am heading to sweden. I found your address on the internet. Im nott a creeper xd. Im a high skill dota player same mmr as you (3.9k) We could play dota togethor. You havent replied to any of my tweets so Im asking in chat. c u soon","tags":"#dota2#s4#kicked#house#same#MMR","favourites":3,"__v":0,"created_on":"2015-04-02T22:01:47.144Z","score":0.000042357344043522324}]