[{"_id":"551e0efd7e4986a85d9bdb7a","id":1398,"pasta":" TQ Wheel Fanstraights 4Head EleGiggle I'll use your rares to buy new WHEELs for my DXRacer Bugatti 4Head EleGiggle 28% odds 4Head EleGiggle","tags":"#wheel#dota2#rares","favourites":0,"__v":0,"created_on":"2015-04-02T23:52:01.691Z","score":0},{"_id":"551d71ec3b30162b599ea7bd","id":1397,"pasta":"I sexually Identify as a Peyhey. Ever since I was a boy I dreamed of streamcheating against disgusting meme streamers. Barnyyy says to me that I should drink bleach and I’m fucking retarded but I don’t care, I’m beautiful. I’m creating a Reddit thread to make the hivemind hate Barnyyy for a week before they go back to bitching about the comeback mechanic and suma1l. Thank you for listening.","tags":"#dota2#barnyyy#sexually#identify#peyhey","favourites":2,"__v":0,"created_on":"2015-04-02T13:38:03.731Z","score":0.000027099200916667136},{"_id":"551d71ce3b30162b599ea7bc","id":1396,"pasta":" I sexually Identify as an Ice Ogre. Ever since I was a boy I dreamed of frost armoring over the jungle dropping cold sticky loads on disgusting sniper pickers. People say to me that a person being an ice ogre is Impossible and I’m fucking retarded but I don’t care, I’m beautiful. I’m having a plastic surgeon install blue skin and two heads, a club and a big dick on my body. From now on I want you guys to call me “Ogre-kun” and respect my right to frost armor from below and meme needlessly. If you can’t accept me you’re a ogrephobe and need to check your jungle privilege. Thank you for being so understanding.","tags":"#dota2#barny#sexually#identify#ice#ogre","favourites":1,"__v":0,"created_on":"2015-04-02T11:20:42.892Z","score":0},{"_id":"551d71ab3b30162b599ea7bb","id":1395,"pasta":" d W ∩ ᴚ Ⅎ ʞ Ͻ ∩ ⊥ ","tags":"#hearthstone#trump#tuck#frump#inverted","favourites":1,"__v":0,"created_on":"2015-04-02T10:26:54.341Z","score":0},{"_id":"551d71933b30162b599ea7ba","id":1394,"pasta":"HELLO I'AM LEGALLY BLIND AND CAN'T SEE THE SCORE THAT IS ON THE FKING SCREEN, SCORE?","tags":"#Score#Blind#Legally#Dota2","favourites":3,"__v":0,"created_on":"2015-04-02T16:33:59.357Z","score":0.0000483246045592121},{"_id":"551ce4fd4b5cdc9958b339d7","id":1393,"pasta":"Beer Can Dan\nDanny Diapers\n\"Ass Man\" Dan\nDanny Daycare\nSpread 'em Dan\nCandy Man Dan\nFamily Man Dan\n\"Big Daddy\" Dan\n\"Deepthroat\" Dan\nThe Big Dick @ Nick\n“Dirty” Dan Schneider\nOpen Wider Schneider\nSchneider The Butcher\n\"Bend Over\" Schneider\n\"Foot Soldier\" Schneider\nDan “The Man” Schneider\nDan \"The Biter\" Schneider\nDan \"The Spider\" Schneider\nDan \"The Defiler\" Schneider\nDan \"The Initiator\" Schneider\n\"Down South\" Dan Schneider\nDan \"The Plunger\" Schneider\nDan \"The Bladder\" Schneider\nDan \"The Seducer\" Schneider\nDan \"Teen Bedder\" Schneider\nDan “Rough Ryder” Schneider\nDan “The Collector” Schneider\n\"No Lube Required\" Schneider\nDan \"The Despoiler\" Schneider\nDan \"Deep Pounder\" Schneider\nDan “She’s a Fighter” Schneider\nDan \"Get in The Van\" Schneider\nDan \"Cunny Hoarder\" Schneider\nDan \"I've Had Tighter\" Schneider\nDan \"The Fart Inhaler\" Schneider\nDan “Deep Inside Her” Schneider\nDan \"The Overnighter\" Schneider\nDan \"Came Inside Her\" Schneider\n\"Please Mister, Slower\" Schneider\nDan “Likes ‘Em Tighter” Schneider\nDan \"The Rough Rider\" Schneider\nDan \"The Meat Grinder\" Schneider\nDan \"The Diaper Slider\" Schneider\nDan “The Cheek Divider” Schneider\nDan \"The Hymen Divider\" Schneider\nDan “The Hymen Collider” Schneider\nDan \"The Demolition Man\" Schneider\nDan \"The Cervix Wrecker\" Schneider\nDan \"This One's a Bleeder\" Schneider\nDan \"The Pussy Annihilator\" Schneider\nDan \"The Starlet Sodomizer\" Schneider","tags":"#DanSchneider#4chan#Nickelodeon","favourites":1,"__v":0,"created_on":"2015-04-02T06:36:51.331Z","score":0},{"_id":"551cd32b4b5cdc9958b339d5","id":1392,"pasta":"(•_•)\n( •_•)>⌐■-■ \n(⌐■_■)\nYEEEAAAAAHHHHHHHHHHHHH","tags":"#donger#yeah#sunglasses#pun","favourites":2,"__v":0,"created_on":"2015-04-02T05:27:04.777Z","score":0.00002703778799670418},{"_id":"551cab734fc8d40a57a6e374","id":1391,"pasta":"　　　　　　　　　　　 　 ∧__∧   \n　　　　　　　　　　　 　( ͡° ͜ʖ ͡°)   \n　　　　　　　　　　　  ☜　　   ☞   \n　　　　　　　　　　　　　(つ ﾉ   \n　　　　　　　　　　　　　 (ノ   \n　　　　　＼　　　　　　☆   \n　　　　　　　　　　　　　|　　　　　☆    \n　　　　　　　　　　(⌒ ⌒ヽ　　　/   \n　　　　＼　　（´⌒　　⌒　　⌒ヾ　　　／   \n　　　　　 （’⌒　;　⌒　　　::⌒　　）    \n　　　　　（´　　　　　）　　　　　:::　）　／   \n　　☆─　（´⌒;:　　　　::⌒`）　:;　　）    \n　　　　　（⌒::　　　::　　　　　::⌒　）   \n　　 　／　（　　　　ゝ　　ヾ　丶　　ソ　─","tags":"#reddit#ASCII#glitter#bomb#fairy","favourites":9,"__v":0,"created_on":"2015-04-02T02:37:35.006Z","score":0.00015282922459851583},{"_id":"551c3ed55a714a1e53683b99","id":1390,"pasta":"୧༼ಠ益ಠ༽୨QONK IS STRONK ୧༼ಠ益ಠ༽୨","tags":"#dota2#synderen#qonk#donger","favourites":1,"__v":0,"created_on":"2015-04-01T14:07:20.817Z","score":0},{"_id":"551bb2f95a714a1e53683b97","id":1389,"pasta":"Interstellar has, so fucking THOROUGHLY, driven me to an entirely new dimension of emotion. The characters and story are easily the absolute best, I've EVER seen. The special effects are jaw-dropping. The scientific accuracy is perfect. Literally perfect. The film drives you through intense emotion like no other film, dare I say it, ever will. There's one scene, which I will NOT spoil, that literally had me shaking in my seat, overwhelmed by a sense of pure intensity. My heart was ready to go out of my chest. I was sweating and breathing harshly. And when it ended, I was crying at the newfound realization of what a single scene can do. But that was ONE MOMENT, in a three-hour masterpiece. The music...oh my god, the music. The music is so brilliantly intense and emotional. It's the same three notes, played upon with different instruments and tempos and styles. A single theme which keeps coming back. But at several points, it begins with a simply synthesizer, and over the course of minutes, picks up, and up, and up, in what is EASILY the greatest musical crescendo I've ever encountered. Unlike almost any song, this melody NEVER silences as it plays. It never slows or whittles down. It only gets higher, and higher, and higher. The result is music that feels justifying of a grand realization of the nature of the entire Universe. Pure euphoria, in the most genuine sense. By the credits roll, I was frozen. And I remained until I was forced out. I went home without saying a word. Without doing anything except contemplating the unbelievable experience. When I settled in my room, for the first time in a decade- no, the first time in my ENTIRE LIFE, I cried myself to sleep. Even now as I type these thoughts I am at a complete loss for what to say. Nothing can possibly do the movie justice.","tags":"#general#interstellar#satire","favourites":2,"__v":0,"created_on":"2015-04-01T08:56:29.520Z","score":0.00002688495961842911},{"_id":"551bb2f65a714a1e53683b96","id":1388,"pasta":"I sexually identify as Trump. Ever since I was a boy I dreamed of soaring over the Twitch chat dropping hot sticky sub mode on disgusting memers. People say to me that a person being a streamer is impossible and I’m *** retarded but I don’t care, I’m playing Pokemon. I’m having a plastic surgeon install rotary teddy bears, 30 mm whiteboards and tattoo every local fast food chain's phone number on my body. From now on I want you guys to call me “Prison Trump” and respect my right to stream from my bedroom and talk the same way but with a slightly offensive attitude. If you can’t accept me you’re a valuephobe and need to check your money. Thank you for being so understanding.","tags":"#tuck#frump#trump#sexually#identify#hearthstone","favourites":6,"__v":0,"created_on":"2015-04-01T08:36:13.310Z","score":0.00010278835962039888},{"_id":"551b74ad972b3991479554ea","id":1387,"pasta":" \"★　　★ ° ☾ ☆ ¸. ¸ 　★　 :.　 . • ○ ° ★　 .　 *　.　.　　¸ .　　 ° 　¸. * ● ¸ .　...somewhere　　　° ☾ ° 　¸. ● ¸ .　　★　° :.　 . • ° 　 .　 *　:.　.in a parallel universe* ● ¸ 　　　　° ☾ °☆ 　. * ¸.　　　★　★ ° . .　　　　.　☾ °☆ 　. * ● ¸ ..We can spam memes...° ☾　★ °● ¸ .　　　★　° :.　 . • ○ ° ★　 .　 * () ☾　★ °● ¸ .　　　★　°\"","tags":"#twitch#parallel#universe#spam#galaxy","favourites":1,"__v":0,"created_on":"2015-04-01T03:34:16.882Z","score":0},{"_id":"551b749b972b3991479554e9","id":1386,"pasta":"﻿Ｉ＇ｖｅ  ｈｅａｒｄ  ｎｕｍｅｒｏｕｓ  ｒｅｐｏｒｔｓ  ｆｒｏｍ  ｐｅｏｐｌｅ  ｓａｙｉｎｇ  ｔｈｅ  ｇａｍｅ  ｗｏｎ＇ｔ  ｓｕｒｖｉｖｅ  ａ  ｆｅｗ  ｍｏｒｅ  ｙｅａｒｓ  ｄｏｗｎ  ｔｈｅ  ｔｒａｃｋ．  Ｄｏ  ｙｏｕ  ｂｅｌｉｅｖｅ  ｔｈｉｓ  ｔｏ  ｂｅ  ｔｒｕｅ  ａｎｄ  ｗｉｌｌ  ｔｈｅ  ｇａｍｅ  ｓｌｏｗｌｙ  ｄｉｅ  ｏｕｔ？  Ｔｏ  ｂｅ  ｈｏｎｅｓｔ，  Ｉ  ｈａｖｅ  ｂｅｅｎ  ｐｌａｙｉｎｇ  ａ  ｌｏｔ  ｌｅｓｓ  ＤＯＴＡ  ｏｖｅｒ  ｔｈｅ  ｐａｓｔ  ｆｅｗ  ｍｏｎｔｈｓ，  ｄｕｅ  ｔｏ  ｕｎｓｔａｂｌｅ  ｍｅｔａ  ａｎｄ  ｐｅｒｓｏｎａｌ  ｒｅａｓｏｎｓ．  Ｉ  ｈａｖｅ  ａｌｓｏ  ｓｔｏｐｐｅｄ  ｆｏｌｌｏｗｉｎｇ  ｐｒｏ  ｇａｍｅｓ，  ｓｉｎｃｅ  ａｌｌ  ｍｙ  ｆａｖｏｒｉｔｅ  ｔｅａｍｓ  ｌｉｋｅ  ｃｌｏｕｄ９  ｋｅｅｐ  ｒｏｔａｔｉｎｇ  ｔｈｅｉｒ  ｌｉｎｅｕｐ．  Ｉ＇ｍ  ｓｔｉｌｌ  ｅｎｔｅｒｔａｉｎｅｄ  ｂｙ  ＲＴＺ，  Ｂｕｌｌｄｏｇ  ａｎｄ  Ｓｉｎｇ＇ｓ  ｓｔｒｅａｍｓ  ｈｏｗｅｖｅｒ．","tags":"#dota2#dedgaem#rtz#singsing#bulldog#arteezy","favourites":2,"__v":0,"created_on":"2015-04-01T03:16:04.555Z","score":0.00002684295716863357},{"_id":"551b7499972b3991479554e8","id":1385,"pasta":"I sexually Identify as Ragnaros the Firelord. Ever since I was a boy I dreamed of soaring over the lava pits dropping hot fiery blasts on disgusting insects. People say to me that a person being Ragnaros is Impossible and I'm fucking retarded but I don't care, I'm beautiful. I'm having a plastic surgeon install lava flows and majestic horns on my body. From now on I want you guys to call me \"Ragnaros\" and respect my right to purge and purge by fire. If you can't accept me you're a elementaphobe and need to check your legendary privilege. Thank you for being so understanding.","tags":"#hearthstone#sexually#identify#ragnaros#rag","favourites":6,"__v":0,"created_on":"2015-04-01T02:23:07.830Z","score":0.00010261239582273395},{"_id":"551b7474972b3991479554e7","id":1384,"pasta":"Hi Treenis, I am trying to learn how to play Treant Protector. Should I skill Nature's Guise to blend in with Nazi mods? Should I skill Leech Seed to sap the life from twitch chat? Should I max Living armor to develop a wooden trunk like you? Or should I skill Overgrowth like you use to prevent Saenis from running away?","tags":"#treenis#way#wagamama#treenisway#dota2","favourites":1,"__v":0,"created_on":"2015-04-01T02:17:58.484Z","score":0}]