[{"_id":"551b7436972b3991479554e6","id":1383,"pasta":"░░░░░░░\n░░YEE░░░░▄▄▄██▀▀▀▀███▄░░░░░\n░░░░░░░▄▀▀░░░░░░░░░░░▀█░░░░\n░░░░▄▄▀░░░░░░░░░░░░░░░▀█░░░\n░░░█░░░░░▀▄░░▄▀░░░░░░░░█░░░\n░░░▐██▄░░▀▄▀▀▄▀░░▄██▀░▐▌░░░\n░░░█▀█░▀░░░▀▀░░░▀░█▀░░▐▌░░░\n░░░█░░▀▐░░░░░░░░▌▀░░░░░█░░░\n░░░█░░░░░░░░░░░░░░░░░░░█░░░\n░░░░█░░▀▄░░░░▄▀░░░░░░░░█░░░\n░░░░█░░░░░░░░░░░▄▄░░░░█░░░░\n░░░░░█▀██▀▀▀▀██▀░░░░░░█░░░░\n░░░░░█░░▀████▀░░░░░░░█░░░░░\n░░░░░░█░░░░░░░░░░░░▄█░░░░░░\n░░░░░░░██░░░░░█▄▄▀▀░█░░░░░░\n░░░░░░░░▀▀█▀▀▀▀░░░░░░█░░░░░\n░░░░░░░░░█░░░░░░░░░░░░█░░░░","tags":"#YEE#ASCII","favourites":4,"__v":0,"created_on":"2015-04-01T01:41:24.338Z","score":0.00005938427194423669},{"_id":"551b33a6972b3991479554df","id":1382,"pasta":"Wake up ᕕ( ՞ ᗜ ՞ )ᕗ\nGrab a brush and put a little make-up ☆*:. o(≧▽≦)o .:*☆\nHide the scars to fade away the shake-up ( ͡↑ ͜ʖ ͡↑)\nWhy'd you leave the keys upon the table? 乁( ⁰͡  Ĺ̯ ⁰͡ ) ㄏ\nHere you go create another donger (⊃｡•́‿•̀｡)⊃","tags":"#saod#donger#chop#suey#sleep","favourites":3,"__v":0,"created_on":"2015-03-31T23:53:58.258Z","score":0.000042357344043522324},{"_id":"551b33a0972b3991479554de","id":1381,"pasta":"YOOOO SO LOOK DA FIRST TIME I EVER GOT ON DIS RIDE I WAS WITH A WHITE FAMILY AND U KNOW WHITE FOLKS CRAZY SO DEY DONT FEAR ROLLER COASTERS OR DEATH IN GENERAL. AFTER ABOUT 10 MINUTES OF TELLIN DEM DAT I DIDNT WANNA GET ON I FINALLY SAID YES CUZ I AINT NEVER BEEN NO BITCH AND I DIDNT PLAN ON STARTING THAT DAY. WHEN DA ENGINEER SAID “PLS LEAN BACK AND KEEP THE BACK OF UR HEAD PRESSED AGAINST YOUR SEAT” AND I SAW EVERYBODY STICK DA BACK OF THEIR HEADS TO THE CHAIR I KNEW DAT I MADE DA WORST DECISION OF MY LIFE CUZ I EVEN SAW SOME BLACK FOLKS LISTEN AND U KNOW DAT WHEN BLACK PEOPLE LISTEN A WHITE LADY’S ADVICE , ITS DA REAL DEAL. SO MY FIRST MISTAKE WAS REFUSING TO PRESS MY HEAD AGAINST THE SEAT… THE RIDE TAKES OFF AND MY DOME SLAMS AGAINST THE CHAIR WHILE MY NECK SNAPPED… UNCONSCIOUS INSTANTLY.. WHEN I AWOKE FROM MY 3 SECOND SLUMBER WE HAD REACHED DA VERY TOP OF THE RIDE WHERE THE RIDE MAKES A QUICK PAUSE… WHEN THE RIDE MADE THAT PAUSE I OPENED MY EYES CAUSE I THOUGHT THE RIDE WAS OVER AND WE ALL MADE IT SAFELY. BOY WAS I WRONG… I OPENED MY EYES AND DA ONLY THING I SAW WAS A 300 FOOT DROP STRAIGHT TO DA GROUND SO I SAID “GOD YOU CANT LET ME DIE LIKE DIS”. I THINK I SUFFERED A HEART CONTUSION CUZ MY HEART JUST COMPLETELY STOPPED BEATING… AND THAN THE RIDE TAKES OFF AGAIN… WE MAKE THE 300 FOOT DROP AND I SCREAM MY LUNGS OUT AS IM SCARED TO DEATH BECAUSE DA ONLY TIME A HUMAN SHOULD BE DAT HIGH IN DA AIR IS WHEN THEIR SPIRIT IS BEING SUCKED INTO HEAVEN BY DA GRACE OF GOD.. SO WE SAFELY MAKE IT TO DA END OF DA RIDE AND WHEN WE GET OFF I STUMBLE OUT OF THE SEAT CUZ MY LEGS WENT NUMB AND ALL THE AIR WAS SUCKED OUT OF MY BODY SO I COULDNT TALK EITHER.. DA FIRST THING THESE CRAZY MOTHERFUCKERS TELL ME IS “HEY MAN LETS DO THAT AGAIN THAT WAS WICKED”. I LOOKED AT DEM AND I REALIZED DAT DIS WHITE KID DAT I BEFRIENDED WAS ACTUALLY SATAN. I NO LONGER HAVE ANY WHITE FRIENDS.","tags":"#general#white#friends#satan","favourites":1,"__v":0,"created_on":"2015-03-31T23:42:25.810Z","score":0},{"_id":"551b2bf5972b3991479554db","id":1380,"pasta":"Today we are going to discuss the racist and sexist undertones of chess.\nLet us start with the queen. Why is this piece considered to be the only female on the board? Her mobility and versatility make her highly desirable to capture, but these qualities are in fact a metaphor for he femininity, and the male pieces don't like the way she is able to express herself so well on the board, thus, when they try to oppress that aspect of her by capturing her, they are literally raping her, which is worse than death. For centuries, this game has been teaching people that women belong in the kitchen, and that they deserve to be raped. It's fucking disgusting.\nNext, we have the king. The king is the patriarch of the the board. THe objective of the game is to trap or capture him, obviously because he is male and 'men are so much better than women'. Yet the king is basically a neutered version of the queen, who is objectively more capable on all aspects, so why isn't the game focused on capturing her? I blame the patriarchy for this. His very title implies a great deal of heteronormativity. King and Queen, as if marriage should only ever occur between a man and a woman. Why couldn't we have another King instead of a queen or two queens? They should at least let players choose, as this is something that happened continually throughout history. Just look it up in any common textbook. But instead, racist misogynists insist on denying the historical record by misrepresenting the board, and, doing so, just by obeying the rules of the game, oppress entire demographics and minorities.\nThe bishops represent the religious patriarchy. They represent the church, advocating against homosexuality as if it was a sin, instilling in our minds the wrong and hurtful idea of slut shaming, perpetuating the biblical persecution and enslavement by evil white racists of 6 million minorities. They are scum and should be permanently removed from the board.\nIt's time to talk about the rook, it's phallic shape and large, hard exterior clearly suggest it is based on the penis, the symbol of absolute male power and control. It can be no coincidence that the penis happens to be one of the most effective at checkmating the opposing king. This proves the whole game is simply a way for guys to measure who has the bigger dick and flaunt it in your face. It's also why when the queen is captured by a rook, it is particularly egregious and sexually graphic and should be censored.\nThe knight is clearly promoting animal abuse, the poor horses are forced to jump over other pieces and go all over the place. Anything contrary to this view is just an excuse by the ignorant problematic chess players who have internalized their hatred for other forms of life. There can be no debate here, these people don't even deserve a platform to have their views be heard and they are killing chess.\nThe pawns have the distinction of being the only piece that can be rewarded for reaching the other end of the board. When this happens, they can be upgraded to any piece besides the king. In practice though, they only become queens. What does that say about trans individuals? The subtext here speaks volumes of bigotry and hatred of the highest order towards the trans community. Pawns are literally the worst pieces in the game, and it is a known fact that they are only good for sacrificing themselves to protect the other, \"better\" pieces. Indeed, one would have to be mentally ill to continuously throw themselves into suicidal situations as is often the case with the pawns, but trans individuals are not mentally ill, they are real human beings and have value and uniqueness in ALL of them.\nThis is why, in the future, proud feminists such as myself are going to lobby for the rules of chess to be changed in celebration of the individuality and worth of the pawns are real people. We're going to make it so they will randomly adopt the appearance of any of the other pieces so you racist shitlords won't be able to tell them apart from the other \"equal\" pieces (previously known as 'minor' and 'major' pieces, and separate from 'lowly' pawns). Furthermore each pawn will now move in one random direction each, instead of all of them only going forward. Finally, it will no longer be a legal move to put your pawns in a positions where you know they could be attacked, much like you can do a move that puts the king in check. These RNG factors will be determined on a per game basis and together will help protect pawns against continued abuse and persecution as well as bring equality to this shitty game. For too long the king has been the only piece important enough to not be able to move into check or be killed. No more. One might say it's time for the king to check his privilege.\nNow let us turn to the coloration of the game pieces. Black and white. Guess which side by rule, ALWAYS gets to go first? This is a huge advantage and a privilege for the white side, but do they really deserve it? If so, by what merit, other than the color of their skin? Is there any possible reason why the first turn couldn't alternate, other than fucking racism? The whole white being superior and black inferior is a false dichotomy that is reflective of the worldview of whoever invented this game for 'intellectuals', even though it might as well be called 'i have a bigger dick than you: the game'. The rules in general are rooted in hate and animal abuse, and are too confusing for minorities and the handicapped, and they create an unfair disadvantage for female players who tend to be more in touch with their emotions whereas men don't have to focus on that and can focus purely on logic. That's why in the near future the rules of chess shall be changed so that both sides get to go first, and they are the same color, and the color is a mixture of both black and white. If you don't like it deal with it shitlords. Chess isn't your private little boys club anymore, stop crying because you just want to have a male dominated space where there's no women allowed. The women and minority hordes are here we and demand you fucking accommodate us.\nFinally we'll talk about the grid. It needs to be changed. It's a representation of the rigid social order enforced by the white shitlord CISHET patriarchy, defining where people can walk and what they can do. Clearly this is extremely oppressive and this is further compounded when you see the restrictive movement that pieces like the pawns can do. We need to change the entire system that encourages oppression, not just the oppressors. Therefore I propose a gridless playing fields where everyone can move their pieces according what they feel is right.","tags":"#tumblr#tumblrista#chess#racist","favourites":2,"__v":0,"created_on":"2015-03-31T23:02:25.569Z","score":0.000023772255578018444},{"_id":"551b2be2972b3991479554da","id":1379,"pasta":"ＨＥＹ ＡＫＲＯＭＡ， Ｉ＇Ｍ ＴＲＹＩＮＧ ＴＯ ＬＥＡＲＮ ＴＯ ＰＬＡＹ ＡＢＡ﻿ＮＤＯＮ． Ｉ ＪＵＳＴ ＨＡＶＥ Ａ ＱＵＥＳＴＩＯＮ ＡＢＯＵＴ ＴＨＥ ＳＫＩＬＬ ＢＵＩＬＤ ： ＳＨＯＵＬＤ Ｉ ＭＡＸ ＭＩＳＴ ＣＯＩＬ ＬＩＫＥ ＹＯＵ ＤＥＮＹ ＹＯＵＲＳＥＬＦ ＦＲＯＭ ＴＨＥ ＧＡＭＥ， ＡＰＨＯＴＩＣ ＳＨＩＥＬＤ ＳＯ Ｉ ＣＯＵＬＤ ＲＥＭＯＶＥ ＢＵＦＦ ＬＩＫＥ ＹＯＵ ＲＥＭＯＶＥＤ ＹＯＵＲＳＥＬＦ ＦＲＯＭ ＴＨＥ ＧＡＭＥ ＯＲ ＣＵＲＳＥ ＯＦ ＡＶＥＲＮＵＳ ＳＯ Ｉ ＣＯＵＬＤ ＣＵＲＳＥ ＰＥＯＰＬＥ ＬＩＫＥ ＹＯＵ ＣＵＲＳＥＤ ＳＩＮＧＳＩＮＧ","tags":"#singsing#dota2#akroma#abaddon#abandon#build","favourites":2,"__v":0,"created_on":"2015-03-31T22:29:37.762Z","score":0.000023772255578018444},{"_id":"551b2bc7972b3991479554d9","id":1378,"pasta":"I believe that Hank Hill is one the most complex and realistic characters in Animation. Although on the surface he appears to be nothing more than a redneck, if you actually watch the show and read between the lines, he's a lot more. Hank Hill, and by extension King of The Hill as a whole, is at its core about showing that one group is not always right, and one group is not always wrong. It's not just blind Liberal bashing by some angry Texans, or angsty Liberal bawwing like Family Guy, it's somewhere in the middle. Hank is a man who represents traditional family values. He works a just-above blue collar job, has an ugly wife, and a kid he fails to understand. He enjoys working on his lawn, grilling, and selling propane (and propane accessories). because he represents traditional values, he often butts heads with newer, more liberal ideas. Now about half the time, he will have a hard time adjusting, but ultimately realize that it isn't that bad, or is even correct. But the other half of the time, he exposes it for the bullshit it is and tries to save those who have been brainwashed. And that's the thing, Hank isn't a racist or Homophobe, or even a devout Republican. If that was the point of the show, he would have voted for Bush in that one episode. No, Hank is a good man who just has a hard time adjusting. Hank stands by his family, his friends, and his family values, and this is why he is a good character. He has a hard time understanding his son, like a lot of parents, but ultimately loves him and accepts him for what he is. When you really get down to it, Hank is so much more than your average sitcom father. Unlike the bumbling Homer, he is a very real man who many people can relate to THEIR fathers. he is the next progression in mature cartoons and sitcoms, a complex character, not a 1 dimensional caricature. In short, he is the Average Joe the typical person represents, and that's a good thing","tags":"#general#hank#hill#america","favourites":2,"__v":0,"created_on":"2015-03-31T22:07:00.553Z","score":0.000023772255578018444},{"_id":"551b2bbe972b3991479554d8","id":1377,"pasta":" ░░░░▓▓▀▀██████▓▄▒▒░░卐░ ░░░▀░░░░░░▀▀▀████▄HITLER ░░▌░░░░░░░░░░░▀███▓DID░ ░▌░░░░░▄▄▄░░░░░░▐█NOTHING ░▄▓▀█▌░▀██▀▒▄░░░▐▓▓▓WRONG ░█▌░░░░░▀▒░░░▀░░░▐▓▒▒░░ ░▌▀▒▄▄░░░░░░░░░░░░░▄▒░░ ░▒▄█████▌▒▒░░░░░░░▒▌▒卐░ ░░▓█████▄▒░▒▒▒░░░░░▐░░░ ░░▒▀▓▒░░░░░░░▒▒░▒▒▒▄░卐░ ░░▓▒▒▒░░░░░░▒▒▒▒▒░▓░░░░ ░░████▄▄▄▄▓▓▓▒▒░░▐░░卐░░░░▀██████▓▒▒▒▒▒░▐░","tags":"#ASCII#hitler#did#nothing#wrong","favourites":3,"__v":0,"created_on":"2015-03-31T21:52:41.674Z","score":0.000042357344043522324},{"_id":"551b2bb5972b3991479554d7","id":1376,"pasta":"Ｈｅｙ ｓｉｎｇｓｉｎｇ ｃａｎ ｙｏｕ ｔｅａｃｈ ｍｅ ｈｏｗ ｔｏ ｐｌａｙ ｓｌａｒｋ？ Ｄｏ Ｉ ｌｅｖｅｌ ｐｏｕｎｃｅ ｆｉｒｓｔ ｌｉｋｅ ｙｏｕ ｐｏｕｎｃｅｄ ｏｎ Ｆｗｏｓｈ？ Ｄａｒｋ ｐａｃｔ ｌｉｋｅ ｔｈｅ ｄａｒｋ ｐａｃｔ ｙｏｕ ｍａｄｅ ｗｉｔｈ ｙｏｕｒ ｔｅａｍ ｔｏ ｎｅｖｅｒ ｓｔｒｅａｍ ａｇａｉｎ？ Ｏｒ ｅｓｓｅｎｃｅ ｓｈｉｆｔ ｌｉｋｅ ｙｏｕ ｓｈｉｆｔｅｄ ａｌｌ ｙｏｕｒ ｐｒｉｏｒｉｔｉｅｓ ｆｒｏｍ ｙｏｕｒ ｌｏｙａｌ ｆａｎｓ？","tags":"#dota2#singsing#fwosh#slark#build","favourites":7,"__v":0,"created_on":"2015-03-31T20:38:27.486Z","score":0.00010581074350563556},{"_id":"551afe17972b3991479554d1","id":1375,"pasta":"EVERY MORNING I WAKE UP AND OPEN PALM SLAM A VHS INTO THE SLOT. ITS EVE IS EASY AND RIGHT THEN AND THERE I START DOING THE MOVES ALONGSIDE WITH THE MAIN CHARACTER, SUITONIA. I DO EVERY MOVE AND I DO EVERY MOVE HARD MAKIN WHOOSHING SOUNDS WHEN I SLAM DOWN SOME GARMURS WITH A KESTREL. NOT MANY CAN TALK ABOUT A KESTREL FOR 5 HOURS, BUT I CAN. I SAY IT AND I SAY IT OUT LOUD EVERYDAY TO PEOPLE IN MY HIGHSCHOOL AND ALL THEY CAN STILL BE IMMATURE JERKS. 2 HOURS INCLUDING WIND DOWN EVERY MORNING","tags":"#EVE#SUITONIA","favourites":2,"__v":0,"created_on":"2015-03-31T19:37:07.780Z","score":0.000023772255578018444},{"_id":"551ae6e6972b3991479554cf","id":1374,"pasta":"Hey Zai, I’m trying to learn to play Bristleback. I just have a question about the skill build. Should I max Nasal Goo like how you spew bullshit about IG vs VG, Quill Spray so I can spray bullshit all over chat or Warpath like how you declared war against Twitch Chat?","tags":"#dota2#zai#twitch#IG#Vici","favourites":2,"__v":0,"created_on":"2015-03-31T14:41:56.443Z","score":0.000023772255578018444},{"_id":"551ae6bb972b3991479554ce","id":1373,"pasta":"Dota 2 is dying. We have this CSGO caster casting our Dota 2 games. I am a small baby with cancer, and my dying wish is to see my favorite game Dota 2 casted by actual Dota 2 casters, not a CSGO caster wannabe. Please copy and paste my story after I die. Goodbye cruel world, I hope you all will not have to listen to CSGO casters such as Toby.","tags":"#dota2#tobiwan#toby#CSGO","favourites":0,"__v":0,"created_on":"2015-03-31T10:11:17.430Z","score":0},{"_id":"551ae6ad972b3991479554cd","id":1372,"pasta":"Guys please stop spamming. My dog, Bernard, looked at my chat and got so dizzy because of the spam that he fell down and hit his noggin right on his food bowl! He couldn’t talk for hours. Please stop spamming, for Bernard.","tags":"#twitch#chat#spam#bernard","favourites":1,"__v":0,"created_on":"2015-03-31T16:53:24.048Z","score":0},{"_id":"551a5e692ee6f05c44f93110","id":1371,"pasta":"░░░░░░░░░░▄▄▄▄░░░░░░ ░░░░░░░▄▀▀▓▓▓▀█░░░░░ ░░░░░▄▀▓▓▄██████▄░░░ ░░░░▄█▄█▀░░▄░▄░█▀░░░ ░░░▄▀░██▄░░▀░▀░▀▄░░░ ░░░▀▄░░▀░▄█▄▄░░▄█▄░░ ░░░░░▀█▄▄░░▀▀▀█▀░░░░ ░░░░░░░█▄▄░░░░█░░░░░ ░░░░░░░█░░░░▀▀█░░░░░ ░░░░░░░█▀▀▀░▄▄█░░░░░ ░░░░░░░█░░░░░░█▄░░░░ ▄▄▄▄██▀▀░░░░░░░▀██░░ ░▄█▀░▀░░░░▄░░░░░░█▄▄ ▀▀█▄▄▄░░░▄██░░░░▄█░░","tags":"#ASCII#mario#dick","favourites":0,"__v":0,"created_on":"2015-03-31T04:03:43.627Z","score":0},{"_id":"551a5e592ee6f05c44f9310f","id":1370,"pasta":"░░░░░░░░░░░░░░░░░░░░░░░HEY░░░░ ░░▄▀░░░▄░░░▄▀▀▄▀▄░░░░░CORE54░░░ ░█░░░░▐▐░░█░░▐▐░░▐░░░░░░▄▄░░░░ ░█░░░░░▀░░░▀▄░▀░░▐░░░░░▐░░▐░░░ ░█░░░░░░░▄░░▐░░░░▐░░░▄▄▐░░▐▄▄░ ░░▀▄░░░░▄░▀▀░▄░░▄▀░░▐░░▐░░▐░▐░ ░░░░▀░░░░▀▀▀▀░░▀░░░░▐░░░░░░░▐░","tags":"#dota2#hey#core54","favourites":0,"__v":0,"created_on":"2015-03-31T03:41:55.094Z","score":0},{"_id":"551a5e562ee6f05c44f9310e","id":1369,"pasta":" ╠═══╣Lets build a ladder╠═══╣","tags":"#lets#build#a#ladder#dota2","favourites":11,"__v":0,"created_on":"2015-03-31T03:32:23.022Z","score":0.00016195849188922848}]