[{"_id":"551a0ef35cb20f82414e7c95","id":1368,"pasta":":P:L:A:Y:P:A:Y:D:A:Y:2:N:O:T:T:H:I:S:F:U:C:K:I:N:G:G:A:M:E","tags":"#twitch#payday#badgem\n","favourites":0,"__v":0,"created_on":"2015-03-31T00:17:56.226Z","score":0},{"_id":"551a0eee5cb20f82414e7c94","id":1367,"pasta":"ヽ༼ຈل͜ຈ༽ﾉ TVEN TU TVELV ヽ༼ຈل͜ຈ༽ﾉ","tags":"#csgo#norwegianenglish#tradeups#cases","favourites":0,"__v":0,"created_on":"2015-03-31T02:13:00.852Z","score":0},{"_id":"5519d4cb6aff47dc40d56c54","id":1366,"pasta":"In all honesty, the pause is a part of my life now. I console my bladder up until the draft ends coz I know there will be a pause for sure for me to go pee and pick up a beer on the way back so I can pee again for the next match.","tags":"#dota2#pause#bladder","favourites":1,"__v":0,"created_on":"2015-03-30T21:53:58.693Z","score":0},{"_id":"5519bd99ea38169238159dba","id":1365,"pasta":" ᶫᶦˢᵗᵉᶰ ᵘᵖ ᵐᵒᵗʰᵉʳᶠᵘᶜᵏᵉʳˢ ʸᵒᵘ ᵃʳᵉ ᵃᶫᶫ ᵃᶜᵗᶦᶰᵍ ʷᵃʸ ᵒᵘᵗ ᵒᶠ ʰᵃᶰᵈ ᵃᶰᵈ ᶰᵒᵗ ᵃᶜᵗᶦᶰᵍ ᶦᶰ ᵃᶜᶜᵒʳᵈ ʷᶦᵗʰ ᵗʷᶦᵗᶜʰ ᵖᵒᶫᶦᶜᶦᵉˢ ʷᶦᵗʰ ᵃᶫᶫ ᵗʰᶦˢ ˢᵖᵃᵐᵐᶦᶰᵍ ᵃᶰᵈ ʸᵒᵘ ᵃʳᵉ ᵃᶫˢᵒ ʳᵘᶦᶰᶦᶰᵍ ᵗʰᶦˢ ᶜʰᵃᵗ ʷʰᶦᶜʰ ᴵ ᵖᵃʸ $4⋅99 ᵃ ᵐᵒᶰᵗʰ ᵗᵒ ᵉᶰʲᵒʸ ᵃᶰᵈ ᴵ ˢʷᵉᵃʳ ᵗᵒ ᵍᵒᵈ ᶦᶠ ᴵ ˢᵉᵉ ᵃᶰʸᵒᶰᵉ ᶜᵒᵖʸ ᵃᶰᵈ ᵖᵃˢᵗᵉ ᵗʰᶦˢ ᴵ'ᵐ ᶜᵃᶫᶫᶦᶰᵍ ᵗʰᵉ ᶜᵒᵖˢ","tags":"#twitch#policies#motherfuckers#ruining#chat","favourites":2,"__v":0,"created_on":"2015-03-30T21:04:55.541Z","score":0.000015248148804916087},{"_id":"5519b5dbea38169238159db8","id":1364,"pasta":"Id just fucking quit stupid bitch cunts. Id then the time to learn how to find people and where they live, if also hack all their shit, id send off all their steam items then get their account VAC banned many times and possibly deleted. Send them death threats, then find them and take their kidneys out and cuts all their fingers off and shove them up their ass all while saying \"it's a prank\" in a stupid fudge packing rainbow cowboy 10 year old CoD fag little bitch no balls voice over and over again. Then recorded it and blast it through super expensive speakers over and over again while the speakers are on the highest volume and basically inside their stupid fucking ears.\n\nFuck them. ﻿","tags":"#csgo#quit#mad#salt@PJSalt","favourites":0,"__v":0,"created_on":"2015-03-30T17:42:07.575Z","score":0},{"_id":"5519b5d4ea38169238159db7","id":1363,"pasta":"ｊｏｉｎＤＯＴＡ, ｐｌｅａｓｅ ｓｔｏｐ ＤＤｏＳｉｎｇ ＢＴＳ, ｉ ｗａｎｔ ｔｏ ｗａｔｃｈ ｆａｎｔａｓｔｉｃ ｇａｍｅ ｏｆ Ｃ9.ＥｔｅｒｎａｌＥｎｖｙ ｔｈｒｏｗｉｎｇ ａｇａｉｎｓｔ Ｅｍｐｉｒｅ.","tags":"#dota2#ddos#bts","favourites":0,"__v":0,"created_on":"2015-03-30T10:18:04.494Z","score":0},{"_id":"5518bb5a693253a057a92506","id":1362,"pasta":"\"Be like salt making its way through cracks. Do not be assertive, but adjust to the object, and you shall find a way around or through it. If nothing within you stays rigid, outward things will disclose themselves. Empty your mind, be formless. Shapeless, like salt. If you put salt into a cup, it becomes the cup. You put salt into a bottle and it becomes the bottle. You put it in a teapot, it becomes the teapot. Now, salt can flow or it can crash. Be salt, my friend.\" - Peter ppd Pandam","tags":"#dota2#peter#dager#ppd#salt#quote","favourites":2,"__v":0,"created_on":"2015-03-30T02:28:17.958Z","score":0.000015198582686783532},{"_id":"5518b32c693253a057a92504","id":1361,"pasta":"\"I can play 69 stars. I have 4 mouses, 2 for my hands, 2 for my feet.\"","tags":"#osu#vidya#videogames#games#game#gaming\n","favourites":0,"__v":0,"created_on":"2015-03-30T02:04:24.466Z","score":0},{"_id":"55189735693253a057a92502","id":1360,"pasta":"As someone who is nearing 200 games of Techies, it is getting more and more frequent that I have a member of the opposite team finding and dewarding my mines, even after smoking in and knowing they do not have ward vision. Many of the times they are in very obscure spots, and I have even put them in useless spots to see if they would find them. Time after time they know exactly where they are, and after watching the replays, they never know that I am ever in the area OR placing mines there. This happens at least every 8-14 games out of 100, and it get quite annoying only being able to kill people with mines only recently placed. Out of the 14 games this has happened, 8 of them were DCs of the person dewarding them, just to come back and find them. the other 6 were just highly suspicious, but it wasn't blatant. This is ruining games and there is no reason someone should be able to cheat in this way. Even if I am able to still manage a ~65% winrate with this being a thing, I think 70% would be possible without it.\nI do not see a problem in making mines unviewable in spectate mode until the game is over, or giving casters in premades elevated privileges to see them, or even blocking spectators from the same IP as a player in the game. I understand that it might be a complex task to tackle, but ward/mine sniping via streams/spectate is becoming really rampant as I play more.","tags":"#dota2#techies#mines#200#games","favourites":1,"__v":0,"created_on":"2015-03-29T23:48:02.239Z","score":0},{"_id":"55188bc6693253a057a924ff","id":1359,"pasta":"(▀̿Ĺ̯▀̿ ̿) This is the throw Police, You're coming with us C9. (▀̿Ĺ̯▀̿ ̿)","tags":"#dota2#c9#throw#police","favourites":16,"__v":0,"created_on":"2015-03-29T22:52:39.260Z","score":0.00014507964469930132},{"_id":"5518427d693253a057a924fd","id":1358,"pasta":"Anyways, ask him \"what would you do if he woke up one night the night after his dad died in a car accident. However, he woke up with no nipples. Then he learns that his dad had been putting on lipstick and sucking the spot where his nipples should be. Not for a sexual reason, but to make it seem like you had nipples like everyone else, so you could fit in. He did it every day. Since he died, he now has no nipples.\" What would he do if that happened?","tags":"#reddit#ama#wtf","favourites":2,"__v":0,"created_on":"2015-03-29T18:15:01.843Z","score":0.000015176779164066968},{"_id":"55184274693253a057a924fc","id":1357,"pasta":"༼ つ ◕_◕ ༽つ  shazamicon  TAKE MY ENERGY VIAGAME༼ つ ◕_◕ ༽つ  shazamicon  TAKE MY ENERGY VIAGAME༼ つ ◕_◕ ༽つ  shazamicon  TAKE MY ENERGY VIAGAME༼ つ ◕_◕ ༽つ  shazamicon  TAKE MY ENERGY VIAGAME༼ つ ◕_◕ ༽つ  shazamicon  TAKE MY ENERGY VIAGAME","tags":"#viagameHS#energy#power#disconnected#hearthstone","favourites":1,"__v":0,"created_on":"2015-03-29T14:09:18.487Z","score":0},{"_id":"5517a43dd926d7b83d0f3b0d","id":1356,"pasta":"slack you are single handedly responsible for ruining dotacinema. i remember when i was a young boy i used to look up to the people in dotacinema but now tards like you get to cast and that makes me sad. what have you ever done to deserve this? you need to fucking just stop this and let dotacinema have quality over quantity","tags":"#siractionslacks#dotacinema#dota2#sunsfan","favourites":4,"__v":0,"created_on":"2015-03-29T06:49:24.208Z","score":0.0000378368729782093},{"_id":"551791e0d926d7b83d0f3b0b","id":1355,"pasta":"What the fuck did you just fucking say about me, you little shit? Ill have you know I graduated top of my stream in the NLSS, and I've been involved in numerous secret raids on BaerTaffy, and I have over 300 confirmed Mega Stan kills. I am trained in the indie ways and Im the Top Isaac in the entire Roundtable. You are nothing to me but just another viewer. I will ignore you the fuck out with RNG the likes of which has never been seen before on this Earth, mark my fucking words. You think you can get away with saying that shit to me over the Internet? Think again, fucker. As we speak I am contacting my secret network of Youtubers across the Canada and your IP is being traced right now so you better prepare for the spam, Fuck boy. The spam that wipes out the pathetic little thing you call your life. Youre fucking dead, kid. I can be anywhere, anytime, and I can raid you in over Sixty Nine ways, and thats just with DraculaFetus. Not only am I extensively trained Rushing Boss Rush, but I have access to the entire egg supply  of the Canadian Mounted Police and I will use it to its full extent to downvote your dank ass off the face of the continent, you little shit. If only you could have known what unholy retribution your little clever comment was about to bring down upon you, maybe you would have held your fucking tongue. But you couldn't, you didnt, and now youre paying the price, you goddamn idiot. I will shit fury all over you and you will drown in it. Youre fucking dead, kiddo.","tags":"#northernleeno#twitch#badrats","favourites":4,"__v":0,"created_on":"2015-03-29T05:29:33.025Z","score":0.0000378281004206083},{"_id":"55178d02d926d7b83d0f3b09","id":1354,"pasta":" ＢＡＴＴＬＥ ＲＯＹＡＬＥ ＷＩＮＮＥＲ ＧＥＴＳ ＡＬＬ ＴＨＥ  [̲̅$̲̅(̲̅ ͡° ͜ʖ ͡°̲̅)̲̅$̲̅]\nᕙ༼ຈلຈ༽ᕗ ＶＳ (̿▀̿ ̿Ĺ̯̿̿▀̿ ̿)̄\nＢＥＧＩＮ\n(⌐■_■)=/̵͇̿̿/'̿'̿̿̿ ̿ ̿̿ (ʘᗩʘ')\nＥＮＤ\nＤＯＮＧＥＲ ＧＥＴＳ ＡＬＬ ＴＨＥ  [̲̅$̲̅(̲̅ ͡° ͜ʖ ͡°̲̅)̲̅$̲̅] [̲̅$̲̅(̲̅ ͡° ͜ʖ ͡°̲̅)̲̅$̲̅] [̲̅$̲̅(̲̅ ͡° ͜ʖ ͡°̲̅)̲̅$̲̅]\n","tags":"#donger#fight#vsbills","favourites":4,"__v":0,"created_on":"2015-03-29T05:15:56.625Z","score":0.000037826605974048006}]