[{"_id":"54b2eb95ce7b585004706d91","id":11,"pasta":"Dear Mitchel \"QutePie\" Stamina, I have to wirite an essay of 10 words about everyting but YAYO due tomorrow. Unfortunately, YAYO is all I know. Please help.","tags":"#lol#imaqtpie#essay#yayo","favourites":23,"__v":0,"created_on":"2015-01-11T21:20:45.708Z","score":0.0010909476703781975},{"_id":"54bfdee23b0a330105ff5cb7","id":425,"pasta":"When a pro dota player got in a car crash, blinded, hands broken, all his dream is lost after 5 years of dota, when finally he discovers hope again, he discovers LoL, which allowed him to play even with disabilities!","tags":"#dota2#lol#car#crash#disabilities#hope","favourites":13,"__v":0,"created_on":"2015-01-21T12:30:50.993Z","score":0.0007786462943093719},{"_id":"54b5a513e90c10d22e88b99f","id":142,"pasta":"Hello guys, I'm back from my 600 second timeout. During that time I was able to finish my 200 page PhD thesis on the topic of Nazi Germany. My thesis is that Nazi fascist beliefs are carried on by imqtpie's twitch tv moderators, who like to act as if they themselves were literally Hitler.","tags":"#lol#imaqtpie#nazi#mods#hitler#thesis","favourites":11,"__v":0,"created_on":"2015-01-13T23:06:55.853Z","score":0.0005852503466592784},{"_id":"54b2eb94ce7b585004706d90","id":10,"pasta":"Hello Michael Santana,my name is Rabia AKA Nįghtblúê3,and I am furious that you blacklisted my name.I am reporting you to twitch.Don't copy paste this or I will report you too","tags":"#lol#nightblue3#nightblue#imaqtpie","favourites":10,"__v":0,"created_on":"2015-01-11T21:20:00.061Z","score":0.0005179844247191184},{"_id":"54b2eb97ce7b585004706d92","id":12,"pasta":"@Imaqtpie My niece turn 14 today and she's watching your stream Can you please say \"Happy birthday Lea from uncle Moe Lester\" ?","tags":"#lol#imaqtpie#molester#niece","favourites":7,"__v":0,"created_on":"2015-01-11T21:21:16.209Z","score":0.0003694708906958786},{"_id":"54b2ee69ce7b585004706db7","id":30,"pasta":"Greeting Michael, this is your Mother. I heard earlier that you \"maybe\" 420 blaze it. I am very concerned. I dont like that Pobelter boy and I dont think you should hang out with him anymore. I hope the rest of you concerned mothers in twitch chat will copy paste this so my son will see..","tags":"#lol#imaqtpie#mother#weed","favourites":6,"__v":0,"created_on":"2015-01-11T21:41:29.067Z","score":0.000317464589623415},{"_id":"54b2ee6fce7b585004706dbc","id":35,"pasta":"@imaqtpie which champion would you have consensual sex with in the missionary position for the sole purpose of procreation after getting married and having your finances sorted out, staring lovingly into each other's eyes while HOLDING HANDS","tags":"#lol#imaqtpie#disgusting#missionary","favourites":6,"__v":0,"created_on":"2015-01-11T21:33:28.932Z","score":0.0003174358151775306},{"_id":"54b5a4bbe90c10d22e88b99d","id":141,"pasta":"\"gotta pay the bills somehow, some people like sucking dick and some people like playing in the lcs. i like both equally\" - imaqtpie","tags":"#lol#imaqtpie#lcs#sucking#dick","favourites":6,"__v":0,"created_on":"2015-01-13T23:05:25.825Z","score":0.0003284549146608972},{"_id":"54b2ee6cce7b585004706dba","id":33,"pasta":"Hey Mr QTPIE, This is John's mother I would love it if you turned down this \"African american\" music down a notch so my son doesn't get corrupted. God Bless you.","tags":"#lol#imaqtpie#rap#john#music","favourites":5,"__v":0,"created_on":"2015-01-11T21:32:24.768Z","score":0.00026356778113977285},{"_id":"54b2ee72ce7b585004706dbe","id":37,"pasta":"Michael \"The PIE\" Santana, this is your mother speaking. Did I just hear that you became a sellout? I did not raise my donger like this, please call home, Michael. I am concerned about you, and what is this about wanting to go into gay pornography?","tags":"#lol#imaqtpie#sellout#porn#mother","favourites":5,"__v":0,"created_on":"2015-01-11T21:34:35.126Z","score":0.0002635742672999425},{"_id":"54b2ee76ce7b585004706dc1","id":40,"pasta":"Hello twitch chat. This is michaels mother speaking. Please stop the spam in the chat. I can't read the amazing conversations that you are having about my son. Thanks. Don't copy and paste this to spam more or I will tell Michael to ban you all.","tags":"#lol#imaqtpie#spam#mother","favourites":5,"__v":0,"created_on":"2015-01-11T21:37:49.907Z","score":0.00026358395945967015},{"_id":"54b5a299e90c10d22e88b997","id":138,"pasta":"What the fuck did you just fucking say about me, you little feeder? I’ll have you know I reached top of the ladder in season 3, and I’ve been involved in numerous secret ddos attacks on streamers, and I have over 300 confirmed pentakills. I am trained in lasthitting and I’m the best Caitlyn in the entire OGN. You are nothing to me but just another stack. I will wipe you the fuck out with skillshots the likes of which have never been seen before on this elo, mark my fucking words. You think you can get away with flaming me in all-chat? Think again, bronzie. As we speak I am contacting my secret network of subscribers across Korea and your IP is being traced right now so you better prepare for the ddos, noob. The ddos that wipes out the pathetic little thing you call your mmr. You’re fucking dead, kid. I can be anywhere, anytime, and I can kill you in over seven hundred ways, and that’s just with my autoattacks. Not only am I extensively trained in jungle invades, but I have access to the entire arsenal of the League of Legends skin shop and I will use it to its full extent to wipe your miserable ass off the Summoner's Rift, you little shit. If only you could have known what unholy retribution your little “secured” killsteal was about to bring down upon you, maybe you wouldn't have wasted your fucking ult. But you couldn’t, you didn’t, and now you’re paying the price, you goddamn idiot. I will shit fury all over you and you will drown in it. gg easy, noobs.","tags":"#lol#league#of#legends#navy#seal#300#confirmed","favourites":5,"__v":0,"created_on":"2015-01-13T22:56:10.273Z","score":0.0002726908808223546},{"_id":"54b5a451e90c10d22e88b99b","id":140,"pasta":"@Imaqtpie is there a HYPER LEARNING PLATFORM website where one can watch GUIDES and VIDEOS of such nature to IMPROVE their own personal skill. Also loved by over 1 MILLION PEOPLE?","tags":"#lol#imaqtpie#skillcapped#skill#capped#hyper#learning","favourites":5,"__v":0,"created_on":"2015-01-13T23:03:40.916Z","score":0.0002727147209233397},{"_id":"54b2eb91ce7b585004706d8e","id":8,"pasta":"Hi me name is Kowak and I are from Poland. Sorry for me bed England. I works in a shop, and i only earn a little money. So to afford an computer i had to selled me girlfriend. But I cant play LOL? Me heard that someone say something about internett, but what is internett? Ples help me poor human from poland. And no copy pasterino trollerino","tags":"#lol#polish#league#of#legends#internet","favourites":4,"__v":0,"created_on":"2015-01-11T21:18:30.558Z","score":0.00020735204290422},{"_id":"54b2ee6ace7b585004706db8","id":31,"pasta":"Hi Michael it's Jarl Balgruuf the Greater. I heard you are trying to play other games when we need you here at Skyrim to clean up the dragons. Quit what you are doing right now and come join me as the new Whiterun Thane. My axe is ready as your reward.","tags":"#lol#imaqtpie#skyrim#jarl","favourites":4,"__v":0,"created_on":"2015-01-11T21:42:27.035Z","score":0.00020740827785464174}]