[{"_id":"55bd5ff1f300bfdf5990c0e2","id":1951,"pasta":"Once upon a time, I opened a LoL game. I entered the game, and I was promptly greeted by another player. I noticed it was a female player and I was pleasantly surprised. I told her of my great love for the female anatomy, particularly the breasts and the backside. To my surprise, she told me she also enjoyed these things. It was then that I realised, I was playing League of Lesbians.....","tags":"#lol#league#of#lesbians#dota2","favourites":22,"__v":0,"created_on":"2015-08-02T00:10:25.569Z","score":0.005225669057754768},{"_id":"55bd5f8cf300bfdf5990c0d9","id":1942,"pasta":"A Dota player and a LoL player walks into a bar. The Dota gamer turns around to the LoL gamer saying, \"LoL sucks!\" The LoL player couldn't deny. ","tags":"#dota2#lol#deny#joke","favourites":22,"__v":0,"created_on":"2015-08-02T00:08:44.323Z","score":0.005225308367589037},{"_id":"5566b258dac4eb127bdadaad","id":1683,"pasta":"(∩ ͡° ͜ʖ ͡°)⊃━☆ﾟ. ･ ｡ﾟMy dick is small, my butthole is leaky, I use this chant, to summon Sneaky","tags":"#LoL#Cloud9#Sneaky","favourites":36,"__v":0,"created_on":"2015-05-27T18:48:10.075Z","score":0.0013623705666015273},{"_id":"55408fc6107beab4641ec2cf","id":1545,"pasta":"LoL>Dota, in dota you kill your own minion WutFace are u traitor? EleGiggle why in dota can you buy a ''battlefury'' on the market for 30 dollars and get a 4000 gold item for free at level 1? FailFish balanced game, dota is also made by unknown company named ''steam'', who is this ''steam''? this ''steam'' is scamming your life, LoL is made by riot, riot is good company who releases balanced champions,  LoL also have lots of skins like mlg teemo, spacesuit teemo, swimsuit teemo, sexy bikini teemo, etc, LoL>Dota","tags":"#dota2#lol#comparisons#skins","favourites":54,"__v":0,"created_on":"2015-04-29T05:10:03.757Z","score":0.0013520790878027023},{"_id":"55b96125a92005fc4d048607","id":1932,"pasta":"trynd's village was killed\n'why did you kill my village' asked trynd to man who kill village\n'nothing personnel kid' he replied, tipping his fedora\nthen trynd was mad\nthe end","tags":"#leagueoflegends#lol#tryndamere#lore","favourites":6,"__v":0,"created_on":"2015-07-29T23:26:29.595Z","score":0.0013375179284826483},{"_id":"55bd5f95f300bfdf5990c0da","id":1943,"pasta":"hello i am selling elo boost for $6.99/second, if you are interested please contact me @ xiaoweixiao on skype","tags":"#lol#xwx#eloboost","favourites":4,"__v":0,"created_on":"2015-08-02T00:08:53.516Z","score":0.00103244346631928},{"_id":"55b55fa8f12af4492558aafe","id":1922,"pasta":"\"How should I sit down Jensen?\" \"Well, have your arms... fully erect.\" said Nicolaj as he slid behind Sneaky, wrapping his arms around the American boy. Sneaky felt a stiff Danish sausage on his rear. \"Are you sure your arms aren't the only thing erect Jensen?!\" Sneaky gasped.","tags":"#LoL#Sneaky#Incarnati0n#fanfic","favourites":5,"__v":0,"created_on":"2015-07-26T22:31:04.350Z","score":0.0009582063497337741},{"_id":"55076b3387d1bc685b1e96a0","id":1041,"pasta":"I sexually Identify as a filthy thresh picker. Ever since I was a boy I dreamed of pulling myself over summoners rift dropping boxes on disgusting non-meta picks. People say to me that a person being a thresh picker is Impossible and I'm fucking retarded but I don't care, I'm beautiful. I'm having a plastic surgeon install a retard hitbox hook, green neon light and lantern on my body. From now on I want you guys to call me \"Thresh\" and respect my right to hook you from behind your minions and kill needlessly. If you can't accept me you're a Threshphobe and need to check your SR privilege. Thank you for being so understanding.","tags":"#lol#sexually#identify#thresh#picker","favourites":49,"__v":0,"created_on":"2015-03-16T23:33:09.378Z","score":0.00083788320672249},{"_id":"54b2eb95ce7b585004706d91","id":11,"pasta":"Dear Mitchel \"QutePie\" Stamina, I have to wirite an essay of 10 words about everyting but YAYO due tomorrow. Unfortunately, YAYO is all I know. Please help.","tags":"#lol#imaqtpie#essay#yayo","favourites":65,"__v":0,"created_on":"2015-01-11T21:20:45.708Z","score":0.0006977212730287613},{"_id":"54eced47c200ce525fb25db2","id":908,"pasta":"I think league of legends is better than dota because its more popular and more simple = easier to learn. You also have to earn your champions yourself. Riot also releases cool CGI movies, valve doesn't. Also LoL has better UI and more interesting champions. This is only my opinion. Pls no hate and have a good day  :) ","tags":"#lol#dota#riot#valve#better#satire","favourites":40,"__v":0,"created_on":"2015-02-24T20:31:00.227Z","score":0.0006073335588722038},{"_id":"54b5a513e90c10d22e88b99f","id":142,"pasta":"Hello guys, I'm back from my 600 second timeout. During that time I was able to finish my 200 page PhD thesis on the topic of Nazi Germany. My thesis is that Nazi fascist beliefs are carried on by imqtpie's twitch tv moderators, who like to act as if they themselves were literally Hitler.","tags":"#lol#imaqtpie#nazi#mods#hitler#thesis","favourites":52,"__v":0,"created_on":"2015-01-13T23:06:55.853Z","score":0.0005842130982328461},{"_id":"54b5a299e90c10d22e88b997","id":138,"pasta":"What the fuck did you just fucking say about me, you little feeder? I’ll have you know I reached top of the ladder in season 3, and I’ve been involved in numerous secret ddos attacks on streamers, and I have over 300 confirmed pentakills. I am trained in lasthitting and I’m the best Caitlyn in the entire OGN. You are nothing to me but just another stack. I will wipe you the fuck out with skillshots the likes of which have never been seen before on this elo, mark my fucking words. You think you can get away with flaming me in all-chat? Think again, bronzie. As we speak I am contacting my secret network of subscribers across Korea and your IP is being traced right now so you better prepare for the ddos, noob. The ddos that wipes out the pathetic little thing you call your mmr. You’re fucking dead, kid. I can be anywhere, anytime, and I can kill you in over seven hundred ways, and that’s just with my autoattacks. Not only am I extensively trained in jungle invades, but I have access to the entire arsenal of the League of Legends skin shop and I will use it to its full extent to wipe your miserable ass off the Summoner's Rift, you little shit. If only you could have known what unholy retribution your little “secured” killsteal was about to bring down upon you, maybe you wouldn't have wasted your fucking ult. But you couldn’t, you didn’t, and now you’re paying the price, you goddamn idiot. I will shit fury all over you and you will drown in it. gg easy, noobs.","tags":"#lol#league#of#legends#navy#seal#300#confirmed","favourites":48,"__v":0,"created_on":"2015-01-13T22:56:10.273Z","score":0.0005457486782397384},{"_id":"5525e21c7ca4658f518f3fe1","id":1430,"pasta":"Ｈｉ Ｄａｒｕｄｅ. Ｍｙ ｄａｄ ａｌｗａｙｓ ｔｏｌｄ ｍｅ ｔｈｉｓ ｓｔｏｒｙ ｗｈｅｒｅ ｈｅ ｓａｉｄ ｈｅ ｗａｓ ｂａｃｋｓｔａｇｅ ａｔ ａ ｃｌｕｂ ａｎｄ ｗａｌｋｅｄ ｕｐ ｔｏ ａ ＤＪ ｐｅｒｆｏｒｍｉｎｇ Ｓａｎｄｓｔｏｒｍ. Ｍｙ ｄａｄ ｈａｔｅｄ ｔｈｅ ｓｏｎｇ ａｎｄ ｔｏｌｄ ｔｈｅ ＤＪ ｔｈａｔ ｉｔ ｗａｓ ｒｅｐｅｔｉｔｉｖｅ ａｎｄ ｃｏｕｌｄｎ＇ｔ ｕｎｄｅｒｓｔａｎｄ ｗｈｙ ｐｅｏｐｌｅ ｌｉｋｅｄ ｉｔ. Ｇｅｔｔｉｎｇ ａ ｗｅｉｒｄ ｌｏｏｋ ｆｒｏｍ ｔｈｅ ＤＪ ｍｙ ｄａｄ ｒｅｔｕｒｎｅｄ ｂａｃｋｓｔａｇｅ ａｎｄ ｔａｌｋｅｄ ｔｏ ｔｈｅ ｍａｎａｇｅｒ ｗｈｏ ｔｈｅｎ ｉｎｆｏｒｍｅｄ ｈｉｍ ｔｈａｔ ｔｈｅ ＤＪ ｈｅ ｉｎｓｕｌｔｅｄ ｗａｓ ｉｎ ｆａｃｔ ｙｏｕ. Ｄｏ ｙｏｕ ｒｅｍｅｍｂｅｒ ｔｈｉｓ ｂｙ ａｎｙ ｃｈａｎｃｅ？ Ｍｙ ｄａｄ ｆｅｌｔ ｐｒｅｔｔｙ ｂａｄ ａｎｄ ｗｏｕｌｄ ａｐｏｌｏｇｉｚｅ ｉｆ ｇｉｖｅｎ ｔｈｅ ｃｈａｎｃｅ ｓｏ Ｉ＇ｍ ｄｏｉｎｇ ｉｔ ｏｎ ｂｅｈａｌｆ ｏｆ ｈｉｍ. Ｉ ｏｎ ｔｈｅ ｏｔｈｅｒ ｈａｎｄ ｈａｐｐｅｎ ｔｏ ｌｉｋｅ Ｓａｎｄｓｔｏｒｍ ａｎｄ ａｐｐｒｅｃｉａｔｅ ｉｔｓ ｍａｓｔｅｒｙ ｏｆ ｔｈｅ ｄａｎｃｅ ｓｃｅｎｅ. Ｔｈａｎｋ ｙｏｕ！","tags":"#darude#sandstorm#dota2#lol#general","favourites":21,"__v":0,"created_on":"2015-04-09T01:52:32.033Z","score":0.000491368538752508},{"_id":"5508f31eb47c3d010fd9658d","id":1133,"pasta":"☑ “This guy's team is CRAZY!” ☑ “My team can't win against a team comp like that” ☑ \"He NEEDED precisely those two champions to win\" ☑ “He got the exact crits he needed. ” ☑ \"His team had the exact champions to counter me\" ☑ “There was no way we could out-smite that\" ☑ “We played that perfectly\"","tags":"#lol#shit#team#checkboxes","favourites":24,"__v":0,"created_on":"2015-03-18T03:02:45.033Z","score":0.0004579748174398742},{"_id":"5582330a2120570651f0ae33","id":1775,"pasta":"Ｈｅｙ  Ｍａｅｌｋ，  Ｉ＇ｍ  ｔｒｙｉｎｇ  ｔｏ  ｌｅａｒｎ  ｔｏ  ｐｌａｙ  Ｂｏｕｎｔｙ  Ｈｕｎｔｅｒ．  Ｉ  ｊｕｓｔ  ｈａｖｅ  ａ  ｑｕｅｓｔｉｏｎ  ａｂｏｕｔ  ｔｈｅ  ｓｋｉｌｌ  ｂｕｉｌｄ：  ｓｈｏｕｌｄ  Ｉ  ｍａｘ  Ｓｈｕｒｉｋｅｎ  ｔｏｓｓ，  ｓｏ  Ｉ  ｃａｎ  ｔｏｓｓ  ｓｈｕｒｉｋｅｎｓ  ｌｉｋｅ  ｙｏｕ  ｔｏｓｓｅｄ  Ｄｏｔａ  ２  ｉｎ  ｔｈｅ  ｔｒａｓｈ，  Ｊｉｎａｄａ  ｓｏ  Ｉ  ｃａｎ  ｃｒｉｔ  ｍｙ  ｅｎｅｍｉｅｓ  ｌｉｋｅ  ｙｏｕ  ｗｅｒｅ  ｃｒｉｔｉｃａｌ  ｏｆ  Ｄｏｔａ  ２，  ｏｒ  Ｓｈａｄｏｗ  ｗａｌｋ  ｓｏ  Ｉ  ｃａｎ  ｗａｌｋ  ａｗａｙ  ｆｒｏｍ  ｔｈｅ  ｅｎｅｍｙ  ｌｉｋｅ  ｙｏｕ  ｗａｌｋｅｄ  ａｗａｙ  ｆｒｏｍ  Ｄｏｔａ  ２？","tags":"#dota2#lol#maelk#skill#build#bounty#hunter","favourites":7,"__v":0,"created_on":"2015-06-17T01:22:23.680Z","score":0.0004357348080806867}]