[{"_id":"550e73e92ab05ce134dd32e2","id":1279,"pasta":"  ༼ ºل͟º༼ ºل͟º( ͡° ͡ ͜ ͡ʖ ͡ °)ºل͟º ༽ºل͟º ༽ 5 MEN, 1 DREAM, 9 EYEBROWS ༼ ºل͟º༼ ºل͟º( ͡° ͡ ͜ ͡ʖ ͡ °)ºل͟º ༽ºل͟º ༽","tags":"#lol#genja#moscow5#donger","favourites":4,"__v":0,"created_on":"2015-03-22T06:01:39.686Z","score":0.00005746776206544095},{"_id":"5508c4a8b47c3d010fd9651b","id":1087,"pasta":"Did You Know? YAYO was first found in America in the year 1070. The native Dongers sang it to please their God. One day they didn't sing YAYO, a NACHO TORPEDO destroyed their whole culture. Ripperino Dongerino, all you knew was YAYO..\n","tags":"#twitch#lol#yayo#founded#nacho#torpedo","favourites":4,"__v":0,"created_on":"2015-03-18T00:13:24.201Z","score":0.000056074697236873664},{"_id":"54b5a451e90c10d22e88b99b","id":140,"pasta":"@Imaqtpie is there a HYPER LEARNING PLATFORM website where one can watch GUIDES and VIDEOS of such nature to IMPROVE their own personal skill. Also loved by over 1 MILLION PEOPLE?","tags":"#lol#imaqtpie#skillcapped#skill#capped#hyper#learning","favourites":5,"__v":0,"created_on":"2015-01-13T23:03:40.916Z","score":0.00005189060548520703},{"_id":"54b5a299e90c10d22e88b997","id":138,"pasta":"What the fuck did you just fucking say about me, you little feeder? I’ll have you know I reached top of the ladder in season 3, and I’ve been involved in numerous secret ddos attacks on streamers, and I have over 300 confirmed pentakills. I am trained in lasthitting and I’m the best Caitlyn in the entire OGN. You are nothing to me but just another stack. I will wipe you the fuck out with skillshots the likes of which have never been seen before on this elo, mark my fucking words. You think you can get away with flaming me in all-chat? Think again, bronzie. As we speak I am contacting my secret network of subscribers across Korea and your IP is being traced right now so you better prepare for the ddos, noob. The ddos that wipes out the pathetic little thing you call your mmr. You’re fucking dead, kid. I can be anywhere, anytime, and I can kill you in over seven hundred ways, and that’s just with my autoattacks. Not only am I extensively trained in jungle invades, but I have access to the entire arsenal of the League of Legends skin shop and I will use it to its full extent to wipe your miserable ass off the Summoner's Rift, you little shit. If only you could have known what unholy retribution your little “secured” killsteal was about to bring down upon you, maybe you wouldn't have wasted your fucking ult. But you couldn’t, you didn’t, and now you’re paying the price, you goddamn idiot. I will shit fury all over you and you will drown in it. gg easy, noobs.","tags":"#lol#league#of#legends#navy#seal#300#confirmed","favourites":5,"__v":0,"created_on":"2015-01-13T22:56:10.273Z","score":0.00005188940261856177},{"_id":"54b2ee76ce7b585004706dc1","id":40,"pasta":"Hello twitch chat. This is michaels mother speaking. Please stop the spam in the chat. I can't read the amazing conversations that you are having about my son. Thanks. Don't copy and paste this to spam more or I will tell Michael to ban you all.","tags":"#lol#imaqtpie#spam#mother","favourites":5,"__v":0,"created_on":"2015-01-11T21:37:49.907Z","score":0.0000514194871436468},{"_id":"54b2ee72ce7b585004706dbe","id":37,"pasta":"Michael \"The PIE\" Santana, this is your mother speaking. Did I just hear that you became a sellout? I did not raise my donger like this, please call home, Michael. I am concerned about you, and what is this about wanting to go into gay pornography?","tags":"#lol#imaqtpie#sellout#porn#mother","favourites":5,"__v":0,"created_on":"2015-01-11T21:34:35.126Z","score":0.0000514189756893621},{"_id":"54b2ee6cce7b585004706dba","id":33,"pasta":"Hey Mr QTPIE, This is John's mother I would love it if you turned down this \"African american\" music down a notch so my son doesn't get corrupted. God Bless you.","tags":"#lol#imaqtpie#rap#john#music","favourites":5,"__v":0,"created_on":"2015-01-11T21:32:24.768Z","score":0.00005141863340155501},{"_id":"54e537919be75f1867cb2314","id":840,"pasta":"How could anyone get off to the idea of removing Kaceytron's clothes and licking her fatty body all over, nibbling her neck and kissing her adorable big nipples? Only a heartless monster would think about her pretty mouth and tongue wrapped around a thick cock slick with her saliva, pumping in and out of her mouth until it erupts, the cum more than her little throat can swallow. The idea of thick viscous semen overflowing, dribbling down her chin over her flat chest, her tiny hands scooping it all up and watching her suck it off her fingertips is just horrible. You're all a bunch of sick perverts, thinking of spreading Kaceytron's smooth slender thighs, cock poised at the entrance to her pure, tight, virginal pussy.","tags":"#lol#kaceytron#perverts#nipples#cock","favourites":4,"__v":0,"created_on":"2015-02-19T00:37:31.243Z","score":0.000048469891542183415},{"_id":"54b5aaebe90c10d22e88b9a3","id":144,"pasta":"@Imaqtpie hey i just won my gold 2 promos because of you! i did the exact opposite you do in game which is feeding so by not dying we won the game WOO THANKS ILY","tags":"#imaqtpie#promos#lol#feeding#league","favourites":4,"__v":0,"created_on":"2015-01-13T23:10:40.234Z","score":0.00004083029260299325},{"_id":"54b2ee6ace7b585004706db8","id":31,"pasta":"Hi Michael it's Jarl Balgruuf the Greater. I heard you are trying to play other games when we need you here at Skyrim to clean up the dragons. Quit what you are doing right now and come join me as the new Whiterun Thane. My axe is ready as your reward.","tags":"#lol#imaqtpie#skyrim#jarl","favourites":4,"__v":0,"created_on":"2015-01-11T21:42:27.035Z","score":0.00004045929146457948},{"_id":"54b2eb91ce7b585004706d8e","id":8,"pasta":"Hi me name is Kowak and I are from Poland. Sorry for me bed England. I works in a shop, and i only earn a little money. So to afford an computer i had to selled me girlfriend. But I cant play LOL? Me heard that someone say something about internett, but what is internett? Ples help me poor human from poland. And no copy pasterino trollerino","tags":"#lol#polish#league#of#legends#internet","favourites":4,"__v":0,"created_on":"2015-01-11T21:18:30.558Z","score":0.00004045632369914579},{"_id":"5508c52db47c3d010fd96523","id":1092,"pasta":"My name is Lisha. I am the significant other of Michael \"Imaqtpie\" Santana. He has a really big dick. But he also has a really small bunghole. Michael likes it when I insert my 10\" strapon into him while wearing a pirate hat and demands I say, \"prepare to be boarded!","tags":"#lol#imaqtpie#big#dick#small#bunghole","favourites":3,"__v":0,"created_on":"2015-03-18T00:20:27.381Z","score":0.00003999782789130053},{"_id":"5508c51cb47c3d010fd96522","id":1091,"pasta":"Mr Santana, this is Riot HQ. We traced yesterday's LCS technical issues back to you forcing your large donger into CoreJJs cooling fan. If you do not formally apologize CLG will be fined $25,000 ","tags":"#lol#imaqtpie#riot#hq#lcs","favourites":3,"__v":0,"created_on":"2015-03-18T00:18:21.868Z","score":0.00003999749502345968},{"_id":"5508c53ab47c3d010fd96524","id":1093,"pasta":"Hi I own 12 burger king chains and I was wondering if you are interested in becoming the new BK mascot. I have a son who is dying of stage 6 áss burgers syndrome and will have to get his left ear removed next week. His dying wish is to see you on a burger king commercial. This is a serious request, please don't copy and paste.","tags":"#lol#imaqtpie#burger#chains","favourites":3,"__v":0,"created_on":"2015-03-18T00:04:30.960Z","score":0.000039995291532451045},{"_id":"5508c50fb47c3d010fd96521","id":1090,"pasta":"Mr. Michael \"imaqtpie\" Santana, I am from the Supports Abused by Adc Foundation, and i would like to point out that you are guilty of verbally molesting all of your last supports. Please no \"copy pasta\", this is a serious warning.","tags":"#lol#imaqtpie#supports#abused","favourites":2,"__v":0,"created_on":"2015-03-18T00:17:29.069Z","score":0.000022447756509513193}]