[{"_id":"5508c502b47c3d010fd96520","id":1089,"pasta":"Hi there Michael :3This is your high school friend Catherine You still know me ? :3 Anyways, I was wondering if we could get back into touch again )))) I assume that $$$ you made from playing in LCS made your cock grow SOOOO HUUUGE :3 ","tags":"#lol#imaqtpie#big#dick#club#catherine","favourites":2,"__v":0,"created_on":"2015-03-18T00:16:54.297Z","score":0.00002887677529533799},{"_id":"54d40bbf01ae2be31cb3df82","id":710,"pasta":"Hello Kaceytron, your stream has changed my life completely. I suffer from severe NaCl (salt) deficiency disorder. I had to visit the hospital 5 times a week for salt injections. However, watching your stream supplies me enough salt through the screen. You saved me money time and effort.","tags":"#lol#kaceytron#NaCl#deficiency#salt#savior","favourites":2,"__v":0,"created_on":"2015-02-05T23:44:34.146Z","score":0.00002242127635678238},{"_id":"54c541a7150501067e808085","id":564,"pasta":"Ｙｏｕ ｇｕｙｓ ａｒｅ ｒｕｉｎｉｎｇ ｍｙ ｔｗｉｔｃｈ ｃｈａｔ ｅｘｐｅｒｉｅｎｃｅ． Ｉ ｃｏｍｅ ｔｏ ｔｈｅ ｔｗｉｔｃｈ ｃｈａｔ ｆｏｒ ｍａｔｕｒｅ ｃｏｎｖｅｒｓａｔｉｏｎ ａｂｏｕｔ ｔｈｅ ｇａｍｅｐｌａｙ， ｏｎｌｙ ｔｏ ｂｅ ａｗａｒｄｅｄ ｗｉｔｈ ｋａｐｐａ ｆａｃｅｓ ａｎｄ ｆｒａｎｋｅｒｚｓ． Ｐｅｏｐｌｅ ｗｈｏ ｓｐａｍ ｓａｉｄ ｆａｃｅｓ ｎｅｅｄ ｍｅｄｉｃａｌ ａｔｔｅｎｔｉｏｎ ｕｔｍｏｓｔ． Ｔｈｅ ｔｗｉｔｃｈ ｃｈａｔ ｉｓ ｓｅｒｉｏｕｓ ｂｕｓｉｎｅｓｓ， ａｎｄ ｔｈｅ ｍｏｄｓ ｓｈｏｕｌｄ ｒｅａｌｌｙ ｄｏ ｔｈｅｉｒ ｊｏｂｓ ｉｎ ｓｔｏｐｐｉｎｇ ｓｕｃｈ ｈｅｒｅｓｙ．","tags":"#twitch#dota#lol#csgo#chat#experience#antipasta","favourites":2,"__v":0,"created_on":"2015-01-25T14:17:48.787Z","score":0.000021040412310775096},{"_id":"54bfdeaa3b0a330105ff5cb6","id":424,"pasta":"Hello, Mitchell \"Pieqtima\" Santorin. This is Dallas - head admin of WHYSP.net | FUTUNARI speaking. I am contacting you today because it seems that you have not logged into our site in some time. I was just wondering if everything was OK? If you have a problem with our site, please don't hesitate to respond. Cheers.","tags":"#lol#imaqtpie#dallas#head#admin#whysp#futunari","favourites":2,"__v":0,"created_on":"2015-01-21T12:09:35.761Z","score":0.000020581609608325514},{"_id":"54b5f629f6a1885137f43ce7","id":190,"pasta":"つ ◕_◕ ༽つ MY LUBE IS READY, MY D*CK IS GETTING BIGGER, WITH THIS CHANT I SUMMON PHANTOML0RD ༼ つ ◕_◕ ༽つ","tags":"#lol#phantoml0rd#phantomlord#summon#chant","favourites":2,"__v":0,"created_on":"2015-01-14T04:51:19.670Z","score":0.000019805451318847174},{"_id":"54b5f5b0f6a1885137f43ce3","id":188,"pasta":"ヽ༼ຈل͜ຈ༽ﾉ This shirt is low cut, the gunnars are on. With this chant I summon Kaceytron ヽ༼ຈل͜ຈ༽ﾉ","tags":"#lol#kaceytron#summon#chant","favourites":2,"__v":0,"created_on":"2015-01-14T04:50:12.252Z","score":0.00001980537122588898},{"_id":"54b70dab22fdca593d86092f","id":208,"pasta":" Ｈｅｌｌｏ　Ｐｏｂｅｌｔｅｒ，　ｔｈｉｓ　ｉｓ　ｔｈｅ　ａｄｍｉｎｉｓｔｒａｔｏｒ　ｏｆ　ＰｏｒｎＨｕｂ™　ｗｅ　ｈａｖｅ　ｎｏｔｉｃｅｄ　ｙｏｕ　 ｈａｖｅｎ’ｔ　ｌｏｇｇｅｄ　ｉｎ　ｆｏｒ　２　ｗｅｅｋｓ，　ｗｅ’ｒｅ　ｊｕｓｔ　ｃｈｅｃｋｉｎｇ　ｔｏ　ｓｅｅ　ｉｆ　ｅｖｅｒｙｔｈｉｎｇ　 ｉｓ　ｏｋａｙ　ａｎｄ　ｗｅ’ｖｅ　ｐｒｅｐａｒｅｄ　ｙｏｕ　ａ　ｌｉｓｔ　ｏｆ　ｖｉｄｅｏｓ　ｆｒｏｍ　ｙｏｕｒ　ｆａｖｏｕｒｉｔｅ　 ｃａｔｅｇｏｒｙ　（Ａｓｉａｎ）．　Ｓｅｅ　ｙｏｕ　ｓｏｏｎ!","tags":"#lol#pobelter#pornhub#asian","favourites":1,"__v":0,"created_on":"2015-01-15T00:25:44.548Z","score":0},{"_id":"54bf15be2d74781f04a60380","id":312,"pasta":"hey guys me and my friend from kindergarden play leage of ledgends and say they stumble on game called Doto I was wondering if this game any good - please no copy pasterino...","tags":"#dota2#lol#kindergarden#friends","favourites":0,"__v":0,"created_on":"2015-01-21T02:52:42.059Z","score":0},{"_id":"54bf35973b0a330105ff5bc9","id":354,"pasta":"<;º ༽ ǫᴜɪɴɴ ɪᴛ ᴛᴏ ᴡɪɴ ɪᴛ <;º ༽","tags":"#lol#imaqtpie#quinn#win","favourites":1,"__v":0,"created_on":"2015-01-21T05:07:09.335Z","score":0},{"_id":"54bfda883b0a330105ff5cb1","id":419,"pasta":"I once saw a stream on twitch.tv i was browsing through pornhub that time and i typed cow's i finally found a guy who was wearing a cowsuit and a cow hat my dick slowly got hard after that it took me 3hours to cum but when i did my dick finally realized the true meaning of sex even though it was me jerking off it still felt like sex through my monitor i felt i was in touch with the guy who was wearing a cow suit and a cow hat yet later that day i did fap 2 him again and it felt like shit thank you for teaching me how to play league of yigends cowsex senpai.","tags":"#lol#cowsep#pornhub#cowsuit#cow#sex","favourites":1,"__v":0,"created_on":"2015-01-21T11:07:25.551Z","score":0},{"_id":"54c09d54a9bec43831afc3e6","id":482,"pasta":"One day, I walked into the LCS studios - a happy and eager fan. I saw Eugene \"Pobelter\" Park smashing Eefje \"Sjokz\" Deporteres on the ANALyst desk. I didn't know what to do, I panicked and let out a shriek, Eugene looked at me and said, \"Better keep your mouth shut kid,\" he then took a puff of the blunt and kept destroying the European cooch.","tags":"#lol#lcs#studio#pobelter#sjokz","favourites":0,"__v":0,"created_on":"2015-01-22T06:32:21.509Z","score":0},{"_id":"54c16b8c5764903a3288022a","id":502,"pasta":"It's amazing just how much DOTA2 has become the antithesis to LoL.\n\nAside from the obvious gameplay, you have DOTA2 only selling costmetic changes while LoL readily sells various advantages to its players. But the most amazing and puzzling difference of all is that while LoL has a wide selection of beautiful and attractive girls, Dota 2 has a just as varied selection of handsome and sexy male heroes, the kind of which you just hope would stroke your face, carry you, and then take you to their home, where you would spend the night together making...eherm... I was getting much too ahead of myself.\n\nMy point, though, is that while the majority of LoL's heroes were designed to attract a primarily male audience, WHY does Dota 2's seem to have been designed to attract the fairer sex?","tags":"#lol#dota2#gay#female#male#heroes","favourites":1,"__v":0,"created_on":"2015-01-22T21:22:24.838Z","score":0},{"_id":"54c1da7f15b4d6835b3394eb","id":514,"pasta":"It was a hot and sultry night at the c9 gaming house. everyone was in bed except for meteos and sneaky. \"we can't keep doing this, baby\" says sneaky. \"put that mouth to use, you dirty tramp\" replies meteos. \"LCS starts tmrw, and if you expect me to carry you again, i need to you to suck me to completion.\" sneaky grins sluttily, and goes to town","tags":"#lol#sneaky#meteos#lcs#fanfic","favourites":0,"__v":0,"created_on":"2015-01-23T05:06:00.603Z","score":0},{"_id":"54cd7224e79ec4797cbee2ab","id":643,"pasta":" ༼ つ ◕◡◕ ༽つ PUT SELDRIC IN BUMBLEBEE OUTFIT ༼ つ ◕◡◕ ༽つ","tags":"#lol#kaceytron#seldric","favourites":1,"__v":0,"created_on":"2015-01-31T23:50:14.147Z","score":0},{"_id":"54cd9438e79ec4797cbee2b0","id":646,"pasta":"ヽ༼ຈل͜ຈ༽ﾉ WALMART PC ◕_◕ ༽つ","tags":"#lol#kaceytron#pc","favourites":1,"__v":0,"created_on":"2015-02-01T01:14:56.605Z","score":0}]