[{"_id":"54b2ee6fce7b585004706dbc","id":35,"pasta":"@imaqtpie which champion would you have consensual sex with in the missionary position for the sole purpose of procreation after getting married and having your finances sorted out, staring lovingly into each other's eyes while HOLDING HANDS","tags":"#lol#imaqtpie#disgusting#missionary","favourites":13,"__v":0,"created_on":"2015-01-11T21:33:28.932Z","score":0.00017293032732078868},{"_id":"54e537919be75f1867cb2314","id":840,"pasta":"How could anyone get off to the idea of removing Kaceytron's clothes and licking her fatty body all over, nibbling her neck and kissing her adorable big nipples? Only a heartless monster would think about her pretty mouth and tongue wrapped around a thick cock slick with her saliva, pumping in and out of her mouth until it erupts, the cum more than her little throat can swallow. The idea of thick viscous semen overflowing, dribbling down her chin over her flat chest, her tiny hands scooping it all up and watching her suck it off her fingertips is just horrible. You're all a bunch of sick perverts, thinking of spreading Kaceytron's smooth slender thighs, cock poised at the entrance to her pure, tight, virginal pussy.","tags":"#lol#kaceytron#perverts#nipples#cock","favourites":10,"__v":0,"created_on":"2015-02-19T00:37:31.243Z","score":0.00017194200835512135},{"_id":"54b2ee76ce7b585004706dc1","id":40,"pasta":"Hello twitch chat. This is michaels mother speaking. Please stop the spam in the chat. I can't read the amazing conversations that you are having about my son. Thanks. Don't copy and paste this to spam more or I will tell Michael to ban you all.","tags":"#lol#imaqtpie#spam#mother","favourites":12,"__v":0,"created_on":"2015-01-11T21:37:49.907Z","score":0.00016083776831449215},{"_id":"559ef17b975fee4a2be08428","id":1857,"pasta":"Hai Sneaky, LeagueOfBoredum here I'm trying to learn how to play shaco and I was wondering what I should max, should I max deceive, like Meteos deceived your team, two-shiv poison like Meteos poisoned your team environment or the box like the box of trust you had with meteos that was lost. Thanks in advance sneaky","tags":"#LoL#Cloud9#Sneaky","favourites":2,"__v":0,"created_on":"2015-07-08T08:27:54.540Z","score":0.00015767616023500312},{"_id":"5508c53ab47c3d010fd96524","id":1093,"pasta":"Hi I own 12 burger king chains and I was wondering if you are interested in becoming the new BK mascot. I have a son who is dying of stage 6 áss burgers syndrome and will have to get his left ear removed next week. His dying wish is to see you on a burger king commercial. This is a serious request, please don't copy and paste.","tags":"#lol#imaqtpie#burger#chains","favourites":7,"__v":0,"created_on":"2015-03-18T00:04:30.960Z","score":0.00014931482939249845},{"_id":"550e73e92ab05ce134dd32e2","id":1279,"pasta":"  ༼ ºل͟º༼ ºل͟º( ͡° ͡ ͜ ͡ʖ ͡ °)ºل͟º ༽ºل͟º ༽ 5 MEN, 1 DREAM, 9 EYEBROWS ༼ ºل͟º༼ ºل͟º( ͡° ͡ ͜ ͡ʖ ͡ °)ºل͟º ༽ºل͟º ༽","tags":"#lol#genja#moscow5#donger","favourites":6,"__v":0,"created_on":"2015-03-22T06:01:39.686Z","score":0.00013270666568333854},{"_id":"54bfdeaa3b0a330105ff5cb6","id":424,"pasta":"Hello, Mitchell \"Pieqtima\" Santorin. This is Dallas - head admin of WHYSP.net | FUTUNARI speaking. I am contacting you today because it seems that you have not logged into our site in some time. I was just wondering if everything was OK? If you have a problem with our site, please don't hesitate to respond. Cheers.","tags":"#lol#imaqtpie#dallas#head#admin#whysp#futunari","favourites":9,"__v":0,"created_on":"2015-01-21T12:09:35.761Z","score":0.00013031723321356821},{"_id":"5508c4a8b47c3d010fd9651b","id":1087,"pasta":"Did You Know? YAYO was first found in America in the year 1070. The native Dongers sang it to please their God. One day they didn't sing YAYO, a NACHO TORPEDO destroyed their whole culture. Ripperino Dongerino, all you knew was YAYO..\n","tags":"#twitch#lol#yayo#founded#nacho#torpedo","favourites":6,"__v":0,"created_on":"2015-03-18T00:13:24.201Z","score":0.00012827432748345116},{"_id":"54f2358587d1bc685b1e95c1","id":940,"pasta":"I sexually Identify as a minion. Ever since I was a boy I dreamed of walking down the lanes of Summoners Rift just to get slaughtered instantly. People say to me that a person being a minion is Impossible and I'm fucking retarded but I don't care, I'm beautiful. I'm having a plastic surgeon install a little stone helmet, shield and battle hammer on my body. From now on I want you guys to call me \"blue melee creep\" and respect my right to willingly suicide into powerful enemy champions. If you can't accept me you're a miniophobe and need to check your summoning privilege. Thank you for being so understanding.","tags":"#lol#sexually#identify#minion","favourites":6,"__v":0,"created_on":"2015-02-28T21:38:39.504Z","score":0.00011282452170147505},{"_id":"5508c52db47c3d010fd96523","id":1092,"pasta":"My name is Lisha. I am the significant other of Michael \"Imaqtpie\" Santana. He has a really big dick. But he also has a really small bunghole. Michael likes it when I insert my 10\" strapon into him while wearing a pirate hat and demands I say, \"prepare to be boarded!","tags":"#lol#imaqtpie#big#dick#small#bunghole","favourites":5,"__v":0,"created_on":"2015-03-18T00:20:27.381Z","score":0.00010651191864713023},{"_id":"54b5aaebe90c10d22e88b9a3","id":144,"pasta":"@Imaqtpie hey i just won my gold 2 promos because of you! i did the exact opposite you do in game which is feeding so by not dying we won the game WOO THANKS ILY","tags":"#imaqtpie#promos#lol#feeding#league","favourites":7,"__v":0,"created_on":"2015-01-13T23:10:40.234Z","score":0.00009818878590720293},{"_id":"54b2ee6ace7b585004706db8","id":31,"pasta":"Hi Michael it's Jarl Balgruuf the Greater. I heard you are trying to play other games when we need you here at Skyrim to clean up the dragons. Quit what you are doing right now and come join me as the new Whiterun Thane. My axe is ready as your reward.","tags":"#lol#imaqtpie#skyrim#jarl","favourites":7,"__v":0,"created_on":"2015-01-11T21:42:27.035Z","score":0.00009705724802244896},{"_id":"54b2eb91ce7b585004706d8e","id":8,"pasta":"Hi me name is Kowak and I are from Poland. Sorry for me bed England. I works in a shop, and i only earn a little money. So to afford an computer i had to selled me girlfriend. But I cant play LOL? Me heard that someone say something about internett, but what is internett? Ples help me poor human from poland. And no copy pasterino trollerino","tags":"#lol#polish#league#of#legends#internet","favourites":7,"__v":0,"created_on":"2015-01-11T21:18:30.558Z","score":0.00009704821667255817},{"_id":"551353cd0489a24c09a597d5","id":1327,"pasta":"It was Dinner Time in the Cloud Nein Gaymer house. Zachary “Sneaky” Scuderi dishes up a steaming plate of pasta when he realizes he forgot the meat. William “Meteos” Hartman looks up from his plate with a gleam in his eye. “I got the meat right here for you baby.” Lubing up with Marinara Sauce, Meteos begins to pound his sausage into sneaky’s lightly buttered Dinner roll. With a scream of delight Meat-eos releases his load calling an end to another successful team dinner.","tags":"#LoL#Erotic#Cloud9","favourites":4,"__v":0,"created_on":"2015-03-26T00:29:38.025Z","score":0.00008942806715718141},{"_id":"54c1da7f15b4d6835b3394eb","id":514,"pasta":"It was a hot and sultry night at the c9 gaming house. everyone was in bed except for meteos and sneaky. \"we can't keep doing this, baby\" says sneaky. \"put that mouth to use, you dirty tramp\" replies meteos. \"LCS starts tmrw, and if you expect me to carry you again, i need to you to suck me to completion.\" sneaky grins sluttily, and goes to town","tags":"#lol#sneaky#meteos#lcs#fanfic","favourites":6,"__v":0,"created_on":"2015-01-23T05:06:00.603Z","score":0.0000889717687630197}]