[{"_id":"559ef17b975fee4a2be08428","id":1857,"pasta":"Hai Sneaky, LeagueOfBoredum here I'm trying to learn how to play shaco and I was wondering what I should max, should I max deceive, like Meteos deceived your team, two-shiv poison like Meteos poisoned your team environment or the box like the box of trust you had with meteos that was lost. Thanks in advance sneaky","tags":"#LoL#Cloud9#Sneaky","favourites":10,"__v":0,"created_on":"2015-07-08T08:27:54.540Z","score":0.0000731974800868276},{"_id":"54b2ee6fce7b585004706dbc","id":35,"pasta":"@imaqtpie which champion would you have consensual sex with in the missionary position for the sole purpose of procreation after getting married and having your finances sorted out, staring lovingly into each other's eyes while HOLDING HANDS","tags":"#lol#imaqtpie#disgusting#missionary","favourites":17,"__v":0,"created_on":"2015-01-11T21:33:28.932Z","score":0.000072190595231804},{"_id":"54b2eb94ce7b585004706d90","id":10,"pasta":"Hello Michael Santana,my name is Rabia AKA Nįghtblúê3,and I am furious that you blacklisted my name.I am reporting you to twitch.Don't copy paste this or I will report you too","tags":"#lol#nightblue3#nightblue#imaqtpie","favourites":17,"__v":0,"created_on":"2015-01-11T21:20:00.061Z","score":0.0000721890428560966},{"_id":"555d54cadf71aa25492f2f87","id":1657,"pasta":"Viewers gather, and now my feed begins. It shall not end until all my teams lose. I shall take no kills, get no assists, farm no creeps. I shall feed and feed at my base. I am the feeder in the fog. I am the feeder at the fountain. I am the feeder that feeds the enemy team. I pledge my life and honor to the Feeder's Elite, for this stream and all the streams to come.","tags":"#dota2#lol#feeder#feed","favourites":11,"__v":0,"created_on":"2015-05-20T17:01:37.464Z","score":0.00006839325890909575},{"_id":"54e537919be75f1867cb2314","id":840,"pasta":"How could anyone get off to the idea of removing Kaceytron's clothes and licking her fatty body all over, nibbling her neck and kissing her adorable big nipples? Only a heartless monster would think about her pretty mouth and tongue wrapped around a thick cock slick with her saliva, pumping in and out of her mouth until it erupts, the cum more than her little throat can swallow. The idea of thick viscous semen overflowing, dribbling down her chin over her flat chest, her tiny hands scooping it all up and watching her suck it off her fingertips is just horrible. You're all a bunch of sick perverts, thinking of spreading Kaceytron's smooth slender thighs, cock poised at the entrance to her pure, tight, virginal pussy.","tags":"#lol#kaceytron#perverts#nipples#cock","favourites":14,"__v":0,"created_on":"2015-02-19T00:37:31.243Z","score":0.00006649159089151188},{"_id":"55ea2838ee33c6aa3d629df9","id":2105,"pasta":"As Wingsofsalt lay in his 2-man bed after a long day of working at McDonald's, he looked over to the empty side and silently wished to himself that Heisindonger was there, to make him feel like a real woman. Maybe a miracle, or maybe just coincidence, Heisindonger kicked open Wing's door, wearing nothing but a neon green speedo. He approached Wings, who was still wide-eyed in both suprise and joy, and wispered in his ear, \"Tonight, you're going bot.\"","tags":"#lol#Wingsofdeath#HeisendongNA","favourites":7,"__v":0,"created_on":"2015-09-04T23:24:40.038Z","score":0.00006490936750439986},{"_id":"55d54e7a5e068c5a59e472cc","id":2023,"pasta":"(∩ sneakyW )⊃━☆ﾟ. ･ ｡ﾟMy dick is small, my butthole is leaky, I use this chant, to summon Sneaky","tags":"#LoL#Sneaky#Cloud9","favourites":7,"__v":0,"created_on":"2015-08-20T03:50:18.214Z","score":0.00006097241894850476},{"_id":"54e6a8068a06216f0557ec9c","id":864,"pasta":"Hello am 48 year man from somalia. Sorry for my bed england. I selled my wife for internet connection for play \"legend league\" and i want to become the goodest player like you I play with 400 ping on brazil server and i am challenger 2. pls no copy pasterino my story.\n","tags":"#lol#hello#somalia#sold#wife#internet","favourites":12,"__v":0,"created_on":"2015-02-20T03:20:32.879Z","score":0.000058010061583887975},{"_id":"5508c53ab47c3d010fd96524","id":1093,"pasta":"Hi I own 12 burger king chains and I was wondering if you are interested in becoming the new BK mascot. I have a son who is dying of stage 6 áss burgers syndrome and will have to get his left ear removed next week. His dying wish is to see you on a burger king commercial. This is a serious request, please don't copy and paste.","tags":"#lol#imaqtpie#burger#chains","favourites":11,"__v":0,"created_on":"2015-03-18T00:04:30.960Z","score":0.00005722066818441588},{"_id":"54b2eb91ce7b585004706d8e","id":8,"pasta":"Hi me name is Kowak and I are from Poland. Sorry for me bed England. I works in a shop, and i only earn a little money. So to afford an computer i had to selled me girlfriend. But I cant play LOL? Me heard that someone say something about internett, but what is internett? Ples help me poor human from poland. And no copy pasterino trollerino","tags":"#lol#polish#league#of#legends#internet","favourites":13,"__v":0,"created_on":"2015-01-11T21:18:30.558Z","score":0.0000568008240513329},{"_id":"5582330a2120570651f0ae33","id":1775,"pasta":"Ｈｅｙ  Ｍａｅｌｋ，  Ｉ＇ｍ  ｔｒｙｉｎｇ  ｔｏ  ｌｅａｒｎ  ｔｏ  ｐｌａｙ  Ｂｏｕｎｔｙ  Ｈｕｎｔｅｒ．  Ｉ  ｊｕｓｔ  ｈａｖｅ  ａ  ｑｕｅｓｔｉｏｎ  ａｂｏｕｔ  ｔｈｅ  ｓｋｉｌｌ  ｂｕｉｌｄ：  ｓｈｏｕｌｄ  Ｉ  ｍａｘ  Ｓｈｕｒｉｋｅｎ  ｔｏｓｓ，  ｓｏ  Ｉ  ｃａｎ  ｔｏｓｓ  ｓｈｕｒｉｋｅｎｓ  ｌｉｋｅ  ｙｏｕ  ｔｏｓｓｅｄ  Ｄｏｔａ  ２  ｉｎ  ｔｈｅ  ｔｒａｓｈ，  Ｊｉｎａｄａ  ｓｏ  Ｉ  ｃａｎ  ｃｒｉｔ  ｍｙ  ｅｎｅｍｉｅｓ  ｌｉｋｅ  ｙｏｕ  ｗｅｒｅ  ｃｒｉｔｉｃａｌ  ｏｆ  Ｄｏｔａ  ２，  ｏｒ  Ｓｈａｄｏｗ  ｗａｌｋ  ｓｏ  Ｉ  ｃａｎ  ｗａｌｋ  ａｗａｙ  ｆｒｏｍ  ｔｈｅ  ｅｎｅｍｙ  ｌｉｋｅ  ｙｏｕ  ｗａｌｋｅｄ  ａｗａｙ  ｆｒｏｍ  Ｄｏｔａ  ２？","tags":"#dota2#lol#maelk#skill#build#bounty#hunter","favourites":8,"__v":0,"created_on":"2015-06-17T01:22:23.680Z","score":0.000055322348931951404},{"_id":"554ec52d3895206d68ad36a3","id":1612,"pasta":"                            \\ /\n                       \\_   |  _/               What gravity does to you                \n                          (, ~,)\n                                            ","tags":"#lol#gravity","favourites":9,"__v":0,"created_on":"2015-05-10T02:10:19.774Z","score":0.00005502388361002335},{"_id":"54b5aaebe90c10d22e88b9a3","id":144,"pasta":"@Imaqtpie hey i just won my gold 2 promos because of you! i did the exact opposite you do in game which is feeding so by not dying we won the game WOO THANKS ILY","tags":"#imaqtpie#promos#lol#feeding#league","favourites":12,"__v":0,"created_on":"2015-01-13T23:10:40.234Z","score":0.000053081225055023136},{"_id":"56948f00c41d20f176ef71aa","id":2474,"pasta":"One day Sneaky woke up to the sight of Raihnbowkidz and decided to climb up her ranked ladder. As he entered queue and slid his LPnis into the vagiiNA, he felt a strange force coming from behind him. It was Meteos. Meteos managed to let out a single Elastic Slingshot and trailed his sticky goo behind. As he bounced in he said \"This is gonna get messy\".","tags":"#sneaky#meteos#raihnbowkidz#lol","favourites":3,"__v":0,"created_on":"2016-01-12T05:28:32.443Z","score":0.000051280362171876294},{"_id":"56948eedc41d20f176ef71a8","id":2472,"pasta":"EleGiggle PASSED AROUND THE LCS TEAMS EleGiggle GARBAGE NA ADC EleGiggle GUESS WHO EleGiggle IT'S YURI JEW EleGiggle ","tags":"#LoL#YuriJew#EleGiggle#NALCS#spam","favourites":3,"__v":0,"created_on":"2016-01-12T05:28:13.530Z","score":0.00005128028372193483}]