[{"_id":"54e6a8068a06216f0557ec9c","id":864,"pasta":"Hello am 48 year man from somalia. Sorry for my bed england. I selled my wife for internet connection for play \"legend league\" and i want to become the goodest player like you I play with 400 ping on brazil server and i am challenger 2. pls no copy pasterino my story.\n","tags":"#lol#hello#somalia#sold#wife#internet","favourites":5,"__v":0,"created_on":"2015-02-20T03:20:32.879Z","score":0.00008813927851696363},{"_id":"54bf35973b0a330105ff5bc9","id":354,"pasta":"<;º ༽ ǫᴜɪɴɴ ɪᴛ ᴛᴏ ᴡɪɴ ɪᴛ <;º ༽","tags":"#lol#imaqtpie#quinn#win","favourites":6,"__v":0,"created_on":"2015-01-21T05:07:09.335Z","score":0.00008793407821022835},{"_id":"54c541a7150501067e808085","id":564,"pasta":"Ｙｏｕ ｇｕｙｓ ａｒｅ ｒｕｉｎｉｎｇ ｍｙ ｔｗｉｔｃｈ ｃｈａｔ ｅｘｐｅｒｉｅｎｃｅ． Ｉ ｃｏｍｅ ｔｏ ｔｈｅ ｔｗｉｔｃｈ ｃｈａｔ ｆｏｒ ｍａｔｕｒｅ ｃｏｎｖｅｒｓａｔｉｏｎ ａｂｏｕｔ ｔｈｅ ｇａｍｅｐｌａｙ， ｏｎｌｙ ｔｏ ｂｅ ａｗａｒｄｅｄ ｗｉｔｈ ｋａｐｐａ ｆａｃｅｓ ａｎｄ ｆｒａｎｋｅｒｚｓ． Ｐｅｏｐｌｅ ｗｈｏ ｓｐａｍ ｓａｉｄ ｆａｃｅｓ ｎｅｅｄ ｍｅｄｉｃａｌ ａｔｔｅｎｔｉｏｎ ｕｔｍｏｓｔ． Ｔｈｅ ｔｗｉｔｃｈ ｃｈａｔ ｉｓ ｓｅｒｉｏｕｓ ｂｕｓｉｎｅｓｓ， ａｎｄ ｔｈｅ ｍｏｄｓ ｓｈｏｕｌｄ ｒｅａｌｌｙ ｄｏ ｔｈｅｉｒ ｊｏｂｓ ｉｎ ｓｔｏｐｐｉｎｇ ｓｕｃｈ ｈｅｒｅｓｙ．","tags":"#twitch#dota#lol#csgo#chat#experience#antipasta","favourites":5,"__v":0,"created_on":"2015-01-25T14:17:48.787Z","score":0.00007492567200965374},{"_id":"54c16b8c5764903a3288022a","id":502,"pasta":"It's amazing just how much DOTA2 has become the antithesis to LoL.\n\nAside from the obvious gameplay, you have DOTA2 only selling costmetic changes while LoL readily sells various advantages to its players. But the most amazing and puzzling difference of all is that while LoL has a wide selection of beautiful and attractive girls, Dota 2 has a just as varied selection of handsome and sexy male heroes, the kind of which you just hope would stroke your face, carry you, and then take you to their home, where you would spend the night together making...eherm... I was getting much too ahead of myself.\n\nMy point, though, is that while the majority of LoL's heroes were designed to attract a primarily male audience, WHY does Dota 2's seem to have been designed to attract the fairer sex?","tags":"#lol#dota2#gay#female#male#heroes","favourites":5,"__v":0,"created_on":"2015-01-22T21:22:24.838Z","score":0.0000737344030994522},{"_id":"54e6a8048a06216f0557ec9a","id":862,"pasta":"Hi guise my name is francisco and im from brazil. i dropped from the potato factori to become best midlaner in ze world. i make huge progress and managed to climb from bronze v to bronze iv in only 3 months. love u scarra (best mordekaiser eu). sori for no propeller englando pls no copi pasterino macarroni ravioli spageti","tags":"#lol#name#francisco#brazil#bronze","favourites":4,"__v":0,"created_on":"2015-02-20T03:19:13.030Z","score":0.00006935074837664618},{"_id":"54e537b59be75f1867cb2315","id":841,"pasta":" Kacey inspires me, I have a huge penis just like she has huge breasts. I want to be able to show my crotch on stream like Kacey shows her tits on stream. I want to be able to have a chat full of female virgins that stroke their pussy for me just like Kacey's chat jerk their cocks for her. I want to be able to show cleavage of my ballsack on twitch stream just like Kacey shows cleavage of her chest on twitch stream. But most of all.... I want Kacey to suck this fat cock.","tags":"#lol#kaceytron#inspires#penis#breasts","favourites":4,"__v":0,"created_on":"2015-02-19T00:37:01.624Z","score":0.00006883034473538992},{"_id":"5508c51cb47c3d010fd96522","id":1091,"pasta":"Mr Santana, this is Riot HQ. We traced yesterday's LCS technical issues back to you forcing your large donger into CoreJJs cooling fan. If you do not formally apologize CLG will be fined $25,000 ","tags":"#lol#imaqtpie#riot#hq#lcs","favourites":3,"__v":0,"created_on":"2015-03-18T00:18:21.868Z","score":0.00005977710710370163},{"_id":"5508c50fb47c3d010fd96521","id":1090,"pasta":"Mr. Michael \"imaqtpie\" Santana, I am from the Supports Abused by Adc Foundation, and i would like to point out that you are guilty of verbally molesting all of your last supports. Please no \"copy pasta\", this is a serious warning.","tags":"#lol#imaqtpie#supports#abused","favourites":3,"__v":0,"created_on":"2015-03-18T00:17:29.069Z","score":0.00005977681849629848},{"_id":"5508c502b47c3d010fd96520","id":1089,"pasta":"Hi there Michael :3This is your high school friend Catherine You still know me ? :3 Anyways, I was wondering if we could get back into touch again )))) I assume that $$$ you made from playing in LCS made your cock grow SOOOO HUUUGE :3 ","tags":"#lol#imaqtpie#big#dick#club#catherine","favourites":3,"__v":0,"created_on":"2015-03-18T00:16:54.297Z","score":0.00005977662842860217},{"_id":"54b5f629f6a1885137f43ce7","id":190,"pasta":"つ ◕_◕ ༽つ MY LUBE IS READY, MY D*CK IS GETTING BIGGER, WITH THIS CHANT I SUMMON PHANTOML0RD ༼ つ ◕_◕ ༽つ","tags":"#lol#phantoml0rd#phantomlord#summon#chant","favourites":4,"__v":0,"created_on":"2015-01-14T04:51:19.670Z","score":0.000055180329738944865},{"_id":"54cd9438e79ec4797cbee2b0","id":646,"pasta":"ヽ༼ຈل͜ຈ༽ﾉ WALMART PC ◕_◕ ༽つ","tags":"#lol#kaceytron#pc","favourites":3,"__v":0,"created_on":"2015-02-01T01:14:56.605Z","score":0.0000437275043814176},{"_id":"552e844f41157097494d180f","id":1464,"pasta":"fairy disgusting player. He was inactive, idle, refused to play and frequently afk. He is getting offendet if anyone dares to react to this negativly. To make it worse he doesnt even try. It is not bad to be not as good as others but this player is infuriating inactive and just does nothing.\nReplays suggest similar actions in previous game, he showes a sickening extreme of refuse to play.\nHe cannot be talked to or reasoned with, since he always insists in some way to refuse to play. He never even trys! Utterly disgusting. He forces a massive unfair disadvantage just by occupying a player slot.\nTo be even more disgusting he belives \"everyone else is toxic\" if they dare to react to this outlandish exess of inactivity negativly. No swearing or insults required. He is one out of a thousand. An utterly disgusting player. Avoid","tags":"#dota2#csgo#lol#player#toxic#unfair","favourites":2,"__v":0,"created_on":"2015-04-15T14:17:04.034Z","score":0.00004303715168057157},{"_id":"54c09d54a9bec43831afc3e6","id":482,"pasta":"One day, I walked into the LCS studios - a happy and eager fan. I saw Eugene \"Pobelter\" Park smashing Eefje \"Sjokz\" Deporteres on the ANALyst desk. I didn't know what to do, I panicked and let out a shriek, Eugene looked at me and said, \"Better keep your mouth shut kid,\" he then took a puff of the blunt and kept destroying the European cooch.","tags":"#lol#lcs#studio#pobelter#sjokz","favourites":3,"__v":0,"created_on":"2015-01-22T06:32:21.509Z","score":0.000041231951938979465},{"_id":"54b5f5b0f6a1885137f43ce3","id":188,"pasta":"ヽ༼ຈل͜ຈ༽ﾉ This shirt is low cut, the gunnars are on. With this chant I summon Kaceytron ヽ༼ຈل͜ຈ༽ﾉ","tags":"#lol#kaceytron#summon#chant","favourites":3,"__v":0,"created_on":"2015-01-14T04:50:12.252Z","score":0.00003935860153420085},{"_id":"5508e288b47c3d010fd9657e","id":1129,"pasta":"America's place as the foremost world power is at jeopardy. Not because of middle eastern conflicts or China's economic awakening but because it does nothing to curb the tide of bronziocracy. American bronzies are given suffrage and even legal and reproductive rights despite having proved their inferior mental and moral status. In countries like Korea where being the worst at something is shameful people give their all to better themselves. However American culture celebrates mediocrity and encourages bronzies to merely stop playing the game when their self esteem might be tarnished by their inferior performances. Instead of sharpening their minds and, even more importantly, teaching themselves to overcome their inherent genetic disadvantages through hard work, American bronzies transition to smoking cannabis and having unprotected ***. They diminish their mental abilities even further while creating the next generation of bronzies. The only way to curb America's economic decline is the mandatory sterilization of all bronzies. While it would be inhumane to simply eradicate the bronzies America is already saddled with, their negative economic impact can be curbed by leveraging them as farm animals and mannequins.","tags":"#lol#rackier#bronzers#bronzies#bronze#america","favourites":2,"__v":0,"created_on":"2015-03-18T02:24:18.250Z","score":0.000033571962842556276}]