[{"_id":"54c1da7f15b4d6835b3394eb","id":514,"pasta":"It was a hot and sultry night at the c9 gaming house. everyone was in bed except for meteos and sneaky. \"we can't keep doing this, baby\" says sneaky. \"put that mouth to use, you dirty tramp\" replies meteos. \"LCS starts tmrw, and if you expect me to carry you again, i need to you to suck me to completion.\" sneaky grins sluttily, and goes to town","tags":"#lol#sneaky#meteos#lcs#fanfic","favourites":11,"__v":0,"created_on":"2015-01-23T05:06:00.603Z","score":0.000050094077492002905},{"_id":"54bfdeaa3b0a330105ff5cb6","id":424,"pasta":"Hello, Mitchell \"Pieqtima\" Santorin. This is Dallas - head admin of WHYSP.net | FUTUNARI speaking. I am contacting you today because it seems that you have not logged into our site in some time. I was just wondering if everything was OK? If you have a problem with our site, please don't hesitate to respond. Cheers.","tags":"#lol#imaqtpie#dallas#head#admin#whysp#futunari","favourites":11,"__v":0,"created_on":"2015-01-21T12:09:35.761Z","score":0.00004989434546411354},{"_id":"55769fef7d2300ce44f0cee7","id":1743,"pasta":"Hi \"imaqtpie\" this is Steves mom. My 13y old son wants to get money from me to get into some \"Big Dick Club\"? Explain this to me! Are you trying to Sex with children? i may have to involve the police..","tags":"#LoL#imaqtpie#BDC#steve","favourites":7,"__v":0,"created_on":"2015-06-08T19:21:02.758Z","score":0.00004739028462870489},{"_id":"54b2ee6ace7b585004706db8","id":31,"pasta":"Hi Michael it's Jarl Balgruuf the Greater. I heard you are trying to play other games when we need you here at Skyrim to clean up the dragons. Quit what you are doing right now and come join me as the new Whiterun Thane. My axe is ready as your reward.","tags":"#lol#imaqtpie#skyrim#jarl","favourites":10,"__v":0,"created_on":"2015-01-11T21:42:27.035Z","score":0.00004469465692296632},{"_id":"551353cd0489a24c09a597d5","id":1327,"pasta":"It was Dinner Time in the Cloud Nein Gaymer house. Zachary “Sneaky” Scuderi dishes up a steaming plate of pasta when he realizes he forgot the meat. William “Meteos” Hartman looks up from his plate with a gleam in his eye. “I got the meat right here for you baby.” Lubing up with Marinara Sauce, Meteos begins to pound his sausage into sneaky’s lightly buttered Dinner roll. With a scream of delight Meat-eos releases his load calling an end to another successful team dinner.","tags":"#LoL#Erotic#Cloud9","favourites":8,"__v":0,"created_on":"2015-03-26T00:29:38.025Z","score":0.00004341398685700774},{"_id":"550e73e92ab05ce134dd32e2","id":1279,"pasta":"  ༼ ºل͟º༼ ºل͟º( ͡° ͡ ͜ ͡ʖ ͡ °)ºل͟º ༽ºل͟º ༽ 5 MEN, 1 DREAM, 9 EYEBROWS ༼ ºل͟º༼ ºل͟º( ͡° ͡ ͜ ͡ʖ ͡ °)ºل͟º ༽ºل͟º ༽","tags":"#lol#genja#moscow5#donger","favourites":8,"__v":0,"created_on":"2015-03-22T06:01:39.686Z","score":0.00004298362106642282},{"_id":"5508c502b47c3d010fd96520","id":1089,"pasta":"Hi there Michael :3This is your high school friend Catherine You still know me ? :3 Anyways, I was wondering if we could get back into touch again )))) I assume that $$$ you made from playing in LCS made your cock grow SOOOO HUUUGE :3 ","tags":"#lol#imaqtpie#big#dick#club#catherine","favourites":7,"__v":0,"created_on":"2015-03-18T00:16:54.297Z","score":0.00003738425374716621},{"_id":"54e537b59be75f1867cb2315","id":841,"pasta":" Kacey inspires me, I have a huge penis just like she has huge breasts. I want to be able to show my crotch on stream like Kacey shows her tits on stream. I want to be able to have a chat full of female virgins that stroke their pussy for me just like Kacey's chat jerk their cocks for her. I want to be able to show cleavage of my ballsack on twitch stream just like Kacey shows cleavage of her chest on twitch stream. But most of all.... I want Kacey to suck this fat cock.","tags":"#lol#kaceytron#inspires#penis#breasts","favourites":7,"__v":0,"created_on":"2015-02-19T00:37:01.624Z","score":0.00003490917655838759},{"_id":"55cfb0ccf8c3a69c48797cea","id":2010,"pasta":"Imaqtpie's games were delayed today after a red powder was found on the rift. After analysis, Rioters determined the red substance, unknown to Imaqtpie, was the remnants of an enemy nexus. Games resumed after Rioters decided Imaqtpie was unlikely to encounter the substance again.\n","tags":"#imaqtpi#lol","favourites":4,"__v":0,"created_on":"2015-08-15T21:36:12.382Z","score":0.000033665316380646044},{"_id":"54cd9438e79ec4797cbee2b0","id":646,"pasta":"ヽ༼ຈل͜ຈ༽ﾉ WALMART PC ◕_◕ ༽つ","tags":"#lol#kaceytron#pc","favourites":7,"__v":0,"created_on":"2015-02-01T01:14:56.605Z","score":0.00003341898377287146},{"_id":"54bf35973b0a330105ff5bc9","id":354,"pasta":"<;º ༽ ǫᴜɪɴɴ ɪᴛ ᴛᴏ ᴡɪɴ ɪᴛ <;º ༽","tags":"#lol#imaqtpie#quinn#win","favourites":7,"__v":0,"created_on":"2015-01-21T05:07:09.335Z","score":0.00003257463400748659},{"_id":"5566b22edac4eb127bdadaa9","id":1679,"pasta":"Mr. Pepe. I pray to you that my League of Legends card will work this time. I spent $700 for one and I will use it to buy in-game money. My parents will be so proud of me because I will be the best on League of Legends. I also live in my grandma’s basement because I was kicked out for stealing money to buy more LoL cards. Mr. Pepe, please give buffs to Fiddlesticks. I don’t want to receive chronic aids from Karthus ult. Please. Nerf Karthus. I will also pay mucho pesos for a new computer because the last one blew up from me being too autistic and not laning right. these compooter hackers can really fry my rooter because my internet no longer works. rip in pizza.","tags":"#lol#pepe","favourites":5,"__v":0,"created_on":"2015-05-26T15:58:44.115Z","score":0.00003245169821501141},{"_id":"5508c52db47c3d010fd96523","id":1092,"pasta":"My name is Lisha. I am the significant other of Michael \"Imaqtpie\" Santana. He has a really big dick. But he also has a really small bunghole. Michael likes it when I insert my 10\" strapon into him while wearing a pirate hat and demands I say, \"prepare to be boarded!","tags":"#lol#imaqtpie#big#dick#small#bunghole","favourites":6,"__v":0,"created_on":"2015-03-18T00:20:27.381Z","score":0.00003211494175975658},{"_id":"5508c4a8b47c3d010fd9651b","id":1087,"pasta":"Did You Know? YAYO was first found in America in the year 1070. The native Dongers sang it to please their God. One day they didn't sing YAYO, a NACHO TORPEDO destroyed their whole culture. Ripperino Dongerino, all you knew was YAYO..\n","tags":"#twitch#lol#yayo#founded#nacho#torpedo","favourites":6,"__v":0,"created_on":"2015-03-18T00:13:24.201Z","score":0.000032114531347333535},{"_id":"54e6a8048a06216f0557ec9a","id":862,"pasta":"Hi guise my name is francisco and im from brazil. i dropped from the potato factori to become best midlaner in ze world. i make huge progress and managed to climb from bronze v to bronze iv in only 3 months. love u scarra (best mordekaiser eu). sori for no propeller englando pls no copi pasterino macarroni ravioli spageti","tags":"#lol#name#francisco#brazil#bronze","favourites":6,"__v":0,"created_on":"2015-02-20T03:19:13.030Z","score":0.000030071154288712473}]