[{"_id":"54f0df5487d1bc685b1e95a6","id":928,"pasta":"Play support\nHelp my teams loads\nSingle-handedly win the laning phase through ganks, despite no boots\nCarry doesn't know how to farm well\nOfflaner feeds after a great start\nMid goes too YOLO\nOther support and I are only decent players on our team\nLook at each other\nShrug\n\"Welp\"\nLose game","tags":"#dota2#lol#support#life","favourites":1,"__v":0,"created_on":"2015-02-27T19:50:21.446Z","score":0},{"_id":"54f124c187d1bc685b1e95ac","id":931,"pasta":"(◕‿◕✿) nice gj RFLegendary! u can do this! (◡‿◡✿)","tags":"#lol#RFLegendary#positive","favourites":1,"__v":0,"created_on":"2015-02-28T01:45:41.232Z","score":0},{"_id":"54f2358587d1bc685b1e95c1","id":940,"pasta":"I sexually Identify as a minion. Ever since I was a boy I dreamed of walking down the lanes of Summoners Rift just to get slaughtered instantly. People say to me that a person being a minion is Impossible and I'm fucking retarded but I don't care, I'm beautiful. I'm having a plastic surgeon install a little stone helmet, shield and battle hammer on my body. From now on I want you guys to call me \"blue melee creep\" and respect my right to willingly suicide into powerful enemy champions. If you can't accept me you're a miniophobe and need to check your summoning privilege. Thank you for being so understanding.","tags":"#lol#sexually#identify#minion","favourites":1,"__v":0,"created_on":"2015-02-28T21:38:39.504Z","score":0},{"_id":"5508c40ab47c3d010fd96517","id":1085,"pasta":"Reginald's story.\nWhat a lot of people don't know is TSM Reginald was originally a 6'2\" Blonde Haired Blue-Eyed Aryan Male with an IQ of over 190.\nIn season 1, on a Team TSM trip to the Zoo, he fell into the monkey enclosure, and was messily devoured by one of the apes.\nSo the rest of TSM decided to just give the ape Regi's login info and make him the new reginald. They taught him to play league of legends. Dyrus joined the team after that, and that's why they're always butting heads, Regi thinks he's a threat to his territory.","tags":"#lol#reginald#story#tsm","favourites":0,"__v":0,"created_on":"2015-03-18T00:07:41.023Z","score":0},{"_id":"5508c558b47c3d010fd96526","id":1095,"pasta":"Hᴇʟʟᴏ Mʀ. Pɪᴇ I ᴀᴍ Mᴀʀɪᴏ Rɪɢᴀᴛᴏɴᴇ ғʀᴏᴍ Pᴀsᴛᴀʀᴏɴɪ ɪɴᴅᴜsᴛʀɪᴇs I ᴡᴀɴᴛ ᴛᴏ ᴍᴀᴋᴇ ɴᴇᴡ ᴘᴀsᴛᴀ ɪɴsᴘɪʀᴇ ʙʏ ʏᴏᴜʀ ᴀᴅᴄ ᴘʟᴀʏ I ᴄᴀʟʟ ɪᴛ ᴛʜᴇ sᴀɴᴛᴀɴᴀ ʙᴀɴᴀɴᴀ ᴍᴀᴄᴀʀᴏɴɪ. Pʟᴇᴀsᴇ ɴᴏ Rᴀᴠɪᴏʟɪ ʟɪɴɢᴜɪɴɪ ᴘᴀsᴛᴀʀɪɴᴏ ","tags":"#lol#imqtpie#mario#rigatone#pasta","favourites":0,"__v":0,"created_on":"2015-03-18T00:21:22.354Z","score":0},{"_id":"5508e1bcb47c3d010fd9657c","id":1128,"pasta":"Low elos should learn to stop back talking diamond 1s or higher. If someone from bronze has an opinion that differs from a diamond 1's, the bronzie should NOT try to reason with the high elo. He shouldn't ask why either. He should take what the diamond says as fact without talking back. Too many times, I've seen a bronzie backtalk a diamond 1, and it's disgusting, because the bronzie is wrong most of the time. The only time a bronzie is right is when 500,000 bronzies are talking back to a single diamond 1. There's a reason why you're stuck in bronze. It's because you think differently than the diamonds. Start thinking like a diamond. - Rackier","tags":"#lol#low#elo#scrubs#shitters#rackier","favourites":0,"__v":0,"created_on":"2015-03-18T02:22:54.147Z","score":0},{"_id":"5508e288b47c3d010fd9657e","id":1129,"pasta":"America's place as the foremost world power is at jeopardy. Not because of middle eastern conflicts or China's economic awakening but because it does nothing to curb the tide of bronziocracy. American bronzies are given suffrage and even legal and reproductive rights despite having proved their inferior mental and moral status. In countries like Korea where being the worst at something is shameful people give their all to better themselves. However American culture celebrates mediocrity and encourages bronzies to merely stop playing the game when their self esteem might be tarnished by their inferior performances. Instead of sharpening their minds and, even more importantly, teaching themselves to overcome their inherent genetic disadvantages through hard work, American bronzies transition to smoking cannabis and having unprotected ***. They diminish their mental abilities even further while creating the next generation of bronzies. The only way to curb America's economic decline is the mandatory sterilization of all bronzies. While it would be inhumane to simply eradicate the bronzies America is already saddled with, their negative economic impact can be curbed by leveraging them as farm animals and mannequins.","tags":"#lol#rackier#bronzers#bronzies#bronze#america","favourites":1,"__v":0,"created_on":"2015-03-18T02:24:18.250Z","score":0},{"_id":"550dcf8b2ab05ce134dd32ca","id":1268,"pasta":"Hey QT, I just had my first child, and since im such a big fan, I named him Big D1ck. Would you please be the godfather??","tags":"#LoL#imaqtpie#child#big#dick","favourites":1,"__v":0,"created_on":"2015-03-21T16:30:14.951Z","score":0},{"_id":"551353cd0489a24c09a597d5","id":1327,"pasta":"It was Dinner Time in the Cloud Nein Gaymer house. Zachary “Sneaky” Scuderi dishes up a steaming plate of pasta when he realizes he forgot the meat. William “Meteos” Hartman looks up from his plate with a gleam in his eye. “I got the meat right here for you baby.” Lubing up with Marinara Sauce, Meteos begins to pound his sausage into sneaky’s lightly buttered Dinner roll. With a scream of delight Meat-eos releases his load calling an end to another successful team dinner.","tags":"#LoL#Erotic#Cloud9","favourites":0,"__v":0,"created_on":"2015-03-26T00:29:38.025Z","score":0}]