[{"_id":"54cec6e9574e442b035d5fd8","id":664,"pasta":"ヽヽ༼༼ຈຈل͜ل͜ຈຈ༽༽ﾉﾉ KACEY TURN OFF THE VIBRATOR ヽヽ༼༼ຈຈل͜ل͜ຈຈ༽༽ﾉﾉ","tags":"#lol#kaceytron#turn#off#vibrator","favourites":6,"__v":0,"created_on":"2015-02-01T23:48:18.893Z","score":0.00002877288147283023},{"_id":"54c16b8c5764903a3288022a","id":502,"pasta":"It's amazing just how much DOTA2 has become the antithesis to LoL.\n\nAside from the obvious gameplay, you have DOTA2 only selling costmetic changes while LoL readily sells various advantages to its players. But the most amazing and puzzling difference of all is that while LoL has a wide selection of beautiful and attractive girls, Dota 2 has a just as varied selection of handsome and sexy male heroes, the kind of which you just hope would stroke your face, carry you, and then take you to their home, where you would spend the night together making...eherm... I was getting much too ahead of myself.\n\nMy point, though, is that while the majority of LoL's heroes were designed to attract a primarily male audience, WHY does Dota 2's seem to have been designed to attract the fairer sex?","tags":"#lol#dota2#gay#female#male#heroes","favourites":6,"__v":0,"created_on":"2015-01-22T21:22:24.838Z","score":0.000028093132928809677},{"_id":"54c541a7150501067e808085","id":564,"pasta":"Ｙｏｕ ｇｕｙｓ ａｒｅ ｒｕｉｎｉｎｇ ｍｙ ｔｗｉｔｃｈ ｃｈａｔ ｅｘｐｅｒｉｅｎｃｅ． Ｉ ｃｏｍｅ ｔｏ ｔｈｅ ｔｗｉｔｃｈ ｃｈａｔ ｆｏｒ ｍａｔｕｒｅ ｃｏｎｖｅｒｓａｔｉｏｎ ａｂｏｕｔ ｔｈｅ ｇａｍｅｐｌａｙ， ｏｎｌｙ ｔｏ ｂｅ ａｗａｒｄｅｄ ｗｉｔｈ ｋａｐｐａ ｆａｃｅｓ ａｎｄ ｆｒａｎｋｅｒｚｓ． Ｐｅｏｐｌｅ ｗｈｏ ｓｐａｍ ｓａｉｄ ｆａｃｅｓ ｎｅｅｄ ｍｅｄｉｃａｌ ａｔｔｅｎｔｉｏｎ ｕｔｍｏｓｔ． Ｔｈｅ ｔｗｉｔｃｈ ｃｈａｔ ｉｓ ｓｅｒｉｏｕｓ ｂｕｓｉｎｅｓｓ， ａｎｄ ｔｈｅ ｍｏｄｓ ｓｈｏｕｌｄ ｒｅａｌｌｙ ｄｏ ｔｈｅｉｒ ｊｏｂｓ ｉｎ ｓｔｏｐｐｉｎｇ ｓｕｃｈ ｈｅｒｅｓｙ．","tags":"#twitch#dota#lol#csgo#chat#experience#antipasta","favourites":5,"__v":0,"created_on":"2015-01-25T14:17:48.787Z","score":0.00002347486148769355},{"_id":"54bfda883b0a330105ff5cb1","id":419,"pasta":"I once saw a stream on twitch.tv i was browsing through pornhub that time and i typed cow's i finally found a guy who was wearing a cowsuit and a cow hat my dick slowly got hard after that it took me 3hours to cum but when i did my dick finally realized the true meaning of sex even though it was me jerking off it still felt like sex through my monitor i felt i was in touch with the guy who was wearing a cow suit and a cow hat yet later that day i did fap 2 him again and it felt like shit thank you for teaching me how to play league of yigends cowsex senpai.","tags":"#lol#cowsep#pornhub#cowsuit#cow#sex","favourites":5,"__v":0,"created_on":"2015-01-21T11:07:25.551Z","score":0.000023248279309566756},{"_id":"54b5f629f6a1885137f43ce7","id":190,"pasta":"つ ◕_◕ ༽つ MY LUBE IS READY, MY D*CK IS GETTING BIGGER, WITH THIS CHANT I SUMMON PHANTOML0RD ༼ つ ◕_◕ ༽つ","tags":"#lol#phantoml0rd#phantomlord#summon#chant","favourites":5,"__v":0,"created_on":"2015-01-14T04:51:19.670Z","score":0.000022859530350053593},{"_id":"552e844f41157097494d180f","id":1464,"pasta":"fairy disgusting player. He was inactive, idle, refused to play and frequently afk. He is getting offendet if anyone dares to react to this negativly. To make it worse he doesnt even try. It is not bad to be not as good as others but this player is infuriating inactive and just does nothing.\nReplays suggest similar actions in previous game, he showes a sickening extreme of refuse to play.\nHe cannot be talked to or reasoned with, since he always insists in some way to refuse to play. He never even trys! Utterly disgusting. He forces a massive unfair disadvantage just by occupying a player slot.\nTo be even more disgusting he belives \"everyone else is toxic\" if they dare to react to this outlandish exess of inactivity negativly. No swearing or insults required. He is one out of a thousand. An utterly disgusting player. Avoid","tags":"#dota2#csgo#lol#player#toxic#unfair","favourites":4,"__v":0,"created_on":"2015-04-15T14:17:04.034Z","score":0.00002265824738526102},{"_id":"5508c51cb47c3d010fd96522","id":1091,"pasta":"Mr Santana, this is Riot HQ. We traced yesterday's LCS technical issues back to you forcing your large donger into CoreJJs cooling fan. If you do not formally apologize CLG will be fined $25,000 ","tags":"#lol#imaqtpie#riot#hq#lcs","favourites":4,"__v":0,"created_on":"2015-03-18T00:18:21.868Z","score":0.000020981258503690816},{"_id":"5508c50fb47c3d010fd96521","id":1090,"pasta":"Mr. Michael \"imaqtpie\" Santana, I am from the Supports Abused by Adc Foundation, and i would like to point out that you are guilty of verbally molesting all of your last supports. Please no \"copy pasta\", this is a serious warning.","tags":"#lol#imaqtpie#supports#abused","favourites":4,"__v":0,"created_on":"2015-03-18T00:17:29.069Z","score":0.000020981225049655423},{"_id":"54c09d54a9bec43831afc3e6","id":482,"pasta":"One day, I walked into the LCS studios - a happy and eager fan. I saw Eugene \"Pobelter\" Park smashing Eefje \"Sjokz\" Deporteres on the ANALyst desk. I didn't know what to do, I panicked and let out a shriek, Eugene looked at me and said, \"Better keep your mouth shut kid,\" he then took a puff of the blunt and kept destroying the European cooch.","tags":"#lol#lcs#studio#pobelter#sjokz","favourites":4,"__v":0,"created_on":"2015-01-22T06:32:21.509Z","score":0.000018327248854142645},{"_id":"54b5f5b0f6a1885137f43ce3","id":188,"pasta":"ヽ༼ຈل͜ຈ༽ﾉ This shirt is low cut, the gunnars are on. With this chant I summon Kaceytron ヽ༼ຈل͜ຈ༽ﾉ","tags":"#lol#kaceytron#summon#chant","favourites":4,"__v":0,"created_on":"2015-01-14T04:50:12.252Z","score":0.000017986675849358886},{"_id":"550dcf8b2ab05ce134dd32ca","id":1268,"pasta":"Hey QT, I just had my first child, and since im such a big fan, I named him Big D1ck. Would you please be the godfather??","tags":"#LoL#imaqtpie#child#big#dick","favourites":3,"__v":0,"created_on":"2015-03-21T16:30:14.951Z","score":0.000015110162419734167},{"_id":"5508e288b47c3d010fd9657e","id":1129,"pasta":"America's place as the foremost world power is at jeopardy. Not because of middle eastern conflicts or China's economic awakening but because it does nothing to curb the tide of bronziocracy. American bronzies are given suffrage and even legal and reproductive rights despite having proved their inferior mental and moral status. In countries like Korea where being the worst at something is shameful people give their all to better themselves. However American culture celebrates mediocrity and encourages bronzies to merely stop playing the game when their self esteem might be tarnished by their inferior performances. Instead of sharpening their minds and, even more importantly, teaching themselves to overcome their inherent genetic disadvantages through hard work, American bronzies transition to smoking cannabis and having unprotected ***. They diminish their mental abilities even further while creating the next generation of bronzies. The only way to curb America's economic decline is the mandatory sterilization of all bronzies. While it would be inhumane to simply eradicate the bronzies America is already saddled with, their negative economic impact can be curbed by leveraging them as farm animals and mannequins.","tags":"#lol#rackier#bronzers#bronzies#bronze#america","favourites":3,"__v":0,"created_on":"2015-03-18T02:24:18.250Z","score":0.000014968832597939406},{"_id":"5508c558b47c3d010fd96526","id":1095,"pasta":"Hᴇʟʟᴏ Mʀ. Pɪᴇ I ᴀᴍ Mᴀʀɪᴏ Rɪɢᴀᴛᴏɴᴇ ғʀᴏᴍ Pᴀsᴛᴀʀᴏɴɪ ɪɴᴅᴜsᴛʀɪᴇs I ᴡᴀɴᴛ ᴛᴏ ᴍᴀᴋᴇ ɴᴇᴡ ᴘᴀsᴛᴀ ɪɴsᴘɪʀᴇ ʙʏ ʏᴏᴜʀ ᴀᴅᴄ ᴘʟᴀʏ I ᴄᴀʟʟ ɪᴛ ᴛʜᴇ sᴀɴᴛᴀɴᴀ ʙᴀɴᴀɴᴀ ᴍᴀᴄᴀʀᴏɴɪ. Pʟᴇᴀsᴇ ɴᴏ Rᴀᴠɪᴏʟɪ ʟɪɴɢᴜɪɴɪ ᴘᴀsᴛᴀʀɪɴᴏ ","tags":"#lol#imqtpie#mario#rigatone#pasta","favourites":3,"__v":0,"created_on":"2015-03-18T00:21:22.354Z","score":0.000014965498434852984},{"_id":"54de3323a43a9c0e1c527fed","id":782,"pasta":"Right I'll tell you what you fat little cunt you're boring, you dont sound Nigerian at all so go fuck yourself, go and fucking crawl in the dirty dank little hole where you fucking come from you dirty dragon eating little fucking spastic.","tags":"#lol#kaceytron#cunt#bitch#nigerian","favourites":3,"__v":0,"created_on":"2015-02-13T16:49:08.683Z","score":0.000013792919826503352},{"_id":"55cee14d2698f7be3d0ad888","id":2003,"pasta":"Now, everybody from the BSB\nPut your motherfucking hands up and follow me\nEverybody from the BSB, put your motherfucking hands up\nlook, look\n\nNow while Exodus stands tough\nNotice that they didn't have their hands up\nThis True Solo channel got you gassed up\nNow who's afraid of being Unlinked\n1, 2 3 and to the 4\n1 OGB, 2 OGB, 3 OGB, 4\n4 OGB, 3 OGB, 2 OGB, 1\nYou're linked, he's linked, our links, none\nThese guys ain't no mother fucking soloers\nthey have never undocked without Evasive Maneuvers\nI don't have implants, I do die often\nif I did have links maybe I would have won\nand I did get jumped, by all 6 of you linked chumps\nand I did get scrammed at 18 kilometers\nand I'm still standing here screaming fuck Interdiction Maneuvers\nYou don't know what the fuck I've been through\nBut I know something about you\nYou can't PvP if you're not in fleet with a Tengu\nWhats the matter Auraus you embarrassed? \nThis guys a Soloer? He has an OGB\nAnd Exodus flies a 9km/s malediction\nall their solo kills are pure fiction\nThis guy don't wanna solo, he ain't elite\nCause ain't no such thing as solo being in fleet\nHe's scared to death, scared to look at the patchnotes\nfuck Exodus.\n\nFuck the beat, I'll go a capella\nFuck OGBs, fuck T3Ds, Fuck Falcons, Fuck everything\nFuck ya'll if you doubt me\nI'm a fucking true soloer, I say it proudly\nand fuck this battle, I don't wanna win, I'm outtie\nHere, link these people something that you killed without an OGB\n","tags":"#EVE#OGB#BSB#Auraus#lolowned","favourites":2,"__v":0,"created_on":"2015-08-15T06:50:53.845Z","score":0.000013445149866199209}]