[{"_id":"54de3323a43a9c0e1c527fed","id":782,"pasta":"Right I'll tell you what you fat little cunt you're boring, you dont sound Nigerian at all so go fuck yourself, go and fucking crawl in the dirty dank little hole where you fucking come from you dirty dragon eating little fucking spastic.","tags":"#lol#kaceytron#cunt#bitch#nigerian","favourites":1,"__v":0,"created_on":"2015-02-13T16:49:08.683Z","score":0},{"_id":"54e36e7089c96e65288919fb","id":820,"pasta":"LoL and Dota have lots of denying in common:\n\nDenying that I got reported for a good reason.\n\nDenying that mid called \"Missing\" before I got ganked.\n\nDenying that other people are better at the game than me.\n\nDenying that I'll never go pro.\n\nDenying that my MMR represents my actual skill level.","tags":"#dota2#lol#denying#common","favourites":0,"__v":0,"created_on":"2015-02-17T10:21:18.908Z","score":0},{"_id":"54f0df5487d1bc685b1e95a6","id":928,"pasta":"Play support\nHelp my teams loads\nSingle-handedly win the laning phase through ganks, despite no boots\nCarry doesn't know how to farm well\nOfflaner feeds after a great start\nMid goes too YOLO\nOther support and I are only decent players on our team\nLook at each other\nShrug\n\"Welp\"\nLose game","tags":"#dota2#lol#support#life","favourites":1,"__v":0,"created_on":"2015-02-27T19:50:21.446Z","score":0},{"_id":"5508c558b47c3d010fd96526","id":1095,"pasta":"Hᴇʟʟᴏ Mʀ. Pɪᴇ I ᴀᴍ Mᴀʀɪᴏ Rɪɢᴀᴛᴏɴᴇ ғʀᴏᴍ Pᴀsᴛᴀʀᴏɴɪ ɪɴᴅᴜsᴛʀɪᴇs I ᴡᴀɴᴛ ᴛᴏ ᴍᴀᴋᴇ ɴᴇᴡ ᴘᴀsᴛᴀ ɪɴsᴘɪʀᴇ ʙʏ ʏᴏᴜʀ ᴀᴅᴄ ᴘʟᴀʏ I ᴄᴀʟʟ ɪᴛ ᴛʜᴇ sᴀɴᴛᴀɴᴀ ʙᴀɴᴀɴᴀ ᴍᴀᴄᴀʀᴏɴɪ. Pʟᴇᴀsᴇ ɴᴏ Rᴀᴠɪᴏʟɪ ʟɪɴɢᴜɪɴɪ ᴘᴀsᴛᴀʀɪɴᴏ ","tags":"#lol#imqtpie#mario#rigatone#pasta","favourites":0,"__v":0,"created_on":"2015-03-18T00:21:22.354Z","score":0},{"_id":"5508e1bcb47c3d010fd9657c","id":1128,"pasta":"Low elos should learn to stop back talking diamond 1s or higher. If someone from bronze has an opinion that differs from a diamond 1's, the bronzie should NOT try to reason with the high elo. He shouldn't ask why either. He should take what the diamond says as fact without talking back. Too many times, I've seen a bronzie backtalk a diamond 1, and it's disgusting, because the bronzie is wrong most of the time. The only time a bronzie is right is when 500,000 bronzies are talking back to a single diamond 1. There's a reason why you're stuck in bronze. It's because you think differently than the diamonds. Start thinking like a diamond. - Rackier","tags":"#lol#low#elo#scrubs#shitters#rackier","favourites":0,"__v":0,"created_on":"2015-03-18T02:22:54.147Z","score":0},{"_id":"550dcf8b2ab05ce134dd32ca","id":1268,"pasta":"Hey QT, I just had my first child, and since im such a big fan, I named him Big D1ck. Would you please be the godfather??","tags":"#LoL#imaqtpie#child#big#dick","favourites":1,"__v":0,"created_on":"2015-03-21T16:30:14.951Z","score":0},{"_id":"554656f592ac5d29444dfc7e","id":1564,"pasta":"Assaultmode: Quickly removing her clothes, Miss Fortune stuck her tongue out, first tasting Soraka’s swollen, sweaty balls. Soraka’s scent completely dominated Miss Fortune, she moved her tongue upwards slowly, while drinking the nectar that was the Starchild’s salty sweat.\n","tags":"#lol#miss#fortune#soraka#balls","favourites":0,"__v":0,"created_on":"2015-05-03T08:01:28.235Z","score":0},{"_id":"554ec5353895206d68ad36a4","id":1613,"pasta":"I invited a Jinx cosplay to my hotel room and we had sex. We spent the night together. When I woke up to go use the bathroom I looked in the mirror and saw the words \"Get Jinxed\" written all over my head. The girl was gone and so were some of the food I brought to the hotel.","tags":"#lol#Jinx#cosplay","favourites":1,"__v":0,"created_on":"2015-05-10T02:29:41.001Z","score":0},{"_id":"5554c434709a8b601ae12e06","id":1632,"pasta":"Formerly CLG Link here, I just wanted to say that the main problem with CLG was not me choking, but deflecting blame onto other players. Please read my 17 page document deflecting all the blame onto my team mates. Farewell! #CLGFIGHTING","tags":"#lol#leagueoflegends#Link#clg#blame","favourites":0,"__v":0,"created_on":"2015-05-14T07:15:57.734Z","score":0},{"_id":"5566b22edac4eb127bdadaa9","id":1679,"pasta":"Mr. Pepe. I pray to you that my League of Legends card will work this time. I spent $700 for one and I will use it to buy in-game money. My parents will be so proud of me because I will be the best on League of Legends. I also live in my grandma’s basement because I was kicked out for stealing money to buy more LoL cards. Mr. Pepe, please give buffs to Fiddlesticks. I don’t want to receive chronic aids from Karthus ult. Please. Nerf Karthus. I will also pay mucho pesos for a new computer because the last one blew up from me being too autistic and not laning right. these compooter hackers can really fry my rooter because my internet no longer works. rip in pizza.","tags":"#lol#pepe","favourites":1,"__v":0,"created_on":"2015-05-26T15:58:44.115Z","score":0},{"_id":"55769fef7d2300ce44f0cee7","id":1743,"pasta":"Hi \"imaqtpie\" this is Steves mom. My 13y old son wants to get money from me to get into some \"Big Dick Club\"? Explain this to me! Are you trying to Sex with children? i may have to involve the police..","tags":"#LoL#imaqtpie#BDC#steve","favourites":1,"__v":0,"created_on":"2015-06-08T19:21:02.758Z","score":0},{"_id":"558b9a092a7929bd7a8b1f91","id":1805,"pasta":"-----------------------+_+--------------------- im the invisible man\n-----------------------+_+--------------------- im the invisible man\n-----------------------+_+--------------------- incredible how you can\n-----------------------+_+--------------------- see right through me","tags":"#Queen#updated#plzkillme#LoL","favourites":1,"__v":0,"created_on":"2015-06-24T20:07:02.283Z","score":0},{"_id":"55b960f5a92005fc4d048604","id":1929,"pasta":"there were three men there.. three men in that hole, nervous as ever, sitting in that hole to keep\ncover from the wizzing projectiles. three men. three memes. we knew we needed to get out of that hole, but it was nearly too late. The enemy was pushing us at an unbelievable rate. I peek my head, and see a large vengence. Many men with their guns out, running with dirt, smeard on their faces.. it was time. My men scream in terror. \"Why gabe. Why?\" holding the cross in his hand. 6 men hop in the hole and start shooting. I see bullets fill my comrads body, blood shoots all around me and my other comrad. As I start to scream in terror, it seems as if its too late..  A sharp pain obvurs in my neck and suddenly beathing air is very hot, and instantly I stop breating.. My heart beats faster than a train at top speed. Before i know it, a fuse ticks in my mind, and I close my eyes, thinking about all the weed I could of been smoking.. My spirit is free. I am free. I leave the hole, and see all the faggots who just shot me.. as scarce as it is.. I fly, fly high up to the sunlight in the air. Black and white images in my sight, but one blink, and a throne was beheald in front of me.\nI look at the throne, and see my king.. Gaben.. Gaben smiles with a might, and presses his glasses upon his face. I thank Gaben, and praise gaben. Gaben greets me, and tours me around Seaven. He takes me to my NASA computer, and pulls up the steam library.. I notice something very abnormal and suddenly merate the biggest smile. My steam library is filled with millions of games.. And my latency is very low.. The peace in Seaven, is healthy, but before I do anything, I feel a tap upon my shoulder. It's my comrad! Looking sharp as ever aswell. We smile and hug eachother, and grasp upon our lives. Gaben is my leader we say, Gallahu Salebar I say, and sit down to open up dota.. Another day I say.. Another day.","tags":"#dota2#gaben#lol#allah","favourites":1,"__v":0,"created_on":"2015-07-29T23:25:41.618Z","score":0},{"_id":"55cee12d2698f7be3d0ad87f","id":1994,"pasta":" I put my hand down my pants for the 6th day of the week. Gripping my dong, I jerk it to Sneaky. Bitter tears begin rolling down my face. I use one hand to take a bite of my sandwich and type \"Kappa\" in chat. I realize my life has become Sneaky and Twitch. Then I see Sneaky smile and realize, this is a good thing. The tears become tears of joy and I finish onto my keyboard... all for Sneaky..","tags":"#LoL#C9Sneaky#sandwich#Kappa","favourites":1,"__v":0,"created_on":"2015-08-15T06:50:21.621Z","score":0},{"_id":"55cee14d2698f7be3d0ad888","id":2003,"pasta":"Now, everybody from the BSB\nPut your motherfucking hands up and follow me\nEverybody from the BSB, put your motherfucking hands up\nlook, look\n\nNow while Exodus stands tough\nNotice that they didn't have their hands up\nThis True Solo channel got you gassed up\nNow who's afraid of being Unlinked\n1, 2 3 and to the 4\n1 OGB, 2 OGB, 3 OGB, 4\n4 OGB, 3 OGB, 2 OGB, 1\nYou're linked, he's linked, our links, none\nThese guys ain't no mother fucking soloers\nthey have never undocked without Evasive Maneuvers\nI don't have implants, I do die often\nif I did have links maybe I would have won\nand I did get jumped, by all 6 of you linked chumps\nand I did get scrammed at 18 kilometers\nand I'm still standing here screaming fuck Interdiction Maneuvers\nYou don't know what the fuck I've been through\nBut I know something about you\nYou can't PvP if you're not in fleet with a Tengu\nWhats the matter Auraus you embarrassed? \nThis guys a Soloer? He has an OGB\nAnd Exodus flies a 9km/s malediction\nall their solo kills are pure fiction\nThis guy don't wanna solo, he ain't elite\nCause ain't no such thing as solo being in fleet\nHe's scared to death, scared to look at the patchnotes\nfuck Exodus.\n\nFuck the beat, I'll go a capella\nFuck OGBs, fuck T3Ds, Fuck Falcons, Fuck everything\nFuck ya'll if you doubt me\nI'm a fucking true soloer, I say it proudly\nand fuck this battle, I don't wanna win, I'm outtie\nHere, link these people something that you killed without an OGB\n","tags":"#EVE#OGB#BSB#Auraus#lolowned","favourites":0,"__v":0,"created_on":"2015-08-15T06:50:53.845Z","score":0}]