[{"_id":"55d54e7a5e068c5a59e472cc","id":2023,"pasta":"(∩ sneakyW )⊃━☆ﾟ. ･ ｡ﾟMy dick is small, my butthole is leaky, I use this chant, to summon Sneaky","tags":"#LoL#Sneaky#Cloud9","favourites":0,"__v":0,"created_on":"2015-08-20T03:50:18.214Z","score":0},{"_id":"55cfb0ccf8c3a69c48797cea","id":2010,"pasta":"Imaqtpie's games were delayed today after a red powder was found on the rift. After analysis, Rioters determined the red substance, unknown to Imaqtpie, was the remnants of an enemy nexus. Games resumed after Rioters decided Imaqtpie was unlikely to encounter the substance again.\n","tags":"#imaqtpi#lol","favourites":1,"__v":0,"created_on":"2015-08-15T21:36:12.382Z","score":0},{"_id":"55cee14d2698f7be3d0ad888","id":2003,"pasta":"Now, everybody from the BSB\nPut your motherfucking hands up and follow me\nEverybody from the BSB, put your motherfucking hands up\nlook, look\n\nNow while Exodus stands tough\nNotice that they didn't have their hands up\nThis True Solo channel got you gassed up\nNow who's afraid of being Unlinked\n1, 2 3 and to the 4\n1 OGB, 2 OGB, 3 OGB, 4\n4 OGB, 3 OGB, 2 OGB, 1\nYou're linked, he's linked, our links, none\nThese guys ain't no mother fucking soloers\nthey have never undocked without Evasive Maneuvers\nI don't have implants, I do die often\nif I did have links maybe I would have won\nand I did get jumped, by all 6 of you linked chumps\nand I did get scrammed at 18 kilometers\nand I'm still standing here screaming fuck Interdiction Maneuvers\nYou don't know what the fuck I've been through\nBut I know something about you\nYou can't PvP if you're not in fleet with a Tengu\nWhats the matter Auraus you embarrassed? \nThis guys a Soloer? He has an OGB\nAnd Exodus flies a 9km/s malediction\nall their solo kills are pure fiction\nThis guy don't wanna solo, he ain't elite\nCause ain't no such thing as solo being in fleet\nHe's scared to death, scared to look at the patchnotes\nfuck Exodus.\n\nFuck the beat, I'll go a capella\nFuck OGBs, fuck T3Ds, Fuck Falcons, Fuck everything\nFuck ya'll if you doubt me\nI'm a fucking true soloer, I say it proudly\nand fuck this battle, I don't wanna win, I'm outtie\nHere, link these people something that you killed without an OGB\n","tags":"#EVE#OGB#BSB#Auraus#lolowned","favourites":0,"__v":0,"created_on":"2015-08-15T06:50:53.845Z","score":0},{"_id":"55cee12d2698f7be3d0ad87f","id":1994,"pasta":" I put my hand down my pants for the 6th day of the week. Gripping my dong, I jerk it to Sneaky. Bitter tears begin rolling down my face. I use one hand to take a bite of my sandwich and type \"Kappa\" in chat. I realize my life has become Sneaky and Twitch. Then I see Sneaky smile and realize, this is a good thing. The tears become tears of joy and I finish onto my keyboard... all for Sneaky..","tags":"#LoL#C9Sneaky#sandwich#Kappa","favourites":1,"__v":0,"created_on":"2015-08-15T06:50:21.621Z","score":0},{"_id":"55bd5ff1f300bfdf5990c0e2","id":1951,"pasta":"Once upon a time, I opened a LoL game. I entered the game, and I was promptly greeted by another player. I noticed it was a female player and I was pleasantly surprised. I told her of my great love for the female anatomy, particularly the breasts and the backside. To my surprise, she told me she also enjoyed these things. It was then that I realised, I was playing League of Lesbians.....","tags":"#lol#league#of#lesbians#dota2","favourites":22,"__v":0,"created_on":"2015-08-02T00:10:25.569Z","score":0.005225669057754768},{"_id":"55bd5f95f300bfdf5990c0da","id":1943,"pasta":"hello i am selling elo boost for $6.99/second, if you are interested please contact me @ xiaoweixiao on skype","tags":"#lol#xwx#eloboost","favourites":4,"__v":0,"created_on":"2015-08-02T00:08:53.516Z","score":0.00103244346631928},{"_id":"55bd5f8cf300bfdf5990c0d9","id":1942,"pasta":"A Dota player and a LoL player walks into a bar. The Dota gamer turns around to the LoL gamer saying, \"LoL sucks!\" The LoL player couldn't deny. ","tags":"#dota2#lol#deny#joke","favourites":22,"__v":0,"created_on":"2015-08-02T00:08:44.323Z","score":0.005225308367589037},{"_id":"55b96125a92005fc4d048607","id":1932,"pasta":"trynd's village was killed\n'why did you kill my village' asked trynd to man who kill village\n'nothing personnel kid' he replied, tipping his fedora\nthen trynd was mad\nthe end","tags":"#leagueoflegends#lol#tryndamere#lore","favourites":6,"__v":0,"created_on":"2015-07-29T23:26:29.595Z","score":0.0013375179284826483},{"_id":"55b960f5a92005fc4d048604","id":1929,"pasta":"there were three men there.. three men in that hole, nervous as ever, sitting in that hole to keep\ncover from the wizzing projectiles. three men. three memes. we knew we needed to get out of that hole, but it was nearly too late. The enemy was pushing us at an unbelievable rate. I peek my head, and see a large vengence. Many men with their guns out, running with dirt, smeard on their faces.. it was time. My men scream in terror. \"Why gabe. Why?\" holding the cross in his hand. 6 men hop in the hole and start shooting. I see bullets fill my comrads body, blood shoots all around me and my other comrad. As I start to scream in terror, it seems as if its too late..  A sharp pain obvurs in my neck and suddenly beathing air is very hot, and instantly I stop breating.. My heart beats faster than a train at top speed. Before i know it, a fuse ticks in my mind, and I close my eyes, thinking about all the weed I could of been smoking.. My spirit is free. I am free. I leave the hole, and see all the faggots who just shot me.. as scarce as it is.. I fly, fly high up to the sunlight in the air. Black and white images in my sight, but one blink, and a throne was beheald in front of me.\nI look at the throne, and see my king.. Gaben.. Gaben smiles with a might, and presses his glasses upon his face. I thank Gaben, and praise gaben. Gaben greets me, and tours me around Seaven. He takes me to my NASA computer, and pulls up the steam library.. I notice something very abnormal and suddenly merate the biggest smile. My steam library is filled with millions of games.. And my latency is very low.. The peace in Seaven, is healthy, but before I do anything, I feel a tap upon my shoulder. It's my comrad! Looking sharp as ever aswell. We smile and hug eachother, and grasp upon our lives. Gaben is my leader we say, Gallahu Salebar I say, and sit down to open up dota.. Another day I say.. Another day.","tags":"#dota2#gaben#lol#allah","favourites":1,"__v":0,"created_on":"2015-07-29T23:25:41.618Z","score":0},{"_id":"55b55fa8f12af4492558aafe","id":1922,"pasta":"\"How should I sit down Jensen?\" \"Well, have your arms... fully erect.\" said Nicolaj as he slid behind Sneaky, wrapping his arms around the American boy. Sneaky felt a stiff Danish sausage on his rear. \"Are you sure your arms aren't the only thing erect Jensen?!\" Sneaky gasped.","tags":"#LoL#Sneaky#Incarnati0n#fanfic","favourites":5,"__v":0,"created_on":"2015-07-26T22:31:04.350Z","score":0.0009582063497337741},{"_id":"559ef17b975fee4a2be08428","id":1857,"pasta":"Hai Sneaky, LeagueOfBoredum here I'm trying to learn how to play shaco and I was wondering what I should max, should I max deceive, like Meteos deceived your team, two-shiv poison like Meteos poisoned your team environment or the box like the box of trust you had with meteos that was lost. Thanks in advance sneaky","tags":"#LoL#Cloud9#Sneaky","favourites":2,"__v":0,"created_on":"2015-07-08T08:27:54.540Z","score":0.00015767616023500312},{"_id":"558b9a092a7929bd7a8b1f91","id":1805,"pasta":"-----------------------+_+--------------------- im the invisible man\n-----------------------+_+--------------------- im the invisible man\n-----------------------+_+--------------------- incredible how you can\n-----------------------+_+--------------------- see right through me","tags":"#Queen#updated#plzkillme#LoL","favourites":1,"__v":0,"created_on":"2015-06-24T20:07:02.283Z","score":0},{"_id":"5582330a2120570651f0ae33","id":1775,"pasta":"Ｈｅｙ  Ｍａｅｌｋ，  Ｉ＇ｍ  ｔｒｙｉｎｇ  ｔｏ  ｌｅａｒｎ  ｔｏ  ｐｌａｙ  Ｂｏｕｎｔｙ  Ｈｕｎｔｅｒ．  Ｉ  ｊｕｓｔ  ｈａｖｅ  ａ  ｑｕｅｓｔｉｏｎ  ａｂｏｕｔ  ｔｈｅ  ｓｋｉｌｌ  ｂｕｉｌｄ：  ｓｈｏｕｌｄ  Ｉ  ｍａｘ  Ｓｈｕｒｉｋｅｎ  ｔｏｓｓ，  ｓｏ  Ｉ  ｃａｎ  ｔｏｓｓ  ｓｈｕｒｉｋｅｎｓ  ｌｉｋｅ  ｙｏｕ  ｔｏｓｓｅｄ  Ｄｏｔａ  ２  ｉｎ  ｔｈｅ  ｔｒａｓｈ，  Ｊｉｎａｄａ  ｓｏ  Ｉ  ｃａｎ  ｃｒｉｔ  ｍｙ  ｅｎｅｍｉｅｓ  ｌｉｋｅ  ｙｏｕ  ｗｅｒｅ  ｃｒｉｔｉｃａｌ  ｏｆ  Ｄｏｔａ  ２，  ｏｒ  Ｓｈａｄｏｗ  ｗａｌｋ  ｓｏ  Ｉ  ｃａｎ  ｗａｌｋ  ａｗａｙ  ｆｒｏｍ  ｔｈｅ  ｅｎｅｍｙ  ｌｉｋｅ  ｙｏｕ  ｗａｌｋｅｄ  ａｗａｙ  ｆｒｏｍ  Ｄｏｔａ  ２？","tags":"#dota2#lol#maelk#skill#build#bounty#hunter","favourites":7,"__v":0,"created_on":"2015-06-17T01:22:23.680Z","score":0.0004357348080806867},{"_id":"55769fef7d2300ce44f0cee7","id":1743,"pasta":"Hi \"imaqtpie\" this is Steves mom. My 13y old son wants to get money from me to get into some \"Big Dick Club\"? Explain this to me! Are you trying to Sex with children? i may have to involve the police..","tags":"#LoL#imaqtpie#BDC#steve","favourites":1,"__v":0,"created_on":"2015-06-08T19:21:02.758Z","score":0},{"_id":"5566b258dac4eb127bdadaad","id":1683,"pasta":"(∩ ͡° ͜ʖ ͡°)⊃━☆ﾟ. ･ ｡ﾟMy dick is small, my butthole is leaky, I use this chant, to summon Sneaky","tags":"#LoL#Cloud9#Sneaky","favourites":36,"__v":0,"created_on":"2015-05-27T18:48:10.075Z","score":0.0013623705666015273}]