[{"_id":"5566b22edac4eb127bdadaa9","id":1679,"pasta":"Mr. Pepe. I pray to you that my League of Legends card will work this time. I spent $700 for one and I will use it to buy in-game money. My parents will be so proud of me because I will be the best on League of Legends. I also live in my grandma’s basement because I was kicked out for stealing money to buy more LoL cards. Mr. Pepe, please give buffs to Fiddlesticks. I don’t want to receive chronic aids from Karthus ult. Please. Nerf Karthus. I will also pay mucho pesos for a new computer because the last one blew up from me being too autistic and not laning right. these compooter hackers can really fry my rooter because my internet no longer works. rip in pizza.","tags":"#lol#pepe","favourites":1,"__v":0,"created_on":"2015-05-26T15:58:44.115Z","score":0},{"_id":"555d54cadf71aa25492f2f87","id":1657,"pasta":"Viewers gather, and now my feed begins. It shall not end until all my teams lose. I shall take no kills, get no assists, farm no creeps. I shall feed and feed at my base. I am the feeder in the fog. I am the feeder at the fountain. I am the feeder that feeds the enemy team. I pledge my life and honor to the Feeder's Elite, for this stream and all the streams to come.","tags":"#dota2#lol#feeder#feed","favourites":7,"__v":0,"created_on":"2015-05-20T17:01:37.464Z","score":0.00028431567501037956},{"_id":"5554c434709a8b601ae12e06","id":1632,"pasta":"Formerly CLG Link here, I just wanted to say that the main problem with CLG was not me choking, but deflecting blame onto other players. Please read my 17 page document deflecting all the blame onto my team mates. Farewell! #CLGFIGHTING","tags":"#lol#leagueoflegends#Link#clg#blame","favourites":0,"__v":0,"created_on":"2015-05-14T07:15:57.734Z","score":0},{"_id":"554ec5353895206d68ad36a4","id":1613,"pasta":"I invited a Jinx cosplay to my hotel room and we had sex. We spent the night together. When I woke up to go use the bathroom I looked in the mirror and saw the words \"Get Jinxed\" written all over my head. The girl was gone and so were some of the food I brought to the hotel.","tags":"#lol#Jinx#cosplay","favourites":1,"__v":0,"created_on":"2015-05-10T02:29:41.001Z","score":0},{"_id":"554ec52d3895206d68ad36a3","id":1612,"pasta":"                            \\ /\n                       \\_   |  _/               What gravity does to you                \n                          (, ~,)\n                                            ","tags":"#lol#gravity","favourites":6,"__v":0,"created_on":"2015-05-10T02:10:19.774Z","score":0.00021380383079531228},{"_id":"554656f592ac5d29444dfc7e","id":1564,"pasta":"Assaultmode: Quickly removing her clothes, Miss Fortune stuck her tongue out, first tasting Soraka’s swollen, sweaty balls. Soraka’s scent completely dominated Miss Fortune, she moved her tongue upwards slowly, while drinking the nectar that was the Starchild’s salty sweat.\n","tags":"#lol#miss#fortune#soraka#balls","favourites":0,"__v":0,"created_on":"2015-05-03T08:01:28.235Z","score":0},{"_id":"5541415d107beab4641ec2d4","id":1548,"pasta":"\"wtf his ult did like 3k damage how is that legit\" - leonardo da vinci 1496, founder of the Illuminati","tags":"#lol#history","favourites":13,"__v":0,"created_on":"2015-04-29T19:12:25.371Z","score":0.0003946094541467247},{"_id":"55408fc6107beab4641ec2cf","id":1545,"pasta":"LoL>Dota, in dota you kill your own minion WutFace are u traitor? EleGiggle why in dota can you buy a ''battlefury'' on the market for 30 dollars and get a 4000 gold item for free at level 1? FailFish balanced game, dota is also made by unknown company named ''steam'', who is this ''steam''? this ''steam'' is scamming your life, LoL is made by riot, riot is good company who releases balanced champions,  LoL also have lots of skins like mlg teemo, spacesuit teemo, swimsuit teemo, sexy bikini teemo, etc, LoL>Dota","tags":"#dota2#lol#comparisons#skins","favourites":54,"__v":0,"created_on":"2015-04-29T05:10:03.757Z","score":0.0013520790878027023},{"_id":"552e844f41157097494d180f","id":1464,"pasta":"fairy disgusting player. He was inactive, idle, refused to play and frequently afk. He is getting offendet if anyone dares to react to this negativly. To make it worse he doesnt even try. It is not bad to be not as good as others but this player is infuriating inactive and just does nothing.\nReplays suggest similar actions in previous game, he showes a sickening extreme of refuse to play.\nHe cannot be talked to or reasoned with, since he always insists in some way to refuse to play. He never even trys! Utterly disgusting. He forces a massive unfair disadvantage just by occupying a player slot.\nTo be even more disgusting he belives \"everyone else is toxic\" if they dare to react to this outlandish exess of inactivity negativly. No swearing or insults required. He is one out of a thousand. An utterly disgusting player. Avoid","tags":"#dota2#csgo#lol#player#toxic#unfair","favourites":2,"__v":0,"created_on":"2015-04-15T14:17:04.034Z","score":0.00004303715168057157},{"_id":"5526dcc50c88f703624a613c","id":1439,"pasta":"~卐卐 YOU HAVE BEEN VISITED BY THE SWASTIKA OF MEME FACES!! 卐卐~\nREPOST THIS 3 (THREE) TIMES IN THE NEXT 5 (FIVE) MINUTES OR YOU WILL JOIN THESE TORTURED SOULS IN THE SWASTIKA AS ANOTHER MEME FACE...\n눈 ͜ಎ눈                          눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈\n눈 ͜ಎ눈                          눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈\n눈 ͜ಎ눈                          눈 ͜ಎ눈\n눈 ͜ಎ눈                          눈 ͜ಎ눈\n눈 ͜ಎ눈                          눈 ͜ಎ눈\n눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈\n눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈\n                                       눈 ͜ಎ눈                          눈 ͜ಎ눈\n                                       눈 ͜ಎ눈                          눈 ͜ಎ눈\n                                       눈 ͜ಎ눈                          눈 ͜ಎ눈\n눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈                          눈 ͜ಎ눈\n눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈                          눈 ͜ಎ눈","tags":"#nazi#mods#dota2#lol#dota#4chan#maymay","favourites":18,"__v":0,"created_on":"2015-04-09T10:23:31.938Z","score":0.0004305331156817362},{"_id":"5525e21c7ca4658f518f3fe1","id":1430,"pasta":"Ｈｉ Ｄａｒｕｄｅ. Ｍｙ ｄａｄ ａｌｗａｙｓ ｔｏｌｄ ｍｅ ｔｈｉｓ ｓｔｏｒｙ ｗｈｅｒｅ ｈｅ ｓａｉｄ ｈｅ ｗａｓ ｂａｃｋｓｔａｇｅ ａｔ ａ ｃｌｕｂ ａｎｄ ｗａｌｋｅｄ ｕｐ ｔｏ ａ ＤＪ ｐｅｒｆｏｒｍｉｎｇ Ｓａｎｄｓｔｏｒｍ. Ｍｙ ｄａｄ ｈａｔｅｄ ｔｈｅ ｓｏｎｇ ａｎｄ ｔｏｌｄ ｔｈｅ ＤＪ ｔｈａｔ ｉｔ ｗａｓ ｒｅｐｅｔｉｔｉｖｅ ａｎｄ ｃｏｕｌｄｎ＇ｔ ｕｎｄｅｒｓｔａｎｄ ｗｈｙ ｐｅｏｐｌｅ ｌｉｋｅｄ ｉｔ. Ｇｅｔｔｉｎｇ ａ ｗｅｉｒｄ ｌｏｏｋ ｆｒｏｍ ｔｈｅ ＤＪ ｍｙ ｄａｄ ｒｅｔｕｒｎｅｄ ｂａｃｋｓｔａｇｅ ａｎｄ ｔａｌｋｅｄ ｔｏ ｔｈｅ ｍａｎａｇｅｒ ｗｈｏ ｔｈｅｎ ｉｎｆｏｒｍｅｄ ｈｉｍ ｔｈａｔ ｔｈｅ ＤＪ ｈｅ ｉｎｓｕｌｔｅｄ ｗａｓ ｉｎ ｆａｃｔ ｙｏｕ. Ｄｏ ｙｏｕ ｒｅｍｅｍｂｅｒ ｔｈｉｓ ｂｙ ａｎｙ ｃｈａｎｃｅ？ Ｍｙ ｄａｄ ｆｅｌｔ ｐｒｅｔｔｙ ｂａｄ ａｎｄ ｗｏｕｌｄ ａｐｏｌｏｇｉｚｅ ｉｆ ｇｉｖｅｎ ｔｈｅ ｃｈａｎｃｅ ｓｏ Ｉ＇ｍ ｄｏｉｎｇ ｉｔ ｏｎ ｂｅｈａｌｆ ｏｆ ｈｉｍ. Ｉ ｏｎ ｔｈｅ ｏｔｈｅｒ ｈａｎｄ ｈａｐｐｅｎ ｔｏ ｌｉｋｅ Ｓａｎｄｓｔｏｒｍ ａｎｄ ａｐｐｒｅｃｉａｔｅ ｉｔｓ ｍａｓｔｅｒｙ ｏｆ ｔｈｅ ｄａｎｃｅ ｓｃｅｎｅ. Ｔｈａｎｋ ｙｏｕ！","tags":"#darude#sandstorm#dota2#lol#general","favourites":21,"__v":0,"created_on":"2015-04-09T01:52:32.033Z","score":0.000491368538752508},{"_id":"551353cd0489a24c09a597d5","id":1327,"pasta":"It was Dinner Time in the Cloud Nein Gaymer house. Zachary “Sneaky” Scuderi dishes up a steaming plate of pasta when he realizes he forgot the meat. William “Meteos” Hartman looks up from his plate with a gleam in his eye. “I got the meat right here for you baby.” Lubing up with Marinara Sauce, Meteos begins to pound his sausage into sneaky’s lightly buttered Dinner roll. With a scream of delight Meat-eos releases his load calling an end to another successful team dinner.","tags":"#LoL#Erotic#Cloud9","favourites":4,"__v":0,"created_on":"2015-03-26T00:29:38.025Z","score":0.00008942806715718141},{"_id":"55107b03e176d8400420cf5c","id":1295,"pasta":"( ͡° ͜ʖ ͡°) Welcome to the league of Draven! ( ͡° ͜ʖ ͡°)","tags":"#lol#league#draven","favourites":11,"__v":0,"created_on":"2015-03-23T20:40:51.178Z","score":0.0002395847737423695},{"_id":"550e73e92ab05ce134dd32e2","id":1279,"pasta":"  ༼ ºل͟º༼ ºل͟º( ͡° ͡ ͜ ͡ʖ ͡ °)ºل͟º ༽ºل͟º ༽ 5 MEN, 1 DREAM, 9 EYEBROWS ༼ ºل͟º༼ ºل͟º( ͡° ͡ ͜ ͡ʖ ͡ °)ºل͟º ༽ºل͟º ༽","tags":"#lol#genja#moscow5#donger","favourites":6,"__v":0,"created_on":"2015-03-22T06:01:39.686Z","score":0.00013270666568333854},{"_id":"550dcf8b2ab05ce134dd32ca","id":1268,"pasta":"Hey QT, I just had my first child, and since im such a big fan, I named him Big D1ck. Would you please be the godfather??","tags":"#LoL#imaqtpie#child#big#dick","favourites":1,"__v":0,"created_on":"2015-03-21T16:30:14.951Z","score":0}]