[{"_id":"5509c7dc2ab05ce134dd3223","id":1202,"pasta":"Fucking lol'd\n\n10/10 if troll\n7/10 if copy pasta\n10/10 if troll\n7/10 if copy pasta>>491290000 → →\nFucking lol'd\n>>491290000 → → Fucking lol'd 10/10 if troll 7/10 if copy pasta >>491290000 → → Fucking lol'd 10/10 if troll 7/10 if copy pasta >>491290000 → → Fucking lol'd 10/10 if troll 7/10 if copy pasta >>491290000 → → Fucking lol'd 10/10 if troll 7/10 if copy pasta >>491290000 → →\nFucking lol'd>Fuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypastaFuckinglold100/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypas\n>>>491285937 (You) # (You) #\n>>>>491285773 (You) # (You) # (You) #\n>>>>491285773 (You) # (You) 10/10 if troll\n7/10 if copy pasta>>491290000 → →\nFucking lol'd\n>>491290000 → → Fucking lol'd 10/10 if troll 7/10 if copy pasta >>491290000 → → Fucking lol'd 10/10 if troll 7/10 if copy pasta >>491290000 → → Fucking lol'd 10/10 if troll 7/10 if co# (You) #\n>>>>>491285484 # # # #>>>>>491285280 # # # # #\n>>>>>Fucking lol'd>>>Fucking lol'd\n>>>troll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10id10/10ipypastaFuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypasta>>49128\n>10/10 if troll\n>7/aFuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/\n>>>>>10/10 if troll>>>>>7/10 if copy pasta>>>>>>491285420 # # # # #>>>>Fucking lol'd\n>>>>10/10 if troll\n>>>>7/10 if copy pastᎦ\n>>>Fucking lol'd>>>Fucking lol'd\n>>>\n>>>10/10 if troll\n>>>7/10 if copypasat\n>Fucking lol'd\n>10/10 if troll\n>7/aFuckinglold10/10iftroll7/10ifcopypasta\n>>>10/10 if troll\n>>7/10 if copypasta\n","tags":"#4chan#copypasta#10/10#troll#fucking#lol'd","favourites":11,"__v":0,"created_on":"2015-03-18T18:44:06.207Z","score":0.0002299593364011971},{"_id":"5508f31eb47c3d010fd9658d","id":1133,"pasta":"☑ “This guy's team is CRAZY!” ☑ “My team can't win against a team comp like that” ☑ \"He NEEDED precisely those two champions to win\" ☑ “He got the exact crits he needed. ” ☑ \"His team had the exact champions to counter me\" ☑ “There was no way we could out-smite that\" ☑ “We played that perfectly\"","tags":"#lol#shit#team#checkboxes","favourites":24,"__v":0,"created_on":"2015-03-18T03:02:45.033Z","score":0.0004579748174398742},{"_id":"5508e288b47c3d010fd9657e","id":1129,"pasta":"America's place as the foremost world power is at jeopardy. Not because of middle eastern conflicts or China's economic awakening but because it does nothing to curb the tide of bronziocracy. American bronzies are given suffrage and even legal and reproductive rights despite having proved their inferior mental and moral status. In countries like Korea where being the worst at something is shameful people give their all to better themselves. However American culture celebrates mediocrity and encourages bronzies to merely stop playing the game when their self esteem might be tarnished by their inferior performances. Instead of sharpening their minds and, even more importantly, teaching themselves to overcome their inherent genetic disadvantages through hard work, American bronzies transition to smoking cannabis and having unprotected ***. They diminish their mental abilities even further while creating the next generation of bronzies. The only way to curb America's economic decline is the mandatory sterilization of all bronzies. While it would be inhumane to simply eradicate the bronzies America is already saddled with, their negative economic impact can be curbed by leveraging them as farm animals and mannequins.","tags":"#lol#rackier#bronzers#bronzies#bronze#america","favourites":2,"__v":0,"created_on":"2015-03-18T02:24:18.250Z","score":0.000033571962842556276},{"_id":"5508e1bcb47c3d010fd9657c","id":1128,"pasta":"Low elos should learn to stop back talking diamond 1s or higher. If someone from bronze has an opinion that differs from a diamond 1's, the bronzie should NOT try to reason with the high elo. He shouldn't ask why either. He should take what the diamond says as fact without talking back. Too many times, I've seen a bronzie backtalk a diamond 1, and it's disgusting, because the bronzie is wrong most of the time. The only time a bronzie is right is when 500,000 bronzies are talking back to a single diamond 1. There's a reason why you're stuck in bronze. It's because you think differently than the diamonds. Start thinking like a diamond. - Rackier","tags":"#lol#low#elo#scrubs#shitters#rackier","favourites":0,"__v":0,"created_on":"2015-03-18T02:22:54.147Z","score":0},{"_id":"5508c558b47c3d010fd96526","id":1095,"pasta":"Hᴇʟʟᴏ Mʀ. Pɪᴇ I ᴀᴍ Mᴀʀɪᴏ Rɪɢᴀᴛᴏɴᴇ ғʀᴏᴍ Pᴀsᴛᴀʀᴏɴɪ ɪɴᴅᴜsᴛʀɪᴇs I ᴡᴀɴᴛ ᴛᴏ ᴍᴀᴋᴇ ɴᴇᴡ ᴘᴀsᴛᴀ ɪɴsᴘɪʀᴇ ʙʏ ʏᴏᴜʀ ᴀᴅᴄ ᴘʟᴀʏ I ᴄᴀʟʟ ɪᴛ ᴛʜᴇ sᴀɴᴛᴀɴᴀ ʙᴀɴᴀɴᴀ ᴍᴀᴄᴀʀᴏɴɪ. Pʟᴇᴀsᴇ ɴᴏ Rᴀᴠɪᴏʟɪ ʟɪɴɢᴜɪɴɪ ᴘᴀsᴛᴀʀɪɴᴏ ","tags":"#lol#imqtpie#mario#rigatone#pasta","favourites":0,"__v":0,"created_on":"2015-03-18T00:21:22.354Z","score":0},{"_id":"5508c53ab47c3d010fd96524","id":1093,"pasta":"Hi I own 12 burger king chains and I was wondering if you are interested in becoming the new BK mascot. I have a son who is dying of stage 6 áss burgers syndrome and will have to get his left ear removed next week. His dying wish is to see you on a burger king commercial. This is a serious request, please don't copy and paste.","tags":"#lol#imaqtpie#burger#chains","favourites":7,"__v":0,"created_on":"2015-03-18T00:04:30.960Z","score":0.00014931482939249845},{"_id":"5508c52db47c3d010fd96523","id":1092,"pasta":"My name is Lisha. I am the significant other of Michael \"Imaqtpie\" Santana. He has a really big dick. But he also has a really small bunghole. Michael likes it when I insert my 10\" strapon into him while wearing a pirate hat and demands I say, \"prepare to be boarded!","tags":"#lol#imaqtpie#big#dick#small#bunghole","favourites":5,"__v":0,"created_on":"2015-03-18T00:20:27.381Z","score":0.00010651191864713023},{"_id":"5508c51cb47c3d010fd96522","id":1091,"pasta":"Mr Santana, this is Riot HQ. We traced yesterday's LCS technical issues back to you forcing your large donger into CoreJJs cooling fan. If you do not formally apologize CLG will be fined $25,000 ","tags":"#lol#imaqtpie#riot#hq#lcs","favourites":3,"__v":0,"created_on":"2015-03-18T00:18:21.868Z","score":0.00005977710710370163},{"_id":"5508c50fb47c3d010fd96521","id":1090,"pasta":"Mr. Michael \"imaqtpie\" Santana, I am from the Supports Abused by Adc Foundation, and i would like to point out that you are guilty of verbally molesting all of your last supports. Please no \"copy pasta\", this is a serious warning.","tags":"#lol#imaqtpie#supports#abused","favourites":3,"__v":0,"created_on":"2015-03-18T00:17:29.069Z","score":0.00005977681849629848},{"_id":"5508c502b47c3d010fd96520","id":1089,"pasta":"Hi there Michael :3This is your high school friend Catherine You still know me ? :3 Anyways, I was wondering if we could get back into touch again )))) I assume that $$$ you made from playing in LCS made your cock grow SOOOO HUUUGE :3 ","tags":"#lol#imaqtpie#big#dick#club#catherine","favourites":3,"__v":0,"created_on":"2015-03-18T00:16:54.297Z","score":0.00005977662842860217},{"_id":"5508c4a8b47c3d010fd9651b","id":1087,"pasta":"Did You Know? YAYO was first found in America in the year 1070. The native Dongers sang it to please their God. One day they didn't sing YAYO, a NACHO TORPEDO destroyed their whole culture. Ripperino Dongerino, all you knew was YAYO..\n","tags":"#twitch#lol#yayo#founded#nacho#torpedo","favourites":6,"__v":0,"created_on":"2015-03-18T00:13:24.201Z","score":0.00012827432748345116},{"_id":"5508c40ab47c3d010fd96517","id":1085,"pasta":"Reginald's story.\nWhat a lot of people don't know is TSM Reginald was originally a 6'2\" Blonde Haired Blue-Eyed Aryan Male with an IQ of over 190.\nIn season 1, on a Team TSM trip to the Zoo, he fell into the monkey enclosure, and was messily devoured by one of the apes.\nSo the rest of TSM decided to just give the ape Regi's login info and make him the new reginald. They taught him to play league of legends. Dyrus joined the team after that, and that's why they're always butting heads, Regi thinks he's a threat to his territory.","tags":"#lol#reginald#story#tsm","favourites":10,"__v":0,"created_on":"2015-03-18T00:07:41.023Z","score":0.00020934047527391365},{"_id":"55076b3387d1bc685b1e96a0","id":1041,"pasta":"I sexually Identify as a filthy thresh picker. Ever since I was a boy I dreamed of pulling myself over summoners rift dropping boxes on disgusting non-meta picks. People say to me that a person being a thresh picker is Impossible and I'm fucking retarded but I don't care, I'm beautiful. I'm having a plastic surgeon install a retard hitbox hook, green neon light and lantern on my body. From now on I want you guys to call me \"Thresh\" and respect my right to hook you from behind your minions and kill needlessly. If you can't accept me you're a Threshphobe and need to check your SR privilege. Thank you for being so understanding.","tags":"#lol#sexually#identify#thresh#picker","favourites":49,"__v":0,"created_on":"2015-03-16T23:33:09.378Z","score":0.00083788320672249},{"_id":"54f2358587d1bc685b1e95c1","id":940,"pasta":"I sexually Identify as a minion. Ever since I was a boy I dreamed of walking down the lanes of Summoners Rift just to get slaughtered instantly. People say to me that a person being a minion is Impossible and I'm fucking retarded but I don't care, I'm beautiful. I'm having a plastic surgeon install a little stone helmet, shield and battle hammer on my body. From now on I want you guys to call me \"blue melee creep\" and respect my right to willingly suicide into powerful enemy champions. If you can't accept me you're a miniophobe and need to check your summoning privilege. Thank you for being so understanding.","tags":"#lol#sexually#identify#minion","favourites":6,"__v":0,"created_on":"2015-02-28T21:38:39.504Z","score":0.00011282452170147505},{"_id":"54f124c187d1bc685b1e95ac","id":931,"pasta":"(◕‿◕✿) nice gj RFLegendary! u can do this! (◡‿◡✿)","tags":"#lol#RFLegendary#positive","favourites":2,"__v":0,"created_on":"2015-02-28T01:45:41.232Z","score":0.000029333870530589138}]