[{"_id":"55b55fa8f12af4492558aafe","id":1922,"pasta":"\"How should I sit down Jensen?\" \"Well, have your arms... fully erect.\" said Nicolaj as he slid behind Sneaky, wrapping his arms around the American boy. Sneaky felt a stiff Danish sausage on his rear. \"Are you sure your arms aren't the only thing erect Jensen?!\" Sneaky gasped.","tags":"#LoL#Sneaky#Incarnati0n#fanfic","favourites":11,"__v":0,"created_on":"2015-07-26T22:31:04.350Z","score":0.00008528262731774957},{"_id":"559ef17b975fee4a2be08428","id":1857,"pasta":"Hai Sneaky, LeagueOfBoredum here I'm trying to learn how to play shaco and I was wondering what I should max, should I max deceive, like Meteos deceived your team, two-shiv poison like Meteos poisoned your team environment or the box like the box of trust you had with meteos that was lost. Thanks in advance sneaky","tags":"#LoL#Cloud9#Sneaky","favourites":10,"__v":0,"created_on":"2015-07-08T08:27:54.540Z","score":0.0000731974800868276},{"_id":"558b9a092a7929bd7a8b1f91","id":1805,"pasta":"-----------------------+_+--------------------- im the invisible man\n-----------------------+_+--------------------- im the invisible man\n-----------------------+_+--------------------- incredible how you can\n-----------------------+_+--------------------- see right through me","tags":"#Queen#updated#plzkillme#LoL","favourites":2,"__v":0,"created_on":"2015-06-24T20:07:02.283Z","score":0.000011211113123563302},{"_id":"5582330a2120570651f0ae33","id":1775,"pasta":"Ｈｅｙ  Ｍａｅｌｋ，  Ｉ＇ｍ  ｔｒｙｉｎｇ  ｔｏ  ｌｅａｒｎ  ｔｏ  ｐｌａｙ  Ｂｏｕｎｔｙ  Ｈｕｎｔｅｒ．  Ｉ  ｊｕｓｔ  ｈａｖｅ  ａ  ｑｕｅｓｔｉｏｎ  ａｂｏｕｔ  ｔｈｅ  ｓｋｉｌｌ  ｂｕｉｌｄ：  ｓｈｏｕｌｄ  Ｉ  ｍａｘ  Ｓｈｕｒｉｋｅｎ  ｔｏｓｓ，  ｓｏ  Ｉ  ｃａｎ  ｔｏｓｓ  ｓｈｕｒｉｋｅｎｓ  ｌｉｋｅ  ｙｏｕ  ｔｏｓｓｅｄ  Ｄｏｔａ  ２  ｉｎ  ｔｈｅ  ｔｒａｓｈ，  Ｊｉｎａｄａ  ｓｏ  Ｉ  ｃａｎ  ｃｒｉｔ  ｍｙ  ｅｎｅｍｉｅｓ  ｌｉｋｅ  ｙｏｕ  ｗｅｒｅ  ｃｒｉｔｉｃａｌ  ｏｆ  Ｄｏｔａ  ２，  ｏｒ  Ｓｈａｄｏｗ  ｗａｌｋ  ｓｏ  Ｉ  ｃａｎ  ｗａｌｋ  ａｗａｙ  ｆｒｏｍ  ｔｈｅ  ｅｎｅｍｙ  ｌｉｋｅ  ｙｏｕ  ｗａｌｋｅｄ  ａｗａｙ  ｆｒｏｍ  Ｄｏｔａ  ２？","tags":"#dota2#lol#maelk#skill#build#bounty#hunter","favourites":8,"__v":0,"created_on":"2015-06-17T01:22:23.680Z","score":0.000055322348931951404},{"_id":"55769fef7d2300ce44f0cee7","id":1743,"pasta":"Hi \"imaqtpie\" this is Steves mom. My 13y old son wants to get money from me to get into some \"Big Dick Club\"? Explain this to me! Are you trying to Sex with children? i may have to involve the police..","tags":"#LoL#imaqtpie#BDC#steve","favourites":7,"__v":0,"created_on":"2015-06-08T19:21:02.758Z","score":0.00004739028462870489},{"_id":"5566b258dac4eb127bdadaad","id":1683,"pasta":"(∩ ͡° ͜ʖ ͡°)⊃━☆ﾟ. ･ ｡ﾟMy dick is small, my butthole is leaky, I use this chant, to summon Sneaky","tags":"#LoL#Cloud9#Sneaky","favourites":102,"__v":0,"created_on":"2015-05-27T18:48:10.075Z","score":0.00048003461309900397},{"_id":"5566b22edac4eb127bdadaa9","id":1679,"pasta":"Mr. Pepe. I pray to you that my League of Legends card will work this time. I spent $700 for one and I will use it to buy in-game money. My parents will be so proud of me because I will be the best on League of Legends. I also live in my grandma’s basement because I was kicked out for stealing money to buy more LoL cards. Mr. Pepe, please give buffs to Fiddlesticks. I don’t want to receive chronic aids from Karthus ult. Please. Nerf Karthus. I will also pay mucho pesos for a new computer because the last one blew up from me being too autistic and not laning right. these compooter hackers can really fry my rooter because my internet no longer works. rip in pizza.","tags":"#lol#pepe","favourites":5,"__v":0,"created_on":"2015-05-26T15:58:44.115Z","score":0.00003245169821501141},{"_id":"555d54cadf71aa25492f2f87","id":1657,"pasta":"Viewers gather, and now my feed begins. It shall not end until all my teams lose. I shall take no kills, get no assists, farm no creeps. I shall feed and feed at my base. I am the feeder in the fog. I am the feeder at the fountain. I am the feeder that feeds the enemy team. I pledge my life and honor to the Feeder's Elite, for this stream and all the streams to come.","tags":"#dota2#lol#feeder#feed","favourites":11,"__v":0,"created_on":"2015-05-20T17:01:37.464Z","score":0.00006839325890909575},{"_id":"5554c434709a8b601ae12e06","id":1632,"pasta":"Formerly CLG Link here, I just wanted to say that the main problem with CLG was not me choking, but deflecting blame onto other players. Please read my 17 page document deflecting all the blame onto my team mates. Farewell! #CLGFIGHTING","tags":"#lol#leagueoflegends#Link#clg#blame","favourites":2,"__v":0,"created_on":"2015-05-14T07:15:57.734Z","score":0.000009848516413517895},{"_id":"554ec5353895206d68ad36a4","id":1613,"pasta":"I invited a Jinx cosplay to my hotel room and we had sex. We spent the night together. When I woke up to go use the bathroom I looked in the mirror and saw the words \"Get Jinxed\" written all over my head. The girl was gone and so were some of the food I brought to the hotel.","tags":"#lol#Jinx#cosplay","favourites":2,"__v":0,"created_on":"2015-05-10T02:29:41.001Z","score":0.000009727323923488649},{"_id":"554ec52d3895206d68ad36a3","id":1612,"pasta":"                            \\ /\n                       \\_   |  _/               What gravity does to you                \n                          (, ~,)\n                                            ","tags":"#lol#gravity","favourites":9,"__v":0,"created_on":"2015-05-10T02:10:19.774Z","score":0.00005502388361002335},{"_id":"554656f592ac5d29444dfc7e","id":1564,"pasta":"Assaultmode: Quickly removing her clothes, Miss Fortune stuck her tongue out, first tasting Soraka’s swollen, sweaty balls. Soraka’s scent completely dominated Miss Fortune, she moved her tongue upwards slowly, while drinking the nectar that was the Starchild’s salty sweat.\n","tags":"#lol#miss#fortune#soraka#balls","favourites":1,"__v":0,"created_on":"2015-05-03T08:01:28.235Z","score":0},{"_id":"5541415d107beab4641ec2d4","id":1548,"pasta":"\"wtf his ult did like 3k damage how is that legit\" - leonardo da vinci 1496, founder of the Illuminati","tags":"#lol#history","favourites":27,"__v":0,"created_on":"2015-04-29T19:12:25.371Z","score":0.00014261437839293016},{"_id":"55408fc6107beab4641ec2cf","id":1545,"pasta":"LoL>Dota, in dota you kill your own minion WutFace are u traitor? EleGiggle why in dota can you buy a ''battlefury'' on the market for 30 dollars and get a 4000 gold item for free at level 1? FailFish balanced game, dota is also made by unknown company named ''steam'', who is this ''steam''? this ''steam'' is scamming your life, LoL is made by riot, riot is good company who releases balanced champions,  LoL also have lots of skins like mlg teemo, spacesuit teemo, swimsuit teemo, sexy bikini teemo, etc, LoL>Dota","tags":"#dota2#lol#comparisons#skins","favourites":84,"__v":0,"created_on":"2015-04-29T05:10:03.757Z","score":0.00037456156779990684},{"_id":"552e844f41157097494d180f","id":1464,"pasta":"fairy disgusting player. He was inactive, idle, refused to play and frequently afk. He is getting offendet if anyone dares to react to this negativly. To make it worse he doesnt even try. It is not bad to be not as good as others but this player is infuriating inactive and just does nothing.\nReplays suggest similar actions in previous game, he showes a sickening extreme of refuse to play.\nHe cannot be talked to or reasoned with, since he always insists in some way to refuse to play. He never even trys! Utterly disgusting. He forces a massive unfair disadvantage just by occupying a player slot.\nTo be even more disgusting he belives \"everyone else is toxic\" if they dare to react to this outlandish exess of inactivity negativly. No swearing or insults required. He is one out of a thousand. An utterly disgusting player. Avoid","tags":"#dota2#csgo#lol#player#toxic#unfair","favourites":4,"__v":0,"created_on":"2015-04-15T14:17:04.034Z","score":0.00002265824738526102}]