[{"_id":"54c09d54a9bec43831afc3e6","id":482,"pasta":"One day, I walked into the LCS studios - a happy and eager fan. I saw Eugene \"Pobelter\" Park smashing Eefje \"Sjokz\" Deporteres on the ANALyst desk. I didn't know what to do, I panicked and let out a shriek, Eugene looked at me and said, \"Better keep your mouth shut kid,\" he then took a puff of the blunt and kept destroying the European cooch.","tags":"#lol#lcs#studio#pobelter#sjokz","favourites":0,"__v":0,"created_on":"2015-01-22T06:32:21.509Z","score":0},{"_id":"54bfdee23b0a330105ff5cb7","id":425,"pasta":"When a pro dota player got in a car crash, blinded, hands broken, all his dream is lost after 5 years of dota, when finally he discovers hope again, he discovers LoL, which allowed him to play even with disabilities!","tags":"#dota2#lol#car#crash#disabilities#hope","favourites":13,"__v":0,"created_on":"2015-01-21T12:30:50.993Z","score":0.00013411671059647862},{"_id":"54bfdeaa3b0a330105ff5cb6","id":424,"pasta":"Hello, Mitchell \"Pieqtima\" Santorin. This is Dallas - head admin of WHYSP.net | FUTUNARI speaking. I am contacting you today because it seems that you have not logged into our site in some time. I was just wondering if everything was OK? If you have a problem with our site, please don't hesitate to respond. Cheers.","tags":"#lol#imaqtpie#dallas#head#admin#whysp#futunari","favourites":2,"__v":0,"created_on":"2015-01-21T12:09:35.761Z","score":0.00001690970039441942},{"_id":"54bfda883b0a330105ff5cb1","id":419,"pasta":"I once saw a stream on twitch.tv i was browsing through pornhub that time and i typed cow's i finally found a guy who was wearing a cowsuit and a cow hat my dick slowly got hard after that it took me 3hours to cum but when i did my dick finally realized the true meaning of sex even though it was me jerking off it still felt like sex through my monitor i felt i was in touch with the guy who was wearing a cow suit and a cow hat yet later that day i did fap 2 him again and it felt like shit thank you for teaching me how to play league of yigends cowsex senpai.","tags":"#lol#cowsep#pornhub#cowsuit#cow#sex","favourites":1,"__v":0,"created_on":"2015-01-21T11:07:25.551Z","score":0},{"_id":"54bf35973b0a330105ff5bc9","id":354,"pasta":"<;º ༽ ǫᴜɪɴɴ ɪᴛ ᴛᴏ ᴡɪɴ ɪᴛ <;º ༽","tags":"#lol#imaqtpie#quinn#win","favourites":1,"__v":0,"created_on":"2015-01-21T05:07:09.335Z","score":0},{"_id":"54bf15be2d74781f04a60380","id":312,"pasta":"hey guys me and my friend from kindergarden play leage of ledgends and say they stumble on game called Doto I was wondering if this game any good - please no copy pasterino...","tags":"#dota2#lol#kindergarden#friends","favourites":0,"__v":0,"created_on":"2015-01-21T02:52:42.059Z","score":0},{"_id":"54b70dab22fdca593d86092f","id":208,"pasta":" Ｈｅｌｌｏ　Ｐｏｂｅｌｔｅｒ，　ｔｈｉｓ　ｉｓ　ｔｈｅ　ａｄｍｉｎｉｓｔｒａｔｏｒ　ｏｆ　ＰｏｒｎＨｕｂ™　ｗｅ　ｈａｖｅ　ｎｏｔｉｃｅｄ　ｙｏｕ　 ｈａｖｅｎ’ｔ　ｌｏｇｇｅｄ　ｉｎ　ｆｏｒ　２　ｗｅｅｋｓ，　ｗｅ’ｒｅ　ｊｕｓｔ　ｃｈｅｃｋｉｎｇ　ｔｏ　ｓｅｅ　ｉｆ　ｅｖｅｒｙｔｈｉｎｇ　 ｉｓ　ｏｋａｙ　ａｎｄ　ｗｅ’ｖｅ　ｐｒｅｐａｒｅｄ　ｙｏｕ　ａ　ｌｉｓｔ　ｏｆ　ｖｉｄｅｏｓ　ｆｒｏｍ　ｙｏｕｒ　ｆａｖｏｕｒｉｔｅ　 ｃａｔｅｇｏｒｙ　（Ａｓｉａｎ）．　Ｓｅｅ　ｙｏｕ　ｓｏｏｎ!","tags":"#lol#pobelter#pornhub#asian","favourites":1,"__v":0,"created_on":"2015-01-15T00:25:44.548Z","score":0},{"_id":"54b5f629f6a1885137f43ce7","id":190,"pasta":"つ ◕_◕ ༽つ MY LUBE IS READY, MY D*CK IS GETTING BIGGER, WITH THIS CHANT I SUMMON PHANTOML0RD ༼ つ ◕_◕ ༽つ","tags":"#lol#phantoml0rd#phantomlord#summon#chant","favourites":2,"__v":0,"created_on":"2015-01-14T04:51:19.670Z","score":0.00001636207090356161},{"_id":"54b5f5b0f6a1885137f43ce3","id":188,"pasta":"ヽ༼ຈل͜ຈ༽ﾉ This shirt is low cut, the gunnars are on. With this chant I summon Kaceytron ヽ༼ຈل͜ຈ༽ﾉ","tags":"#lol#kaceytron#summon#chant","favourites":2,"__v":0,"created_on":"2015-01-14T04:50:12.252Z","score":0.000016362014111072052},{"_id":"54b5aaebe90c10d22e88b9a3","id":144,"pasta":"@Imaqtpie hey i just won my gold 2 promos because of you! i did the exact opposite you do in game which is feeding so by not dying we won the game WOO THANKS ILY","tags":"#imaqtpie#promos#lol#feeding#league","favourites":4,"__v":0,"created_on":"2015-01-13T23:10:40.234Z","score":0.00004083029260299325},{"_id":"54b5a513e90c10d22e88b99f","id":142,"pasta":"Hello guys, I'm back from my 600 second timeout. During that time I was able to finish my 200 page PhD thesis on the topic of Nazi Germany. My thesis is that Nazi fascist beliefs are carried on by imqtpie's twitch tv moderators, who like to act as if they themselves were literally Hitler.","tags":"#lol#imaqtpie#nazi#mods#hitler#thesis","favourites":11,"__v":0,"created_on":"2015-01-13T23:06:55.853Z","score":0.00011135501151195276},{"_id":"54b5a4bbe90c10d22e88b99d","id":141,"pasta":"\"gotta pay the bills somehow, some people like sucking dick and some people like playing in the lcs. i like both equally\" - imaqtpie","tags":"#lol#imaqtpie#lcs#sucking#dick","favourites":6,"__v":0,"created_on":"2015-01-13T23:05:25.825Z","score":0.00006249559773071219},{"_id":"54b5a451e90c10d22e88b99b","id":140,"pasta":"@Imaqtpie is there a HYPER LEARNING PLATFORM website where one can watch GUIDES and VIDEOS of such nature to IMPROVE their own personal skill. Also loved by over 1 MILLION PEOPLE?","tags":"#lol#imaqtpie#skillcapped#skill#capped#hyper#learning","favourites":5,"__v":0,"created_on":"2015-01-13T23:03:40.916Z","score":0.00005189060548520703},{"_id":"54b5a299e90c10d22e88b997","id":138,"pasta":"What the fuck did you just fucking say about me, you little feeder? I’ll have you know I reached top of the ladder in season 3, and I’ve been involved in numerous secret ddos attacks on streamers, and I have over 300 confirmed pentakills. I am trained in lasthitting and I’m the best Caitlyn in the entire OGN. You are nothing to me but just another stack. I will wipe you the fuck out with skillshots the likes of which have never been seen before on this elo, mark my fucking words. You think you can get away with flaming me in all-chat? Think again, bronzie. As we speak I am contacting my secret network of subscribers across Korea and your IP is being traced right now so you better prepare for the ddos, noob. The ddos that wipes out the pathetic little thing you call your mmr. You’re fucking dead, kid. I can be anywhere, anytime, and I can kill you in over seven hundred ways, and that’s just with my autoattacks. Not only am I extensively trained in jungle invades, but I have access to the entire arsenal of the League of Legends skin shop and I will use it to its full extent to wipe your miserable ass off the Summoner's Rift, you little shit. If only you could have known what unholy retribution your little “secured” killsteal was about to bring down upon you, maybe you wouldn't have wasted your fucking ult. But you couldn’t, you didn’t, and now you’re paying the price, you goddamn idiot. I will shit fury all over you and you will drown in it. gg easy, noobs.","tags":"#lol#league#of#legends#navy#seal#300#confirmed","favourites":5,"__v":0,"created_on":"2015-01-13T22:56:10.273Z","score":0.00005188940261856177},{"_id":"54b2ee76ce7b585004706dc1","id":40,"pasta":"Hello twitch chat. This is michaels mother speaking. Please stop the spam in the chat. I can't read the amazing conversations that you are having about my son. Thanks. Don't copy and paste this to spam more or I will tell Michael to ban you all.","tags":"#lol#imaqtpie#spam#mother","favourites":5,"__v":0,"created_on":"2015-01-11T21:37:49.907Z","score":0.0000514194871436468}]