[{"_id":"5508c502b47c3d010fd96520","id":1089,"pasta":"Hi there Michael :3This is your high school friend Catherine You still know me ? :3 Anyways, I was wondering if we could get back into touch again )))) I assume that $$$ you made from playing in LCS made your cock grow SOOOO HUUUGE :3 ","tags":"#lol#imaqtpie#big#dick#club#catherine","favourites":7,"__v":0,"created_on":"2015-03-18T00:16:54.297Z","score":0.00003738425374716621},{"_id":"5508c4a8b47c3d010fd9651b","id":1087,"pasta":"Did You Know? YAYO was first found in America in the year 1070. The native Dongers sang it to please their God. One day they didn't sing YAYO, a NACHO TORPEDO destroyed their whole culture. Ripperino Dongerino, all you knew was YAYO..\n","tags":"#twitch#lol#yayo#founded#nacho#torpedo","favourites":6,"__v":0,"created_on":"2015-03-18T00:13:24.201Z","score":0.000032114531347333535},{"_id":"5508c40ab47c3d010fd96517","id":1085,"pasta":"Reginald's story.\nWhat a lot of people don't know is TSM Reginald was originally a 6'2\" Blonde Haired Blue-Eyed Aryan Male with an IQ of over 190.\nIn season 1, on a Team TSM trip to the Zoo, he fell into the monkey enclosure, and was messily devoured by one of the apes.\nSo the rest of TSM decided to just give the ape Regi's login info and make him the new reginald. They taught him to play league of legends. Dyrus joined the team after that, and that's why they're always butting heads, Regi thinks he's a threat to his territory.","tags":"#lol#reginald#story#tsm","favourites":17,"__v":0,"created_on":"2015-03-18T00:07:41.023Z","score":0.00008465554366260617},{"_id":"55076b3387d1bc685b1e96a0","id":1041,"pasta":"I sexually Identify as a filthy thresh picker. Ever since I was a boy I dreamed of pulling myself over summoners rift dropping boxes on disgusting non-meta picks. People say to me that a person being a thresh picker is Impossible and I'm fucking retarded but I don't care, I'm beautiful. I'm having a plastic surgeon install a retard hitbox hook, green neon light and lantern on my body. From now on I want you guys to call me \"Thresh\" and respect my right to hook you from behind your minions and kill needlessly. If you can't accept me you're a Threshphobe and need to check your SR privilege. Thank you for being so understanding.","tags":"#lol#sexually#identify#thresh#picker","favourites":75,"__v":0,"created_on":"2015-03-16T23:33:09.378Z","score":0.00030252140828401737},{"_id":"54f2358587d1bc685b1e95c1","id":940,"pasta":"I sexually Identify as a minion. Ever since I was a boy I dreamed of walking down the lanes of Summoners Rift just to get slaughtered instantly. People say to me that a person being a minion is Impossible and I'm fucking retarded but I don't care, I'm beautiful. I'm having a plastic surgeon install a little stone helmet, shield and battle hammer on my body. From now on I want you guys to call me \"blue melee creep\" and respect my right to willingly suicide into powerful enemy champions. If you can't accept me you're a miniophobe and need to check your summoning privilege. Thank you for being so understanding.","tags":"#lol#sexually#identify#minion","favourites":17,"__v":0,"created_on":"2015-02-28T21:38:39.504Z","score":0.00008102381704648875},{"_id":"54f124c187d1bc685b1e95ac","id":931,"pasta":"(◕‿◕✿) nice gj RFLegendary! u can do this! (◡‿◡✿)","tags":"#lol#RFLegendary#positive","favourites":2,"__v":0,"created_on":"2015-02-28T01:45:41.232Z","score":0.000008021835335971559},{"_id":"54f0df5487d1bc685b1e95a6","id":928,"pasta":"Play support\nHelp my teams loads\nSingle-handedly win the laning phase through ganks, despite no boots\nCarry doesn't know how to farm well\nOfflaner feeds after a great start\nMid goes too YOLO\nOther support and I are only decent players on our team\nLook at each other\nShrug\n\"Welp\"\nLose game","tags":"#dota2#lol#support#life","favourites":2,"__v":0,"created_on":"2015-02-27T19:50:21.446Z","score":0.000008016859791825461},{"_id":"54eced47c200ce525fb25db2","id":908,"pasta":"I think league of legends is better than dota because its more popular and more simple = easier to learn. You also have to earn your champions yourself. Riot also releases cool CGI movies, valve doesn't. Also LoL has better UI and more interesting champions. This is only my opinion. Pls no hate and have a good day  :) ","tags":"#lol#dota#riot#valve#better#satire","favourites":44,"__v":0,"created_on":"2015-02-24T20:31:00.227Z","score":0.0001828072139003676},{"_id":"54e6a8068a06216f0557ec9c","id":864,"pasta":"Hello am 48 year man from somalia. Sorry for my bed england. I selled my wife for internet connection for play \"legend league\" and i want to become the goodest player like you I play with 400 ping on brazil server and i am challenger 2. pls no copy pasterino my story.\n","tags":"#lol#hello#somalia#sold#wife#internet","favourites":12,"__v":0,"created_on":"2015-02-20T03:20:32.879Z","score":0.000058010061583887975},{"_id":"54e6a8048a06216f0557ec9a","id":862,"pasta":"Hi guise my name is francisco and im from brazil. i dropped from the potato factori to become best midlaner in ze world. i make huge progress and managed to climb from bronze v to bronze iv in only 3 months. love u scarra (best mordekaiser eu). sori for no propeller englando pls no copi pasterino macarroni ravioli spageti","tags":"#lol#name#francisco#brazil#bronze","favourites":6,"__v":0,"created_on":"2015-02-20T03:19:13.030Z","score":0.000030071154288712473},{"_id":"54e537b59be75f1867cb2315","id":841,"pasta":" Kacey inspires me, I have a huge penis just like she has huge breasts. I want to be able to show my crotch on stream like Kacey shows her tits on stream. I want to be able to have a chat full of female virgins that stroke their pussy for me just like Kacey's chat jerk their cocks for her. I want to be able to show cleavage of my ballsack on twitch stream just like Kacey shows cleavage of her chest on twitch stream. But most of all.... I want Kacey to suck this fat cock.","tags":"#lol#kaceytron#inspires#penis#breasts","favourites":7,"__v":0,"created_on":"2015-02-19T00:37:01.624Z","score":0.00003490917655838759},{"_id":"54e537919be75f1867cb2314","id":840,"pasta":"How could anyone get off to the idea of removing Kaceytron's clothes and licking her fatty body all over, nibbling her neck and kissing her adorable big nipples? Only a heartless monster would think about her pretty mouth and tongue wrapped around a thick cock slick with her saliva, pumping in and out of her mouth until it erupts, the cum more than her little throat can swallow. The idea of thick viscous semen overflowing, dribbling down her chin over her flat chest, her tiny hands scooping it all up and watching her suck it off her fingertips is just horrible. You're all a bunch of sick perverts, thinking of spreading Kaceytron's smooth slender thighs, cock poised at the entrance to her pure, tight, virginal pussy.","tags":"#lol#kaceytron#perverts#nipples#cock","favourites":14,"__v":0,"created_on":"2015-02-19T00:37:31.243Z","score":0.00006649159089151188},{"_id":"54e36e7089c96e65288919fb","id":820,"pasta":"LoL and Dota have lots of denying in common:\n\nDenying that I got reported for a good reason.\n\nDenying that mid called \"Missing\" before I got ganked.\n\nDenying that other people are better at the game than me.\n\nDenying that I'll never go pro.\n\nDenying that my MMR represents my actual skill level.","tags":"#dota2#lol#denying#common","favourites":2,"__v":0,"created_on":"2015-02-17T10:21:18.908Z","score":0.000007812188727293478},{"_id":"54de3323a43a9c0e1c527fed","id":782,"pasta":"Right I'll tell you what you fat little cunt you're boring, you dont sound Nigerian at all so go fuck yourself, go and fucking crawl in the dirty dank little hole where you fucking come from you dirty dragon eating little fucking spastic.","tags":"#lol#kaceytron#cunt#bitch#nigerian","favourites":3,"__v":0,"created_on":"2015-02-13T16:49:08.683Z","score":0.000013792919826503352},{"_id":"54de3317a43a9c0e1c527fec","id":781,"pasta":" kaceytron im really disapointed in you i used to tune in your stream to watch your boobs on full cam and fap all day long now you have gone insane and lost your faithful veiwers my jerking days are over thanks kaceytron ( no copy pasta please this is personal )","tags":"#lol#kaceytron#tits#fap","favourites":1,"__v":0,"created_on":"2015-02-13T16:48:31.434Z","score":0}]