[{"_id":"54b2ee72ce7b585004706dbe","id":37,"pasta":"Michael \"The PIE\" Santana, this is your mother speaking. Did I just hear that you became a sellout? I did not raise my donger like this, please call home, Michael. I am concerned about you, and what is this about wanting to go into gay pornography?","tags":"#lol#imaqtpie#sellout#porn#mother","favourites":5,"__v":0,"created_on":"2015-01-11T21:34:35.126Z","score":0.000036181722658752193},{"_id":"54b2ee6fce7b585004706dbc","id":35,"pasta":"@imaqtpie which champion would you have consensual sex with in the missionary position for the sole purpose of procreation after getting married and having your finances sorted out, staring lovingly into each other's eyes while HOLDING HANDS","tags":"#lol#imaqtpie#disgusting#missionary","favourites":6,"__v":0,"created_on":"2015-01-11T21:33:28.932Z","score":0.00004357591110338887},{"_id":"54b2ee6cce7b585004706dba","id":33,"pasta":"Hey Mr QTPIE, This is John's mother I would love it if you turned down this \"African american\" music down a notch so my son doesn't get corrupted. God Bless you.","tags":"#lol#imaqtpie#rap#john#music","favourites":5,"__v":0,"created_on":"2015-01-11T21:32:24.768Z","score":0.000036181540835030973},{"_id":"54b2ee6ace7b585004706db8","id":31,"pasta":"Hi Michael it's Jarl Balgruuf the Greater. I heard you are trying to play other games when we need you here at Skyrim to clean up the dragons. Quit what you are doing right now and come join me as the new Whiterun Thane. My axe is ready as your reward.","tags":"#lol#imaqtpie#skyrim#jarl","favourites":4,"__v":0,"created_on":"2015-01-11T21:42:27.035Z","score":0.000028469610618637503},{"_id":"54b2ee69ce7b585004706db7","id":30,"pasta":"Greeting Michael, this is your Mother. I heard earlier that you \"maybe\" 420 blaze it. I am very concerned. I dont like that Pobelter boy and I dont think you should hang out with him anymore. I hope the rest of you concerned mothers in twitch chat will copy paste this so my son will see..","tags":"#lol#imaqtpie#mother#weed","favourites":6,"__v":0,"created_on":"2015-01-11T21:41:29.067Z","score":0.00004357671767283592},{"_id":"54b2eb97ce7b585004706d92","id":12,"pasta":"@Imaqtpie My niece turn 14 today and she's watching your stream Can you please say \"Happy birthday Lea from uncle Moe Lester\" ?","tags":"#lol#imaqtpie#molester#niece","favourites":7,"__v":0,"created_on":"2015-01-11T21:21:16.209Z","score":0.00005072459414179085},{"_id":"54b2eb95ce7b585004706d91","id":11,"pasta":"Dear Mitchel \"QutePie\" Stamina, I have to wirite an essay of 10 words about everyting but YAYO due tomorrow. Unfortunately, YAYO is all I know. Please help.","tags":"#lol#imaqtpie#essay#yayo","favourites":23,"__v":0,"created_on":"2015-01-11T21:20:45.708Z","score":0.00014977670158601084},{"_id":"54b2eb94ce7b585004706d90","id":10,"pasta":"Hello Michael Santana,my name is Rabia AKA Nįghtblúê3,and I am furious that you blacklisted my name.I am reporting you to twitch.Don't copy paste this or I will report you too","tags":"#lol#nightblue3#nightblue#imaqtpie","favourites":10,"__v":0,"created_on":"2015-01-11T21:20:00.061Z","score":0.00007111480473003918},{"_id":"54b2eb91ce7b585004706d8e","id":8,"pasta":"Hi me name is Kowak and I are from Poland. Sorry for me bed England. I works in a shop, and i only earn a little money. So to afford an computer i had to selled me girlfriend. But I cant play LOL? Me heard that someone say something about internett, but what is internett? Ples help me poor human from poland. And no copy pasterino trollerino","tags":"#lol#polish#league#of#legends#internet","favourites":4,"__v":0,"created_on":"2015-01-11T21:18:30.558Z","score":0.000028468034131407677}]