[{"_id":"54bf5e333b0a330105ff5c0d","id":378,"pasta":"~SECURITY ALERT~ A Romanian man, roughly 6'3\", skeleton thin, with black hair and scraggly beard has been seen riding the NYC Sub train and violently \"Bro-Fisting\" passengers. He's accompanied by a short Asian man dressed as Hitler called \"Mayor of Value town\" .","tags":"#hearthstone#kripp#valuetown#trump#romanian","favourites":12,"__v":0,"created_on":"2015-01-21T08:03:09.656Z","score":0.000618894172605543},{"_id":"54c474b5059d4c227bbcb566","id":553,"pasta":"No, he did not miss lethal. No, he did not misplay. There was nothing he could do. He played that absolutely perfectly. I am sick and tired of you Twitch retards disrespecting this gentleman, who, quite frankly, is simply the greatest Hearthstone player ever to live. Pls no copypasterino.","tags":"#hearthstone#kripp#reynad#miss#lethal#greatest","favourites":11,"__v":0,"created_on":"2015-01-25T04:44:30.180Z","score":0.0006101525638085723},{"_id":"54b5d4688ba53a7c3326b4f0","id":164,"pasta":"The stream starts, and so my spam begins. It shall not end until I am banned. I shall fear no mod, sub to no streamer. I shall live and die in the Chat. For I am the value in the bomber. I am the BM in the lethal. I am the salt in the defeat. I pledge my keyboard to the Chat, for this stream and all the streams to come.","tags":"#pledge#hearthstone#nights#watch#got","favourites":13,"__v":0,"created_on":"2015-01-14T02:25:23.135Z","score":0.0005939338788228524},{"_id":"54cfbdd6a9f640440b41fc5a","id":676,"pasta":"(╭ರ_•́)\\ Mr. Fors we politely ask for the program 'Plug-Dj\" to be used in this live broadcast for alas we will stir up a ruckus (╭ರ_•́)\\","tags":"#hearthstone#forsen#plugdj#politely#ruckus#gentleman","favourites":9,"__v":0,"created_on":"2015-02-02T17:55:37.357Z","score":0.0005931588704815341},{"_id":"54c712aaf63c027608a745e6","id":583,"pasta":"What the fuck did you just fucking play against me, you little bitch? \nI’ll have you know I graduated top of my class in the Top Deck School,\n and I’ve been involved in numerous secret raids on Blizzard HQ, and I have over 300 confirmed topdecked lethals.\n I am trained in Hunter warfare and I’m the top topdecker in the entire US legendary bracket. \nYou are nothing to me but just another win. \nI will kick you the fuck out of legend with precision the likes of which has never been seen before on this Earth, \nmark my fucking words. \nYou think you can get away with trying to derank me over the Internet? Think again, fucker.","tags":"#hearthstone#hs#topdeck#navy#seals","favourites":10,"__v":0,"created_on":"2015-01-27T01:13:32.727Z","score":0.0005773508942813185},{"_id":"54cc4417528592176c9bce3a","id":630,"pasta":"\"Hey Hosty, I've got some bad news.\" says Amaz to Hosty. \"But I wasn't ghosting I swear!\" he replies, sweating heavily. \"It's alright, I won't fire you, as long as you do something for me.\" Hosty knows what Amaz wants. He bends over and lets Amaz have his way. Afterwards, as he cries on the bed, Amaz whispers in his ear, \"I lied. You're fired.\"﻿","tags":"#hearthstone#amaz#hosty#ghosty#sniperino#fanfic","favourites":9,"__v":0,"created_on":"2015-01-31T01:39:55.449Z","score":0.0005633481635058589},{"_id":"54be9589e99bf86b74870e63","id":285,"pasta":"★ ° ☾ ☆ ¸. ¸ 　★　 :.　 . • ○ ° ★　 .　 　.　.　　¸ .　　 ° 　¸. ● ¸ .　...somewhere　　　° ☾ ° 　¸. ● ¸ .　　★　° :.　 . • ° 　 .　 　:.　.in a parallel universe ● ¸ 　　　　° ☾ °☆ 　. ¸.　　　★　★ ° . .　　　　.　☾ °☆ 　. ● ¸ ..Kripp...° ☾　★ °● ¸ .　　　★　° :.　 . • ○ ° ★　 .　 ...is not a casual... ☾　★ ★ ° ☾ ☆ ¸. ¸ 　★　 :.　 . • ○ ° ★","tags":"#hearthstone#kripp#universe#parallel#casual","favourites":11,"__v":0,"created_on":"2015-01-20T09:15:33.584Z","score":0.0005628333027609253},{"_id":"54b6c843f6a1885137f43d0d","id":205,"pasta":"☑ “These Kripp nudes are CRAZY!” ☑ “My dick can't stay limp against nudes like that” ☑ \"He NEEDED precisely those two balls to win\" ☑ “He took the only nudes that could make me beat off” ☑ \"He had the perfect dick\" ☑ “There was nothing I could do but subscribe” ☑ ﻿","tags":"#kripp#checkboxes#nudes#hearthstone","favourites":12,"__v":0,"created_on":"2015-01-14T19:40:38.778Z","score":0.000558415586387866},{"_id":"54b2eba2ce7b585004706d99","id":19,"pasta":"That's an extremely unfortunate loss Kripp, even though you outplayed him on every possible level he still beat you, i've never seen anyone as unlucky as you that match, nor anyone as lucky as he was that match. It shouldn't even be legal for someone as bad as him to beat someone as amazing as you are at this game","tags":"#hearthstone#kripp#salt#sarcasm#sarcastic#luck","favourites":12,"__v":0,"created_on":"2015-01-11T21:25:39.432Z","score":0.0005346035660923578},{"_id":"54cff3e281be138a0c3cad29","id":682,"pasta":"Do you take Rania to be your lawfully wedded wife?\" asks the priest. Kripp smiles as he slips the ring on her finger. \"Yes I do,\" he says, squinting in the glare of a foggy day. The priest says, \"You may kiss the bride.\" as the crowd cheers. Kripp lifts Rania's veil and recoils in horror. Trump smirks, \"It seems you've tarried Mrump.\"","tags":"#hearthstone#kripp#trump#marry#wife#rania","favourites":8,"__v":0,"created_on":"2015-02-02T22:01:39.507Z","score":0.0005324823861467882},{"_id":"54b6c7e9f6a1885137f43d0b","id":203,"pasta":"When I'm ready to go to sleep I grab my laptop and get in bed. I open my laptop, go to Kripparrians youtube, turn the brightness all the way up and watch the video with the laptop screen close to my eyes. When the video is done I close my eyes and can still see Kripps face while I go to sleep. It's the only way I can feel safe.﻿","tags":"#kripp#hearthstone#sleep#youtube","favourites":11,"__v":0,"created_on":"2015-01-14T19:27:10.214Z","score":0.0005157058465973367},{"_id":"54c477e1059d4c227bbcb568","id":554,"pasta":"Topdick? TOPDICK? THAT WAS NOT A TOPDICK. THAT WAS PURE UNADULTERATED SKILL. I'm sorry if you are too stupid to see that. There is no part of Hearthstone that depends on \"luck\" or \"RNG\". It was all 100% calculated.","tags":"#hearthstone#topdeck#skill#luck#RNG#calculated","favourites":9,"__v":0,"created_on":"2015-01-25T04:58:04.397Z","score":0.0005067001451185617},{"_id":"54b6c81ef6a1885137f43d0c","id":204,"pasta":"Romanian doctor say in thick accent, \"He suffer from Casualitis, too many salts in blood.\" OJ is injected into the Kripp , but he continues to mumble \"Really bro,\" and \"Wow,\" numerous times. A priest enters and rips a bag of pepperonis over the Kripp. Papparin say \"Drink with me friends,\" and offer cappucino to all.﻿","tags":"#hearthstone#kripp#casualarrian#oj#doctor","favourites":10,"__v":0,"created_on":"2015-01-14T19:28:23.755Z","score":0.00047236358803510526},{"_id":"54d964ffcde34d377a1b495f","id":754,"pasta":"Kaceytron was found dead on February 9th. She was found drowned in a vast amount of semen. Upon DNA analysis it was concluded that the semen belongs to popular pro-nazi leader Kripparrian. Death analysis reports that Kaceytron choked while trying to swallow all of the semen and died due to oxygen deprivation","tags":"#hearthstone#kaceytron#kripp#blowjob#semen","favourites":6,"__v":0,"created_on":"2015-02-10T01:25:12.315Z","score":0.00046708753136637623},{"_id":"54c48db0059d4c227bbcb571","id":558,"pasta":"☑ “This guy's deck is alright” ☑ “My deck might not win against a deck like that” ☑ \"He NEEDED precisely those two cards to give him a better chance to win\" ☑ “He topdecked a card that might beat me” ☑ \"He alright cards\" ☑ “There are somethings I could do” ☑ “I played that alright\"","tags":"#hearthstone#kripp#mediocre#indecisive#checkboxes","favourites":8,"__v":0,"created_on":"2015-01-25T06:31:08.475Z","score":0.00045384873131107417}]