[{"_id":"556c1e7f5362236f199aa445","id":1704,"pasta":"(╭ರ_•́) Mr. Forsen we politely ask for you to have a sexual intercourse with the female in front of you for alas we will accuse you of prerecording the stream (╭ರ_•́).,","tags":"#forsen#tyggbar#hearthstone#twitch","favourites":20,"__v":0,"created_on":"2015-05-31T19:24:26.107Z","score":0.00012078445391463349},{"_id":"54b59209e90c10d22e88b97a","id":123,"pasta":"ᴀᴛᴛᴇɴᴛɪᴏɴ ᴛᴡɪᴛᴄʜ ᴜsᴇʀs: ᴛʜɪs ɪs ɪɴᴛᴇʀᴘᴏʟ ᴀɢᴇɴᴛ ɢɪɴᴏ ᴘᴀsᴛᴇʀɪɴᴏ ᴀɴᴅ ɪ'ᴍ ʜᴇʀᴇ ɪɴᴠᴇsᴛɪɢᴀᴛɪɴɢ sᴇʀɪᴀʟ ʀᴀᴘɪsᴛ ᴀɴᴅ ɴᴀᴢɪ sʏᴍᴘᴀᴛʜɪᴢᴇʀ ᴄᴏᴅᴇɴᴀᴍᴇᴅ ғᴏʀsᴇɴ. ᴘʟᴇᴀsᴇ ʜᴇʟᴘ sᴘʀᴇᴀᴅ ᴀᴡᴀʀᴇɴᴇss ᴏғ ᴛʜɪs ᴅᴀɴɢᴇʀᴏᴜs ᴄʀɪᴍɪɴᴀʟ.","tags":"#hearthstone#forsen#rapist","favourites":30,"__v":0,"created_on":"2015-01-13T21:45:00.490Z","score":0.00011904718532373664},{"_id":"561ca5ef84d2175224d8530a","id":2224,"pasta":"greEtings traVeler im new!!!!!!! holds up eaglehorn bow my name is rexxar but u can call me t3h hunTer oF fAAAce!!!!!!!! lol…as u can see i'll hunt you down!!!! thats why i came here, 2 go face _… im 13 years old (that didnt quite hit the mark!!) i like 2 attack face w/ my huffer (i hunt alone if u dont like it deal w/it) its our favorite turn 3 play!!! bcuz its SOOOO RNG!!!! hes RNG 2 of course but i want 2 summon more RNG cards =) like they say the more the facier!!!! lol…time moves quickly but i hope 2 make alot of SMOrcs here so give me lots of ragequits!!!!\nFAAAAAAAAAAACCCEE!!!!!!!!!!!!!!!! <--- me bein RNG again _^ hehe…my apologies!!!!!\n\nlet the hunt begin,\n\nt3h hunTer oF fAAce","tags":"#hearthstone#SMOrc#face#hunter#katie#random","favourites":11,"__v":0,"created_on":"2015-10-13T06:34:23.137Z","score":0.00011728352967416248},{"_id":"563006739c4390371389d141","id":2253,"pasta":"Tʜɪs ɪs ᴛʀᴜᴍᴘ. ᴅᴜʀɪɴɢ ᴀ ʙʀᴏᴀᴅᴄᴀsᴛ ɪ ᴀᴄᴄɪᴅᴇɴᴛᴀʟʟʏ sʜᴏᴡᴇᴅ ᴍʏ ᴅᴇsᴋᴛᴏᴘ ᴀɴᴅ ᴀ ғɪʟᴇ ɴᴀᴍᴇs “ʜᴀғᴜɴᴜᴅᴇs…” ɪ’ᴍ ᴅɪsɢᴜsᴛᴇᴅ ʙʏ ᴘᴇᴏᴘʟᴇ ᴀssᴜᴍɪɴɢ ᴛʜɪs ɪs ᴛʜᴇ ʜᴀғᴜ ɴᴜᴅᴇs. ᴛʜɪs ɪs ᴀᴄᴛᴜᴀʟʟʏ ʜᴀғᴜɴᴜᴅᴇsGONEWILD, ᴛʜᴇ ᴛᴇɴ ᴛɪᴍᴇs ᴍᴏʀᴇ sᴘɪᴄʏ ᴠᴇʀsɪᴏɴ, ᴀ ᴘʀɪᴠᴀᴛᴇ ᴘʜᴏᴛᴏsʜᴏᴏᴛ ᴏɴʟʏ ғᴏʀ ᴍᴇ. ɢᴇᴛ ʏᴏᴜʀ ғᴀᴄᴛs ʀɪɢʜᴛ.","tags":"#twitch#hearthstone#trump#hafu#hafunudes","favourites":10,"__v":0,"created_on":"2015-10-27T23:19:15.271Z","score":0.00011521626663499555},{"_id":"5630066b9c4390371389d140","id":2252,"pasta":"This chat is filled with racism, misogny and toxic behavior and general. Forsen you should double check your mod team because this is unacceptable, I am on the phone with twitch support right now to resolve this.","tags":"#twitch#hearthstone#forsen","favourites":10,"__v":0,"created_on":"2015-10-27T23:19:07.359Z","score":0.00011521621493901468},{"_id":"54f8d50287d1bc685b1e9613","id":975,"pasta":"( ง ͠° ͟ʖ ͡°)ง LETHAL, ATTEND ME (ง ͠° ͟ʖ ͡°)ง ( ° ͜ʖ͡°)╭∩╮ NEVER, FORSEN ( ° ͜ʖ͡°)╭∩╮","tags":"#hearthstone#forsen#one#off#lethal","favourites":25,"__v":0,"created_on":"2015-03-05T18:33:17.102Z","score":0.00011500356570521752},{"_id":"551b7499972b3991479554e8","id":1385,"pasta":"I sexually Identify as Ragnaros the Firelord. Ever since I was a boy I dreamed of soaring over the lava pits dropping hot fiery blasts on disgusting insects. People say to me that a person being Ragnaros is Impossible and I'm fucking retarded but I don't care, I'm beautiful. I'm having a plastic surgeon install lava flows and majestic horns on my body. From now on I want you guys to call me \"Ragnaros\" and respect my right to purge and purge by fire. If you can't accept me you're a elementaphobe and need to check your legendary privilege. Thank you for being so understanding.","tags":"#hearthstone#sexually#identify#ragnaros#rag","favourites":23,"__v":0,"created_on":"2015-04-01T02:23:07.830Z","score":0.00011458237268491255},{"_id":"54b5e94880aeb7bf35eaf564","id":175,"pasta":" ᕕ┌◕ᗜ◕┐ᕗ CHUGGA CHUGGA ᕕ┌◕ᗜ◕┐ᕗ\n","tags":"#Chugga#Hearthstone","favourites":28,"__v":0,"created_on":"2015-01-14T03:48:34.122Z","score":0.00011223029926584969},{"_id":"54bc394a2f952d126cefc72f","id":257,"pasta":"୧༼ಠ益ಠ༽୨ PLUGDJ OR RIOT ୧༼ಠ益ಠ༽୨","tags":"#hearthstone#forsen#plugdj#riot#donger","favourites":27,"__v":0,"created_on":"2015-01-18T22:52:38.208Z","score":0.00010997034909929027},{"_id":"55922df4dd62532d34ee3737","id":1828,"pasta":"so i was walking down the road today and 2 black hoodlums approached me. They asked \"dawg u a crip or a blood fool\". Startled, i muttered \"I'm a kripp\". The power of morosan rushed through my body, i raised my donger and blew both of the hoodlums away with 100% pure orange juice from concentrate. Value.","tags":"#hearthstone#kripp#value#donger","favourites":15,"__v":0,"created_on":"2015-06-29T13:55:30.322Z","score":0.00010269940934884665},{"_id":"55d81c2f65d3a500319d6d04","id":2033,"pasta":"Adrian “Lifecoach” Koy was born in 1981 in Eur-rope. The son of a poor rope salesman, it was young Adrian’s job to burn the ends of the rope together to make them stronger. Lifecoach’s father died 2 years ago and he vowed to burn every rope he saw from then on in his honor.","tags":"#Lifecoach#Ropecoach#Hearthstone","favourites":12,"__v":0,"created_on":"2015-08-22T06:52:31.348Z","score":0.00010187717171703733},{"_id":"54c96790f63c027608a74613","id":599,"pasta":"Trump. Amaz. MaSsan. Hafu. Long ago, the four Asians streamed together in harmony. Then, everything changed when the F O R S E N B O Y S attacked. Only Reynad, master of all four, could stop them, but when Twitch needed him most, he was too salty. But my brother and I found the new Avatar, a salty streamer named Kripp","tags":"#hearthstone#kripp#reynad#avatar#4#asians","favourites":24,"__v":0,"created_on":"2015-01-28T21:16:12.133Z","score":0.00010163361444138135},{"_id":"54b4a8d8e5f2e8b72283cd69","id":91,"pasta":"Kripp, do you remember me? Your one true love?\nEveryday you used to ride me, everyday you used me. We were meant to see the world together.\nBut then one day a strange black man came up to me and told me I was such a fine piece of work, there was nothing I could do but let him take me, own me. He was I, I was him. We were one.\nI come here today to tell you that I miss you and I want you back.\nRuck Fania, let us start over again and spend our lives together, forever!\n//Your Bike.","tags":"#hearthstone#kripp#bike#rania#succubus","favourites":25,"__v":0,"created_on":"2015-01-13T05:06:42.388Z","score":0.0001015164611270006},{"_id":"56038821dbbbe94d05d1750f","id":2171,"pasta":"My Name is REYNAD ヾ(●⌒∇⌒●)ﾉ, I’m a little salty and like to drink the day away. However, if I manage to get a good night’s ass-pounding I’m a very talkative and adventurous person.","tags":"#hearthstone#Hearthstone#forsen","favourites":10,"__v":0,"created_on":"2015-09-24T05:20:33.381Z","score":0.00009864324074345479},{"_id":"55de3beebf32cfe3756042d1","id":2078,"pasta":"ʀᴇxxᴀʀ ᴅɪᴀʀʏ ᴛɢᴛ ᴅᴀʏ 1: ᴇᴠᴇʀʏ ᴅᴇᴄᴋ ɪɴsᴘɪʀᴇ ɴᴏᴡ. ᴀᴍ ᴄᴏɴғᴜsᴇ. ᴛʀᴀᴅᴇ ᴏʀ ʜɪᴛ ғᴀᴄᴇ? ɪ ᴘʟᴀʏ ᴛ1 ʟᴇᴘᴇʀ ɢɴᴏᴍᴇ ᴄᴏɪɴ ʟᴇᴘᴇʀ ɢɴᴏᴍᴇ? ᴛɢᴛ ᴅᴀʏ 2: ᴍᴀɴʏ ᴛʜɪɴᴋɪɴɢ, ʙʀᴀɪɴ ʜᴜʀᴛ. ᴅᴇᴄɪᴅᴇ ᴛᴏ ᴋᴇᴇᴘ ᴜsɪɴɢ ᴏʟᴅ ᴅᴇᴄᴋ. ᴅᴇᴄɪᴅᴇ ᴋᴇᴇᴘ ᴜsᴇ ᴏʟᴅ ᴅᴇᴄᴋ ᴀɴᴅ ʜɪᴛ ғᴀᴄᴇ. ᴛɢᴛ ᴅᴀʏ 3: ᴍᴇ sᴛɪʟʟ ᴡɪɴɴɪɴɢ.","tags":"#hearthstone#TGT#facehunter#smorc","favourites":11,"__v":0,"created_on":"2015-08-26T22:21:34.747Z","score":0.00009582444708840616}]