[{"_id":"54e4f4969be75f1867cb2304","id":837,"pasta":"Hey, I'm drafting a Rogue Arena deck and I'm 29 cards in. Should I pick Conceal (like how MagicAmy concealed her identity), Sap (like all of us were), or Vanish (like what MagicAmy is about to do)?","tags":"#hearthstone#magicamy#rogue#draft#fake","favourites":21,"__v":0,"created_on":"2015-02-18T20:04:39.835Z","score":0.00009516319912518105},{"_id":"54b787b25003512e438e7406","id":214,"pasta":" ☑ “This muslim's terrorism is CRAZY!” ☑ “My caricatures can't win against a terrorist like that” ☑ \"He NEEDED precisely those two AK-47 to win\" ☑ “He had the only bomb that could kill me” ☑ \"He had the perfect Allahu Akbar\" ☑ “There was nothing I could do” ☑ “He killed my freedom of speech perfectly\" ☑ \"What a joke\"","tags":"#hearthstone#kripp#terrorists#islam#checkboxes","favourites":23,"__v":0,"created_on":"2015-01-15T09:03:35.213Z","score":0.00009488876600811113},{"_id":"5532b71eb5d5ffec4839e7f6","id":1484,"pasta":"SECURITY ALERT: A Romanian man, roughly 6'5\", skeleton thin, with black hair and scraggly beard has been seen riding the NYC Sub train and violently \"Bro-Fisting\" passengers. He's accompanied by a short Asian man dressed as Hitler who reputedly cuts out the tongue of anyone who refuses to give him $5. Exercise caution and stay way from the Subs!","tags":"#hearthstone#kripp#trump#nazi#subs","favourites":17,"__v":0,"created_on":"2015-04-18T12:51:35.634Z","score":0.00009217514554227545},{"_id":"54ea280ac200ce525fb25d96","id":897,"pasta":"TTours Le Two Cam has arrived TTours","tags":"#hearthstone#two#camera#cam#toucan","favourites":20,"__v":0,"created_on":"2015-02-22T13:51:05.726Z","score":0.00009203041647569566},{"_id":"56ea32f2709549ef048c48d9","id":2565,"pasta":"I sexually Identify as a Reynad. Ever since I was a boy I dreamed of soaring over the twitch chat dropping hot sticky loads of salt on disgusting plebs. People say to me it is Impossible and I’m fucking retarded but I don’t care, I’m beautiful. I’m having a plastic surgeon install a big forehead, and spacepants. From now on I want you guys to call me “Reynoodle” and respect my right to pour salt from above and ban needlessly. If you can’t accept me you’re an Archon member and need to check out Tempo Storm. Thank you for being so understanding.","tags":"#hearthstone#reynad","favourites":3,"__v":0,"created_on":"2016-03-17T04:30:42.810Z","score":0.00009014388317016324},{"_id":"551432afb79c00ce446ab06b","id":1334,"pasta":" ໒( •̀ ╭ ͟ʖ╮ •́ )७ It is me Kripp Dong Un. I demand that all showings of \"Topdecking and Wrecking 3: Gripped and Kripped\" be removed immediately. Those who refuse will be pepperonied ໒( •̀ ╭ ͟ʖ╮ •́ )७","tags":"#hearthstone#kripp#dong#un#pepperoni","favourites":17,"__v":0,"created_on":"2015-03-26T13:38:59.814Z","score":0.00008658580738803185},{"_id":"54f8d50d87d1bc685b1e9614","id":976,"pasta":"( ง ͠° ͟ʖ ͡°)ง RNG, ATTEND ME (ง ͠° ͟ʖ ͡°)ง ( ° ͜ʖ͡°)╭∩╮ NEVER, KRIPP ( ° ͜ʖ͡°)╭∩╮","tags":"#hearthstone#kripp#RNG#attend#me","favourites":18,"__v":0,"created_on":"2015-03-05T18:34:10.666Z","score":0.00008627998428538684},{"_id":"55f075b7496ad3a51db512b4","id":2125,"pasta":"SMOrc Hey, hey, hey\nJust think while you been getting down and out about the healers and the dirty dirty taunts of the world you could have been getting down to these sick beats SMOrc\n\nSMOrc That Shaman brought his new Taunt friend\n I'm like SMOrc oh my god I just wanna face \nWith the owl over there with the derpy eye hair\nWon't you Kill Command baby let's go face, face SMOrc","tags":"#hearthstone#SMOrc#face#hunter","favourites":9,"__v":0,"created_on":"2015-09-09T18:08:55.222Z","score":0.0000841225145828661},{"_id":"560f5d67dbbbe94d05d17562","id":2201,"pasta":"Hi i am Biccboi-fuccboi. Can you please stop spamming. IT IS SO FKING CHILDISH. As you know Massan is a very educational streamer, so please raise your iq by 420 by watching and shutting up. Massan is a very funny and smart man. Please no copy pasta","tags":"#hearthstone#massan#420","favourites":8,"__v":0,"created_on":"2015-10-03T04:45:27.569Z","score":0.00008322411498886498},{"_id":"54ee54dd10b7396256d9cbf8","id":918,"pasta":"✓ amazW ✓ krippW ✓ trumpW ✓ reynadW ✓ kolentoW ✓ bajW ✓ dewW ✓ emjaneW ✓ forsenW ✓ krippW ✓ mitchW ✓ reckW ✓ sodaW ✓ taymooW ✓ PLEB TEST PASSED","tags":"#hearthstone#forsen#pleb#test","favourites":17,"__v":0,"created_on":"2015-02-25T19:47:22.428Z","score":0.00008040004739137025},{"_id":"54b6c7e9f6a1885137f43d0b","id":203,"pasta":"When I'm ready to go to sleep I grab my laptop and get in bed. I open my laptop, go to Kripparrians youtube, turn the brightness all the way up and watch the video with the laptop screen close to my eyes. When the video is done I close my eyes and can still see Kripps face while I go to sleep. It's the only way I can feel safe.﻿","tags":"#kripp#hearthstone#sleep#youtube","favourites":19,"__v":0,"created_on":"2015-01-14T19:27:10.214Z","score":0.00008017163360668408},{"_id":"564dbab214bb47530dfef22d","id":2303,"pasta":"I SEXUALLY IDENTIFY AS “NONE OF YOUR BUSINESS”. EVER SINCE I WAS A BOY I DREAMED OF SOARING THROUGH THE INN DROPPING 1-MANA SPELLS FOR FREE ON DISGUSTING HUNTERS. PEOPLE SAY TO ME THAT A PERSON BEING A MYSTERIOUS CHALLENGER IS IMPOSSIBLE AND I’M FUCKING RETARDED BUT I DON’T CARE, I’M BEAUTIFUL. I’M GOING TO COME DOWN ON TURN SIX, PULL 5 SECRETS FROM MY DECK AND SQUASH ANY HOPE OF BOARD CONTROL FROM YOUR PUNY SOUL. FROM NOW ON I WANT YOU GUYS TO CALL ME “DR. SIX” AND RESPECT MY RIGHT TO SINGLEHANDEDLY BREAK A CERTAIN CLASS OF CARDS. IF YOU CAN’T ACCEPT ME YOU’RE A SECRETOPHOBE AND NEED TO CHECK YOUR SPELL PRIVILEGE. THANK YOU FOR BEING SO UNDERSTANDING.","tags":"#hearthstone#noneofyourbusiness#paladin#twitch","favourites":6,"__v":0,"created_on":"2015-11-19T12:04:02.871Z","score":0.00007924680235495622},{"_id":"54b5d4688ba53a7c3326b4f0","id":164,"pasta":"The stream starts, and so my spam begins. It shall not end until I am banned. I shall fear no mod, sub to no streamer. I shall live and die in the Chat. For I am the value in the bomber. I am the BM in the lethal. I am the salt in the defeat. I pledge my keyboard to the Chat, for this stream and all the streams to come.","tags":"#pledge#hearthstone#nights#watch#got","favourites":18,"__v":0,"created_on":"2015-01-14T02:25:23.135Z","score":0.00007631733956130787},{"_id":"566907fcc41d20f176ef70d0","id":2427,"pasta":"At first i thought this viewbotting thing was just a joke, but as i watch it now i think Massan may really viewbot.\nHe's making lots of excuses not to show the money he makes. Also... why the hell are 15k people watching a stream in which there is almost nothing interesting? I mean - he has facecam, some ads put here and there and rarely speaks something quietly. Why would people watch a silent stream with Asian and ads in it?\nLike why?","tags":"#hearthstone#massan#viewbot#viewbotting#MrDestructoid#lie","favourites":5,"__v":0,"created_on":"2015-12-10T05:05:00.604Z","score":0.00007393466776398598},{"_id":"560f5d6bdbbbe94d05d17563","id":2202,"pasta":"MaSsan created a strategy that revolved around becoming the top streamer on twitch without requiring any real human viewers. Fighting to hold viewer's interest and interaction between twitch streamers make an overall Twitch stream more fun and compelling, but only broadcasting to computers is not particularly fun or interactive.","tags":"#MaSsan#MrDestructoid#Hearthstone#BeepBoop","favourites":7,"__v":0,"created_on":"2015-10-03T04:45:31.164Z","score":0.00007319143715859445}]