[{"_id":"54b2eba2ce7b585004706d99","id":19,"pasta":"That's an extremely unfortunate loss Kripp, even though you outplayed him on every possible level he still beat you, i've never seen anyone as unlucky as you that match, nor anyone as lucky as he was that match. It shouldn't even be legal for someone as bad as him to beat someone as amazing as you are at this game","tags":"#hearthstone#kripp#salt#sarcasm#sarcastic#luck","favourites":17,"__v":0,"created_on":"2015-01-11T21:25:39.432Z","score":0.0000721896941656107},{"_id":"54cfbdd6a9f640440b41fc5a","id":676,"pasta":"(╭ರ_•́)\\ Mr. Fors we politely ask for the program 'Plug-Dj\" to be used in this live broadcast for alas we will stir up a ruckus (╭ರ_•́)\\","tags":"#hearthstone#forsen#plugdj#politely#ruckus#gentleman","favourites":16,"__v":0,"created_on":"2015-02-02T17:55:37.357Z","score":0.00007200598281322646},{"_id":"555e5e85df71aa25492f2f93","id":1666,"pasta":"Kappa                                                                                          You are permanently subscribed to TrumpSC.","tags":"#hearthstone#forsen#kappa#trump","favourites":11,"__v":0,"created_on":"2015-05-21T17:31:06.959Z","score":0.0000686038718211588},{"_id":"55354e9e7b5dde465c0ff5a1","id":1494,"pasta":"└( ° ͜ʖ͡°)┐Born too late to explore the Earth, born too soon to explore the Galaxy. Born just in time to TAKE THE SOURPLS TEST! └( ° ͜ʖ͡°)┐ ✓ SourPls ✓ SourPls ✓ SourPls ✓ SourPls ✓ SourPls ✓ SourPls ✓ SourPls ✓ SourPls ✓ SourPls ✓ SourPls ✓ SourPls ✓ SourPls ✓ SourPls ✓ SourPls SOURPLS TEST PASSED","tags":"#test#sourpls#explore#galaxy#hearthstone","favourites":12,"__v":0,"created_on":"2015-04-20T17:42:14.938Z","score":0.00006787113503156137},{"_id":"550f0b0d2ab05ce134dd32f1","id":1285,"pasta":"ASCENDED invisible spam                                                                                                                                                                                                                                                                                                                                                                                        PogChamp","tags":"#hearthstone#ascended#spam","favourites":13,"__v":0,"created_on":"2015-03-22T16:14:09.235Z","score":0.00006743088140773514},{"_id":"54c712aaf63c027608a745e6","id":583,"pasta":"What the fuck did you just fucking play against me, you little bitch? \nI’ll have you know I graduated top of my class in the Top Deck School,\n and I’ve been involved in numerous secret raids on Blizzard HQ, and I have over 300 confirmed topdecked lethals.\n I am trained in Hunter warfare and I’m the top topdecker in the entire US legendary bracket. \nYou are nothing to me but just another win. \nI will kick you the fuck out of legend with precision the likes of which has never been seen before on this Earth, \nmark my fucking words. \nYou think you can get away with trying to derank me over the Internet? Think again, fucker.","tags":"#hearthstone#hs#topdeck#navy#seals","favourites":15,"__v":0,"created_on":"2015-01-27T01:13:32.727Z","score":0.00006690898502894841},{"_id":"550903fab47c3d010fd965d9","id":1170,"pasta":"ｗａｋｉｎｇ ｓｕｄｄｅｎｌｙ． ｉ ｆｅｅｌ ｃｕｍ ｉｎ ｍｙ ｄｉａｐｅｒ． ｉ ｗｈｉｓｐｅｒ ｓｏｌｅｍｎｌｙ ｉｎｔｏ ｔｈｅ ｄａｒｋ．\"ｋｒｉｐｐａｒｒｉａｎ.\"","tags":"#hearthstone#kripp#waking#cum#diaper","favourites":13,"__v":0,"created_on":"2015-03-18T04:49:18.330Z","score":0.0000666440594793231},{"_id":"54c474b5059d4c227bbcb566","id":553,"pasta":"No, he did not miss lethal. No, he did not misplay. There was nothing he could do. He played that absolutely perfectly. I am sick and tired of you Twitch retards disrespecting this gentleman, who, quite frankly, is simply the greatest Hearthstone player ever to live. Pls no copypasterino.","tags":"#hearthstone#kripp#reynad#miss#lethal#greatest","favourites":15,"__v":0,"created_on":"2015-01-25T04:44:30.180Z","score":0.00006661711316157991},{"_id":"54e552149be75f1867cb2318","id":842,"pasta":"It's been said that you can see the real magicamy if you look closely enough into Hosty's picture frame.","tags":"#hearthstone#magicamy#fake#ghosty#hosty","favourites":14,"__v":0,"created_on":"2015-02-19T02:59:26.010Z","score":0.00006650778013810629},{"_id":"54be9589e99bf86b74870e63","id":285,"pasta":"★ ° ☾ ☆ ¸. ¸ 　★　 :.　 . • ○ ° ★　 .　 　.　.　　¸ .　　 ° 　¸. ● ¸ .　...somewhere　　　° ☾ ° 　¸. ● ¸ .　　★　° :.　 . • ° 　 .　 　:.　.in a parallel universe ● ¸ 　　　　° ☾ °☆ 　. ¸.　　　★　★ ° . .　　　　.　☾ °☆ 　. ● ¸ ..Kripp...° ☾　★ °● ¸ .　　　★　° :.　 . • ○ ° ★　 .　 ...is not a casual... ☾　★ ★ ° ☾ ☆ ¸. ¸ 　★　 :.　 . • ○ ° ★","tags":"#hearthstone#kripp#universe#parallel#casual","favourites":15,"__v":0,"created_on":"2015-01-20T09:15:33.584Z","score":0.00006586999833587397},{"_id":"54f78c2387d1bc685b1e95fb","id":965,"pasta":"I sexually identify as an Ironbeak Owl. Ever since I was a boy I dreamed of being misplayed during tournaments and silencing the incorrect cards. People say to me that a person being an owl is ridiculous and I'm fucking retarded but I don't care, I'm beautiful. I'm having a genetic engineer put ironbeak owl DNA into my body, equipping me with feathers, beaks, and the power to silence others. From now on I want you guys to call me \"Owlsen\" and respect my right to silence from above and silence needlessly. If you can't accept me you're an owlphobe and need to check your animal privilege. Thank you for being so","tags":"#hearthstone#sexually#identify#ironbeak#owl","favourites":13,"__v":0,"created_on":"2015-03-04T18:54:46.050Z","score":0.0000643821717287151},{"_id":"558233112120570651f0ae34","id":1776,"pasta":"After a long and relaxing mid-afternoon nap, sjow wakes up just in time to hear that he has been disqualified from Dream Hack. \"What a yoke\" sjow whines as he makes his way to the nearest bar to drown his sorrows. On his way out he spots nadia, who asks sjow if she can be his waifu. Becoming instantly horny, sjow mutters something cheesy and runs to the gay bar in the middle of the street for a lap dance. sjow eventually finishes in his pants 30 seconds into his lap dance. \"Money well spent\" sjow sighs with satisfaction. He looks up and then recoils in horror at the face of this 'stripper'. \"I'm glad you liked it\" trump says with a smirk ","tags":"#Hearthstone#sjow#dreamhack#trump","favourites":9,"__v":0,"created_on":"2015-06-17T02:35:44.637Z","score":0.00006184413238392504},{"_id":"551bb2f65a714a1e53683b96","id":1388,"pasta":"I sexually identify as Trump. Ever since I was a boy I dreamed of soaring over the Twitch chat dropping hot sticky sub mode on disgusting memers. People say to me that a person being a streamer is impossible and I’m *** retarded but I don’t care, I’m playing Pokemon. I’m having a plastic surgeon install rotary teddy bears, 30 mm whiteboards and tattoo every local fast food chain's phone number on my body. From now on I want you guys to call me “Prison Trump” and respect my right to stream from my bedroom and talk the same way but with a slightly offensive attitude. If you can’t accept me you’re a valuephobe and need to check your money. Thank you for being so understanding.","tags":"#tuck#frump#trump#sexually#identify#hearthstone","favourites":11,"__v":0,"created_on":"2015-04-01T08:36:13.310Z","score":0.00005943854181145799},{"_id":"5566b227dac4eb127bdadaa8","id":1678,"pasta":" LETS MAKE A RAINBOW █████████████████████████","tags":"#hearthstone#kripp#rainbow","favourites":9,"__v":0,"created_on":"2015-05-26T09:12:22.630Z","score":0.000057772573998847024},{"_id":"54b6c81ef6a1885137f43d0c","id":204,"pasta":"Romanian doctor say in thick accent, \"He suffer from Casualitis, too many salts in blood.\" OJ is injected into the Kripp , but he continues to mumble \"Really bro,\" and \"Wow,\" numerous times. A priest enters and rips a bag of pepperonis over the Kripp. Papparin say \"Drink with me friends,\" and offer cappucino to all.﻿","tags":"#hearthstone#kripp#casualarrian#oj#doctor","favourites":13,"__v":0,"created_on":"2015-01-14T19:28:23.755Z","score":0.00005718457145460294}]