[{"_id":"564e1eb614bb47530dfef260","id":2354,"pasta":"Forsen turns on Reynad's stream and sees Tyggbar riding Reynad cowgirl. He turns on his stream, \"I'm not triggered, chat,\" he says, tears streaming down his face.. FeelsBadMan","tags":"#hearthstone#forsen#reynad#tyggbar#rarepepe#twitch","favourites":1,"__v":0,"created_on":"2015-11-19T19:10:46.000Z","score":0},{"_id":"564e1ba614bb47530dfef25c","id":2350,"pasta":"KappaRoss “This guy's painting is CRAZY!” KappaRoss “My drawing can't win against a painting like that” KappaRoss \"He NEEDED precisely those colors to win\" KappaRoss “He drew the only scene that could beat me” KappaRoss \"He had the perfect brush\" KappaRoss","tags":"#Hearthstone#Forsenlol#Kripp#Crazy#twitch","favourites":10,"__v":0,"created_on":"2015-11-19T18:57:42.837Z","score":0.00012953279858840042},{"_id":"564dbab214bb47530dfef22d","id":2303,"pasta":"I SEXUALLY IDENTIFY AS “NONE OF YOUR BUSINESS”. EVER SINCE I WAS A BOY I DREAMED OF SOARING THROUGH THE INN DROPPING 1-MANA SPELLS FOR FREE ON DISGUSTING HUNTERS. PEOPLE SAY TO ME THAT A PERSON BEING A MYSTERIOUS CHALLENGER IS IMPOSSIBLE AND I’M FUCKING RETARDED BUT I DON’T CARE, I’M BEAUTIFUL. I’M GOING TO COME DOWN ON TURN SIX, PULL 5 SECRETS FROM MY DECK AND SQUASH ANY HOPE OF BOARD CONTROL FROM YOUR PUNY SOUL. FROM NOW ON I WANT YOU GUYS TO CALL ME “DR. SIX” AND RESPECT MY RIGHT TO SINGLEHANDEDLY BREAK A CERTAIN CLASS OF CARDS. IF YOU CAN’T ACCEPT ME YOU’RE A SECRETOPHOBE AND NEED TO CHECK YOUR SPELL PRIVILEGE. THANK YOU FOR BEING SO UNDERSTANDING.","tags":"#hearthstone#noneofyourbusiness#paladin#twitch","favourites":6,"__v":0,"created_on":"2015-11-19T12:04:02.871Z","score":0.00007924680235495622},{"_id":"563fff7e59b2d28c5e79046f","id":2264,"pasta":"༼ ºʖ̯º ༽༼ ºʖ̯º ༽༼ ºʖ̯º ༽ EVERYONE, GET OUT OF HERE ༼ ºʖ̯º ༽༼ ºʖ̯º ༽༼ ºʖ̯º ༽","tags":"#hearthstone#patron#get#out","favourites":3,"__v":0,"created_on":"2015-11-09T02:05:50.601Z","score":0.00003496097297613591},{"_id":"563006739c4390371389d141","id":2253,"pasta":"Tʜɪs ɪs ᴛʀᴜᴍᴘ. ᴅᴜʀɪɴɢ ᴀ ʙʀᴏᴀᴅᴄᴀsᴛ ɪ ᴀᴄᴄɪᴅᴇɴᴛᴀʟʟʏ sʜᴏᴡᴇᴅ ᴍʏ ᴅᴇsᴋᴛᴏᴘ ᴀɴᴅ ᴀ ғɪʟᴇ ɴᴀᴍᴇs “ʜᴀғᴜɴᴜᴅᴇs…” ɪ’ᴍ ᴅɪsɢᴜsᴛᴇᴅ ʙʏ ᴘᴇᴏᴘʟᴇ ᴀssᴜᴍɪɴɢ ᴛʜɪs ɪs ᴛʜᴇ ʜᴀғᴜ ɴᴜᴅᴇs. ᴛʜɪs ɪs ᴀᴄᴛᴜᴀʟʟʏ ʜᴀғᴜɴᴜᴅᴇsGONEWILD, ᴛʜᴇ ᴛᴇɴ ᴛɪᴍᴇs ᴍᴏʀᴇ sᴘɪᴄʏ ᴠᴇʀsɪᴏɴ, ᴀ ᴘʀɪᴠᴀᴛᴇ ᴘʜᴏᴛᴏsʜᴏᴏᴛ ᴏɴʟʏ ғᴏʀ ᴍᴇ. ɢᴇᴛ ʏᴏᴜʀ ғᴀᴄᴛs ʀɪɢʜᴛ.","tags":"#twitch#hearthstone#trump#hafu#hafunudes","favourites":10,"__v":0,"created_on":"2015-10-27T23:19:15.271Z","score":0.00011521626663499555},{"_id":"5630066b9c4390371389d140","id":2252,"pasta":"This chat is filled with racism, misogny and toxic behavior and general. Forsen you should double check your mod team because this is unacceptable, I am on the phone with twitch support right now to resolve this.","tags":"#twitch#hearthstone#forsen","favourites":10,"__v":0,"created_on":"2015-10-27T23:19:07.359Z","score":0.00011521621493901468},{"_id":"561ca6b584d2175224d85313","id":2233,"pasta":"Brotherman Bill created a strategy that revolved around trying to live at the top of the hill with the bunch of tadadadadadas in his song. Fighting for hill control and battles between KKona spammers make an overall spam more fun and compelling, but listening the same song 20+ times is not particularly fun or interactive. .","tags":"#hearthstone#brotherman#bill","favourites":25,"__v":0,"created_on":"2015-10-13T06:37:41.911Z","score":0.00024326764898112307},{"_id":"561ca68484d2175224d8530f","id":2229,"pasta":" Reynad created a strategy that revolved around muting your mic during stream without reading chat at all. Watching him talk to himself concede HearthStone games is fun and compelling, but not having a commentary in one turn is not particularly fun or interactive. .","tags":"#hearthstone#reynad#mic#muted","favourites":5,"__v":0,"created_on":"2015-10-13T06:36:52.288Z","score":0.000054654235914471764},{"_id":"561ca5ef84d2175224d8530a","id":2224,"pasta":"greEtings traVeler im new!!!!!!! holds up eaglehorn bow my name is rexxar but u can call me t3h hunTer oF fAAAce!!!!!!!! lol…as u can see i'll hunt you down!!!! thats why i came here, 2 go face _… im 13 years old (that didnt quite hit the mark!!) i like 2 attack face w/ my huffer (i hunt alone if u dont like it deal w/it) its our favorite turn 3 play!!! bcuz its SOOOO RNG!!!! hes RNG 2 of course but i want 2 summon more RNG cards =) like they say the more the facier!!!! lol…time moves quickly but i hope 2 make alot of SMOrcs here so give me lots of ragequits!!!!\nFAAAAAAAAAAACCCEE!!!!!!!!!!!!!!!! <--- me bein RNG again _^ hehe…my apologies!!!!!\n\nlet the hunt begin,\n\nt3h hunTer oF fAAce","tags":"#hearthstone#SMOrc#face#hunter#katie#random","favourites":11,"__v":0,"created_on":"2015-10-13T06:34:23.137Z","score":0.00011728352967416248},{"_id":"56175e9084d2175224d852de","id":2216,"pasta":" You've been visted by the BALTIMORE LOOT HOARDER TriHard panicBasket post this five times without getting banned and all the loot is YOURS!!","tags":"#hearthstone#baltimore#loot#hoarder","favourites":2,"__v":0,"created_on":"2015-10-09T06:28:32.993Z","score":0.000016900778979241565},{"_id":"560f5d6bdbbbe94d05d17563","id":2202,"pasta":"MaSsan created a strategy that revolved around becoming the top streamer on twitch without requiring any real human viewers. Fighting to hold viewer's interest and interaction between twitch streamers make an overall Twitch stream more fun and compelling, but only broadcasting to computers is not particularly fun or interactive.","tags":"#MaSsan#MrDestructoid#Hearthstone#BeepBoop","favourites":7,"__v":0,"created_on":"2015-10-03T04:45:31.164Z","score":0.00007319143715859445},{"_id":"560f5d67dbbbe94d05d17562","id":2201,"pasta":"Hi i am Biccboi-fuccboi. Can you please stop spamming. IT IS SO FKING CHILDISH. As you know Massan is a very educational streamer, so please raise your iq by 420 by watching and shutting up. Massan is a very funny and smart man. Please no copy pasta","tags":"#hearthstone#massan#420","favourites":8,"__v":0,"created_on":"2015-10-03T04:45:27.569Z","score":0.00008322411498886498},{"_id":"560e1a6bdbbbe94d05d17551","id":2189,"pasta":"Leeroy Jenkins created a strategy that revolved around trying to defeat your opponent in one turn without requiring any cards on the board. Fighting for board control and battles between minions make an overall game of Hearthstone more fun and compelling, but taking 20+ damage in one turn is not particularly fun or interactive.","tags":"#hearthstone#patron#warrior#leeroy#jenkins","favourites":1,"__v":0,"created_on":"2015-10-02T05:47:23.126Z","score":0},{"_id":"56038821dbbbe94d05d1750f","id":2171,"pasta":"My Name is REYNAD ヾ(●⌒∇⌒●)ﾉ, I’m a little salty and like to drink the day away. However, if I manage to get a good night’s ass-pounding I’m a very talkative and adventurous person.","tags":"#hearthstone#Hearthstone#forsen","favourites":10,"__v":0,"created_on":"2015-09-24T05:20:33.381Z","score":0.00009864324074345479},{"_id":"55f270f5b83e5439695d2ca0","id":2130,"pasta":"Hey Mr. Yagut, Team Liquid manager here. I´ve heard you´re looking for a team now. We´ve noticed your incredible photoshop skills (your fake legend rank), and we´re just looking for a designer for our new web site. Please contact us if you´re interested","tags":"#hearthstone#MrYagut#fake#rank","favourites":4,"__v":0,"created_on":"2015-09-11T06:13:09.390Z","score":0.00003737961061374264}]