[{"_id":"559b5486f17ca0ca6d772bdc","id":1850,"pasta":"@Forsenlol I am 23 year old. I have 13 year olf sister.Our parents passed away 3 years ago.I do m y best to survive.My sister need 10 $ for school trip.Can u give me 10 $. :(","tags":"#forsen#hearthstone#sister#10","favourites":2,"__v":0,"created_on":"2015-07-05T13:18:15.905Z","score":0.00014642725450386395},{"_id":"55922df4dd62532d34ee3737","id":1828,"pasta":"so i was walking down the road today and 2 black hoodlums approached me. They asked \"dawg u a crip or a blood fool\". Startled, i muttered \"I'm a kripp\". The power of morosan rushed through my body, i raised my donger and blew both of the hoodlums away with 100% pure orange juice from concentrate. Value.","tags":"#hearthstone#kripp#value#donger","favourites":7,"__v":0,"created_on":"2015-06-29T13:55:30.322Z","score":0.0005639395834693351},{"_id":"55922decdd62532d34ee3736","id":1827,"pasta":"Bro, you literally saved my life. I was running away from communist East Germany. I had had no food or sleep for 3 days, and I could feel my legs collapsing beneath myself. I saw the guard tower that would surely shoot me down if I approached the chain-link fence tipped with barbed wire, and I lost all hope. Then I spied a West German fellow about to watch this vid. I hopped the fence to skipp the kripp just in time.","tags":"#kripp#hearthstone#skipthekripp","favourites":2,"__v":0,"created_on":"2015-06-29T13:41:22.925Z","score":0.00012667058656166998},{"_id":"558f79137bc415727ec982ef","id":1818,"pasta":"\"Great day, isn't it Reynad?\" Frodan asks on Skype. \"I suppose so,\" says Reynad, \"I've almost convinced Mira into anal.\" \"I meant about Gay Marriage,\" replies Frodan. Reynad sighs, \"I've told you before, I was drunk and confused.\"","tags":"#hearthstone#reynad#gay","favourites":1,"__v":0,"created_on":"2015-06-27T08:41:29.498Z","score":0},{"_id":"558233112120570651f0ae34","id":1776,"pasta":"After a long and relaxing mid-afternoon nap, sjow wakes up just in time to hear that he has been disqualified from Dream Hack. \"What a yoke\" sjow whines as he makes his way to the nearest bar to drown his sorrows. On his way out he spots nadia, who asks sjow if she can be his waifu. Becoming instantly horny, sjow mutters something cheesy and runs to the gay bar in the middle of the street for a lap dance. sjow eventually finishes in his pants 30 seconds into his lap dance. \"Money well spent\" sjow sighs with satisfaction. He looks up and then recoils in horror at the face of this 'stripper'. \"I'm glad you liked it\" trump says with a smirk ","tags":"#Hearthstone#sjow#dreamhack#trump","favourites":8,"__v":0,"created_on":"2015-06-17T02:35:44.637Z","score":0.0004959330732584698},{"_id":"557c9db22906adf56249ad88","id":1763,"pasta":"( ͡° ͜🔴 ͡°) ＣＬＯＷＮ ＦＩＥＳＴＡ ( ͡° ͜🔴 ͡°)","tags":"#hearthstone#clown#fiesta","favourites":39,"__v":0,"created_on":"2015-06-13T15:20:58.870Z","score":0.0019068111893851612},{"_id":"5578be8a7d2300ce44f0cef8","id":1753,"pasta":" ( ͡° ͜◯ ͡°) ﻿ＣＬＯＷＮ ＦＩＥＳＴＡ ( ͡° ͜◯ ͡°)","tags":"#clowns#forsen#hearthstone","favourites":14,"__v":0,"created_on":"2015-06-10T21:29:39.037Z","score":0.0007437112665103482},{"_id":"55737b4d7d2300ce44f0ceca","id":1727,"pasta":"[ง •̀_•́]ง CANCER ONLINE! [ง •̀_•́]ง","tags":"#cancer#hearthstone#forsen","favourites":1,"__v":0,"created_on":"2015-06-05T15:43:40.187Z","score":0},{"_id":"556c1ea85362236f199aa448","id":1707,"pasta":"Tyggbar says to Forsen, \"Sniffing my bed was kinda weird.\" Forsen laughs awkwardly, \"Haha, it was Twitch chat.\" Later as Tyggbar sleeps, Forsen removes her panties and spreads her buttcheeks and takes a deep whiff. \"Enjoy the scent?\" asks Trump. As Forsen recoils in horror, Trump smirks, \"It seems you've tiffed Snrump.\"","tags":"#hearthstone#Forsen#Tyggbar#Trump#TUCK#FRUMP","favourites":6,"__v":0,"created_on":"2015-05-31T17:39:55.729Z","score":0.00028520506168253887},{"_id":"556c1e7f5362236f199aa445","id":1704,"pasta":"(╭ರ_•́) Mr. Forsen we politely ask for you to have a sexual intercourse with the female in front of you for alas we will accuse you of prerecording the stream (╭ರ_•́).,","tags":"#forsen#tyggbar#hearthstone#twitch","favourites":12,"__v":0,"created_on":"2015-05-31T19:24:26.107Z","score":0.0005507842943892769},{"_id":"556a566a497ba3c6251a7503","id":1701,"pasta":"This spam is ruining my tournament experience I can't cope with all you children spamming. Can you please stop or else I will report the authorities","tags":"#hearthstone#viagame#spam#report#authorities","favourites":0,"__v":0,"created_on":"2015-05-30T14:58:05.177Z","score":0},{"_id":"556a565a497ba3c6251a7502","id":1700,"pasta":"In 2013 Athens received an encrypted call from the Greek Ministry of Foreign Affairs. Greek President Karolos Papoulias immediately deployed a team of skilled professionals to Great Britain the next day. Their objective was to infiltrate the British Esports and gain British fans, forcing the UK to stay in the European Union. On that day, the London Conspiracy was formed. ","tags":"#hearthstone#london#conspiracy","favourites":0,"__v":0,"created_on":"2015-05-30T13:02:16.475Z","score":0},{"_id":"5569240bba095caa758c0eff","id":1697,"pasta":"I was only 9 years old. I loved Trump so much, I had all the emotes and mod privileges. I watch Trump's stream every night before bed, thanking him for the value I've been given. \"Trump is value\" I say; \"Trump is life\". My dad hears me and calls me a faggot. I know he was just jealous of my devotion for Trump. I called him a FORSEN BOY. He slaps me and sends me to go to sleep. I'm crying now, and my face hurts. I lay in bed and there is very little value. Suddenly, value is moving towards me. It's Trump. I am so happy. He whispers into my ear \"This is my Value Town.\" He grabs me with his powerful asian brain and puts me down onto my hands and knees. I'm ready. I spread my ass-cheeks for Trump. He penetrates my butt-hole. It hurts so much but I do it for Trump. I can feel my butt tearing as my eyes start to water. I push against his value. I want to please Trump. He roars in a mighty roar as he fills my butt with his value. My dad walks in. Trump looks him straight in the eyes and says \"It's all value now.\" Frump tucks through my window. Frump is value. Frump is TSM player in australia.\n","tags":"#trump#tuck#frump#hearthstone#MrTricks#value","favourites":5,"__v":0,"created_on":"2015-05-29T21:08:49.884Z","score":0.00023039340440739954},{"_id":"556923e5ba095caa758c0efc","id":1694,"pasta":"I have a REQUEST: could you please stop saying \"RNG\"? There is no \"random number generator\" in any games. It's all PSEUDO-random number generator. So therefore it should be PNG or PRNG and not RNG. I am a mathematician, this is important to me, thank you. Using incorrect terms make you lose unprofessional and amateurish and make you lose credibility (and donations","tags":"#hearthstone#rng#twitch#speedrun#math","favourites":2,"__v":0,"created_on":"2015-05-28T16:39:23.915Z","score":0.00007132709393431465},{"_id":"5566b299dac4eb127bdadab2","id":1688,"pasta":"Breakdown of Kripp stream: ☑ always 1 hr late ☑ 20 minute intro ☑ bit sleepy today ☑ foodie time ☑ constant salt/complaining endless amounts of food ☑ 1 hr of actual gameplay ☑ ending stream early ☑ no stream tomorrow","tags":"#hearthstone#kripp#stream#breakdown#checkboxes","favourites":3,"__v":0,"created_on":"2015-05-28T05:43:15.041Z","score":0.00012625883918176943}]