[{"_id":"54bf2af73b0a330105ff5bab","id":344,"pasta":"n0tail u r fuckin perfect m8.\nyou're a flower. you're also a rainbow and a river. you are the manifestation of all perfection and i want to i don't fucking know. i want this to not sound gay, but you are fucking perfect, n0tail.\nty for listening","tags":"#dota2#n0tail#fucking#perfect#perfection","favourites":246,"__v":0,"created_on":"2015-01-21T04:27:41.355Z","score":0.0017739752928477546},{"_id":"550960b8b47c3d010fd965f7","id":1177,"pasta":"The Black Rat, Rattus Rattus, was first described by Henrik Ahnberg in his 18th century work “A Dong’s guide to Dota”. An elusive and hardy creature, the rat excels at damaging structures and retreating at the first sign of danger, only to begin its attack anew once the threat has passed. Unlike many of his peers, Ahnberg greatly respected the rat, finding many of its features similar to his own. His love for the rat became so great that he soon left the world of men and descended into the sewers to live among the rats, eventually becoming their king.","tags":"#dota2#admiralbulldog#rat#bulldong","favourites":126,"__v":0,"created_on":"2015-03-18T07:41:43.933Z","score":0.0013739739908308465},{"_id":"54bf3ace3b0a330105ff5bd2","id":358,"pasta":"As Artour stood in the school library, the dean approached him:\n\"Artour\" He said \"This is your last exam, if you fail this you're out, Babaevsky.\"\n As he turned his face slowly, with a grin as large as his GPM, he responded with \nsuch elegance:\"LMFAO wHo cAREAS HAHA Xd\" ","tags":"#dota2#rtz#arteezy#school#library#dean#gpm","favourites":175,"__v":0,"created_on":"2015-01-21T05:27:38.041Z","score":0.0013340971067508562},{"_id":"54b5f438f6a1885137f43cda","id":184,"pasta":"Arteezy sat in a dark room. The words \"Dire Victory\" filled up the screen. Not even Arteezy's shadow fiend could win this game. 3/8/7 378 GPM. Tears filled Arteezy's eyes as he carassed his hand of midas. The sound of hard core gangster rap and crying filled the room. The door creaks open and EE-sama enters the room. \"You lost Artour.\" \"You do know what happens when you lose.\" Arteezy removed his clothes, wearing only one of EE's anime wigs. EE removed his clothes, \"You lost 23 MM. Thats how many hours your punishment will be.\" Arteezy spent the next 23 hours being furiously fucked by his mentor. After the punishment the semen covered Arteezy arised. \"Thank you master, I can't wait to return the favor when you lose.\" Envy smiled. \"So will I Artour.\"","tags":"#dota2#arteezy#rtz#eternalenvy#ee#midas#fanfic","favourites":182,"__v":0,"created_on":"2015-01-14T04:41:41.443Z","score":0.0013332779722172354},{"_id":"54b2eb9ece7b585004706d97","id":17,"pasta":"Hello my name is Sing_sing and I am from the distant future. I am here to inform you, past Sing_sing that you must replace S4 on SECRET and travel with your new team to the TI5 EU Hub and play Mario Party for 2 weeks straight, if you fail to do this The Bankers will take over the world and it will descend into chaos. Thank you for listening to future Sing_sing. Please no pasta alfredo","tags":"#sing#singsing#dota2#secret","favourites":151,"__v":0,"created_on":"2015-01-11T21:24:27.532Z","score":0.0011278493391026297},{"_id":"54bf29182d74781f04a603c1","id":341,"pasta":"ʕ ͡•ᴥ ͡• ʔ(_̅_̅_̅FISSURE_̅_̲̅_̅_̅_̅()","tags":"#dota2#earthshaker#fissure#bear#bare","favourites":141,"__v":0,"created_on":"2015-01-21T04:15:00.449Z","score":0.0011127494938196576},{"_id":"54bf14322d74781f04a60379","id":311,"pasta":"Ｈｅｌｌｏ  Ｉ＇ｍ  Ｓｎｉｔｈ，  ｐｌａｙｉｎｇ  ｍｙ  ２０２１４３ｔｈ  ｇａｍｅ  ｏｎ  Ｃｈｅｎ．  Ｅｖｅｎ  ｔｈｏｕｇｈ  ｉｔ＇ｓ  ｔｈｅ  ｏｎｌｙ  ｈｅｒｏ  Ｉ  ｐｌａｙ  Ｉ  ｓｔｉｌｌ  ｓｕｃｋ  ａｔ  ｉｔ．  Ａｓ  ａ  ｃｏｍｐｅｎｓａｔｉｏｎ  ｆｏｒ  ｍｙ  ｌａｃｋ  ｏｆ  ｓｋｉｌｌ  Ｉ  ａｍ  ｇｏｉｎｇ  ｔｏ  ｂｕｙ  ａｌｌ  ｓｕｐｐｏｒｔ  ｉｔｅｍｓ  ａｎｄ  ｇａｎｋ  ｍｉｄ  ａｔ  ｌｖｌ  ２  ａｎｄ  ｆａｉｌ．  Ｔｈａｎｋｓ  ｆｏｒ  ｌｉｓｔｅｎｉｎｇ","tags":"#dota2#hello#snith#chen#only#hero#suck","favourites":135,"__v":0,"created_on":"2015-01-21T02:44:07.591Z","score":0.0010725374807900076},{"_id":"54e02a0026efea8810640220","id":794,"pasta":" ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ༼ຈ ل͜ຈ༽ﾉ•︻̷┻̿═━一 ｈｏｈｏ　ｈａｈａ　ｓｈｒａｐｎｅｌヽ༼ຈل͜ຈ༽ﾉ•︻̷┻̿═━一 ヽ｀ヽ｀、ヽヽ｀ヽ｀、｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ、ヽヽ｀ヽ","tags":"#dota2#shrapnel#sniper","favourites":107,"__v":0,"created_on":"2015-02-15T05:02:49.424Z","score":0.0010020230857432125},{"_id":"54bf066ebd6b1a11037e7c98","id":300,"pasta":"\"Sheever, ravage!\" Singsing shouts, infuriated at yet another of Sheever's antics. Sheever upon hearing this retreats to her room, tears streaming down her cheeks.Singsing doesn't notice until hours later, after losing to pubs for the third time in a row and switching off his stream.He finds Sheever in a ball on her bed, tear marks on the sheets and her eyes red and swollen. \"What's wrong, Sheever-chan?\" Singsing asks.\"You.. you yelled at me!\"","tags":"#dota2#singsing#sheever#fanfic","favourites":118,"__v":0,"created_on":"2015-01-21T01:50:16.708Z","score":0.0009577122260523581},{"_id":"54bf32603b0a330105ff5bc2","id":353,"pasta":"ʜᴇʟʟᴏ ʙᴜʟʟᴅᴏɢᴇ I ᴀᴍ ғᴀᴍᴏᴜs ᴘᴏʀɴ ᴅɪʀᴇᴄᴛᴏʀ, ᴛᴏɴʏ ᴘᴀsᴛᴇʀɪɴᴏ. ᴡᴇ ᴡᴏᴜʟᴅ ʟɪᴋᴇ ʏᴏᴜ ᴀɴᴅ sʜᴇᴇᴠᴇʀ ᴛᴏ ᴘᴀʀᴛɪᴄɪᴘᴀᴛᴇ ɪɴ ᴏᴜʀ ɴᴇᴡ ᴠɪᴅᴇᴏ \" ʜᴏᴏᴋɪɴ' ɴ ᴊᴜᴋᴇɪɴ' \" sʜᴇᴇᴠᴇʀ ᴡᴏᴜʟᴅ ʙᴇ ᴡɪɴᴅʀᴜɴɴᴇʀ ᴀɴᴅ ʏᴏᴜ sᴀʏ ɴᴏ ᴊᴜᴋᴇʀɪɴᴏ ᴀɴᴅ ʙᴀᴄᴋᴅᴏᴏʀ ʜᴇʀ.","tags":"#dota2#admiralbulldog#porn#sheever#jukerino#backdoor","favourites":108,"__v":0,"created_on":"2015-01-21T04:42:26.764Z","score":0.0008895092170298091},{"_id":"54b5f43df6a1885137f43cdb","id":185,"pasta":"Albert Einstein, one of the greatest minds to ever live, was once perplexed by the speed at which Arteezy was able to farm. Seemingly impossible GPMs of 800+ every game were consistently observed, leading to the hypothesis that this was no fluke. Einstein spent the last years of his life trying to prove the ability of Arteezy's farm existed within the laws of science. Critics laughed at his efforts, claiming that Arteezy's farm was an undeniable act of divine intervention. It wasn't until the end when Einstein found the answer. On his deathbed, Einstein spent the last seconds of his life jotting down what is now the world's most infamous scientific formula. r=tz²","tags":"#rtz#einstein#arteezy#dota2#gpm#farm","favourites":107,"__v":0,"created_on":"2015-01-14T04:42:15.444Z","score":0.0008536455530398628},{"_id":"54d7c1544cdf1142657fb74e","id":735,"pasta":"Arteezy gets first blood on Suma1L mid and he says, \"That's how you do it, son.\" Then Universe comes down the lane, hand in hand with his princess, Aui_2000, and proclaims, \"Don't you talk to my nephew that way.\" But then Fear rolls down midlane in his wheelchair -- old man, Father Fear -- looks directly into Arteezy, his son's eyes and softly says, \"Where am I?\"","tags":"#dota2#sumail#eg#rtz#arteezy#first#blood","favourites":90,"__v":0,"created_on":"2015-02-08T19:17:32.926Z","score":0.0008374409537065346},{"_id":"5514dfeeb79c00ce446ab073","id":1337,"pasta":"﻿ＳＩＮＧＳＩＮＧ，  ＨＯＷ  ＤＯ  ＹＯＵ  ＰＬＡＹ  ＭＥＥＰＯ？  ＤＯ  ＹＯＵ  ＭＡＸ  ＰＯＯＦ，  ＬＩＫＥ  ＹＯＵ  ＰＯＯＦＥＤ  ＯＵＴ  ＯＦ  ＲＥＬＥＶＡＮＣＥ？  ＯＲ  ＤＯ  ＹＯＵ  ＭＡＸ  ＮＥＴ，  ＬＩＫＥ  ＹＯＵ  ＮＥＴＴＥＤ  ＺＥＲＯ  ＬＡＮ  ＷＩＮＳ  ＩＮ  ２０１５？  ＭＹ  ＦＡＶＯＲＩＴＥ  ＢＵＩＬＤ  ＩＳ  ＭＡＸＩＮＧ  ＧＥＯＳＴＲＩＫＥ，  ＬＩＫＥ ＹＯＵ  ＳＴＲＵＣＫ  ＲＯＣＫ  ＢＯＴＴＯＭ．  ＰＬＥＡＳＥ  ＡＮＳＷＥＲ","tags":"#dota2#singsing#meepo#build","favourites":64,"__v":0,"created_on":"2015-03-27T03:40:30.309Z","score":0.0008206572587409135},{"_id":"54fa6ecc87d1bc685b1e9640","id":998,"pasta":" @ppdDota ＹＯＵ　ＦＵＣＫＩＮＧ　ＮＥＲＤ　．．：　Ｕ　ＷＩＬＬ　ＮＥＶＥＲ　ＭＡＫＥ　ＳＥＸ　ＩＮ　ＵＲ　ＬＩＦＥ　．．：　ＷＨＩＬＥ　ＩＮ　ＢＲＡＺＩＬ　Ｉ　ＨＡＶＥ　ＳＥＸ　３０　ＴＩＭＥＳ　ＥＡＣＨ　ＤＡＹ　ＡＴ　ＣＡＲＮＡＶＡＬ","tags":"#dota2#ppd#nerd#carnaval#make#sex","favourites":73,"__v":0,"created_on":"2015-03-07T01:15:00.583Z","score":0.0008109474342819799},{"_id":"54b5fc11f6a1885137f43cf2","id":195,"pasta":"EE. I will be your bodygaurd at any major lan you attend. In fact I will protect all of C9. Seriously. I am a former pro fighter(undefeated) and I will happily punch Arise really hard for you. I just require transportation and Dota coaching. Pls no copy pastarino","tags":"#dota2#ee#eternalenvy#bodyguard#arise","favourites":90,"__v":0,"created_on":"2015-01-14T05:17:29.918Z","score":0.0007380134978281667}]