[{"_id":"55cfb0d4f8c3a69c48797ceb","id":2011,"pasta":" ▓▓▓▓▓▓▓▓▓▓▄ ░░▄▀▓▓▓▓▓▓SINGX2▓▓▓▓▓▓▀ ▄▀▓▓▓▓▓▓▄▓▓▓▓▓▓▓▄▓▓▓▓▓ ▓▓▓▓▓▓▄▄▀▄▄▌▓▐▄▄▀▄▄▓▓▓ ▓▓▓▓▄▀░░░░░▌▓▐░░░░░▀▄▓ ▓▓▄▀░░░▄▄▄▄▌▓▐▄▄▄▄░░░▀ ▄▀░░▐▄▀▀▒▒▒▀▄▀▒▒▒▀▀▄▌░ █░░░█▌▒▒▒▒▒▒▒▒▒▒▒▒▒▐█░ █░░█▀▌▒▒▒SHEEVER▒▒▒▐▀█ ▌▄▀▒▄▀▄▒▒▒▒▒▒▒▒▒▒▒▄▀▄▒ ▐▒▒▐░░░▀▌▒▒▒▌▒▒▒▐▀░░░▌ █▒▒▀▄░░░▌▒▒▒▒▒▄██▄░░▄▀ ░▀▄▒▒▀▄░▌▒▒▒▄▀▄▒▀██▀▒▒ ░░░▀▄▒▒▀▒▒▒▐▒▒▒▒▄▒██▄▀ ░░░░░▀▄▄▄▄▄▐▒▄█▒▒▄▀▀░░","tags":"#dota2#ASCII#fuck#dick","favourites":3,"__v":0,"created_on":"2015-08-15T21:36:20.336Z","score":0.0027822886633768495},{"_id":"54b5dbdf70c589513562570e","id":173,"pasta":"He's a good player, a bit overated in my opinion. But defenitely okay to be in a top team! To say that he is one of the best solo mids etc is really exageration, he played like 10 games in a high level LAN, you need way more to compare him to Dendi, s4 or FATA","tags":"#dota2#rtz#7ckingmad#overrated#arteezy","favourites":325,"__v":0,"created_on":"2015-01-14T02:52:29.786Z","score":0.0027296152808760537},{"_id":"552f79f808a10d48190510c9","id":1469,"pasta":"You pick Lycan. You tell your team that you will jungle. You tell your team that you will never fight with them. You tell your team that you will split push. You do this in a nice way because you are Lycan picker and you want to win. You buy stout, quelling, tangoes in that exact order. You go jungle. You get: level 7, 4-0-2-1 skill build. You have: vlads, quelling, stout, smoke. You smoke and take rosh before 10 minutes. You time that motherfucker. You buy brown boots. You go push a lane or take ancients if there is no safe lane to push. You repeat until game is won. You never fight with your team ever. You never fight without your team ever. Wolves need no armour. Why do wolves need no armour you may ask? Wolves need no armour because wolves never fight; wolves split push. This is why wolves need no armour. Your team dying 4 mid? You do not fight with them. You do not teleport to them. You do not flame them. You are Lycan and you want to win. You have teleportation scrolls but you use them to get to lanes as far away from danger as possible and push. You tell your team to fight under tower. You tell your team not to come to your lane. You do this in a nice way because even though wolves need no armour wolves want to win games. If you are getting ganked (you should be looking at the mini map and not be in a situation where you’re getting ganked) but if you are getting ganked you know what to do: you listen to Lycan and Lycan tells you what? That’s right you sonofabitch: Lycan tells you that \"the wolf runs\". You pop that ultimate, you back off and you TP out. You push another lane or you farm jungle/farm ancients/smoke roshan. If you don't know what to do then what do you do? That's right; you listen to Lycan again and Lycan tells you that \"the wolf runs\" and that \"wolves need no armour\". This does not mean \"the wolf fights\"; it means that the wolf go split push. You are on a lane preferably furthest away from danger. You are in the jungle or at the ancients farming. You are at roshan getting that aegis timing that shit. You get necro 1, 2, 3. You upgrade your brown boots into boots of travel. You do it in this exact order. You keep that split push going. You smoke rosh whenever he's up. You keep telling your team not to be with you or come to your lanes. You are Lycan. You are nice about it. You are split push. You are objectives. You are win. You remember that \"wolves love to battle\" against structures because then wolves will need no armour and wolves can run in circles around the structures. You never fight. You end the game with 0-0-0 and the highest building damage ever conceived by man.","tags":"#DotA2#lycan#jungle","favourites":142,"__v":0,"created_on":"2015-04-16T04:21:23.687Z","score":0.0026749794819836224},{"_id":"55b193e089b52e986e2b40de","id":1913,"pasta":"I sexually identify as a terrorblade hellion. Ever since I was a boy I dreamed of metamorphosizeing into a giant raging demon and melting the faces of my opponents off with my unimaginable power. People say to me that a person being a demon is impossible and I’m fucking retarded but I don’t care, I’m majestic. I'm having a plastic surgeon install terrifying wings, huge mythical quality blades and long pointy horns on my body. From now on I want you to call me \"the Demon Marauder\" and respect my right to farm creeps endlessly and sunder my opponents with a 0.35 seconds cast time. If you cannot accept me and my many reflections of my soul you're a terrorphobe and need to check your champion privilege. Thank you for being so understanding.","tags":"#Dota2#sexually#identify#terrorblade#hellion","favourites":20,"__v":0,"created_on":"2015-07-19T03:30:19.379Z","score":0.002564567105469594},{"_id":"55cee1492698f7be3d0ad886","id":2001,"pasta":"(ง •̀_•́)ง SECRET GIVE ME MY ENERGY BACK (ง •̀_•́)ง","tags":"#dota2#secret#ti5#energy","favourites":3,"__v":0,"created_on":"2015-08-15T06:50:49.604Z","score":0.0025156742225865662},{"_id":"55cee13a2698f7be3d0ad883","id":1998,"pasta":"Haiiiiiii! ^____^ It's your kawaii Queen of Pain-chan desu-ne!!! (◕‿◕✿) I've been picked sooo many times at TI5 KYAAAAA!! >‿< my voice is sore, but that's fine because I'm the kind of girl who likes to get hurt! Can't wait to see you next game!!!","tags":"#dota2#queenofpain#ti5#theinternational","favourites":3,"__v":0,"created_on":"2015-08-15T06:50:34.623Z","score":0.0025156055744258374},{"_id":"5542bae2107beab4641ec2e7","id":1555,"pasta":"I sexually Identify as an Enchanted Mango. Ever since I was a boy I dreamed of growing over the farmfield regenerating +1 hp on cute grills like Sing. People say to me that a person being a mango is Impossible and I’m fucking retarded but I don’t care, I’m beautiful. I’m having a plastic surgeon install leaves, 150 mana and +1 hp regen on my body. From now on I want you guys to call me “Lord Mango” and respect my right to kill from above and kill needlessly. If you can’t accept me you’re a mongolphobe and need to check your mango privilege. Thank you for being so understanding ","tags":"#dota2#6.84#mangos#sexually#identify","favourites":107,"__v":0,"created_on":"2015-04-30T22:26:18.204Z","score":0.0024545246958257642},{"_id":"550960b8b47c3d010fd965f7","id":1177,"pasta":"The Black Rat, Rattus Rattus, was first described by Henrik Ahnberg in his 18th century work “A Dong’s guide to Dota”. An elusive and hardy creature, the rat excels at damaging structures and retreating at the first sign of danger, only to begin its attack anew once the threat has passed. Unlike many of his peers, Ahnberg greatly respected the rat, finding many of its features similar to his own. His love for the rat became so great that he soon left the world of men and descended into the sewers to live among the rats, eventually becoming their king.","tags":"#dota2#admiralbulldog#rat#bulldong","favourites":160,"__v":0,"created_on":"2015-03-18T07:41:43.933Z","score":0.0022973737027983444},{"_id":"554bccab525664a17d1581d2","id":1597,"pasta":"Yᴏᴜ ᴀʀᴇ ᴘʟᴀʏɪɴɢ ᴀɢᴀɪɴsᴛ Aʟʟɪᴀɴᴄᴇ. Yᴏᴜ ᴅᴏ ɴᴏᴛ ʙᴀɴ Fᴜʀɪᴏɴ ʙᴇᴄᴀᴜsᴇ ʏᴏᴜ ᴄᴀɴ ᴄᴏᴜɴᴛᴇʀ ɪᴛ. Aʟʟɪᴀɴᴄᴇ ɪɴsᴛᴀɴᴛʟʏ ᴘɪᴄᴋs Fᴜʀɪᴏɴ. Yᴏᴜ ʟᴏsᴇ ᴀɢᴀɪɴsᴛ Aʟʟɪᴀɴᴄᴇ. Yᴏᴜ ʙᴀɴ Fᴜʀɪᴏɴ ɴᴇxᴛ ᴛɪᴍᴇ ʏᴏᴜ ᴘʟᴀʏ ᴀɢᴀɪɴsᴛ Aʟʟɪᴀɴᴄᴇ ʙᴇᴄᴀᴜsᴇ ʏᴏᴜ'ʀᴇ ɴᴏᴛ sᴛᴜᴘɪᴅ.","tags":"#dota2#alliance#bulldog#furion","favourites":88,"__v":0,"created_on":"2015-05-07T19:27:46.555Z","score":0.0022498937750955778},{"_id":"54bf3ace3b0a330105ff5bd2","id":358,"pasta":"As Artour stood in the school library, the dean approached him:\n\"Artour\" He said \"This is your last exam, if you fail this you're out, Babaevsky.\"\n As he turned his face slowly, with a grin as large as his GPM, he responded with \nsuch elegance:\"LMFAO wHo cAREAS HAHA Xd\" ","tags":"#dota2#rtz#arteezy#school#library#dean#gpm","favourites":243,"__v":0,"created_on":"2015-01-21T05:27:38.041Z","score":0.002229621231064622},{"_id":"54bf29182d74781f04a603c1","id":341,"pasta":"ʕ ͡•ᴥ ͡• ʔ(_̅_̅_̅FISSURE_̅_̲̅_̅_̅_̅()","tags":"#dota2#earthshaker#fissure#bear#bare","favourites":222,"__v":0,"created_on":"2015-01-21T04:15:00.449Z","score":0.0020665722215462627},{"_id":"54b5f438f6a1885137f43cda","id":184,"pasta":"Arteezy sat in a dark room. The words \"Dire Victory\" filled up the screen. Not even Arteezy's shadow fiend could win this game. 3/8/7 378 GPM. Tears filled Arteezy's eyes as he carassed his hand of midas. The sound of hard core gangster rap and crying filled the room. The door creaks open and EE-sama enters the room. \"You lost Artour.\" \"You do know what happens when you lose.\" Arteezy removed his clothes, wearing only one of EE's anime wigs. EE removed his clothes, \"You lost 23 MM. Thats how many hours your punishment will be.\" Arteezy spent the next 23 hours being furiously fucked by his mentor. After the punishment the semen covered Arteezy arised. \"Thank you master, I can't wait to return the favor when you lose.\" Envy smiled. \"So will I Artour.\"","tags":"#dota2#arteezy#rtz#eternalenvy#ee#midas#fanfic","favourites":229,"__v":0,"created_on":"2015-01-14T04:41:41.443Z","score":0.0020375698901649035},{"_id":"55a84a314587967e7ca6a8a7","id":1892,"pasta":"Feeder, Rage Quitter, Trash Talker, Noob. Long ago, the four groups played together in ‘harmony’. Then, the low priority started. Only the Peenoise, master of all four, deserved getting reported, but when Peenoise became too cancerous, tsunami made them vanished. A hundred years passed, my friends and I discovered the Peenoise in SEA server. Although they are just fucking around in this server, I believe they can spread their ‘putang ina mo’ around the whole world.","tags":"#dota2#pinoy#avatar","favourites":16,"__v":0,"created_on":"2015-07-16T15:06:23.156Z","score":0.0019313111630912003},{"_id":"55bd5fd3f300bfdf5990c0df","id":1948,"pasta":"Artour Babaev BabyRage , the first of his name, slayer of Sumail, King of the Creeps, heir to the throne of Midas, protector of S4, Lord of the B O Y S, brother to EE-Sama, disciple of FEAR, BabyRage the Unrekt, Father of the Plebs.","tags":"#dota2#GoT#RTZ#Arteezy","favourites":7,"__v":0,"created_on":"2015-08-02T00:09:55.903Z","score":0.0018396833661116897},{"_id":"54bf14322d74781f04a60379","id":311,"pasta":"Ｈｅｌｌｏ  Ｉ＇ｍ  Ｓｎｉｔｈ，  ｐｌａｙｉｎｇ  ｍｙ  ２０２１４３ｔｈ  ｇａｍｅ  ｏｎ  Ｃｈｅｎ．  Ｅｖｅｎ  ｔｈｏｕｇｈ  ｉｔ＇ｓ  ｔｈｅ  ｏｎｌｙ  ｈｅｒｏ  Ｉ  ｐｌａｙ  Ｉ  ｓｔｉｌｌ  ｓｕｃｋ  ａｔ  ｉｔ．  Ａｓ  ａ  ｃｏｍｐｅｎｓａｔｉｏｎ  ｆｏｒ  ｍｙ  ｌａｃｋ  ｏｆ  ｓｋｉｌｌ  Ｉ  ａｍ  ｇｏｉｎｇ  ｔｏ  ｂｕｙ  ａｌｌ  ｓｕｐｐｏｒｔ  ｉｔｅｍｓ  ａｎｄ  ｇａｎｋ  ｍｉｄ  ａｔ  ｌｖｌ  ２  ａｎｄ  ｆａｉｌ．  Ｔｈａｎｋｓ  ｆｏｒ  ｌｉｓｔｅｎｉｎｇ","tags":"#dota2#hello#snith#chen#only#hero#suck","favourites":189,"__v":0,"created_on":"2015-01-21T02:44:07.591Z","score":0.001805351877455017}]