[{"_id":"550960b8b47c3d010fd965f7","id":1177,"pasta":"The Black Rat, Rattus Rattus, was first described by Henrik Ahnberg in his 18th century work “A Dong’s guide to Dota”. An elusive and hardy creature, the rat excels at damaging structures and retreating at the first sign of danger, only to begin its attack anew once the threat has passed. Unlike many of his peers, Ahnberg greatly respected the rat, finding many of its features similar to his own. His love for the rat became so great that he soon left the world of men and descended into the sewers to live among the rats, eventually becoming their king.","tags":"#dota2#admiralbulldog#rat#bulldong","favourites":176,"__v":0,"created_on":"2015-03-18T07:41:43.933Z","score":0.0006219820730721688},{"_id":"54e02a0026efea8810640220","id":794,"pasta":" ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ༼ຈ ل͜ຈ༽ﾉ•︻̷┻̿═━一 ｈｏｈｏ　ｈａｈａ　ｓｈｒａｐｎｅｌヽ༼ຈل͜ຈ༽ﾉ•︻̷┻̿═━一 ヽ｀ヽ｀、ヽヽ｀ヽ｀、｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ、ヽヽ｀ヽ","tags":"#dota2#shrapnel#sniper","favourites":183,"__v":0,"created_on":"2015-02-15T05:02:49.424Z","score":0.0005940123804509996},{"_id":"55a84a4f4587967e7ca6a8a8","id":1893,"pasta":"Ｉ　ｏｎｃｅ　ｄｒａｎｋ　ａｎ　ｅｎｔｉｒｅ　ｂｏｔｔｌｅ　ｏｆ　ｓｏｙ　ｓａｕｃｅ　ｏｎ　ａ　ｄａｒｅ，　ｗｈｉｃｈ　Ｉ　ｔｈｏｕｇｈｔ　ｗａｓ　ａｌｌ　ｗｅｌｌ　ａｎｄ　ｇｏｏｄ．．．　ｕｎｔｉｌ　Ｉ　ｄｅｖｅｌｏｐｅｄ　ｅｘｔｒｅｍｅ　ｄｅｈｙｄｒａｔｉｏｎ　ａｎｄ　Ｈｙｐｅｒｎａｔｒｅｍｉａ　（ｈｔｔｐ：／／ｅｎ．ｗｉｋｉｐｅｄｉａ．ｏｒｇ／ｗｉｋｉ／Ｈｙｐｅｒｎａｔｒｅｍｉａ）．　Ｔｈｅｙ　ｈａｄ　ｔｏ　ｐｕｔ　ａｎ　ｉｖ　ｄｉｒｅｃｔｌｙ　ｉｎｔｏ　ｍｙ　ｖｅｉｎｓ　ｔｏ　ｒｅｈｙｄｒａｔｅ　ｍｅ．　Ｉｔ　ｗａｓ　ｔｈｅ　ｃｌｏｓｅｓｔ　Ｉ’ｖｅ　ｅｖｅｒ　ｂｅｅｎ　ｔｏ　ｄｙｉｎｇ．　Ｗｈａｔ　Ｉ’ｍ　ｇｅｔｔｉｎｇ　ａｔ　ｉｓ，　ｅｖｅｎ　ｔｈａｔ　ｗａｓ　ｎｏｔ　ｎｅａｒｌｙ　ａｓ　ｓａｌｔｙ　ａｓ　ｙｏｕ　ａｒｅ　ｒｉｇｈｔ　ｎｏｗ．\n","tags":"#dota2#soy#sauce#salt#ppd","favourites":105,"__v":0,"created_on":"2015-07-16T19:13:21.908Z","score":0.0005791714036079853},{"_id":"574a34c4709549ef048c4ba5","id":2798,"pasta":"EternalEnvy stood back and looked at his work. Everything had been prepared; the ritual could now commence. He closed his eyes and made a quick prayer to Gaben.\n\"Through this sacrifice, may I prove worthy to receive that which I would most desire.\"\nHis eyes opened. It would be a great sacrifice indeed; but it would be worth it. OSFrog knew he had enough excesses to cover it. Terrorblade will receive an immortal in treasure 2, he promised himself. I have paid the price. He eyed the pentagram, a small urn sitting in the centre of it.\nWith that, he began the ritual, smoothly sliding down his pants and whipping out his stiffy, pre-lubed and harder than a level 16 Tiny. He intoned a demonic chant as he jerked his chodelike Chinese meat, slowly at first but growing faster with each stroke. He aimed the tip at the urn and moved his free hand over to his computer. His mouse moved quickly; he opened the recycle tab, tossing in items. The Marauder's Reflection set disappeared first, followed by the Eternal Purgatory. The remaining Terrorblade items formed a pentagram, the arcana at the centre. A humming noise filled the air, volume intensifying. As the screen started to glow a dark crimson, Jacky Mao came with the force of a thousand suns, and his hot load audibly splashed into the urn. A deep, throaty chuckle issued from his speakers, and everything went dark.\nWhen EE came to, the urn had disappeared, and a note was left in its place. He dashed over, tripping over his pants that were still down around his spindly ankles, and his eyes drank in the text.\nShriek when you see me.\nEternalEnvy sat down, and started giggling. His giggling grew louder, more maniacal, until the neighbours knocked on the door to complain, but he didn't care. He had won.\n\"NOW who's meta, bitches?\" he cackled.","tags":"#dota2#EE#EternalEnvy#Terrorblade#immortal#JackyMao","favourites":5,"__v":0,"created_on":"2016-05-29T00:16:04.472Z","score":0.0005747078180227426},{"_id":"54d7c1544cdf1142657fb74e","id":735,"pasta":"Arteezy gets first blood on Suma1L mid and he says, \"That's how you do it, son.\" Then Universe comes down the lane, hand in hand with his princess, Aui_2000, and proclaims, \"Don't you talk to my nephew that way.\" But then Fear rolls down midlane in his wheelchair -- old man, Father Fear -- looks directly into Arteezy, his son's eyes and softly says, \"Where am I?\"","tags":"#dota2#sumail#eg#rtz#arteezy#first#blood","favourites":172,"__v":0,"created_on":"2015-02-08T19:17:32.926Z","score":0.0005552062116604094},{"_id":"56f83b6d709549ef048c4946","id":2616,"pasta":" PuppeyFace it's a dirty game PuppeyFace it's a dirty world PuppeyFace i kicked w33ha like a pregnant girl PuppeyFace I stole RTC and Universe to get that paper PuppeyFace when it comes to screwing peter i got a major PuppeyFace","tags":"#dota#dota2#puppey#secret#rtz#w33#kick","favourites":16,"__v":0,"created_on":"2016-03-27T19:58:37.725Z","score":0.0005462811268602463},{"_id":"5542bae2107beab4641ec2e7","id":1555,"pasta":"I sexually Identify as an Enchanted Mango. Ever since I was a boy I dreamed of growing over the farmfield regenerating +1 hp on cute grills like Sing. People say to me that a person being a mango is Impossible and I’m fucking retarded but I don’t care, I’m beautiful. I’m having a plastic surgeon install leaves, 150 mana and +1 hp regen on my body. From now on I want you guys to call me “Lord Mango” and respect my right to kill from above and kill needlessly. If you can’t accept me you’re a mongolphobe and need to check your mango privilege. Thank you for being so understanding ","tags":"#dota2#6.84#mangos#sexually#identify","favourites":130,"__v":0,"created_on":"2015-04-30T22:26:18.204Z","score":0.0005435722425931713},{"_id":"54b2eb9ece7b585004706d97","id":17,"pasta":"Hello my name is Sing_sing and I am from the distant future. I am here to inform you, past Sing_sing that you must replace S4 on SECRET and travel with your new team to the TI5 EU Hub and play Mario Party for 2 weeks straight, if you fail to do this The Bankers will take over the world and it will descend into chaos. Thank you for listening to future Sing_sing. Please no pasta alfredo","tags":"#sing#singsing#dota2#secret","favourites":175,"__v":0,"created_on":"2015-01-11T21:24:27.532Z","score":0.0005274307260073129},{"_id":"554bccab525664a17d1581d2","id":1597,"pasta":"Yᴏᴜ ᴀʀᴇ ᴘʟᴀʏɪɴɢ ᴀɢᴀɪɴsᴛ Aʟʟɪᴀɴᴄᴇ. Yᴏᴜ ᴅᴏ ɴᴏᴛ ʙᴀɴ Fᴜʀɪᴏɴ ʙᴇᴄᴀᴜsᴇ ʏᴏᴜ ᴄᴀɴ ᴄᴏᴜɴᴛᴇʀ ɪᴛ. Aʟʟɪᴀɴᴄᴇ ɪɴsᴛᴀɴᴛʟʏ ᴘɪᴄᴋs Fᴜʀɪᴏɴ. Yᴏᴜ ʟᴏsᴇ ᴀɢᴀɪɴsᴛ Aʟʟɪᴀɴᴄᴇ. Yᴏᴜ ʙᴀɴ Fᴜʀɪᴏɴ ɴᴇxᴛ ᴛɪᴍᴇ ʏᴏᴜ ᴘʟᴀʏ ᴀɢᴀɪɴsᴛ Aʟʟɪᴀɴᴄᴇ ʙᴇᴄᴀᴜsᴇ ʏᴏᴜ'ʀᴇ ɴᴏᴛ sᴛᴜᴘɪᴅ.","tags":"#dota2#alliance#bulldog#furion","favourites":118,"__v":0,"created_on":"2015-05-07T19:27:46.555Z","score":0.0005111722648444494},{"_id":"56ea32a9709549ef048c48d7","id":2563,"pasta":"He is faster ᕙ DansGame ╱ He is stronger ᕙ DansGame ╱ Who is he ᕙ DansGame ╱ The mighty DONGER ᕙ DansGame ╱","tags":"#dota#dota2#admiral#bulldog#donger#bulldong","favourites":16,"__v":0,"created_on":"2016-03-17T04:29:29.652Z","score":0.0004832256136816797},{"_id":"54b5f43df6a1885137f43cdb","id":185,"pasta":"Albert Einstein, one of the greatest minds to ever live, was once perplexed by the speed at which Arteezy was able to farm. Seemingly impossible GPMs of 800+ every game were consistently observed, leading to the hypothesis that this was no fluke. Einstein spent the last years of his life trying to prove the ability of Arteezy's farm existed within the laws of science. Critics laughed at his efforts, claiming that Arteezy's farm was an undeniable act of divine intervention. It wasn't until the end when Einstein found the answer. On his deathbed, Einstein spent the last seconds of his life jotting down what is now the world's most infamous scientific formula. r=tz²","tags":"#rtz#einstein#arteezy#dota2#gpm#farm","favourites":155,"__v":0,"created_on":"2015-01-14T04:42:15.444Z","score":0.0004789368658458048},{"_id":"54bf32603b0a330105ff5bc2","id":353,"pasta":"ʜᴇʟʟᴏ ʙᴜʟʟᴅᴏɢᴇ I ᴀᴍ ғᴀᴍᴏᴜs ᴘᴏʀɴ ᴅɪʀᴇᴄᴛᴏʀ, ᴛᴏɴʏ ᴘᴀsᴛᴇʀɪɴᴏ. ᴡᴇ ᴡᴏᴜʟᴅ ʟɪᴋᴇ ʏᴏᴜ ᴀɴᴅ sʜᴇᴇᴠᴇʀ ᴛᴏ ᴘᴀʀᴛɪᴄɪᴘᴀᴛᴇ ɪɴ ᴏᴜʀ ɴᴇᴡ ᴠɪᴅᴇᴏ \" ʜᴏᴏᴋɪɴ' ɴ ᴊᴜᴋᴇɪɴ' \" sʜᴇᴇᴠᴇʀ ᴡᴏᴜʟᴅ ʙᴇ ᴡɪɴᴅʀᴜɴɴᴇʀ ᴀɴᴅ ʏᴏᴜ sᴀʏ ɴᴏ ᴊᴜᴋᴇʀɪɴᴏ ᴀɴᴅ ʙᴀᴄᴋᴅᴏᴏʀ ʜᴇʀ.","tags":"#dota2#admiralbulldog#porn#sheever#jukerino#backdoor","favourites":151,"__v":0,"created_on":"2015-01-21T04:42:26.764Z","score":0.0004762249409219624},{"_id":"5514dfeeb79c00ce446ab073","id":1337,"pasta":"﻿ＳＩＮＧＳＩＮＧ，  ＨＯＷ  ＤＯ  ＹＯＵ  ＰＬＡＹ  ＭＥＥＰＯ？  ＤＯ  ＹＯＵ  ＭＡＸ  ＰＯＯＦ，  ＬＩＫＥ  ＹＯＵ  ＰＯＯＦＥＤ  ＯＵＴ  ＯＦ  ＲＥＬＥＶＡＮＣＥ？  ＯＲ  ＤＯ  ＹＯＵ  ＭＡＸ  ＮＥＴ，  ＬＩＫＥ  ＹＯＵ  ＮＥＴＴＥＤ  ＺＥＲＯ  ＬＡＮ  ＷＩＮＳ  ＩＮ  ２０１５？  ＭＹ  ＦＡＶＯＲＩＴＥ  ＢＵＩＬＤ  ＩＳ  ＭＡＸＩＮＧ  ＧＥＯＳＴＲＩＫＥ，  ＬＩＫＥ ＹＯＵ  ＳＴＲＵＣＫ  ＲＯＣＫ  ＢＯＴＴＯＭ．  ＰＬＥＡＳＥ  ＡＮＳＷＥＲ","tags":"#dota2#singsing#meepo#build","favourites":122,"__v":0,"created_on":"2015-03-27T03:40:30.309Z","score":0.0004681041837958033},{"_id":"55cc12292ccec12862a3e7b5","id":1984,"pasta":"ti5 finals. Evil Genius vs Team Secret; Game Five\nAmazingly, Evil genius has managed to turn it around, and scrounge up two victories despite the first two games of the grand finals being devastating losses. Arteezy’s Max Backstab Riki build simply proved too strong for Evil Geniuses. Thankfully, while PPD was rushed to the medical tent to be treated for Salt poisoning Fear took his seat and banned it, but to complicate things further, Ice Frog, hallow be his name, took Suma1l’s advice from DACC at the start of the series, patching him out of reality, and into the game, where he became the new Storm Spirit. Fortuanatly, Gabe Newell’s son, Mason was on hand to take his place.\nEG thought they might actually be able to beat Secret in the final game, as S4 didn’t ban Suma1l Spirit, because he is cool. However, Secret finally breaks out their last pocket start, drafting Arteezy safelane farm techies. He builds midas first, followed by five more midases. Evil Geniuses were not expecting this, and are unable to counter it.Icefrog would later be quoted as saying “對不起，我真的很喜歡這個小怪物作為英雄”\nFinally, after three long hours, the game finally enters the mid game. Evil Geniuses, on radiant has been pushed back into their fountain, their ancient is exposed, Secret could end the game at any time, instead, they choose to fountain camp, killing Evil Geniuses over and over again. Finally, they drag Fear out, kicking and screaming, and bring him to Arteezy.\nFear’s life support system has begun to fail irl, both of his arms have snapped, yet he somehow managed to escape his base and take Dire’s top lane tier one, the first tower they have lost all game. Secret pledges to make an example of him.Arteezy must deal the final blow, to prove his loyalty to Secret, who have just revealed they are sponsored by Isis and the Illuminati.\nArteezy draws his midas, and prepares to deal the final blow, he fights back tears as he prepares to do what he knows he must. “Artour…” Fear finally says. “You were the last hope of NA dota.” Then fear dies irl and in game. there is no respawn timer. The audience falls silent, everyone can clearly hear the maniacal laughter of Team Secret. Finally, after several minutes, Zai stops laughing long enough to ask Arteezy why he is crying. “He was just some old man,” he reminds him.\nNo one is able to hear Arteezy’s response over the laughter. “He wasn’t just ‘some old man.’ He was my father.” The caliber of his sins are too much and as a final act of repentance, he screams “SUICIDE SQUAD, ATTACK!” and uses the bombs gifted to him by his sponsors to destroy himself, and take out the rest of his team. Sensing a chance to win, the Mason/Suma1l Archon blast out of their base, zip zopping all they way to Dire’s ancient, as techies mines were rigged to destroy every building on the map.\nThen tragedy strikes. The same black magic Puppey and Kuroky used to kill Na’Vi has brought them back as undead abominations. Dendi throws a perfect hook at Suma1l Spirit, catching him just as he runs out of mana.\nThe EG survivors yell to the audience, “NA DOTA, LEND US YOUR STRENGTH” but nothing happens because the NA dota scene is a joke. Finally though, a lone figure stands up in the crowd. Drinking one last Red Bull, Demon grows wings, and ascends to a higher plane of existence, becoming a being of pure energy, then sacrificing himself to give Suma1l a single bloodstone charge and just enough mana to escape and kill the xboct ghost, causing him to drop six rapiers. \"Classic Jimmy.\" Say all three Merlinis. A single tear running down their collective faces.\nWith his final bit of mana, he rockets towards the dire ancient, but alas, he wasn’t fast enough. Admiralbulldog destroys both ancients simultaneously, forever proving Rat Dota is best dota, winning the game for Alliance. The Aegis still goes to China for some reason.","tags":"#ti5#dota2#finals#arteezy","favourites":71,"__v":0,"created_on":"2015-08-13T03:42:33.114Z","score":0.0004598759151830808},{"_id":"55bd5f8cf300bfdf5990c0d9","id":1942,"pasta":"A Dota player and a LoL player walks into a bar. The Dota gamer turns around to the LoL gamer saying, \"LoL sucks!\" The LoL player couldn't deny. ","tags":"#dota2#lol#deny#joke","favourites":73,"__v":0,"created_on":"2015-08-02T00:08:44.323Z","score":0.0004516991227180975}]