[{"_id":"5503bc3787d1bc685b1e967d","id":1025,"pasta":"｀、｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ༼ຈ ل͜ຈ༽ﾉ•︻̷┻̿═━一 h a h a  i n  t h e  s t r e e t s,  h o h o  i n t h e s h e e t sヽ༼ຈل͜ຈ༽ﾉ•︻̷┻̿═━一 ヽ｀ヽ｀、ヽヽ｀ヽ｀、｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ、ヽヽ｀ヽ","tags":"#dota2#sniper#haha#hoho#sheets","favourites":33,"__v":0,"created_on":"2015-03-14T03:30:06.970Z","score":0.0005800749122532454},{"_id":"54d81ddcb898625b08cd362a","id":741,"pasta":"i expect us to win every lan\" - s4 2015","tags":"#dota2#s4#lan#tournament","favourites":43,"__v":0,"created_on":"2015-02-09T02:36:25.354Z","score":0.0005777811782647189},{"_id":"54bf0661bd6b1a11037e7c97","id":299,"pasta":"¸. * ● ¸ .　...somewhere　　　° ☾ ° 　¸. ● ¸ .　　★　° :.　 . • ° 　 .　 *　:.　.in a parallel universe* ● ¸ 　　　　° ☾ °☆ 　. * ¸.　　　★　★ ° . .　　　　.　☾ °☆ 　. * ● ¸ ...singsing..° ☾　★ °● ¸ .　　　★　° :.　 . • ○ ° ★　 .　 * ..strim♥ ☾　★ °● ¸ .　　　★","tags":"#dota2#singsing#sing#parallel#strim","favourites":49,"__v":0,"created_on":"2015-01-21T01:50:14.920Z","score":0.0005751921380197293},{"_id":"54b5f449f6a1885137f43cdc","id":186,"pasta":"What the sproink did you just enchant me with, you little jungle creep? I’ll have you know I graduated top of my class in the fluffy tails institute, and I’ve been involved in numerous secret raids on Dire-side, and I have over 300 confirmed kills on my socketed gems. I am trained in jungle warfare and I’m the top ganker in the entire Radiant hero pool. You are nothing to me but just another fawn to enchant. I will heal you the sproink up with precision the likes of which has never been seen before on the shady lanes and sunny glades, mark my fluffy tail. You think you can get away with running that slow from me with my movespeed? Think again, my lovely. As we speak I am contacting my secret network of enchanted creeps across the river and your icon is being pinged right now so you better prepare for the darkened dapples, doe. The hoofprints that wipe out the lovely little thing you call your hp bar. Don't think I wasn't fawned of you, flower. I can be anywhere, anytime, and I can heal you in over seven hundred nature attendants, and that’s just with my bare sproink. Not only am I extensively trained in unarmed healing, but I have access to the entire arsenal of new tracks to follow and I will use them to their full extent to wipe your miserable frown upside down, you little thing you. If only you could have known what racked retribution your little “fast\" auto attacks was about to bring down upon you, maybe you would have healed your golden tongue. But you couldn’t, you didn’t, and now the buck stops here, points for trying though! I will impetus spears all over you and you will buckle down. Ready or not, here I come!","tags":"#dota2#enchantress#sproink#creep#navy#seal","favourites":51,"__v":0,"created_on":"2015-01-14T04:42:49.209Z","score":0.000572136415672686},{"_id":"550301b787d1bc685b1e9679","id":1023,"pasta":"༼ つ ◕_◕ ༽つ MY LUBE IS READY. MY DICK IS GETTING LONGER. WITH THIS CHANT I SUMMON THE BULLDONGER! ༼ つ ◕_◕ ༽つ","tags":"#dota2#admiralbulldog#bulldog#bulldong#chant","favourites":32,"__v":0,"created_on":"2015-03-13T13:15:30.861Z","score":0.0005623698189579943},{"_id":"54b5d2198ba53a7c3326b4ec","id":162,"pasta":"This is probably going to come off pretty White Knight-y but that can't be helped. Some of the over the top sexual/sexist talk with Sheever/Jess/other women are on screen in EU hub is really fucking disgusting. I can't be the only one ashamed of this behavior out of the community. I know the morning Sheever came out in a dress she seemed fairly perturbed, though maybe I misjudged her reaction. I hopped on the stream briefly this morning and there was a 3rd woman present (short red hair? don't know her name) and chat was going ape shit begging for orgies and shit. There is a reason this hobby is so male dominated, and it's repugnant behavior like this. Grow the fuck up. I'm not saying everyone has have great manners and be super respectful all the time, but the shit that's come out of chat is fucking awful and it's embarrassing.","tags":"#sjw#fedorapasta#sheever#dota2#euhub","favourites":50,"__v":0,"created_on":"2015-01-14T02:17:34.149Z","score":0.0005622654925219367},{"_id":"54ce925b574e442b035d5fc5","id":651,"pasta":"Scientists have been pondering for ages how the universe keeps expanding, when by chance they were watching a televised Dota 2 tournament... suddenly they realized - it's iceiceice creating space","tags":"#dota2#scientists#universe#iceiceice#space#created","favourites":43,"__v":0,"created_on":"2015-02-01T15:17:04.497Z","score":0.0005513996689422376},{"_id":"54befef1e99bf86b74870e75","id":292,"pasta":"⋛⋋( ՞ਊ ՞)⋌⋚ CAW CAW ⋛⋋( ՞ਊ ՞)⋌⋚","tags":"#dota2#donger#caw#cawcaw#phoenix","favourites":45,"__v":0,"created_on":"2015-01-21T01:11:28.999Z","score":0.0005348777794266765},{"_id":"5505d59c87d1bc685b1e968f","id":1032,"pasta":"Hello everybody this is Slahser and this is my way of dewarding. Normally when people deward they will place it in the spot that covers the most ward spots however while this method may work i believe my way is also viable. First you need to build Boots of travel and a flying courier and a refresher quelling blade. Secondly you need to be a hero nobody expects to be the one to deward preferably choosing a hero like phantom assassin.\nNext you must place your sentry ward to find the deward, this is where my method differs from the standard. I place my ward in the most obscure spot so that if it spots the ward its very unlikely to get dewarded due to this obscurity. This method is very effective against heroes like mirana, nyx, stealth assassin, and Bounty hunter\nOnce you have spotted a ward you use your quelling blade refresh said quelling blade so you will be able to instantly destroy wards and the enemy side wont know who did it and assume an important support did the dewarding. Urns isnt core but is heavily recommended since i believe it supports PA style of stealth dewarding","tags":"#dota2#slahser#dewarding","favourites":28,"__v":0,"created_on":"2015-03-15T16:19:28.321Z","score":0.000509479492183361},{"_id":"54b5f2d8f6a1885137f43cd4","id":182,"pasta":"Yeah there were just so many reasons why this year's TI4 finals were absolute shit.\n1) My favorite teams being eliminated. Alliance eliminated in group stage. Na'Vi eliminated. C9 eliminated. EG eliminated. Na'Vi.US eliminated just kidding they are nobody's favorite team. I don't need anyone on this subreddit to explain to me the nature of competition, and how teams can only either win and continue playing, or lose and drop out. I don't want to hear that shit. When is IceFrog going to nerf Chinese teams? I think next year's International should be patched so that only one or two Chinese teams can enter the competition. Failing that, we need GabeN to make another version of the International, called the Americas where only teams from North America and Europe can play.\n2) Boring playstyle. It's well known that the Chinese have the rare ability to make any playstyle boring. This is evidenced by the fact that they are playing the exact style that old Na'Vi were famous for (KILLFUCKINGEVERYTHING), yet it is still somehow boring. If they rice for 90 minutes it's boring. If Burning's Naga rats, it's boring. If they play deathball it's boring. Over 1kill/minute in every single game of this year's Grand Final? Get out of here with that math shit. Everyone knows the ideal Kill-per-minute is around 0.75kpm to 0.96322kpm. Anything outside of this arbitrary range is FUKCNG BOIRNG. Also games are ending too soon, which brings me to my next point.\n3) Games are ending too soon. Games should last at least 30 minutes, or how else will I be able to slack off at work long enough to last the work day? I don't want to hear the fact that how long games last for is entirely out of the players' control. They're here to entertain me, goddammit. All I care about is watching some good ol' 'Murican DOTO while I drink my Bud Light. I can't even get decently buzzed on a 15 minute game.\n4) Same picks every single game by the Chinese.They pick the same damn picks every round and win it's so disgusting. This year’s Grand Final had the same picks like Shadow Shaman, Nature’s Prophet, Ancient KAPPArition and Sand King every game. Why can’t it be like last year's Grand Final between two tax paying, Aryan teams where we had Wisp, Batrider, Alch and Nature's Prophet every game instead? I think Chinese teams need to vary their picks more, because they are playing for my enjoyment as an audience member and I can't enjoy DOTA when they keep conforming to tradition and picking the same heroes every game. The games need to be more like TI2 where there was the same strat and same heroes in every single game, or TI3 where there was the same strat and same heroes in every single game, or even TI1 where we had the same strat and same heroes every game. Picking a strategy again that worked before in a tournament for money makes no sense at all. Fucking Chinese have no originality.\n5) Nationalism. There were rumors floating around that NewBee are racists and love China. This is despicable. America is the only country anyone should feel any pride for. This is evidenced by the fact that nobody cares when the crowd cheers USA USA USA but posts about Chinese nationalism makes the front page on this subreddit. Martin Luther King Jr. turned around in his grave today because RACISM FUKCIN WON. Also, in a rare turn of events, Communism won as well for the first time in history.\n6) I don't feel any emotional connection to the players. How am I supposed to feel any emotional connection to these faceless Chinese players? They all look the same, for Chrissakes. What happened to God-fearing, Liberty-loving Americans like ppd who's twitter literally makes me cry with emotion? (https://twitter.com/ppdDota). Or Universe, who I barely know since he has a grand total of three interviews under his belt? Or Mason, who's xenophobia in-game rivals my own closeted mistrust for other ethnicities? Or the stone-faced zai? Or Arteezy, the honorary American? These Chinese players are mechanical and emotionless, nevermind the fact that I've never bothered to learn anything about them.\n7) A team that is not from the U.S. won. (Na'Vi are an exception, because they are white) This is by far the biggest reason why this year's International sucks. First of all, it's well known that the U.S. wins everything. it should have won this competition too. We win the Olympics. We win at Baseball. We win at Basketball. We win at soccer. We won in Vietnam and Iraq. We DESERVE to win this. It is our God given RIGHT to win. How dare the Chinese take this win from us.","tags":"#dota2#ti4#international#china#newbee#usa","favourites":44,"__v":0,"created_on":"2015-01-14T04:37:28.878Z","score":0.0005045519656915214},{"_id":"54c08735e93bb9213040a1ee","id":478,"pasta":"ＦＲＯＭ  ＴＨＥ  ＧＨＡＳＴＬＹ  ＥＹＲＩＥ  Ｉ  ＣＡＮ  ＳＥＥ  ＴＯ  ＴＨＥ  ＥＮＤＳ  ＯＦ  ＴＨＥ  ＷＯＲＬＤ，  ＡＮＤ  ＦＲＯＭ  ＴＨＩＳ  ＶＡＮＴＡＧＥ  ＰＯＩＮＴ  Ｉ  ＤＥＣＬＡＲＥ  ＷＩＴＨ  ＵＴＴＥＲ  ＣＥＲＴＡＩＮＴＹ  ＴＨＡＴ  ＴＨＩＳ  ＯＮＥ  ＩＳ  ＩＮ  ＴＨＥ  ＢＡＧ！","tags":"#dota2#skywrath#mage#prediction#ghastly#eyrie","favourites":40,"__v":0,"created_on":"2015-01-22T03:12:00.772Z","score":0.00048678663403643513},{"_id":"54b5d2108ba53a7c3326b4ea","id":160,"pasta":"It was another slow and uneventful day for Black^. He got up out of bed, ate his tangoes and went for an adventure. Skipping down the steps, hopping around the trees and prancing through the fields, he made his way to the nearby forest. Meandering from camp to camp, he finally came across a 4-stack and was filled with joy. He put a straw in his mouth, rolled up his sleeves and said to himself: \"Ahh, creeps.\" ( ͡°╭͜ʖ╮͡° )","tags":"#dota2#black^","favourites":41,"__v":0,"created_on":"2015-01-14T02:16:11.021Z","score":0.00047477991559749316},{"_id":"54f22aa187d1bc685b1e95be","id":939,"pasta":"HEY RTZ, I'M TRYING TO LEARN TO PLAY SNIPER. l JUST HAVE A QUESTION ABOUT THE SKILL BUILD SHOULD I MAX SHRAPNEL LIKE YOU GAINED VISION OF EMPIRES POSITIONS, HEADSHOT SO I DON'T MISS LIKE YOU DIDN'T MISS ANY OF EMPIRES WARDS, OR TAKE AIM SO I COULD BE ON A SAFE DISTANCE LIKE YOU WERE SAFE FROM PUNISHMENT.","tags":"#dota2#rtz#arteezy#learn#sniper","favourites":29,"__v":0,"created_on":"2015-02-28T14:28:52.995Z","score":0.0004697361706622853},{"_id":"54bf05fdbd6b1a11037e7c95","id":297,"pasta":">Beyondthesummit\n \nLmao. Every day, every day this shitty studio's audio is out of sync. Every day they miss 3/4 of the draft or even the entire drafting phase. Every day, ching chong Merlini is dirty and disheveled while casting, unshowered and unkempt because of his refusal to shower and his dedication to mouthbreathing. Every day the fat jew David \"LD\" Gormanberg is a fat jew, fat and a jew. Every day GoDz sucks the tiny cock of the Chinese dota scene just a little bit harder, desperately hoping for the Chinese load to be shot deep into his throat while trying to look \"cool\" with his awful pedophile mustache. Every day, Zyori \"S N I F F B O Y\" sniffs his dirty scrotum on camera, misses early teamfights and wears a pink bow in his disgusting, terrible \"hair\". Every single day this goes on, and you people eat it up. You love it. This is absolutely disgusting. I'm disgusted and I hate every single one of you, every single miscreant that donated to this horrid studio's kickstarter, every single retard that watches their streams without AdBlock, every single fan of this atrocious, revolting, insulting excuse for a \"studio\".","tags":"#dota2#bts#jew#ld#godz#merlini#beyond","favourites":38,"__v":0,"created_on":"2015-01-21T01:47:06.384Z","score":0.0004630286258189328},{"_id":"54b2eba8ce7b585004706d9d","id":23,"pasta":"How is this guy even successful at LoL? I mean all he does is scream \"OH MAI GAWWWD\" and \"AWW BIITCHH\" and then he proceeds to feed. Feed feed is a bad player and doesn't deserve all this attention and he is definitely not a pro. I am 4k MMR and I could beat him with my FEET. The only reason he wins is because 4.20 is a noob patch made for players like feed feed. pls copy and paste and show this to everyone","tags":"#dota2#sing#singsing#sing_sing#whine#salt","favourites":40,"__v":0,"created_on":"2015-01-11T21:29:11.968Z","score":0.00045917833616653913}]