[{"_id":"54d7c1544cdf1142657fb74e","id":735,"pasta":"Arteezy gets first blood on Suma1L mid and he says, \"That's how you do it, son.\" Then Universe comes down the lane, hand in hand with his princess, Aui_2000, and proclaims, \"Don't you talk to my nephew that way.\" But then Fear rolls down midlane in his wheelchair -- old man, Father Fear -- looks directly into Arteezy, his son's eyes and softly says, \"Where am I?\"","tags":"#dota2#sumail#eg#rtz#arteezy#first#blood","favourites":157,"__v":0,"created_on":"2015-02-08T19:17:32.926Z","score":0.0017322789798148264},{"_id":"54e02a0026efea8810640220","id":794,"pasta":" ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ༼ຈ ل͜ຈ༽ﾉ•︻̷┻̿═━一 ｈｏｈｏ　ｈａｈａ　ｓｈｒａｐｎｅｌヽ༼ຈل͜ຈ༽ﾉ•︻̷┻̿═━一 ヽ｀ヽ｀、ヽヽ｀ヽ｀、｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ、ヽヽ｀ヽ","tags":"#dota2#shrapnel#sniper","favourites":148,"__v":0,"created_on":"2015-02-15T05:02:49.424Z","score":0.0017187253472904817},{"_id":"5514dfeeb79c00ce446ab073","id":1337,"pasta":"﻿ＳＩＮＧＳＩＮＧ，  ＨＯＷ  ＤＯ  ＹＯＵ  ＰＬＡＹ  ＭＥＥＰＯ？  ＤＯ  ＹＯＵ  ＭＡＸ  ＰＯＯＦ，  ＬＩＫＥ  ＹＯＵ  ＰＯＯＦＥＤ  ＯＵＴ  ＯＦ  ＲＥＬＥＶＡＮＣＥ？  ＯＲ  ＤＯ  ＹＯＵ  ＭＡＸ  ＮＥＴ，  ＬＩＫＥ  ＹＯＵ  ＮＥＴＴＥＤ  ＺＥＲＯ  ＬＡＮ  ＷＩＮＳ  ＩＮ  ２０１５？  ＭＹ  ＦＡＶＯＲＩＴＥ  ＢＵＩＬＤ  ＩＳ  ＭＡＸＩＮＧ  ＧＥＯＳＴＲＩＫＥ，  ＬＩＫＥ ＹＯＵ  ＳＴＲＵＣＫ  ＲＯＣＫ  ＢＯＴＴＯＭ．  ＰＬＥＡＳＥ  ＡＮＳＷＥＲ","tags":"#dota2#singsing#meepo#build","favourites":100,"__v":0,"created_on":"2015-03-27T03:40:30.309Z","score":0.0016634540869957853},{"_id":"556923a9ba095caa758c0ef8","id":1690,"pasta":"(ง╭ರ_•́)ง We politely ask for this game to be started for alas we will stir up a ruckus (ง╭ರ_•́)ง","tags":"#dota2#bts#ruckus#start#game","favourites":43,"__v":0,"created_on":"2015-05-28T19:02:37.751Z","score":0.0016091133127320155},{"_id":"55552186d8a10121136da80a","id":1635,"pasta":"I want to turn into Luna's bodysuit\nShe wouldn't notice anything weird and wear me into the battle\nAnd then I would tease her naughty bits\nI would gently lick her nipples and play with her cunny\nNot too much though, just enough to get her aroused\nAs she would kill more enemies and get carried away by the slaughter I would increase my \"assault\"\nBy the end of the battle she would be very close and I would give her the pleasure of finishing the \"job\" herself, enjoying every last drop she let into me\nHowever, the story wouldn't end here\nMuch to her surprise, she wouldn't be able to take me off\nMultiple tongues I would've grown inside the suit would caress her plump breasts, stiff nipples, perfect tummy, fit ass and her clitoris\nI would grow two penises right inside the suit which would fill her unexperienced pussy and virgin ass\nThey would vibrate as she moaned and quivered around, helpless and increasingly aroused\nTwo pulsing penises inside her loin and tongues working every single inch of her body wouldn't take too long to bring her to another pleasant ending\nThat wouldn't be it yet though\nFor the last stage, I would begin to pump her with my penises while intensely vibrating around her erogenous zones\nAfter giving her yet another orgasm, I would turn back into a fat-ass self insert and run away","tags":"#dota2#luna#4chan#bodysuit","favourites":50,"__v":0,"created_on":"2015-05-14T21:42:30.687Z","score":0.0015187317919047297},{"_id":"54b2eb9ece7b585004706d97","id":17,"pasta":"Hello my name is Sing_sing and I am from the distant future. I am here to inform you, past Sing_sing that you must replace S4 on SECRET and travel with your new team to the TI5 EU Hub and play Mario Party for 2 weeks straight, if you fail to do this The Bankers will take over the world and it will descend into chaos. Thank you for listening to future Sing_sing. Please no pasta alfredo","tags":"#sing#singsing#dota2#secret","favourites":163,"__v":0,"created_on":"2015-01-11T21:24:27.532Z","score":0.0015128669622989437},{"_id":"555687d1db837b14022dba88","id":1637,"pasta":"(This message has been brought to you in part by theScore | eSports, Vulcun, G2A, 100 TB, and G1 Gaming by GIGABYTE)","tags":"#dota2#bts#sellout#vulcan","favourites":49,"__v":0,"created_on":"2015-05-15T16:54:28.747Z","score":0.0015078734688366785},{"_id":"559ef1fc975fee4a2be08437","id":1872,"pasta":"Arteezy joined my game and demanded mid as Naga. I got really nervous because I watch his stream all the time and didn't want to make him upset, so I picked treant so he'd be safe. All the sudden, my mom called. She told me my dad had a stroke and was the hospital in critical condition. I wanted to leave, but I knew I'd be letting Arteezy down, so I stayed and played the game out. I finished 2/8/10 and Arteezy called me a fucking moron. My dad died before I made it to the hospital, but I know he'd say I did the right thing.","tags":"#dota2#rtz#arteezy#dad","favourites":15,"__v":0,"created_on":"2015-07-09T21:15:32.356Z","score":0.0014836268184374298},{"_id":"554688bf92ac5d29444dfc8f","id":1574,"pasta":"It is TI5 grand finals, Secret vs C9. After 4 intense games, it is tied up at 2-2. All these chinese teams have been knocked out due to the meta change. Jacky had bleached his hair for this TI in preparation for what is to come.\nJacky closed his eyes and said, \"It is time Bone-chan\". He then opens his eyes with the fury of a thousand suns, he picked on Leshrac, Beastmaster, Phoenix, Crystal maiden and Kotl. He has prepared this strategy since the legendary \"6.84 patch day of doom\".\nHe all-chats: \"Artour, you have yet to see my final form.\" Artour replies: \"LMAO wHo cARES HAHA Xd\"\nEE farmed up Bloodstone, Loda's Orb, Octarine Core in 20 minutes on Leshrac and have taken their middle barracks. Jacky knows it, Artour knows it, the world knows it. It is time. It is time for the greatest spirit bomb that Dota2 has ever seen.\nC9 begins to push through middle line with 10 full couriers of enchanted mango. They are ready to finish the game. Jacky stands up in his booth as he blinks into the Secret base with his ultimate and Diabolic Edict turn on. \". FEED ME MANGOES, FEED ME MANGOES, FEED ME MANGOES, FEED ME MANGOES, yells Jacky. Phoenix casts Supernova, Kotl is channeling his wave of heal, CM channeling freezing field, BM roars onto Arteezy's OD.\nSecret cannot handle this death ball that Jacky has become. Artour's eyes are now glowing in fear. \"We cannot... we cannot go near him... His power level is just... We fucking lost\". Artour instantly purchases a second Midas and has given up. Puppey yelled at Artour to sell his midas and knocked some sense into him. Secret has decided to go for the couriers and support kills instead. So smart... So Smart...\nThe throne is now down to 200 hp, only Bone7 and EE is alive and both of them are on low on HP. Looking like a lifeless and dried up flower, Johan breathlessly says, \"We are out of mangoes Jacky...you have drained all our energy...\" \"Just a little bit more...\", Jacky whispers.\nBigdaddy, FATA- and Misery have all fainted in their seats as they are all out of energy.\n\"Bone-chan, all these throws you have committed over the years, it is time for me to cleanse your sins...\", EE uses his bloodstone and commits suicide, he sacrificed himself for Bone322's sins. Bone is now full life. Standing ovation from the crowd, LD has gone insane and repeatedly yells, \"WAOWWWWW!!! THE SUICIDE, THE SUICIDE\". Bone's last few auto attacks finishes off the throne as he also faints.\nJacky exits the booth, Secret is in disbelief, Artour is in BabyRage mode. It is over. Jacky walks out of his booth and rips the Aegis of Immortal out of GabeN's hands. Jacky walks up to Ar1se and smashes him in the head with the aegis. It is over... TI5... the last International, the greatest Esport tournament ever.","tags":"#EE#c9#throw9#TI5#mango#dota2#6.84#leshrac","favourites":55,"__v":0,"created_on":"2015-05-03T17:18:41.560Z","score":0.0014430213128806852},{"_id":"55cee12b2698f7be3d0ad87e","id":1993,"pasta":" ʕ ͡·ᴥ ͡· ʔ You've been visited by Hellbear Smasher of fortune. Clap your paws and copy paste this message 5 times without getting banned by mods and luck be with you for the next year ʕ ͡·ᴥ ͡· ʔ","tags":"#dota2#bear#twitch","favourites":2,"__v":0,"created_on":"2015-08-15T06:50:19.625Z","score":0.0014117973236024474},{"_id":"54bf32603b0a330105ff5bc2","id":353,"pasta":"ʜᴇʟʟᴏ ʙᴜʟʟᴅᴏɢᴇ I ᴀᴍ ғᴀᴍᴏᴜs ᴘᴏʀɴ ᴅɪʀᴇᴄᴛᴏʀ, ᴛᴏɴʏ ᴘᴀsᴛᴇʀɪɴᴏ. ᴡᴇ ᴡᴏᴜʟᴅ ʟɪᴋᴇ ʏᴏᴜ ᴀɴᴅ sʜᴇᴇᴠᴇʀ ᴛᴏ ᴘᴀʀᴛɪᴄɪᴘᴀᴛᴇ ɪɴ ᴏᴜʀ ɴᴇᴡ ᴠɪᴅᴇᴏ \" ʜᴏᴏᴋɪɴ' ɴ ᴊᴜᴋᴇɪɴ' \" sʜᴇᴇᴠᴇʀ ᴡᴏᴜʟᴅ ʙᴇ ᴡɪɴᴅʀᴜɴɴᴇʀ ᴀɴᴅ ʏᴏᴜ sᴀʏ ɴᴏ ᴊᴜᴋᴇʀɪɴᴏ ᴀɴᴅ ʙᴀᴄᴋᴅᴏᴏʀ ʜᴇʀ.","tags":"#dota2#admiralbulldog#porn#sheever#jukerino#backdoor","favourites":134,"__v":0,"created_on":"2015-01-21T04:42:26.764Z","score":0.001353677014147626},{"_id":"55408fc6107beab4641ec2cf","id":1545,"pasta":"LoL>Dota, in dota you kill your own minion WutFace are u traitor? EleGiggle why in dota can you buy a ''battlefury'' on the market for 30 dollars and get a 4000 gold item for free at level 1? FailFish balanced game, dota is also made by unknown company named ''steam'', who is this ''steam''? this ''steam'' is scamming your life, LoL is made by riot, riot is good company who releases balanced champions,  LoL also have lots of skins like mlg teemo, spacesuit teemo, swimsuit teemo, sexy bikini teemo, etc, LoL>Dota","tags":"#dota2#lol#comparisons#skins","favourites":54,"__v":0,"created_on":"2015-04-29T05:10:03.757Z","score":0.0013520790878027023},{"_id":"5589fdb72a7929bd7a8b1f7f","id":1793,"pasta":"Ｈｅｙ  Ｋｏｒｏｋ  Ｉ＇ｍ  ｔｒｙｉｎｇ  ｔｏ  ｌｅａｒｎ  ｔｏ  ｐｌａｙ  ｃｌｏｃｋｗｅｒｋ．  Ｉ  ｊｕｓｔ  ｈａｖｅ  ａ  ｑｕｅｓｔｉｏｎ  ａｂｏｕｔ  ｔｈｅ  ｓｋｉｌｌ  ｂｕｉｌｄ．  Ｓｈｏｕｌｄ  Ｉ  ｍａｘ  Ｂａｔｔｅｒｙ  ａｓｓａｕｌｔ，  ｌｉｋｅ  ｙｏｕ  ｃｏｍｍｉｔｔｅｄ  ｂａｔｔｅｒｙ  ａｎｄ  ａｓｓａｕｌｔｅｄ  ｙｏｕｒ  ｇｉｒｌｆｒｉｅｎｄ，  Ｈｏｏｋ  ｓｈｏｔ  ｓｏ  Ｉ  ｃａｎ  ｐｕｎｃｈ  ｍｙ  ｇｉｒｌｆｒｉｅｎｄ＇ｓ  ｌｉｇｈｔｓ  ｏｕｔ，  ｏｒ  ｒｏｃｋｅｔ  ｆｌａｒｅ  ｌｉｋｅ  ｔｈｅ  ｐｏｌｉｃｅ  ｆｉｒｅｄ  ｉｎ  ｔｈｅｉｒ  ｐｕｒｓｕｉｔ  ａｎｄ  ａｒｒｅｓｔ  ｏｆ  ｙｏｕ？","tags":"#korok#dota2#beat#girlfriend#stillavirgin","favourites":21,"__v":0,"created_on":"2015-06-23T00:36:13.963Z","score":0.0013349525393220334},{"_id":"55bd5fe7f300bfdf5990c0e1","id":1950,"pasta":"My name is Henrik, 25 year old man from Swedlandia. I am come play \"dota two\" in American to make money find wife and lose virgin. I find \"Gabriel Newman\", he fat man like me. He say,  \"we have job for you.\" Now I make $3.22/hr scrubbing toilet at \"ti5\" thank you for listening please no copy my story.","tags":"#dota2#admiralbulldog#henrik#ti5#toilets","favourites":5,"__v":0,"created_on":"2015-08-02T00:10:15.585Z","score":0.0013122186120131689},{"_id":"54bf066ebd6b1a11037e7c98","id":300,"pasta":"\"Sheever, ravage!\" Singsing shouts, infuriated at yet another of Sheever's antics. Sheever upon hearing this retreats to her room, tears streaming down her cheeks.Singsing doesn't notice until hours later, after losing to pubs for the third time in a row and switching off his stream.He finds Sheever in a ball on her bed, tear marks on the sheets and her eyes red and swollen. \"What's wrong, Sheever-chan?\" Singsing asks.\"You.. you yelled at me!\"","tags":"#dota2#singsing#sheever#fanfic","favourites":128,"__v":0,"created_on":"2015-01-21T01:50:16.708Z","score":0.0013016831586994985}]