[{"_id":"54b5f43df6a1885137f43cdb","id":185,"pasta":"Albert Einstein, one of the greatest minds to ever live, was once perplexed by the speed at which Arteezy was able to farm. Seemingly impossible GPMs of 800+ every game were consistently observed, leading to the hypothesis that this was no fluke. Einstein spent the last years of his life trying to prove the ability of Arteezy's farm existed within the laws of science. Critics laughed at his efforts, claiming that Arteezy's farm was an undeniable act of divine intervention. It wasn't until the end when Einstein found the answer. On his deathbed, Einstein spent the last seconds of his life jotting down what is now the world's most infamous scientific formula. r=tz²","tags":"#rtz#einstein#arteezy#dota2#gpm#farm","favourites":130,"__v":0,"created_on":"2015-01-14T04:42:15.444Z","score":0.0012676300724748077},{"_id":"54fa6ecc87d1bc685b1e9640","id":998,"pasta":" @ppdDota ＹＯＵ　ＦＵＣＫＩＮＧ　ＮＥＲＤ　．．：　Ｕ　ＷＩＬＬ　ＮＥＶＥＲ　ＭＡＫＥ　ＳＥＸ　ＩＮ　ＵＲ　ＬＩＦＥ　．．：　ＷＨＩＬＥ　ＩＮ　ＢＲＡＺＩＬ　Ｉ　ＨＡＶＥ　ＳＥＸ　３０　ＴＩＭＥＳ　ＥＡＣＨ　ＤＡＹ　ＡＴ　ＣＡＲＮＡＶＡＬ","tags":"#dota2#ppd#nerd#carnaval#make#sex","favourites":84,"__v":0,"created_on":"2015-03-07T01:15:00.583Z","score":0.0012261553742929133},{"_id":"5508db5bb47c3d010fd9656f","id":1122,"pasta":"I hear \"ho ho, ha ha!\" in my sleep. I'm constantly on edge around short people. My dad was watching American Sniper this weekend and I had PTSD.","tags":"#dota2#fuck#sniper#hoho#haha","favourites":71,"__v":0,"created_on":"2015-03-18T01:54:44.085Z","score":0.0011574118963557929},{"_id":"55106830e176d8400420cf53","id":1293,"pasta":"Shrapnel is named after Major-General Henry Shrapnel (1761–1842), a British artillery officer, whose experiments, initially conducted in his own time and at his own expense, culminated in the design and development of a new type of artillery shell ending with his famous catchphrase \"Hoho Haha\"","tags":"#dota2#sniper#henry#shrapnel#hoho#haha","favourites":67,"__v":0,"created_on":"2015-03-23T18:58:30.301Z","score":0.001153876472365135},{"_id":"552e844541157097494d180e","id":1463,"pasta":"Friend who is a regular player began to play less and less since the patch hit. As the days went on the steam messages I would get from him became more and more nonsensical and unintelligible. The last time I heard from him was three weeks ago now and the only thing he said was \"Ho Ho Ha Ha\".","tags":"#dota2#patch#hoho#haha#sniper","favourites":51,"__v":0,"created_on":"2015-04-15T13:24:01.481Z","score":0.001120721293590349},{"_id":"54c7be27f63c027608a745ee","id":586,"pasta":"Artour got out of the building. He was a bit frustrated. His team was making him play stupid heroes again. He wanted to play Naga and Terrorblade. Didn't they understand the main goal of Dota is to kill creeps?\nArtour whispered to himself, \"LMFAO wHo cAREAS HAHA Xd\". He sighed and crossed the street. Suddenly Artour's face went pale. On the other side of the street was the Cloud 9 squad. \"J-Jacky...\", he whispered. They were coming at him. He was frozen in place.\nEE looked at him and said \"Long time no see Artour.\" He was speechless as all of them passed by him. Only n0tail stayed there with him, his hands on his pockets. Artour didn't dare to say anything. He hadn't ever seen n0tail with such a grim look.\n\"Having fun with my old team, Artour?\" n0tail asked, a maniac grin growing in his face. \"The team who kicked me because of you.\"\nArtour was panicking. Who was that guy? He surely wasn't the BigDaddy he had met before.\" Don't worry Artour\", continued n0tail, \"I'm not gonna hurt you. In fact, I'm just having fun with my new best friend... Jacky.\"\nThat was it. Artour lost control. \"You'll never steal Jacky from me! Never!\" n0tail's grin got bigger. \"You've always been naive, Artour... I've watched your replays. I know how to please Jacky better than you now.\"\nArtour stared in disbelief. \"W-what...\". N0tail slowly took his hands out of his pockets. A golden glow filled the whole street. Artour fell to his knees as he saw not only one, but two hands of Midas. \"Good luck on the tournament, Artour...\" said n0tail while leaving. Artour sat in the ground, tears in his face. \"Jacky...\" He whispered.","tags":"#dota2#arteezy#rtz#ee#jacky#building#notail#bigdaddy","favourites":102,"__v":0,"created_on":"2015-01-27T16:04:51.524Z","score":0.0011183566040642667},{"_id":"551076e5e176d8400420cf56","id":1294,"pasta":"ＨＥＹ Ｓ４， Ｉ＇Ｍ ＴＲＹＩＮＧ ＴＯ ＬＥＡＲＮ ＴＯ ＰＬＡＹ ＭＡＧＮＵＳ． Ｉ ＪＵＳＴ ＨＡＶＥ Ａ ＱＵＥＳＴＩＯＮ ＡＢＯＵＴ ＴＨＥ ＳＫＩＬＬ ＢＵＩＬＤ： ＳＨＯＵＬＤ Ｉ ＭＡＸ ＳＨＯＣＫＷＡＶＥ ＬＩＫＥ ＹＯＵ ＳＨＯＣＫＥＤ ＥＶＥＲＹＯＮＥ ＷＨＥＮ ＹＯＵ ＬＥＦＴ ＡＬＬＩＡＮＣＥ， ＳＫＥＷＥＲ ＳＯ Ｉ ＣＡＮ ＥＳＣＡＰＥ ＬＩＫＥ ＹＯＵ ＥＳＣＡＰＥＤ ＡＬＬＩＡＮＣＥ， ＯＲ ＥＭＰＯＷＥＲ ＳＯ Ｉ ＣＡＮ ＣＬＥＡＶＥ ＬＩＫＥ ＹＯＵ ＣＬＥＡＶＥＤ ＬＯＤＡ＇Ｓ ＨＥＡＲＴ","tags":"#dota2#s4#learn#magnus#skill#build","favourites":61,"__v":0,"created_on":"2015-03-23T20:05:21.369Z","score":0.0010661805815040746},{"_id":"54bf0f9a2d74781f04a6036f","id":307,"pasta":"Hey 2gd ( ° ͜ʖ͡°)╭∩╮","tags":"#dota2#hey#2gd#donger","favourites":100,"__v":0,"created_on":"2015-01-21T02:31:00.022Z","score":0.0010578803223747573},{"_id":"55b193ad89b52e986e2b40d8","id":1907,"pasta":"EleGiggle Little Subscriber gays ? SoBayed u thought u WON ? SoBayed Mother Fuckers ? SoBayed spent 5$ to EleGiggle talk in chat for 5mins ? SoBayed or playing EleGiggle subgames which happen EleGiggle once a YEAR ? 4Head","tags":"#dota2#bulldog#subs","favourites":8,"__v":0,"created_on":"2015-07-17T08:56:17.712Z","score":0.0010492036469214947},{"_id":"55cc12682ccec12862a3e7bc","id":1991,"pasta":"It all happened years ago when Twitch chat had had enough. They knew that something had to be done. Their plan was to kidnap a child, give him cancer, and make him meet IceFrog through Make-A-Wish Foundation. After kidnapping an orphan, they forced the poor kid to watch Twitch chat for 10 hours non-stop. He quickly fell terminally ill. Then they submitted the wish and waited. When the two finally met, IceFrog asked the boy if there was anything he wished for. After the kid told him his last wish, IceFrog fell silent. A tear rolled down his cheek as he answered: \"Yes, my little fansh*t, I will balance Glimmer Cape as your last wish.\". And thus in the patch 7.52 it finally happened, Glimmer Cape was nerfed. Its cooldown was increased by one second.","tags":"#dota2#twitch#icefrog#icefraud#glimmer","favourites":2,"__v":0,"created_on":"2015-08-13T03:43:36.923Z","score":0.001049105521827117},{"_id":"5504fdc887d1bc685b1e9684","id":1028,"pasta":"It's time to get angry at 4K MMR players, the best time of the day. Every fucking day. I play scrims, I get depressed. Even though I win them. And then I play these 4k MMR games and I lose hope in humanity. That's my life. Every day. I play on my smurf and I lose hope in myself, and then I play on my main account and I lose hope in everybody else. And at the end of the day I have no friends. That's life. The life of Jacky Mao.","tags":"#dota2#ee#jacky#mao#angry#4k","favourites":64,"__v":0,"created_on":"2015-03-15T02:43:04.189Z","score":0.0010357817837605067},{"_id":"55737b537d2300ce44f0cecb","id":1728,"pasta":"ლ(́◉◞౪◟◉‵ლ) let me hold your mangoes for a while ლ(́◉◞౪◟◉‵ლ)","tags":"#dota2#double#crosser#mango#radboys","favourites":22,"__v":0,"created_on":"2015-06-05T17:30:33.337Z","score":0.0010186174390408717},{"_id":"5597362fa28b796c71d39efd","id":1839,"pasta":"Ｈｉ  Ｖａｌｖｅ，  Ｉ＇ｍ  ｔｒｙｉｎｇ  ｔｏ  ｌｅａｒｎ  ｈｏｗ  ｔｏ  ｐｌａｙ  ｄｏｔａ  ２．  Ｓｈｏｕｌｄ  Ｉ  ｂｕｙ  ａ  ｈｅａｒｔ  ｔｏ  ｒｅｐａｉｒ  ｍｉｎｅ  ａｆｔｅｒ  ｙｏｕ  ｂｒｏｋｅ  ｉｔ  ｗｉｔｈ  ｕｎｔｉｍｅｌｙ  ｒｅｌｅａｓｅ  ｏｆ  Ｉｍｍｏｒｔａｌ  ＩＩＩ  ｃｈｅｓｔ，  ｂｕｙ  Ｂｕｔｔｅｒｆｌｙ  ｓｏ  Ｉ  ｃａｎ  ａｖｏｉｄ  ｅｖｅｒｙｔｈｉｎｇ  ｌｉｋｅ  ｉｃｅＦｒａｕｄ  ｄｏｅｓ  ｏｒ  ｓｈｏｕｌｄ  ｉ  ｂｕｙ  ａ  ｍｉｄａｓ  ｓｏ  ｉ  ｃａｎ  ｇｅｔ  ｒｉｃｈ  ａｎｄ  ｂｅ  ｕｓｅｌｅｓｓ？","tags":"#dota2#valve#hearthofterrasque#broken","favourites":12,"__v":0,"created_on":"2015-07-02T21:48:51.251Z","score":0.0010109224949121553},{"_id":"54c826aaf63c027608a745f6","id":587,"pasta":"In Portal 2, Valve attached a very sophisticated AI to a potato and it worked just fine. In DotA 2, they've made servers from potatoes but haven't had much success and I can't understand why.","tags":"#dota2#portal#valve#potato#servers","favourites":90,"__v":0,"created_on":"2015-01-27T22:30:23.184Z","score":0.001008102895510982},{"_id":"54bf5e573b0a330105ff5c0e","id":379,"pasta":"Mason got into his car in a hurry as he was late to work at McDonalds. As he pulled out of his driveway, he saw a beautiful vixen approaching him . She had long brown flowing hair that rustled gently in the wind. Mason's heart rate accelerated and he began dripping with sweat from every pore of his all-American 350 pound body. He hadn't been this aroused since the last all you can eat pancake buffet at Denny's. This girl was the most beautiful human he'd ever laid his eyes on. As he got closer to her, he rolled down his window, and whispered \"h-hey\". Zai cleared the brown hair from his eyes and replied \"shut the fuck up mason i thought we booted u\"","tags":"#dota2#mason#zai#car#mcdonalds","favourites":94,"__v":0,"created_on":"2015-01-21T07:06:36.602Z","score":0.0010052987248284552}]