[{"_id":"54e760958a06216f0557ecb5","id":876,"pasta":"I'm 1.2K but I should be 7.3K, I just got calibrated into the wrong bracket because every team I got put into was full of idiots and I can't climb MMR because every match I get paired with people who throw. I've sent in my application though, I'm confident I'll be selected because I know I'm good, my teammates just make me look bad.","tags":"#dota2#MMR#VG#trench#ego#rage#7k","favourites":28,"__v":0,"created_on":"2015-02-20T16:13:06.736Z","score":0.00038128854549323004},{"_id":"54ecec3dc200ce525fb25db0","id":907,"pasta":"I sexually identify myself as a  ( ͡°╭͜ʖ╮͡° ) Day Tucker, ○☾☆*★●° Night Fucker ( ͡ʘ╭͜ʖ╮͡ʘ) . At daytime i play dota with sing stack and and at nighttime I rape kids like rtz in the streets, where their parents have left them because they didnt have enough money for internet bills. But dont get me wrong, im not gay like Akroma and EternalErection, i like cute asian grills like SingSing. If there are others like me in this chat, please copy and paste my post. Have a nice day!","tags":"#dota2#tucker#fucker#rape#singsing#identify","favourites":27,"__v":0,"created_on":"2015-02-24T21:15:00.066Z","score":0.00037925429143912293},{"_id":"5505d57e87d1bc685b1e968e","id":1031,"pasta":"I fucking love Jackie Mao. And I love the reddit hate for him as well. He's a nerd. A natural born fucking autist. He watches anime, virgin, slurps, dreams of nihon, 0 social skills, prolly even got a dakimakura of some anime character. At the end of an interview they say \"ok so this is our last question, its a joke question...haha whats your favorite hentai?\" he answers honestly without hesitation then waits patiently to be let in on the joke. I fuckin love this guy. HE's the hero our dota 2 deserves, but he's NOT the hero you fuckin normalcools want because you fucking 2.5kmmr sunbreathers want to live in a fantasy world where Dota Gods like EE have jobs, grillfriends, and even live on their own, so that it can be something you can comprehend, something you can relate to, something even you too can dream of achieving. Well, that wont happen. You will never understand eternal envy and you will never understand Dota.","tags":"#dota2#eternalenvy#ee#love#autist#hentai","favourites":23,"__v":0,"created_on":"2015-03-15T16:03:11.099Z","score":0.0003733796570794298},{"_id":"54bf5f8b3b0a330105ff5c14","id":385,"pasta":"\"Could it be? Papa is it true?\" \"It's true son, I never thought it would happen again.\" \"When you told me about how sing strimed when you were my age, I didn't believe you. Dad are you crying?\" \"No son, it's just a little pastarino in my eye.\"","tags":"#dota2#sing#singsing#papa#son#stream#strim","favourites":33,"__v":0,"created_on":"2015-01-21T07:33:10.361Z","score":0.00036925434358585927},{"_id":"54bf1a7a2d74781f04a6038f","id":319,"pasta":"As soon as I open the stream I start noticing mistakes. \"Why didn't he do this? Why didn't he do that?\" and that's when I realize - I'm the best Dota player in the world. I am better than every pro. When I play Dota I always lose because of bad teammates but if I had good teammates my MMR would easily be 7000+. So my only option is to watch professional player streams and tell them what they're doing wrong. I'm trying to enlighten the Dota community. I don't state opinions - I state facts. Please accept that I am better than you at Dota and that everything I say is right. Thank you so much for reading please no copy pasterino.","tags":"#dota2#as#soon#why#didn't#this#mmr#7k","favourites":33,"__v":0,"created_on":"2015-01-21T03:16:52.149Z","score":0.0003689036766813908},{"_id":"54b4befb6ef754dd27d5fd9b","id":96,"pasta":"PLEASE BE AWARE IF YOU CHOOSE TO PLAY DOTA 2 YOU MAY: PERMANENTLY LOSE YOUR SOCIAL LIFE , BECOME RACIST TOWARDS PERUVIANS / RUSSIANS BUT EVERYTIME YOU WIN A GAME, YOU WILL FEEL LIKE GOD.","tags":"#dota2#cyka#blyat","favourites":34,"__v":0,"created_on":"2015-01-13T06:45:09.675Z","score":0.0003631985607605882},{"_id":"54b2eba6ce7b585004706d9c","id":22,"pasta":"Wow I can't believe how you can say heil hitler when he killed so many Jews. You people should be ashamed of yourselves. Why can't you be like freedom fighter RTZ. So much shame. No copy pasta pls this is serious.","tags":"#dota2#freedom#fighter#arteezy#nazi#mods","favourites":34,"__v":0,"created_on":"2015-01-11T21:27:49.136Z","score":0.0003606142941159611},{"_id":"54ce9229574e442b035d5fc3","id":649,"pasta":"Secret won't get Top 8. They're really weak right now. I talked to them and I know what's going on with performance and what not. They seem to be in a really rough spot. I think EG will do okay, probably one of the more stronger teams.","tags":"#dota2#secret#tralf#dac#eg","favourites":29,"__v":0,"created_on":"2015-02-01T12:17:06.378Z","score":0.000351243903658276},{"_id":"54e82b0d8a06216f0557ecbb","id":879,"pasta":"Let's look at this statistically. Assuming you are not peruvian, your team has four chances to spawn a peruvian. The other team has five chances to spawn a peruvian. Overall, you will have less peruvians then your opponents, and will automatically rise on the ladder. If you aren't rising, you are probably secretly a peruvian, ruining the statistical balance of sweet victory.","tags":"#dota2#peruvians#peru#statistics#trench","favourites":25,"__v":0,"created_on":"2015-02-21T06:44:12.870Z","score":0.0003469293825353295},{"_id":"54bfe9ec3b0a330105ff5cda","id":449,"pasta":"LMFAO wHo cAREAS HAHA Xd","tags":"#dota2#rtz#arteezy#lmfao#who#cares","favourites":29,"__v":0,"created_on":"2015-01-21T17:58:47.820Z","score":0.00033113685251453314},{"_id":"54d10a7b26bb364104067eea","id":686,"pasta":"And there was a player who had had lost MMR for twelve games in a row, and though he had spent all his living on coaching, he could not be taught to play Dota by anyone. He came up behind Arteezy and touched the fringe of his garment, and immediately his MMR increased by 25. And Arteezy said, “Who was it that touched me?” When all denied it, Peter Dager said, “Master, the crowds surround you and are pressing in on you!” But Arteezy said, “Someone touched me, for I perceive that MMR has gone out from me.” And when the player saw that he was not hidden, he came trembling, and falling down before him declared in the presence of all the people why he had touched him, and how he had immediately improved at Dota. And Arteezy said to him, “Son, your faith has made you not a noob; go in peace.”\nArtour 8:43-48","tags":"#dota2#arteezy#noob#mmr","favourites":25,"__v":0,"created_on":"2015-02-03T09:53:59.723Z","score":0.00031222592036259317},{"_id":"550af90a2ab05ce134dd3261","id":1226,"pasta":"HEY RELATEABLEDOTA, I'M TRYING TO LEARN TO PLAY DRAGON KNIGHT. I JUST HAVE A QUESTION ABOUT THE SKILL BUID. SHOULD I MAX DRAGON BREATH FIRE FOR THE MOST GENERIC DAMAGE DEALING SPELL IN THE GAME, DRAGON TAIL FOR THE MOST GENERIC POINT AND CLICK STUN IN THE GAME, OR DRAGON BLOOD SO I CAN DIE SLIGHTLY SLOWER","tags":"#dota2#dragonknight#skill#build","favourites":18,"__v":0,"created_on":"2015-03-19T16:22:52.693Z","score":0.0003097644291588559},{"_id":"54cd7208e79ec4797cbee2a8","id":641,"pasta":"I sexually identify as a Chen Picker. Ever since I was a boy I dreamed of walking through the jungle, dominating hot sexy neutral creeps. People say to me that being useful as Chen is impossible and I'm fucking retarded but I don't care, I'm beautiful.I'm having Icefrog buff the jungle creeps, so that the wildkins and hellbears can dominate me, which I've always fantasized about.","tags":"#dota2#sexually#identify#chen#picker","favourites":25,"__v":0,"created_on":"2015-01-31T23:43:10.724Z","score":0.0003079967059000193},{"_id":"54c1a6775764903a3288023e","id":510,"pasta":"My name is Omar from Saudi Arabia, a Dota 2 player and a tournament organizer who has just received the sad news about our king's death.I am very sad at the moment, I doubt that you know how I feel, It is just really really sad. I was 12 when King Abdullah reigned. I am 23 now and can't help myself getting emotional over this. All TV stations are airing holy scripts from the Quran, everything is quite outside and the country in mourning. I play Dota 2 a lot, and I decided to play Sand King for the next 90 games, in his memory.","tags":"#dota2#omar#saudi#quran#king#death","favourites":26,"__v":0,"created_on":"2015-01-23T01:04:17.703Z","score":0.0003033967404546906},{"_id":"54c13a215764903a32880216","id":492,"pasta":"Charlie first noticed Arteezy among a group of young boys. Arteezy's monstrous nose and sharp blue eyes spoke of a freakish talent that lay hidden in the young boy. Charlie approached him, 'I have an offer for you son. I can give you a life. A life with purpose. With meaning. I will show you the world. I will turn you into a man, a man you can be proud of. You and that monstrous nose will carry EG. Will carry the pile of shit known as NA Dota. You won't have to practice. You won't have to scrimm. We'll still pay you a monthly salary. You will be known as A-God. Look deep inside yourself son, is this what you want?'\n \nThe young Arteezy without hesitation shouted 'WHATEVER wHo cAREAS HAHA!' as he took Charlies hand. He noticed how soft Charlies hand was, the softness which comes from never working a day in your life. Arteezy was home.","tags":"#dota2#arteezy#rtz#nose#eg#young#charlie","favourites":26,"__v":0,"created_on":"2015-01-22T12:57:58.405Z","score":0.0003025754666994955}]