[{"_id":"564e3e8914bb47530dfef279","id":2379,"pasta":"(~(~(~(~(~( ʕっ•ᴥ•ʔっ )~)~)~)~)~) SLAMMIN'","tags":"#dota2#earthshaker#echoslam#slammin#fissure","favourites":31,"__v":0,"created_on":"2015-11-19T21:26:33.985Z","score":0.0003534708947070715},{"_id":"55ef465f496ad3a51db512ab","id":2119,"pasta":"Ｈｅｌｌｏ．　Ｉ　ａｍ　ｎｏｏｂｆｒｏｍｕａ．Ｉ　ｗａｎｔｅｄ　ｔｏ　ａｓｋ　ｉｆ　ｙｏｕ　ｇｉｖｅ　ｍｅ　ｐｅｒｍｉｓｓｉｏｎ　ｔｏ　ｓｏｍｅｔｉｍｅｓ　ｕｓｅ　ｙｏｕｒ　ｓｔｒｅａｍ　ｃｏｎｔｅｎｔ　ｉｎ　ｍｙ　ｙｏｕｔｕｂｅ　ｖｉｄｅｏｓ．","tags":"#dota2#noobfromua","favourites":44,"__v":0,"created_on":"2015-09-08T20:34:39.259Z","score":0.0003403727562103539},{"_id":"5508db5bb47c3d010fd9656f","id":1122,"pasta":"I hear \"ho ho, ha ha!\" in my sleep. I'm constantly on edge around short people. My dad was watching American Sniper this weekend and I had PTSD.","tags":"#dota2#fuck#sniper#hoho#haha","favourites":85,"__v":0,"created_on":"2015-03-18T01:54:44.085Z","score":0.0003371882258001768},{"_id":"54bf0ba02619c58503a1dc63","id":303,"pasta":"Guys, it's not nice to make fun of sing_sing. Being a gay player in the DOTA 2 scene is really hard sometimes because a lot of the guys are ugly. Plus, ever since he got kicked from C9 by known homophobe Envy (who insists that \"Futa isn't gay, it's Kawaii\"), he doesn't get to cuddle with AUI anymore and has to settle for Tucker \"The Fucker,\" who's really rough and makes him cry sometimes. ","tags":"#dota2#singsing#not#nice#gay#envy","favourites":100,"__v":0,"created_on":"2015-01-21T02:14:19.863Z","score":0.0003367655836464303},{"_id":"54b5fc11f6a1885137f43cf2","id":195,"pasta":"EE. I will be your bodygaurd at any major lan you attend. In fact I will protect all of C9. Seriously. I am a former pro fighter(undefeated) and I will happily punch Arise really hard for you. I just require transportation and Dota coaching. Pls no copy pastarino","tags":"#dota2#ee#eternalenvy#bodyguard#arise","favourites":98,"__v":0,"created_on":"2015-01-14T05:17:29.918Z","score":0.00032584567686642885},{"_id":"55106830e176d8400420cf53","id":1293,"pasta":"Shrapnel is named after Major-General Henry Shrapnel (1761–1842), a British artillery officer, whose experiments, initially conducted in his own time and at his own expense, culminated in the design and development of a new type of artillery shell ending with his famous catchphrase \"Hoho Haha\"","tags":"#dota2#sniper#henry#shrapnel#hoho#haha","favourites":80,"__v":0,"created_on":"2015-03-23T18:58:30.301Z","score":0.0003252171488696729},{"_id":"564e3e3a14bb47530dfef276","id":2376,"pasta":"17% LUCK OSfrog 17% SKILL OSfrog 17% CONCENTRATED POWER OF WILL OSfrog 17% PLEASURE OSfrog 17% PAIN OSfrog AND 17% REASON TO ABANDON THE GAME OSfrog","tags":"#dota2#twitch","favourites":28,"__v":0,"created_on":"2015-11-19T21:25:14.725Z","score":0.00032375782386050904},{"_id":"55552186d8a10121136da80a","id":1635,"pasta":"I want to turn into Luna's bodysuit\nShe wouldn't notice anything weird and wear me into the battle\nAnd then I would tease her naughty bits\nI would gently lick her nipples and play with her cunny\nNot too much though, just enough to get her aroused\nAs she would kill more enemies and get carried away by the slaughter I would increase my \"assault\"\nBy the end of the battle she would be very close and I would give her the pleasure of finishing the \"job\" herself, enjoying every last drop she let into me\nHowever, the story wouldn't end here\nMuch to her surprise, she wouldn't be able to take me off\nMultiple tongues I would've grown inside the suit would caress her plump breasts, stiff nipples, perfect tummy, fit ass and her clitoris\nI would grow two penises right inside the suit which would fill her unexperienced pussy and virgin ass\nThey would vibrate as she moaned and quivered around, helpless and increasingly aroused\nTwo pulsing penises inside her loin and tongues working every single inch of her body wouldn't take too long to bring her to another pleasant ending\nThat wouldn't be it yet though\nFor the last stage, I would begin to pump her with my penises while intensely vibrating around her erogenous zones\nAfter giving her yet another orgasm, I would turn back into a fat-ass self insert and run away","tags":"#dota2#luna#4chan#bodysuit","favourites":66,"__v":0,"created_on":"2015-05-14T21:42:30.687Z","score":0.00031982102968829487},{"_id":"54befef1e99bf86b74870e75","id":292,"pasta":"⋛⋋( ՞ਊ ՞)⋌⋚ CAW CAW ⋛⋋( ՞ਊ ՞)⋌⋚","tags":"#dota2#donger#caw#cawcaw#phoenix","favourites":94,"__v":0,"created_on":"2015-01-21T01:11:28.999Z","score":0.00031963663150761084},{"_id":"54b5d1ff8ba53a7c3326b4e6","id":156,"pasta":"Well, I'm ready with my can of Monster Energy. I've got my CyberPowerPC turned on and my BenQ screen picture quality is perfect. My Razer headphones sound authentic and my DesignByHumans hoodie is super comfortable. I'm fully supported by my NeedForSeat chair and my computer commands are super fast thanks to HyperX RAM. Clinton \"Fear\" Loomis, take it away!","tags":"#dota2#eg#bleedblue#sellout#fear#oldman","favourites":93,"__v":0,"created_on":"2015-01-14T02:15:00.815Z","score":0.00031169638318442286},{"_id":"554688bf92ac5d29444dfc8f","id":1574,"pasta":"It is TI5 grand finals, Secret vs C9. After 4 intense games, it is tied up at 2-2. All these chinese teams have been knocked out due to the meta change. Jacky had bleached his hair for this TI in preparation for what is to come.\nJacky closed his eyes and said, \"It is time Bone-chan\". He then opens his eyes with the fury of a thousand suns, he picked on Leshrac, Beastmaster, Phoenix, Crystal maiden and Kotl. He has prepared this strategy since the legendary \"6.84 patch day of doom\".\nHe all-chats: \"Artour, you have yet to see my final form.\" Artour replies: \"LMAO wHo cARES HAHA Xd\"\nEE farmed up Bloodstone, Loda's Orb, Octarine Core in 20 minutes on Leshrac and have taken their middle barracks. Jacky knows it, Artour knows it, the world knows it. It is time. It is time for the greatest spirit bomb that Dota2 has ever seen.\nC9 begins to push through middle line with 10 full couriers of enchanted mango. They are ready to finish the game. Jacky stands up in his booth as he blinks into the Secret base with his ultimate and Diabolic Edict turn on. \". FEED ME MANGOES, FEED ME MANGOES, FEED ME MANGOES, FEED ME MANGOES, yells Jacky. Phoenix casts Supernova, Kotl is channeling his wave of heal, CM channeling freezing field, BM roars onto Arteezy's OD.\nSecret cannot handle this death ball that Jacky has become. Artour's eyes are now glowing in fear. \"We cannot... we cannot go near him... His power level is just... We fucking lost\". Artour instantly purchases a second Midas and has given up. Puppey yelled at Artour to sell his midas and knocked some sense into him. Secret has decided to go for the couriers and support kills instead. So smart... So Smart...\nThe throne is now down to 200 hp, only Bone7 and EE is alive and both of them are on low on HP. Looking like a lifeless and dried up flower, Johan breathlessly says, \"We are out of mangoes Jacky...you have drained all our energy...\" \"Just a little bit more...\", Jacky whispers.\nBigdaddy, FATA- and Misery have all fainted in their seats as they are all out of energy.\n\"Bone-chan, all these throws you have committed over the years, it is time for me to cleanse your sins...\", EE uses his bloodstone and commits suicide, he sacrificed himself for Bone322's sins. Bone is now full life. Standing ovation from the crowd, LD has gone insane and repeatedly yells, \"WAOWWWWW!!! THE SUICIDE, THE SUICIDE\". Bone's last few auto attacks finishes off the throne as he also faints.\nJacky exits the booth, Secret is in disbelief, Artour is in BabyRage mode. It is over. Jacky walks out of his booth and rips the Aegis of Immortal out of GabeN's hands. Jacky walks up to Ar1se and smashes him in the head with the aegis. It is over... TI5... the last International, the greatest Esport tournament ever.","tags":"#EE#c9#throw9#TI5#mango#dota2#6.84#leshrac","favourites":66,"__v":0,"created_on":"2015-05-03T17:18:41.560Z","score":0.0003095144428741386},{"_id":"55cc12432ccec12862a3e7b8","id":1987,"pasta":"This is 17% luck, 17% skill, 17% concentrated power of will 17% pleasure; 17% pain, And a 17% reason to uninstall the game","tags":"#dota2#twitch","favourites":44,"__v":0,"created_on":"2015-08-13T03:42:59.973Z","score":0.00030639606826051563},{"_id":"5504fdc887d1bc685b1e9684","id":1028,"pasta":"It's time to get angry at 4K MMR players, the best time of the day. Every fucking day. I play scrims, I get depressed. Even though I win them. And then I play these 4k MMR games and I lose hope in humanity. That's my life. Every day. I play on my smurf and I lose hope in myself, and then I play on my main account and I lose hope in everybody else. And at the end of the day I have no friends. That's life. The life of Jacky Mao.","tags":"#dota2#ee#jacky#mao#angry#4k","favourites":74,"__v":0,"created_on":"2015-03-15T02:43:04.189Z","score":0.00029766230646953136},{"_id":"565b238414bb47530dfef2c1","id":2402,"pasta":"500k viewers on majors? ✓ 4Head 1970 graphics ✓ SoBayed full of 14 years old ✓ BrokeBack Prizepool smaller than their dick SeemsGood ✓  Must be League of Losers ✓ SeemsGood","tags":"#dota2#lol","favourites":23,"__v":0,"created_on":"2015-11-29T16:10:44.669Z","score":0.0002880497265693988},{"_id":"56038833dbbbe94d05d17510","id":2172,"pasta":"I TriHard SOLD TriHard COCAINE TriHard TO TriHard A TriHard PREGNANT TriHard GIRL TriHard IM TriHard NOT TriHard A TriHard DRUG TriHard DEALER TriHard IM TriHard A TriHard LIFE TriHard SAVER TriHard","tags":"#RTZ#Dota2#bestmusicNA","favourites":33,"__v":0,"created_on":"2015-09-24T05:20:51.877Z","score":0.00028389470436756707}]