[{"_id":"554913a7d51fb1666ee0bbf5","id":1589,"pasta":"Hey Twitch Chat, I'm trying to learn Undying and have a question about the skill build. Should I max Decay, like you all do sitting in your chairs all day and never going outside, Soul Rip, like every single copy pasta does to mah chat experience, or Tombstone, like you all deserved to be buried under?","tags":"#dota2#undying#twitch#chat#skillbuild","favourites":35,"__v":0,"created_on":"2015-05-05T18:55:30.736Z","score":0.0010046215626218398},{"_id":"5566b234dac4eb127bdadaaa","id":1680,"pasta":"I sexually identify as Spirit Breaker. Ever since I was a boy I dreamed of charging across the map and stunning the Radiant Creeps. People say to me that being Spirit Breaker is impossible and I'm fucking retarded but I don't care, I'm beautiful. I'm having plastic surgeons install horns, hooves, and 17% chance to bash on my body. From now on I want you guys to call me Barathrum and respect my right to bash you four times in a row. If you can't accept me you're a RNGesusphobe and need to check your bashing privileges. Thank you for being so understanding. ","tags":"#dota2#spiritbreaker#sexually#identify","favourites":25,"__v":0,"created_on":"2015-05-26T21:43:48.062Z","score":0.0009824809379322254},{"_id":"5549452c23421e5349f3c5ed","id":1590,"pasta":"乁༼◔‿◔✿༽ㄏ LOOK AT ME I HAVE GLIMMER CAPE 乁༼◔‿◔✿༽ㄏ","tags":"#dota2#rtz#glimmer#cape","favourites":34,"__v":0,"created_on":"2015-05-05T21:08:49.821Z","score":0.0009809746645111177},{"_id":"54bf0ba02619c58503a1dc63","id":303,"pasta":"Guys, it's not nice to make fun of sing_sing. Being a gay player in the DOTA 2 scene is really hard sometimes because a lot of the guys are ugly. Plus, ever since he got kicked from C9 by known homophobe Envy (who insists that \"Futa isn't gay, it's Kawaii\"), he doesn't get to cuddle with AUI anymore and has to settle for Tucker \"The Fucker,\" who's really rough and makes him cry sometimes. ","tags":"#dota2#singsing#not#nice#gay#envy","favourites":90,"__v":0,"created_on":"2015-01-21T02:14:19.863Z","score":0.0009679870216475384},{"_id":"556d613a36229374433ca3e6","id":1712,"pasta":"guys, I'm about to tell u a true story. I was a 300 mmr scrub and i was feeding every single game. then i watched rtz steam. i was amazed by the plays. now i always play shirtless, buy midas and bottlecrow regardless of the game and blast gangsta rap during my games. i quickly became 7k mmr top player and own hundreds of bugattis. thx artour\npermalink","tags":"#dota2#rtz#arteezy#shirtless#bugatti","favourites":22,"__v":0,"created_on":"2015-06-02T05:15:27.932Z","score":0.00096440830645467},{"_id":"5510b6e632d34a8e3c3ec406","id":1297,"pasta":"Dota's comeback mechanics are just genius, I think every sports needs to have similar mechanics in the future. For example in football your goal could be made bigger by moving the goalposts if your team is winning a lot. Or maybe they could count one goal as two goals for the team that is behind. Or maybe punish leading team more for their mistakes. Red card instead of yellow and so on.\nI think comeback mechanics are the future of all competitions, as they make watching much more pleasant experience since you can't be sure if the best team wins or loses.","tags":"#dota2#comeback#satire#football","favourites":54,"__v":0,"created_on":"2015-03-24T00:39:29.761Z","score":0.0009629710318813334},{"_id":"55628ec4d2c875b036466655","id":1676,"pasta":"ＨＥＹ ＢＲＵＮＯ， Ｉ＇Ｍ ＴＲＹＩＮＧ ＴＯ ＬＥＡＲＮ ＴＯ ＰＬＡＹ ＳＰＩＲＩＴ ＢＲＥＡＫＥＲ． Ｉ ＪＵＳＴ ＨＡＶＥ Ａ ＱＵＥＳＴＩＯＮ ＡＢＯＵＴ ＴＨＥ ＳＫＩＬＬ ＢＵＩＬＤ： ＳＨＯＵＬＤ Ｉ ＭＡＸ ＣＨＡＲＧＥ ＬＩＫＥ ＹＯＵ ＣＨＡＲＧＥＤ ＡＷＡＹ ＦＲＯＭ ＵＳ， ＥＭＰＯＷＥＲＩＮＧ ＨＡＳＴＥ ＳＯ Ｉ ＣＡＮ ＲＵＮ ＦＡＳＴ ＬＩＫＥ ＹＯＵ ＤＩＤ ＦＲＯＭ ＵＳ， ＯＲ ＧＲＥＡＴＥＲ ＢＡＳＨ ＬＩＫＥ ＹＯＵ ＢＡＳＨＥＤ ＯＵＲ ＨＯＰＥＳ ＯＦ ＨＥＡＲＩＮＧ ＹＯＵ ＣＡＳＴ Ａ ＧＡＭＥ ＯＦ ＤＯＴＡ ２ ＡＧＡＩＮ． ＯＲ ＳＨＯＵＬＤ Ｉ ＭＡＸ ＳＴＡＴＳ， ＬＩＫＥ ＴＨＥ ＳＴＡＴＳＭＡＮ ＹＯＵ ＯＮＣＥ ＷＥＲＥ．","tags":"#dota2#bruno#spiritbreaker","favourites":26,"__v":0,"created_on":"2015-05-22T21:19:00.121Z","score":0.0009615049803633195},{"_id":"54b5fc11f6a1885137f43cf2","id":195,"pasta":"EE. I will be your bodygaurd at any major lan you attend. In fact I will protect all of C9. Seriously. I am a former pro fighter(undefeated) and I will happily punch Arise really hard for you. I just require transportation and Dota coaching. Pls no copy pastarino","tags":"#dota2#ee#eternalenvy#bodyguard#arise","favourites":92,"__v":0,"created_on":"2015-01-14T05:17:29.918Z","score":0.0009478996859561196},{"_id":"553bf3ad0623c068248e4aab","id":1523,"pasta":"ヽ(◉◡◔)ﾉ MY NAME IS PUPPEY, I DONT BAN SNIPER CUZ IM COOL ヽ(◉◡◔)ﾉ","tags":"#dota2#puppey#secret#alliance#starladder","favourites":37,"__v":0,"created_on":"2015-04-25T10:15:10.734Z","score":0.0009409822881898688},{"_id":"55b193b389b52e986e2b40d9","id":1908,"pasta":"ＨＥＹ ＬＥＡＦＡＴＯＲ Ｉ ＡＭ ＴＲＹＩＮＧ ＴＯ ＡＮＣＩＥＮＴＳ ＮＥＣＲＯ． Ｉ ＪＵＳＴ ＨＡＶＥ Ａ ＱＵＥＳＴＩＯＮ ＡＢＯＵＴ ＴＨＥ ＳＫＩＬＬ ＢＵＩＬＤ． ＳＨＯＵＬＤ Ｉ ＭＡＸ ＳＡＤＩＳＴ， ＬＩＫＥ ＹＯＵ ＳＡＤＩＳＴＩＣＡＬＬＹ ＰＯＳＴＥＤ ＹＯＵＲ ＧＵＩＤＥ，ＤＥＡＴＨ ＰＵＬＳＥ， ＳＯ Ｉ ＣＡＮ ＦＥＥＬ ＬＩＫＥ ＮＥＣＲＯ＇Ｓ ＷＩＮＲＡＴＥ ＷＨＥＮ ＩＴ ＤＲＯＰＰＥＤ, ＯＲ ＨＥＡＲＴＳＴＯＰＰＥＲ ＡＵＲＡ， ＬＩＫＥ ＭＹ ＨＥＡＲＴ ＳＴＯＰＳ ＥＶＥＲＹ ＴＩＭＥ Ｉ ＳＥＥ ＡＮ ＡＮＣＩＥＮＴＳ ＮＥＣＲＯ？","tags":"#dota2#necro#necrophos#ancients","favourites":7,"__v":0,"created_on":"2015-07-17T21:31:37.092Z","score":0.0009394041821950665},{"_id":"553bf3ca0623c068248e4aad","id":1525,"pasta":"HEY, GABEN, I'M TRYING TO LEARN TO PLAY ALCHEMIST. I JUST HAVE A QUESTION ABOUT THE SKILL BUILD: SHOULD I MAX HIS STUN LIKE YOU STUNNED THE WHOLE FANBASE WITH THE DECISION TO INTRODUCE MODS YOU HAVE TO PAY FOR, ACID SPRAY TO BURN MY ENEMIES LIKE THE MODDING COMMUNITY GOT BURNED BY TRUSTING YOU, GREEVIL'S GREED LIKE THE GREED THAT MADE YOU GIVE THE MODDERS ONLY 25% OF WHAT YOU CHARGE, OR CHEMICAL RAGE LIKE THE REACTION OF THE COMMUNITY TO YOUR DECISION?","tags":"#valve#dota2#bethesda#modgate#gaben","favourites":34,"__v":0,"created_on":"2015-04-25T17:06:01.865Z","score":0.0008777794421725713},{"_id":"558e468263aff1a558465ef9","id":1811,"pasta":"Do you know what time is it? I just bought my manta style so it's 3 AM. ༼⌐■ل͟■༽༼⌐■ل͟■༽༼⌐■ل͟■༽ ","tags":"#Dota2#mantastyle#op","favourites":12,"__v":0,"created_on":"2015-06-26T13:17:36.792Z","score":0.0008736550015174313},{"_id":"55b5413989b52e986e2b40f0","id":1916,"pasta":"JESUS FUCKING CHRIST THIS IS THE MOST RIDICULOUS DISPLAY OF SKILL I'VE EVER SEEN IN MY LIFE. I CAN'T BELIEVE I'M WATCHING THIS MAKING OF HISTORY LIVE.\nHe fucking FORCE STAFFED AN ILLUSION for a last hit onto an enemy Lion instead of rocketing him. He BLIND HOOKED A LUNA 15 SECONDS AFTER LOSING VISION. Using blademail to kill a sandstorming SK. What IS THIS MADNESS.","tags":"#dota2#MIRACLE\n","favourites":6,"__v":0,"created_on":"2015-07-19T20:52:02.804Z","score":0.0008653117431624561},{"_id":"54b5d1ff8ba53a7c3326b4e6","id":156,"pasta":"Well, I'm ready with my can of Monster Energy. I've got my CyberPowerPC turned on and my BenQ screen picture quality is perfect. My Razer headphones sound authentic and my DesignByHumans hoodie is super comfortable. I'm fully supported by my NeedForSeat chair and my computer commands are super fast thanks to HyperX RAM. Clinton \"Fear\" Loomis, take it away!","tags":"#dota2#eg#bleedblue#sellout#fear#oldman","favourites":82,"__v":0,"created_on":"2015-01-14T02:15:00.815Z","score":0.0008596484339559101},{"_id":"55c05fb9ccc3f041309573ef","id":1964,"pasta":"PLIIZ STAHP SPAMMING!!!! I want to have nice conversations about strats and itembuilds here!!! DON'T SPAM SHIT PLIZ!!!","tags":"#twitch#nospam#Dota2","favourites":3,"__v":0,"created_on":"2015-08-04T06:46:17.456Z","score":0.0008486139811455276}]