[{"_id":"54ce925b574e442b035d5fc5","id":651,"pasta":"Scientists have been pondering for ages how the universe keeps expanding, when by chance they were watching a televised Dota 2 tournament... suddenly they realized - it's iceiceice creating space","tags":"#dota2#scientists#universe#iceiceice#space#created","favourites":77,"__v":0,"created_on":"2015-02-01T15:17:04.497Z","score":0.0002776416979392309},{"_id":"555687d1db837b14022dba88","id":1637,"pasta":"(This message has been brought to you in part by theScore | eSports, Vulcun, G2A, 100 TB, and G1 Gaming by GIGABYTE)","tags":"#dota2#bts#sellout#vulcan","favourites":55,"__v":0,"created_on":"2015-05-15T16:54:28.747Z","score":0.0002746878384929522},{"_id":"5742a35b709549ef048c4b6e","id":2779,"pasta":"༼ ▀̿̿Ĺ̯̿̿▀̿ ̿ ༽ ʕ ͡•ᴥ ͡• ʔ ༼ ▀̿̿Ĺ̯̿̿▀̿ ̿ ༽ PROTECT THE BEAR !!!","tags":"#bear#dota2#protect","favourites":3,"__v":0,"created_on":"2016-05-23T06:29:47.985Z","score":0.00027389123491545776},{"_id":"551076e5e176d8400420cf56","id":1294,"pasta":"ＨＥＹ Ｓ４， Ｉ＇Ｍ ＴＲＹＩＮＧ ＴＯ ＬＥＡＲＮ ＴＯ ＰＬＡＹ ＭＡＧＮＵＳ． Ｉ ＪＵＳＴ ＨＡＶＥ Ａ ＱＵＥＳＴＩＯＮ ＡＢＯＵＴ ＴＨＥ ＳＫＩＬＬ ＢＵＩＬＤ： ＳＨＯＵＬＤ Ｉ ＭＡＸ ＳＨＯＣＫＷＡＶＥ ＬＩＫＥ ＹＯＵ ＳＨＯＣＫＥＤ ＥＶＥＲＹＯＮＥ ＷＨＥＮ ＹＯＵ ＬＥＦＴ ＡＬＬＩＡＮＣＥ， ＳＫＥＷＥＲ ＳＯ Ｉ ＣＡＮ ＥＳＣＡＰＥ ＬＩＫＥ ＹＯＵ ＥＳＣＡＰＥＤ ＡＬＬＩＡＮＣＥ， ＯＲ ＥＭＰＯＷＥＲ ＳＯ Ｉ ＣＡＮ ＣＬＥＡＶＥ ＬＩＫＥ ＹＯＵ ＣＬＥＡＶＥＤ ＬＯＤＡ＇Ｓ ＨＥＡＲＴ","tags":"#dota2#s4#learn#magnus#skill#build","favourites":65,"__v":0,"created_on":"2015-03-23T20:05:21.369Z","score":0.0002729108222655339},{"_id":"54bf21222d74781f04a603ac","id":332,"pasta":"Hello Bulba, this is your mother. I write here to inform you that your father and I do not approve of your timewaste playing childrens game for the internet. Therefore we are sending you to India to marry your beautiful cousin Venkatanarasimharajuvaripeta and work as a train conductor.","tags":"#dota2#bulba#mother#childrens#games#india#train","favourites":75,"__v":0,"created_on":"2015-01-21T03:42:05.992Z","score":0.0002642733217518104},{"_id":"56dfacf0709549ef048c4874","id":2514,"pasta":"OMGScoots MEN LIE OMGScoots WOMEN LIE OMGScoots STATS DONT OMGScoots","tags":"#dota2#mafia#nahaz#stats","favourites":9,"__v":0,"created_on":"2016-03-09T04:56:16.189Z","score":0.0002629554685412224},{"_id":"556923a9ba095caa758c0ef8","id":1690,"pasta":"(ง╭ರ_•́)ง We politely ask for this game to be started for alas we will stir up a ruckus (ง╭ರ_•́)ง","tags":"#dota2#bts#ruckus#start#game","favourites":49,"__v":0,"created_on":"2015-05-28T19:02:37.751Z","score":0.0002590500537899139},{"_id":"5510b6e632d34a8e3c3ec406","id":1297,"pasta":"Dota's comeback mechanics are just genius, I think every sports needs to have similar mechanics in the future. For example in football your goal could be made bigger by moving the goalposts if your team is winning a lot. Or maybe they could count one goal as two goals for the team that is behind. Or maybe punish leading team more for their mistakes. Red card instead of yellow and so on.\nI think comeback mechanics are the future of all competitions, as they make watching much more pleasant experience since you can't be sure if the best team wins or loses.","tags":"#dota2#comeback#satire#football","favourites":61,"__v":0,"created_on":"2015-03-24T00:39:29.761Z","score":0.0002587509254219204},{"_id":"552e844541157097494d180e","id":1463,"pasta":"Friend who is a regular player began to play less and less since the patch hit. As the days went on the steam messages I would get from him became more and more nonsensical and unintelligible. The last time I heard from him was three weeks ago now and the only thing he said was \"Ho Ho Ha Ha\".","tags":"#dota2#patch#hoho#haha#sniper","favourites":55,"__v":0,"created_on":"2015-04-15T13:24:01.481Z","score":0.00025190822552050246},{"_id":"55b960dea92005fc4d048602","id":1927,"pasta":"░░░░░░░░░░░░░░░▄▀▄░░░░░░░░░░░░░░░ ░░░░░░░░░░░░░▄▀░░░▀▄░░░░░░░░░░░░░ ░░░░░░░░░░░▄▀ Kappa ▄▀█░░░░░░░░░░░░░ ░░░░░░░░░▄▀ Kappa ▄▀░▄▀░▄▀▄░░░░░░░░░ ░░░░░░░▄▀ Kappa ▄▀░▄▀░▄▀ Kappa ▀▄░░░░░░ ░░░░░░░█▀▄ Kappa ▀█░▄▀ Kappa Kappa ▀▄░░░░ ░░░▄▀▄░▀▄░▀▄ Kappa ▀ Kappa ▄█▄ Kappa ▀▄░░░ ░▄▀░░░▀▄░▀▄░▀▄░ Kappa ▄▀░█░▀▄ Kappa ▀▄░ ░█▀▄ Kappa ▀▄░█▀ Kappa Kappa ▀█░▀▄░▀▄░▄▀█ ░▀▄░▀▄ Kappa ▀ Kappa ▄█▄ Kappa ▀▄░▀▄░█░▄▀░ ░░░▀▄░▀▄░ Kappa ▄▀░█░▀▄ Kappa ▀▄░░▀█▀░░ ░░░░░▀▄░▀▄░▄▀░▄▀░█▀ Kappa ▄▀█░░░░░░░ ░░░░░░░▀▄░█░▄▀░▄▀ Kappa ▄▀░▄▀░░░░░░░ ░░░░░░░░░▀█▀░▄▀ Kappa ▄▀░▄▀░░░░░░░░░ ░░░░░░░░░░░░░█▀▄░▄▀░▄▀░░░░░░░░░░░ ░░░░░░░░░░░░░▀▄░█░▄▀░░░░░░░░░░░░░ ░░░░░░░░░░░░░░░▀█▀░░░░░░░░░░░░░░░:","tags":"#Kappa#dota2#singsing#mods#core54#nazi#ascii","favourites":37,"__v":0,"created_on":"2015-07-29T23:25:18.540Z","score":0.00025072831259570505},{"_id":"55c6e04c93639d8d333a6438","id":1982,"pasta":"Haiiiiiii! ^____^ It's your kawaii Queen of Pain-chan desu-ne!!! (◕‿◕✿) I've been picked sooo many times at TI5 KYAAAAA!! >‿< my voice is sore, but that's fine because I'm the kind of gal who likes to get hurt! Can't wait to see you next game!!","tags":"#dota2#international#ti#flower#qop#qopypasta","favourites":35,"__v":0,"created_on":"2015-08-09T05:08:28.011Z","score":0.0002482365926999274},{"_id":"5716387f709549ef048c4a76","id":2717,"pasta":"OSfrog Give a man balance and he will quit after a patch, OSfrog give him unbalance and he will wait for balance for the rest of his life OSfrog\n","tags":"#dota2#icefrog","favourites":5,"__v":0,"created_on":"2016-04-19T13:54:07.680Z","score":0.0002478244020146247},{"_id":"54d81ddcb898625b08cd362a","id":741,"pasta":"i expect us to win every lan\" - s4 2015","tags":"#dota2#s4#lan#tournament","favourites":63,"__v":0,"created_on":"2015-02-09T02:36:25.354Z","score":0.00023856379037157547},{"_id":"567663a1c41d20f176ef7112","id":2442,"pasta":"The big day had finally arrived for Jacky Mao. He had scheduled this appointment 8 months in advance, anticipating how busy it would be. His flight to Seattle from Malaysia had been smooth, but the drive to the Valve Headquarters from had been a constant stutter; traffic had not made it easy on him. The traffic wasn’t all bad though. He had been able to sit in the back of the cab and phone his partners. This endeavorer was too important and Jacky knew he couldn’t do it alone.\nHe had called his most trustworthy. They had struggled through the days of DOTA together, scrambling to master the various heroes that the game had presented. For too long, one of these heroes had been neglected and this demanded action. The cab stopped suddenly. Jacky had been so lost in his thoughts that he didn’t realize they had now arrived.\n“That’ll be 48.07.” The cab driver, a middle eastern boy, told him over his shoulder.\n“Are you even old enough to drive?”\n“I’m like 15. Please go kill yourself.”\nJacky just handed him the money and got out of the cab. What was he thinking getting in a cab with someone so young? His driving had been reckless too. It was either by a large amount of luck or skill that they hadn’t crashed. He shook his head and walked up the steps towards the lobby. He needed to focus. Today was the day;Today was his day.\nHe walked right up to the secretaries desk and stood, waiting for her to acknowledge him. After about a minute, she looked up at him. “Sorry I was just finishing something. Can I help you?”\n“I am here to see Icefrog. I have an appointment. My name is Jack-” “Sorry I can’t really understand you. Let me get a translator.” “But I am speaking English.” Jacky waited while she called someone.\n“Hello? Yes I need a translator. Well it sounds like English, but it sounds like a really mumbled, gargled version of it. Oh... You think so? Ok!” The secretary looked back at Jacky. “Are you Eternal Envy?” He started to speak but she cut him off. “Its ok. Just nod.”\nJacky didn’t like her condescending tone, but he had to be on his best behavior today. He nodded, complying with her odd request.\n“Great! Icefrog will see you now! Just head on up. I am sure you know the floor.”\nJacky moved towards the elevators, the knot in his stomach growing. You can do this, he told himself, don’t let all this planning go to waste. The door closed as Jacky pushed the button for the 6th floor. He tapped his foot nervously as the elevator rose. When the bell dinged and the door opened he was greeted by a horrific sight.\n“Hello Jacky”\n“Hi Henrik”\nThey passed by each other; Jacky moved into the hallway and Henrik into the elevator. For a moment, he thought he would escape without having to engage him in conversation.\n“Hey Jacky, good luck in there. After what I just did, you are going to need it.” Henrik grinned maniacally, a deep throaty chuckle accompanying his words. Jacky’s adams apple bobbed as he swallowed. There was a reason he was called King Dong, Admiral Bulldong, the donger, the list of names went on. His ability to stimulate from every angle was renowned, and his sexual prowess had even allowed him to seduce Jacky’s most precious companion, Xiituzi. I bet she high-five’d him afterwards Jacky thought to himself. He shook those thoughts out of his head. He might not be able to compare to the Bulldong alone, but he wasn’t alone. Teamwork had garnered them many accomplishments before, and it would again. Confident as ever, Jacky marched forward and knocked on door 686.\n“Come in.” A slight accent graced the words.\nJacky walked into the room, leaving the door behind him open. It was cold and damp, perfect for an amphibian of Icefrog’s preferences. Icefrog stood in front of a wide window that gave a wonderful view of downtown Seattle. “Hello Jacky.”\n“Hello Icefrog.” Envy searched for a compliment. “Nice suit.”\n“Thanks! You like it? I bought it from Argentina, and had Unknown bring it to me in Frankfurt. I love South American teams, they will do anything to get in a tournament, and I do mean anything.” A devious grin grew on Icefrog’s face as he said this. This brought them to the key point of their meeting. “So Jacky, what do you want for Christmas, and what are you willing to do for it?”\nJacky breathed in and out deeply for a few moments. He looked Icefrog straight in the eyes and then whispered, “I want a Terrorblade buff.”\nIcefrog wolf whistled slowly. “Jacky, that ain’t gonna be easy. I mean, hell, he hasn’t been touched at all this patch, and he isn’t all that prominent in pubs. Don’t get me wrong, the sexcapades with you, Loda, and Black were good enough to earn a minor rework of the hero, but to get a straight buff is gonna take a lot more, and unless Arteezy suddenly taught a whole lot of people how to play riki, you are all alone here. What could you possibly do to satisfy my sexual appetites?”\nThis was his moment. He whipped out his phone and pushed a button. Suddenly, a rapid pinging noise filled the room. “What the hell?” Icefrog shouted, covering his ears as he did so. When the pinging had stopped, four other people had joined them in the room. “Hello Puppan, Pie, Misery.” Icefrog nodded to these familiar faces, but one was not so familiar. “And who is this?” he asked.\n“This is w33.” Puppey began to explain.\n“I knew that Clement. What I really meant was, why should I care?” He didn’t wait for an answer, just continuing his rant. “Let’s face it boys. I just had a twelve hour orgy with all of OG. And let me tell you, despite that terrible music that Moonmeander insisted on listening to every time he came, that most definitely stands for Olympic Gays. What could you guys possibly do to compete with them?”\nThe four of them didn’t even respond. Instead, they gathered around w33ha and began chanting in unison. “KeepoKappaKeepoKappaKeepoKappaKeepoKappa.”\nIcefrog shook his head in disbelief. What were these idiots doing? His eyes narrowed in suspicion. Where w33ha had once stood, there now seemed to be two of him. Now three. Four! Could it be?\nThey finished their chanting and turned to face Icefrog. The Argentinian suit had already been stripped off and thrown against the wall. It was time to begin.\n24 hours later, and after many screams of plz mr lizard, Icefrog emerged from the pile of bodies, and began dressing himself. Even Admiral Bulldog and his ability to push all of Icefrog’s spots simultaneously couldn’t compete with that level of coordination; not just the coordination between the teammates, but also between what he had begun to affectionally call the w33pos.\n“Well boys, you did good. I’ll give terrorblade an extra 2 base armor, and..”\nThe group holds their breath.\n“I’ll buff his strength gain to two strength per level.”\nEnvy let out a happy cheer and, from where he lay on the office floor, he pumped his fist in the air. It was worth it. Even when Icefrog took out the weird Aghanim’s scepter dildo to try to create another w33po, it was worth it.","tags":"#dota2#IceFrog#EternalEnvy#ee","favourites":16,"__v":0,"created_on":"2015-12-20T08:15:29.859Z","score":0.00023648825962358126},{"_id":"55bac082a92005fc4d048618","id":1941,"pasta":"PogChamp WTF PogChamp 3 MERLINIS PogChamp HOW IS THAT EVEN POSSIBLE?? PogChamp WTF PogChamp 3 MERLINIS PogChamp HOW IS THAT EVEN POSSIBLE?? PogChamp WTF PogChamp","tags":"#merlini#dota2#twitch","favourites":34,"__v":0,"created_on":"2015-07-31T00:25:38.021Z","score":0.0002340746069899282}]