[{"_id":"54c13a215764903a32880216","id":492,"pasta":"Charlie first noticed Arteezy among a group of young boys. Arteezy's monstrous nose and sharp blue eyes spoke of a freakish talent that lay hidden in the young boy. Charlie approached him, 'I have an offer for you son. I can give you a life. A life with purpose. With meaning. I will show you the world. I will turn you into a man, a man you can be proud of. You and that monstrous nose will carry EG. Will carry the pile of shit known as NA Dota. You won't have to practice. You won't have to scrimm. We'll still pay you a monthly salary. You will be known as A-God. Look deep inside yourself son, is this what you want?'\n \nThe young Arteezy without hesitation shouted 'WHATEVER wHo cAREAS HAHA!' as he took Charlies hand. He noticed how soft Charlies hand was, the softness which comes from never working a day in your life. Arteezy was home.","tags":"#dota2#arteezy#rtz#nose#eg#young#charlie","favourites":26,"__v":0,"created_on":"2015-01-22T12:57:58.405Z","score":0.000332646460366925},{"_id":"54e36eef89c96e65288919ff","id":824,"pasta":"I'm worried for SingSing. He's been streaming for 14 hours or some shit. Before that he slept for four hours, and before that he streamed for 17 hours. Before that he did something similar. I was just at his house to bring him a homemade cake, but it was in the shape of kappa and he did not like it. The stream just keeps going and I don't know what to do anymore. Sometimes I go flame Tucker but it is no good. Now I just sit here and watch the stream and all I can do is pray that it will be alright.","tags":"#dota2#singsing#tucker#worried#streaming","favourites":21,"__v":0,"created_on":"2015-02-17T16:05:35.850Z","score":0.00032454303134103095},{"_id":"54f9d57b87d1bc685b1e962b","id":987,"pasta":"Hello I'm Synderen. I sexually Identify as a pig molester. Ever since I was a boy I dreamed of walking through pigsties, diddling sexy piglets. People say to me that having sex with pigs is illegal and I'm retarded but I don't care, I'm Danish. I'm moving back to Denmark so I can marry my favorite pig, which I've always fantasized about.","tags":"#dota2#synderen#sexually#identify#pig","favourites":18,"__v":0,"created_on":"2015-03-06T14:54:48.799Z","score":0.00031861189916817324},{"_id":"54d30e3e01ae2be31cb3df6a","id":700,"pasta":"This is what's wrong with Twitch. Just because of this cute asian girl called \"sing_sing\" is showing off her body and cute voice, horny teenagers are donating to her. Remember the times when twitch was an actual game stream platform where we watched professional players and not noob girls like this \"sing\"?","tags":"#dota2#twitch#wrong#singsing#asian#girl","favourites":22,"__v":0,"created_on":"2015-02-05T06:23:27.483Z","score":0.0003122836337225996},{"_id":"552454ddf13e0576299e163e","id":1423,"pasta":"I'm really enjoying Xyclopz's take on this draft. When he pointed out ching chong chang I wasn't sure but then he said bing ting tang and I could see his point of view. When he called the bingalingting that was when I knew he was a genius.","tags":"#xyclopz#SEA#Caster#Dota2","favourites":13,"__v":0,"created_on":"2015-04-07T19:00:48.828Z","score":0.00030836117182113826},{"_id":"54ea279cc200ce525fb25d93","id":894,"pasta":"Tbh, a long time ago when I had like 1.6k hours or smth, I was playing support lion, I zoned the enemy offlane, ganked and killed mid twice and stacked ancients and big camps 3 times each in 15minutes and our team was stomping, after getting the 1st barracks our carry started bragging with things like \"I'm so good at this game\" \"Look at my farm, I'm so pro\" and \"I can even carry these 4 retard to an easy win\" when he said the last one I sold everything I had, bought 2 rapiers, fed myself to the enemy, left the game and gladly watched the enemy team coming back and winning, I played my low priority games laughing, felt good.","tags":"#dota2#intentional#feeding#feed#support#lion","favourites":19,"__v":0,"created_on":"2015-02-22T18:02:37.082Z","score":0.0003075236605981907},{"_id":"54ee113610b7396256d9cbf0","id":915,"pasta":"I sexually identify myself as a twitch chat spammer. I'm always posting shitty copypastas here because I'm 50 year old fat virgin with no job, no friends, no pussy and my dick is only 0.322 centimeters. I'm still living with my mother. She is better at playing dota than me and she started last week. That is because i dont have life. I dont have my desktop anymore because i had spammed too long copypastas about tucker in BTS and got life-long spam. I raged and sat on my poor comp. Now i only have a shitty hp laptop with windows 95. Pls kids dont copypaste this message so you dont become life me. ","tags":"#dota2#sexually#identify#spammer#bts#virgin","favourites":18,"__v":0,"created_on":"2015-02-25T17:57:13.608Z","score":0.00029927726380467415},{"_id":"5525e21c7ca4658f518f3fe1","id":1430,"pasta":"Ｈｉ Ｄａｒｕｄｅ. Ｍｙ ｄａｄ ａｌｗａｙｓ ｔｏｌｄ ｍｅ ｔｈｉｓ ｓｔｏｒｙ ｗｈｅｒｅ ｈｅ ｓａｉｄ ｈｅ ｗａｓ ｂａｃｋｓｔａｇｅ ａｔ ａ ｃｌｕｂ ａｎｄ ｗａｌｋｅｄ ｕｐ ｔｏ ａ ＤＪ ｐｅｒｆｏｒｍｉｎｇ Ｓａｎｄｓｔｏｒｍ. Ｍｙ ｄａｄ ｈａｔｅｄ ｔｈｅ ｓｏｎｇ ａｎｄ ｔｏｌｄ ｔｈｅ ＤＪ ｔｈａｔ ｉｔ ｗａｓ ｒｅｐｅｔｉｔｉｖｅ ａｎｄ ｃｏｕｌｄｎ＇ｔ ｕｎｄｅｒｓｔａｎｄ ｗｈｙ ｐｅｏｐｌｅ ｌｉｋｅｄ ｉｔ. Ｇｅｔｔｉｎｇ ａ ｗｅｉｒｄ ｌｏｏｋ ｆｒｏｍ ｔｈｅ ＤＪ ｍｙ ｄａｄ ｒｅｔｕｒｎｅｄ ｂａｃｋｓｔａｇｅ ａｎｄ ｔａｌｋｅｄ ｔｏ ｔｈｅ ｍａｎａｇｅｒ ｗｈｏ ｔｈｅｎ ｉｎｆｏｒｍｅｄ ｈｉｍ ｔｈａｔ ｔｈｅ ＤＪ ｈｅ ｉｎｓｕｌｔｅｄ ｗａｓ ｉｎ ｆａｃｔ ｙｏｕ. Ｄｏ ｙｏｕ ｒｅｍｅｍｂｅｒ ｔｈｉｓ ｂｙ ａｎｙ ｃｈａｎｃｅ？ Ｍｙ ｄａｄ ｆｅｌｔ ｐｒｅｔｔｙ ｂａｄ ａｎｄ ｗｏｕｌｄ ａｐｏｌｏｇｉｚｅ ｉｆ ｇｉｖｅｎ ｔｈｅ ｃｈａｎｃｅ ｓｏ Ｉ＇ｍ ｄｏｉｎｇ ｉｔ ｏｎ ｂｅｈａｌｆ ｏｆ ｈｉｍ. Ｉ ｏｎ ｔｈｅ ｏｔｈｅｒ ｈａｎｄ ｈａｐｐｅｎ ｔｏ ｌｉｋｅ Ｓａｎｄｓｔｏｒｍ ａｎｄ ａｐｐｒｅｃｉａｔｅ ｉｔｓ ｍａｓｔｅｒｙ ｏｆ ｔｈｅ ｄａｎｃｅ ｓｃｅｎｅ. Ｔｈａｎｋ ｙｏｕ！","tags":"#darude#sandstorm#dota2#lol#general","favourites":12,"__v":0,"created_on":"2015-04-09T01:52:32.033Z","score":0.0002901061798613561},{"_id":"54befb41e99bf86b74870e72","id":291,"pasta":"There was once a Magnus. The weight of the world was on his shoulders. He heard the words of his commander in his ears: \"No pressure. All we need is a 5 man RP.\" The magnus stood with his horn held high. He knew it was his time. This was his day. Blink at the ready, finger on R, he called out to his comrades, \"Affirmative.\" Such is the legend of Bangfish.","tags":"#dota2#magnus#bangfish#5#man","favourites":22,"__v":0,"created_on":"2015-01-21T01:02:43.509Z","score":0.00028518793824328635},{"_id":"54bf25b72d74781f04a603b9","id":339,"pasta":"people really need to stop buying midas unless they truly understand how the item works.. im not trying to sound cocky or anything but FUCK","tags":"#dota2#arteezy#rtz#stop#buying#midas","favourites":21,"__v":0,"created_on":"2015-01-21T04:02:34.005Z","score":0.0002740219957088424},{"_id":"54c150395764903a3288021f","id":498,"pasta":"RAVAGE 人人人人人 ╲⊚益⊚╱ 人人人人人","tags":"#dota2#tidehunter#ravage","favourites":20,"__v":0,"created_on":"2015-01-22T19:09:42.756Z","score":0.0002650394565331898},{"_id":"550c39ca2ab05ce134dd328b","id":1241,"pasta":"I just don't get why people think twitch chat is funny. Maybe if I was like 15 and baked. Like how is it funny whenever they interview Chinese players for everyone to spam CHING CHONG for 5 minutes? Like does anyone really find that fucking funny? I mean you've got hundreds of people at once doing this stupid shit. SingSings stream is even more insane, it feels like 5000 people with tourettes just trying to say the most bluntly offensive things they possibly can for no reason. I don't get it at all, it's fucking stupid and a huge waste of time.","tags":"#twitch#antipasta#funny#baked#dota2","favourites":13,"__v":0,"created_on":"2015-03-20T12:24:00.880Z","score":0.0002646801695012748},{"_id":"54bf609e3b0a330105ff5c18","id":387,"pasta":"Ｊａｃｋｙ　Ｍａｏ，　ｔｈｉｓ　ｉｓ　Ａｒｔｏｕｒ’ｓ　ｍｏｔｈｅｒ．　Ｄｏ　ｙｏｕ　ｋｎｏｗ　ｗｈｅｒｅ　ｈｅ　ｉｓ　ｒｉｇｈｔ　ｎｏｗ？　Ｉ　ｃａｎ’ｔ　ｒｅａｃｈ　ｈｉｓ　ｐｈｏｎｅ．　Ｈｅ　ｌｅｆｔ　ｔｗｏ　ｈｏｕｒｓ　ａｇｏ　ｓｉｎｇｉｎｇ　Ｔｅｌｅｔｕｂｂｉｅｓ　ｍａｉｎ　ｔｈｅｍｅ．　Ｉ　ｔｈｉｎｋ　ｈｅ　ｗｅｎｔ　ｉｎｓａｎｅ．　Ｐｌｅａｓｅ　ｃｏｎｔａｃｔ　ｍｅ　ｉｆ　ｙｏｕ’ｌｌ　ｋｎｏｗ　ｓｏｍｅｔｈｉｎｇ　ａｂｏｕｔ　ｙｏｕｒ　ｂｏｙｆｒｉｅｎｄ　ａｎｄ　ｎｏ　ｃｏｐｙｐａｓｔｅｒｉｎｏ　ｓｅａｓａｍｉｎｏ　ｅｌｍｅｒｉｎｏ","tags":"#dota2#arteezy#rtz#eternalenvy#ee","favourites":20,"__v":0,"created_on":"2015-01-21T08:14:53.539Z","score":0.0002628208671455975},{"_id":"54cbfad122b71eb66af9d22b","id":627,"pasta":"\"Gleb peek mi storm\"\n\"Gleb peek mi poodka\"\n\"I Gleb, I peek techiss.\"\n\"Gleb, peek mi tha wenge, I weel kerry.\"\n\"Gleb, peek mi rokman I toss u\"\n\"OK good dreft tim excellent stretigy\"","tags":"#dota2#gleb#techies","favourites":18,"__v":0,"created_on":"2015-01-30T20:26:29.612Z","score":0.00025335129730487134},{"_id":"54bf3b033b0a330105ff5bd3","id":359,"pasta":"Hey LD ( ° ͜ʖ͡°)╭∩╮","tags":"#dota2#hey#LD#donger","favourites":19,"__v":0,"created_on":"2015-01-21T05:33:28.180Z","score":0.0002510799106392746}]