[{"_id":"5622fcb884d2175224d8533d","id":2249,"pasta":"GORGEOUS TONE OF GRAY ✓ Kappa TIMELESS DESIGN ✓ Kappa THE ORIGINAL KING OF THE EMOTES ✓ Kappa LOTS OF ADORABLE VERSIONS ✓ Kappa MUST BE  Kappa ✓ Kappa","tags":"#twitch#general#dota2#emotes#checkmark","favourites":23,"__v":0,"created_on":"2015-10-18T01:58:16.941Z","score":0.00023139327588643738},{"_id":"54bf61013b0a330105ff5c19","id":388,"pasta":"EG, VG, Secret, C9. Long ago, the four teams played together in harmony. Then, everything changed when the Great Immigration happened. Only Arteezy, master of all four roles, could stop them, but when EG needed him most, he vanished. A hundred years passed and my brother and I discovered the new Arteezy, a potato farmer named Artour. And although his midas skills are great, he has a lot to learn before he's ready to win anything.","tags":"#dota2#rtz#arteezy#eg#vg#secret#c9#harmony","favourites":62,"__v":0,"created_on":"2015-01-21T08:15:48.331Z","score":0.00022507539081679476},{"_id":"56766335c41d20f176ef710d","id":2437,"pasta":"BrokeBack GET BrokeBack YOUR  BrokeBack BROKEBACKS  BrokeBack READY  BrokeBack WE ARE  BrokeBack ABOUT  BrokeBack TO SEE  BrokeBack NA DOTA BrokeBack","tags":"#dota2#nadota#brokeback","favourites":15,"__v":0,"created_on":"2015-12-20T08:13:41.501Z","score":0.00022327333410325498},{"_id":"550866ac9c40b75805998494","id":1045,"pasta":"Hello I'm Synderen. I sexually identify as a pig molester. Ever since I was a boy I dreamed of walking through pigsties, diddling sexy piglets. People say to me that having sex with pigs is illegal and I'm retarded but I don't care, I'm Danish. I’m having a plastic surgeon implant pig tails, ears and a snout on my body. From now on I want you to call me “Porky” and respect my right to be sexually aroused by mammals that serve as food for millions all over the world. If you can’t accept me you’re a swinophobe and need to check your sus privilege. I'm moving back to Denmark so I can marry my favorite pig, which I've always fantasized about. Thank you for being so understanding.","tags":"#dota2#synderen#pig#molester#porky","favourites":50,"__v":0,"created_on":"2015-03-17T17:29:19.442Z","score":0.00021498365291571813},{"_id":"563006dc9c4390371389d149","id":2261,"pasta":"OVERRATED PLAYERS ✓ RECENTLY SHUFFLED ROSTERS ✓ TROLLY PLAYS AND THROWS ✓ FAT CASTERS ✓ TIER 4 TEAMS ✓ POOR QUALITY PLAY ✓ MUST BE NA DOTA BrokeBack ","tags":"#dota2#NA#NAdota","favourites":20,"__v":0,"created_on":"2015-10-27T23:21:00.247Z","score":0.00021475451027302752},{"_id":"5622fca784d2175224d8533c","id":2248,"pasta":"CHECK MARK ✓ 4Head CHECK MARK ✓ EleGiggle CHECK MARK ✓ SoBayed CHECK MARK ✓ PogChamp MUST BE CHECK MARK ✓ SeemsGood","tags":"#dota2#checkmark","favourites":21,"__v":0,"created_on":"2015-10-18T01:57:59.637Z","score":0.00021372553848214828},{"_id":"554913a7d51fb1666ee0bbf5","id":1589,"pasta":"Hey Twitch Chat, I'm trying to learn Undying and have a question about the skill build. Should I max Decay, like you all do sitting in your chairs all day and never going outside, Soul Rip, like every single copy pasta does to mah chat experience, or Tombstone, like you all deserved to be buried under?","tags":"#dota2#undying#twitch#chat#skillbuild","favourites":42,"__v":0,"created_on":"2015-05-05T18:55:30.736Z","score":0.00021208410603871736},{"_id":"563fff8b59b2d28c5e790470","id":2265,"pasta":"Just another day at 5k mmr. I pick the renowed windranger and say I want mid. Blue picked sf and also wants mid. I go safelane. We have an AM. I became support at minute 4. No couriers and wards just the strength of our skills and hearts. Seven minutes into the game I got flamed. Ten minutes into the game sf died three times. I rotate top. I gank. I died. I got flamed. \"Time to get serious\" is what I said. Thirty minutes into the game our carry lost hope and afk at base. My CM is out of control. Sf is feeding. The perfect time. Finished my aghs/daedalus. I thrive in a 1v9 situation. Odds are stacked I lose my composure. My heart beats faster with every kill. I die multiple times before realizing my true fate. I am windranger. I powershoot to victory. My teammates flame me. I mute them. I windrun. I bkb. I kill. Everything up to this point is a mere act. Two man shackles that baffles their minds. I kill. Enemy WW glimmer capes to safety. I powershoot. I kill. Not once have I doubted my ability. Couriers are everywhere. Fools. I am windranger. The racks melt at my focus fire. No buyback on the enemy team. I unmute to see what the fools have to say. \"You're doing it wr\". I muted them again. The enemy ancient never stood a chance. A grin appears on my face while typing \"gg\". I don't complain. I don't flame. I am windranger. The game ends. ","tags":"#dota2#5k#windrunner","favourites":18,"__v":0,"created_on":"2015-11-09T02:06:03.498Z","score":0.0002080173768907132},{"_id":"550863e69c40b75805998490","id":1042,"pasta":"ヽ(◉◡◔)ﾉ•︻̷┻̿═━一 HO HO! HA HA! I HAVE DOWN SYNDROME ヽ(◉◡◔)ﾉ•︻̷┻̿═━一","tags":"#dota2#sniper#down#syndrome#shrapnel","favourites":48,"__v":0,"created_on":"2015-03-17T11:05:27.224Z","score":0.00020750175589258208},{"_id":"54b5f449f6a1885137f43cdc","id":186,"pasta":"What the sproink did you just enchant me with, you little jungle creep? I’ll have you know I graduated top of my class in the fluffy tails institute, and I’ve been involved in numerous secret raids on Dire-side, and I have over 300 confirmed kills on my socketed gems. I am trained in jungle warfare and I’m the top ganker in the entire Radiant hero pool. You are nothing to me but just another fawn to enchant. I will heal you the sproink up with precision the likes of which has never been seen before on the shady lanes and sunny glades, mark my fluffy tail. You think you can get away with running that slow from me with my movespeed? Think again, my lovely. As we speak I am contacting my secret network of enchanted creeps across the river and your icon is being pinged right now so you better prepare for the darkened dapples, doe. The hoofprints that wipe out the lovely little thing you call your hp bar. Don't think I wasn't fawned of you, flower. I can be anywhere, anytime, and I can heal you in over seven hundred nature attendants, and that’s just with my bare sproink. Not only am I extensively trained in unarmed healing, but I have access to the entire arsenal of new tracks to follow and I will use them to their full extent to wipe your miserable frown upside down, you little thing you. If only you could have known what racked retribution your little “fast\" auto attacks was about to bring down upon you, maybe you would have healed your golden tongue. But you couldn’t, you didn’t, and now the buck stops here, points for trying though! I will impetus spears all over you and you will buckle down. Ready or not, here I come!","tags":"#dota2#enchantress#sproink#creep#navy#seal","favourites":56,"__v":0,"created_on":"2015-01-14T04:42:49.209Z","score":0.00020307056005533297},{"_id":"553bf3ad0623c068248e4aab","id":1523,"pasta":"ヽ(◉◡◔)ﾉ MY NAME IS PUPPEY, I DONT BAN SNIPER CUZ IM COOL ヽ(◉◡◔)ﾉ","tags":"#dota2#puppey#secret#alliance#starladder","favourites":41,"__v":0,"created_on":"2015-04-25T10:15:10.734Z","score":0.00020167616011003607},{"_id":"5549452c23421e5349f3c5ed","id":1590,"pasta":"乁༼◔‿◔✿༽ㄏ LOOK AT ME I HAVE GLIMMER CAPE 乁༼◔‿◔✿༽ㄏ","tags":"#dota2#rtz#glimmer#cape","favourites":38,"__v":0,"created_on":"2015-05-05T21:08:49.821Z","score":0.00019474806894533296},{"_id":"54bf0661bd6b1a11037e7c97","id":299,"pasta":"¸. * ● ¸ .　...somewhere　　　° ☾ ° 　¸. ● ¸ .　　★　° :.　 . • ° 　 .　 *　:.　.in a parallel universe* ● ¸ 　　　　° ☾ °☆ 　. * ¸.　　　★　★ ° . .　　　　.　☾ °☆ 　. * ● ¸ ...singsing..° ☾　★ °● ¸ .　　　★　° :.　 . • ○ ° ★　 .　 * ..strim♥ ☾　★ °● ¸ .　　　★","tags":"#dota2#singsing#sing#parallel#strim","favourites":52,"__v":0,"created_on":"2015-01-21T01:50:14.920Z","score":0.00019375662001028411},{"_id":"55dbff260211b6e228c8a0a6","id":2053,"pasta":"ＨＥＹ ＰＰＤ，　Ｉ’Ｍ　ＴＲＹＩＮＧ　ＴＯ　ＬＥＡＲＮ　ＴＯ　ＰＬＡＹ ＴＵＳＫ．　Ｉ　ＪＵＳＴ　ＨＡＶＥ　Ａ　ＱＵＥＳＴＩＯＮ　ＡＢＯＵＴ　ＴＨＥ ＩＴＥＭ　ＢＵＩＬＤ：　 ＳＨＯＵＬＤ　Ｉ　ＢＵＹ　ＡＧＨＡＮＩＭ’Ｓ　ＳＯ　ＴＨＡＴ　Ｉ　ＣＡＮ　ＫＩＣＫ　ＰＥＯＰＬＥ　ＬＩＫＥ　ＹＯＵ　ＫＩＣＫＥＤ　ＹＯＵＲ　ＳＵＰＰ ＢＵＤＤＹ，　 ＯＲ　ＩＲＯＮ　ＢＲＡＮＣＨ　ＷＨＩＣＨ　Ｉ　ＣＡＮ　ＪＵＳＴ　ＴＨＲＯＷ　ＡＷＡＹ　ＬＩＫＥ　ＹＯＵ　ＴＨＲＥＷ　ＡＷＡＹ　ＥＧ’Ｓ　ＣＨＡＮＣＥＳ　ＴＯ　ＷＩＮ　ＡＮＯＴＨＥＲ ＴＩ， ＯＲ　ＳＩＬＶＥＲ ＥＤＧＥ　ＳＯ　ＴＨＡＴ　Ｉ　ＣＡＮ　ＡＰＰＬＹ　ＢＲＥＡＫ　ＬＩＫＥ　ＹＯＵ　ＤＩＤ　ＴＯ　ＡＵＩ’Ｓ　ＨＥＡＲＴ.","tags":"#dota2#ppd#tusk#skill#build","favourites":24,"__v":0,"created_on":"2015-08-25T05:37:42.738Z","score":0.0001905544101727425},{"_id":"5622fcc284d2175224d8533e","id":2250,"pasta":"NotATK Chinese supports?✔ ANELE Pakistani Mid? ✔ 4Head Trash Carry? ✔ EleGiggle Indian Offlane? ✔ SoBayed Only 1 relevant team? ✔ FailFish MUST BE NA DOTA 4Head EleGiggle","tags":"#dota2#na#EvilGeniuses#EG","favourites":18,"__v":0,"created_on":"2015-10-18T01:58:26.594Z","score":0.00018665494376736427}]