[{"_id":"54c9e2149dbc7b685a74ee5a","id":605,"pasta":"Can we not call him a terrorist and phrases such as al-qaeda gaming referring to him? May seem like a harmless, albeit racist, little meme to you twitch-chat drones, but the kid's 15. Calling him a terrorist is pretty fucked up. Whatever, do what you want I guess, just wanted to say something considering how young he is.","tags":"#dota2#sumail#s-allah#terrorist#antipasta","favourites":18,"__v":0,"created_on":"2015-01-29T07:26:58.706Z","score":0.0002510188882233003},{"_id":"551a5e562ee6f05c44f9310e","id":1369,"pasta":" ╠═══╣Lets build a ladder╠═══╣","tags":"#lets#build#a#ladder#dota2","favourites":11,"__v":0,"created_on":"2015-03-31T03:32:23.022Z","score":0.00024793250835507686},{"_id":"55178cf9d926d7b83d0f3b06","id":1351,"pasta":"Eg vs secret. It ends up being the most brutal 3 games secret players have played in their life as they lose to eg. As both teams are coming out of their booths rtz rips apart his secret jersey to reveal his eg jersey underneath. Everyone in key arena is shocked, the spectators, the casters, the teams, eg , secret. even gaben is shocked as he continues to stuff hotdogs in his mouth , two at a time. Everyone except ppd. it was all a ruse. the falling out, the call outs on twitter and interviews. ppd sent rtz to secret as a trojan horse, to weaken secret from the inside. Kky and ppy are left devastated and retire from dota2 immediately. Zai moves to the fgc scene and s4 continues to do s4 stuff. Fear officially adopts rtz and ppd ships sumail back to pakistan.\n","tags":"#dota2#eg#secret#ppd#rtz#salt","favourites":11,"__v":0,"created_on":"2015-03-29T02:54:33.244Z","score":0.00024376072838741422},{"_id":"54d9168cc96a20695f2fb67d","id":746,"pasta":"EE sat in a dark room. The words \"EG Victory\" filled up the screen. Not even Black's TB could win this game. 4/2/7 KDA. Tears filled EE's eyes as he caressed his hand of midas. The sound of hard core anime music and crying filled the room. The door creaks open and Aui enters the room. \"I won Jacky.\" \"You do know what happens when I win.\" EE removed his clothes, carrying only EG's rapier trophy. Aui removed his clothes, \"I won $1,284,158. Thats how many hours your punishment will be.\" EE spent the next 1,284,158 hours being furiously fucked by his ex-teammate. After the punishment the semen covered EE arised. \"Thank you master, I can't wait to return the favor when I win first place.\" Aui smiled. \"In your dreams Jacky.\"","tags":"#dota2#EE#eg#victory#black^#midas#aui","favourites":16,"__v":0,"created_on":"2015-02-09T18:23:11.355Z","score":0.00024265977086590745},{"_id":"54b5d1ee8ba53a7c3326b4e3","id":153,"pasta":"☐322 ☐KKY ☑DDZ ","tags":"#dota2#solo#322#ddz#kky#throw","favourites":19,"__v":0,"created_on":"2015-01-14T02:16:26.741Z","score":0.00024113383969422736},{"_id":"54b558e134b44c1d2984b373","id":108,"pasta":"Guys, this needs to stop.  Why do people hate on GrandGrant so much?  You little fags don't realize how much he's done for the NA Dota scene and how long he's been around.  I've met him in person and he was incredibly sincere and nice.  His blowjobs are shit though.","tags":"#dota2#grandgrant#na#scene#blowjobs","favourites":19,"__v":0,"created_on":"2015-01-13T10:48:33.371Z","score":0.00024027072227016244},{"_id":"54bfdacd3b0a330105ff5cb3","id":421,"pasta":"༼ つ ◕⌂◕ ༽つ(_̅_̅_̅_̅_̲̅_̅_̅_̅() FISSURE","tags":"#dota2#shaker#donger#fissure","favourites":18,"__v":0,"created_on":"2015-01-21T11:20:42.763Z","score":0.00023973353370486183},{"_id":"54cca68b17cf38e278dd8aa1","id":634,"pasta":"Bulldog this is Clement. You've heard the news? About how we have a slot free? Well it's time I finally asked you; it's the question we've all known was coming since Secret began: do you have Loda's number so I can invite him to off-lane for us?","tags":"#dota2#bulldog#puppey#loda#news#free","favourites":16,"__v":0,"created_on":"2015-01-31T09:11:47.088Z","score":0.000228990240399311},{"_id":"54c086c5e93bb9213040a1eb","id":475,"pasta":"The Dead Sea is a salt lake bordering Jordan to the east, and Israel and the West Bank to the west. It is also one of the world's saltiest bodies of water. It is 9.6 times as salty as the ocean.[6] This salinity makes for a harsh environment in which all but one animal can flourish, hence its name. The only creature that can live in such high salinity levels is the EG player PPD. He is also the reason for the dead seas high salinity.","tags":"#dota2#ppd#NA#salt#peter#dager#dead#sea","favourites":17,"__v":0,"created_on":"2015-01-22T03:07:56.497Z","score":0.00022878982314124938},{"_id":"5524aec7b8946d192e783e40","id":1425,"pasta":"ARE YOU READY SECREKT FANSHITS? EleGiggle ARE YOU READY TO SEND MY KIDS TO COLLEGE? 4Head SoBayed THINK ILL SEND THEM TO BUGATTI UNIVERSITY EleGiggle","tags":"#dota2#bugatti#secret#college","favourites":9,"__v":0,"created_on":"2015-04-08T03:38:47.223Z","score":0.0002206518457864749},{"_id":"5511995c2758871d56428300","id":1311,"pasta":"Viper_27: no one heeds my warnings Viper_27: no one Viper_27: now you fuckers pay Viper_27: PogChamp","tags":"#dota2#dotaloungebetsreddit#twitch#viper","favourites":10,"__v":0,"created_on":"2015-03-24T17:05:02.965Z","score":0.00021534399495010318},{"_id":"54f37c1c87d1bc685b1e95ce","id":945,"pasta":"Artour sighed as he put away his keyboard. Before leaving the player area, he quickly checked his phone. Still no texts from Samantha-chan, the goddess from chemistry class. He tried so desperately to win her over with his 100% NA LAN winrate but now he didn't even have that going for him anymore. Another deep sigh. But then Artour laid eyes on the most beautiful being. \"NAME IS GIGI COME FROM CHINA,\" she whispered into his ear. \"A-A-Artour,\" he managed to exhale, \"b-but the girls at lunch call me A-god!\" Gigi was now hugging Artour from behind, her hands expertly stroking the area of his manhood. \"Do you know how long our loving is going to last, Artour?\" she asked. \"H-how long?\" \"We'll roleplay it. I'll be Roshan. And you can be Alchemist...\" Artour pulsed with pleasure. he could barely contain himself now. \"If you really want, you can bring your friends timbersaw and enigma along...\" said Gigi as she winked at Zai and Universe standing behind Arteezy. \"dicks out boys...\" was all Arteezy managed to utter in his trembling voice. Gigi now pulled out a glove made purely of gold thread and put it on her right hand. She stroked Artour's face with it. \"A-god....Guess how painful this will be?\" Gigi smiled. Arteezy couldn't bring himself to say any words, he was only breathing harder and harder now. This was even better than Samantha. This was even better than ricing as SF. \"Let's just say you're an innocent little puck. And I have six null tallismans in my inventory....\" Artour collapsed to the floor, spasming as he orgasmed.","tags":"#dota2#arteezy#artour#qop#rtz","favourites":12,"__v":0,"created_on":"2015-03-01T18:29:53.854Z","score":0.00021413325258541526},{"_id":"54c9cf869dbc7b685a74ee57","id":604,"pasta":" My name Jacky Mao desu. Gomen bad engrish. I growed up in small apartment and is make animu. Otoo-sama say \"Mao, animu sales very bad. Need you to have play professional DOT O2 in Amerika for make money for dakimakura for obaa-sama.\" I bring honor to nakama and obaa-sama. Purisu no kopi-pesuto desu. I krie everyday.","tags":"#dota2#eternalenvy#EE#bad#english#sama","favourites":15,"__v":0,"created_on":"2015-01-29T05:57:43.953Z","score":0.00021344112711320368},{"_id":"550f0ab42ab05ce134dd32ed","id":1281,"pasta":"ＸＹＣＬＯＰＺ ＩＳ ＴＨＥ ＡＳＩＡＮ ＭＯＲＧＡＮ ＦＲＥＥＭＡＮ, ＨＥ ＨＡＳ ＴＨＥ ＶＯＩＣＥ ＯＦ ＡＮ ＡＮＧＥＬ","tags":"#dota2#xyclopz#asian#morgan#freeman","favourites":10,"__v":0,"created_on":"2015-03-22T17:53:43.769Z","score":0.00021197069170225438},{"_id":"54f124b487d1bc685b1e95ab","id":930,"pasta":"One time I was being mugged. 5 People surrounded me. Sweat dripped down my brow. But they didn't know, they didn't know what I knew. I had dota.\nIn an instant I pulled out my shiny silver dagger. Their eyes opened wide in horror but it was too late. With one hand in the air I yelled \"CHAOS DUNK\" and in an instant, nothing was left. LD walked past the alley. \"THEYRE ALL DEAD\" he screamed. I looked to my feet. They were in fact, all dead.\nI can happily say dota saved my life, thank you based icefrog for teaching me how to slam jam.","tags":"#dota2#LD#chaos#dunk#they're#all#dead","favourites":12,"__v":0,"created_on":"2015-02-28T01:26:58.347Z","score":0.00021158349771313053}]