[{"_id":"54befef1e99bf86b74870e75","id":292,"pasta":"⋛⋋( ՞ਊ ՞)⋌⋚ CAW CAW ⋛⋋( ՞ਊ ՞)⋌⋚","tags":"#dota2#donger#caw#cawcaw#phoenix","favourites":73,"__v":0,"created_on":"2015-01-21T01:11:28.999Z","score":0.0008110437989511514},{"_id":"550866ac9c40b75805998494","id":1045,"pasta":"Hello I'm Synderen. I sexually identify as a pig molester. Ever since I was a boy I dreamed of walking through pigsties, diddling sexy piglets. People say to me that having sex with pigs is illegal and I'm retarded but I don't care, I'm Danish. I’m having a plastic surgeon implant pig tails, ears and a snout on my body. From now on I want you to call me “Porky” and respect my right to be sexually aroused by mammals that serve as food for millions all over the world. If you can’t accept me you’re a swinophobe and need to check your sus privilege. I'm moving back to Denmark so I can marry my favorite pig, which I've always fantasized about. Thank you for being so understanding.","tags":"#dota2#synderen#pig#molester#porky","favourites":46,"__v":0,"created_on":"2015-03-17T17:29:19.442Z","score":0.0007986930004937327},{"_id":"55b1937e89b52e986e2b40d2","id":1901,"pasta":"eh, average play. Obvious QoP would blink, so it would be stupid to not blink to that exact spot and even fake your ult a little first to make her think you weren't going to do it!, 5/10","tags":"#dota2#8kmmr#qop","favourites":5,"__v":0,"created_on":"2015-07-22T07:11:12.674Z","score":0.0007874695471294955},{"_id":"550863e69c40b75805998490","id":1042,"pasta":"ヽ(◉◡◔)ﾉ•︻̷┻̿═━一 HO HO! HA HA! I HAVE DOWN SYNDROME ヽ(◉◡◔)ﾉ•︻̷┻̿═━一","tags":"#dota2#sniper#down#syndrome#shrapnel","favourites":45,"__v":0,"created_on":"2015-03-17T11:05:27.224Z","score":0.0007822298913289664},{"_id":"54ce925b574e442b035d5fc5","id":651,"pasta":"Scientists have been pondering for ages how the universe keeps expanding, when by chance they were watching a televised Dota 2 tournament... suddenly they realized - it's iceiceice creating space","tags":"#dota2#scientists#universe#iceiceice#space#created","favourites":62,"__v":0,"created_on":"2015-02-01T15:17:04.497Z","score":0.0007572443647884379},{"_id":"54bf21222d74781f04a603ac","id":332,"pasta":"Hello Bulba, this is your mother. I write here to inform you that your father and I do not approve of your timewaste playing childrens game for the internet. Therefore we are sending you to India to marry your beautiful cousin Venkatanarasimharajuvaripeta and work as a train conductor.","tags":"#dota2#bulba#mother#childrens#games#india#train","favourites":67,"__v":0,"created_on":"2015-01-21T03:42:05.992Z","score":0.0007547776255837937},{"_id":"54d81ddcb898625b08cd362a","id":741,"pasta":"i expect us to win every lan\" - s4 2015","tags":"#dota2#s4#lan#tournament","favourites":58,"__v":0,"created_on":"2015-02-09T02:36:25.354Z","score":0.0007500502175397692},{"_id":"55738f897d2300ce44f0ced5","id":1738,"pasta":"The year is 2077. I stand at a window of my mansion and revel at my prized possessions - the vast acres of suburban real estate that my father and grandfather endlessly toiled to build up, and now, I have inherited it all. My grandson stands next to me and asks, \"grandpa, can I be a big businessman like you when I grow up?\"\n\"Of course,\" I said, \"this will all be yours someday.\"\nI walk over to my computer and sit on my gold-plated, diamond crusted seat. I open Reddit, a leading and most-trusted source for world news. The top headline reads, \"Immortal III treasure released.\"\n\"Marvelous!\" I chuckle to myself. This is just in time to boost the TI67 prize pool. I purchase several chests as a present for my grandson's compendium. As I click \"checkout\" on the website, I can't help but take a peek in one of the chests.\n\"Why, it's a shiny Zeus hammer!\"\nI cannot resist but open the chest. I receive a Crystal Maiden staff.\n\"This is no Zeus hammer,\" I thought. Let me just open another.\nTo my dismay, I still have not found the elusive Zeus treasure. I continue to buy more and more chests, determined that my wealth would eventually overpower Valve's determination to hide the chest from me. This quickly escalated to precisely 90,663,887,774 chests purchased, and not a single Zeus hammer lay between my wrinkly hands.\nSlowly, a cloud of darkness consumed my mind. I began dreaming of Valve's logo being carved and stamped on every piece of real estate I owned. I have thrown all my wealth away in search of this treasure. My grandson's future--no longer secured.\nI only have a few pennies left at this point, and I decided to spend them on internet bandwidth to search reddit for guidance. I went back to the Dota 2 subreddit to make sense of this all. I see a post on the front page titled, \"I opened one treasure with my level 1 compendium and look what I got :D!!!\" I clicked the post, only to see Zeus with all his might, holding a shiny, golden hammer, engulfed by lightening. Merlini himself would be blinded by such beauty.\nAt this point, my grandson came to me and climbed on my lap. \"whoa,\" he said, \"I want one of those!\" He asked if he can have just one Zeus hammer when he's a \"rich business man\" like me. I slowly carried him off my lap, with tears running down my eyes I told him,\n\"Of course, Kappa.\"","tags":"#dota2#zeus#hammer#chest#compendium#reddit","favourites":15,"__v":0,"created_on":"2015-06-05T07:58:56.590Z","score":0.0007219882143303244},{"_id":"55303caef4896f0411730596","id":1473,"pasta":"THE HALLOWED ONE, THE MASTER OF STRATEGY, THE KING OF GANK, THE SULTAN OF PUSH, THE TZAR OF TEAMFIGHT, THE SLAYER OF EHOME, THE CAPTAIN OF THEY YEAR 2010, THE CHAMPION OF THE INTERNATIONAL THE ONE AND ONLY ARTSTYLE","tags":"#dota2#artstyle#returns","favourites":30,"__v":0,"created_on":"2015-04-16T19:07:49.951Z","score":0.000720386118963115},{"_id":"55b5412f89b52e986e2b40ef","id":1915,"pasta":"Plebs, mods, turbo, subs. Long ago, the four nation played together in harmony. Then, everything changed when the the plebs  spammed . Only Admiralbulldog, master of all chat, could stop them, but when the chat needed him most, he vanished. A hundred years passed and my brother and I discovered the new Admiralbulldog a streamer who did not qualify for TI5. And although his banning skills are great, he has a lot to learn before he's ready to become the nazi hitler. ","tags":"#dota2#admiralbulldog#avatar#donger","favourites":5,"__v":0,"created_on":"2015-07-19T13:18:26.158Z","score":0.0007103293145439658},{"_id":"55c6dfbf93639d8d333a6435","id":1979,"pasta":"Hi, 5k player here who reported Bulldog. Bulldog was our position 1 Bloodcyka. He built boots of travel and had around 3 Eul's in his inventory. He would run back to base midfight with his 2000ms, buy a new Eul's and proceeded to yell \"GOTTA GO FAST\". We gave him position 1 farm so he could be a Racecar. His unorthodox build ruined our game and gave the enemy ez MMR. I felt it deserved a report.","tags":"#dota2#bulldog#bloodcyka#sonic","favourites":2,"__v":0,"created_on":"2015-08-09T05:06:07.424Z","score":0.0006942089193470916},{"_id":"557b753c7d2300ce44f0cf09","id":1762,"pasta":"    LITERALLYSOMETHINGLITERALLYSOMETHINGLITERALLYSO\n    LITERALLYSOMETHINGLITERALLYSOMETHINGLITERALLYSO\n    LITERALL    ETHINGLITERALLYSOME           LLYSO\n    LITERAL        INGLITERALLYSOMETH         LLYSO\n    LITER            GLITERALLYSOMETHIN       LLYSO\n    LITERAL            ITERALLYSOMETHING      LLYSO\n    LITERALLY            ERALLYSOMETHINGLIT   LLYSO\n    LITERALLYSO            ALLYSOMETHINGLITERALLYSO\n    LITERALLYSOM             LYSOMETHINGLITERALLYSO\n    LITERALLYSOMET             SOMETHINGLITERALLYSO\n    LITERALLYSOMETHI             METHINGLITERALLYSO\n    LITERALLYSOMETHING             THINGLITERALLYSO\n    LITERALLYSOMETHINGLI               GLITERALLYSO\n    LITERALLYSOMETHINGLIT                ITERALLYSO\n    LITERALLYSOMETHINGLITER               TERALLYSO\n    LITERALLYSOMETHINGLITERAL                ALLYSO\n    LITE  LLYSOMETHINGLITERALLY            ERALLYSO\n    LITE   LYSOMETHINGLITERALLYSO         TERALLYSO\n    LITE     SOMETHINGLITERALLYSOME      ITERALLYSO\n    LITE       METHINGLITERALLYSOMETH   LITERALLYSO\n    LITE         THINGLITERALLYSOMETHINGLITERALLYSO\n    LITERALLYSOMETHINGLITERALLYSOMETHINGLITERALLYSO\n    LITERALLYSOMETHINGLITERALLYSOMETHINGLITERALLYSO","tags":"#dota2#literally#something#logo","favourites":12,"__v":0,"created_on":"2015-06-13T00:11:31.482Z","score":0.0006711398752311698},{"_id":"5503bc3787d1bc685b1e967d","id":1025,"pasta":"｀、｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ༼ຈ ل͜ຈ༽ﾉ•︻̷┻̿═━一 h a h a  i n  t h e  s t r e e t s,  h o h o  i n t h e s h e e t sヽ༼ຈل͜ຈ༽ﾉ•︻̷┻̿═━一 ヽ｀ヽ｀、ヽヽ｀ヽ｀、｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ、ヽヽ｀ヽ","tags":"#dota2#sniper#haha#hoho#sheets","favourites":38,"__v":0,"created_on":"2015-03-14T03:30:06.970Z","score":0.0006597857845599627},{"_id":"54bf61013b0a330105ff5c19","id":388,"pasta":"EG, VG, Secret, C9. Long ago, the four teams played together in harmony. Then, everything changed when the Great Immigration happened. Only Arteezy, master of all four roles, could stop them, but when EG needed him most, he vanished. A hundred years passed and my brother and I discovered the new Arteezy, a potato farmer named Artour. And although his midas skills are great, he has a lot to learn before he's ready to win anything.","tags":"#dota2#rtz#arteezy#eg#vg#secret#c9#harmony","favourites":56,"__v":0,"created_on":"2015-01-21T08:15:48.331Z","score":0.0006491078575059756},{"_id":"553dc49a3dcb4bc6633db853","id":1534,"pasta":"ＨＥＹ ＬＯＤＡ， ＩＭ ＴＲＹＩＮＧ ＴＯ ＬＥＡＲＮ ＴＯ ＰＬＡＹ ＣＥＮＴＡＵＲ．Ｉ ＪＵＳＴ ＨＡＶＥ Ａ ＱＵＥＳＴＩＯＮ ＡＢＯＵＴ ＴＨＥ ＳＫＩＬＬ ＢＵＩＬＤ：ＳＨＯＵＬＤ Ｉ ＭＡＸ ＨＯＯＦＳＴＯＭＰ ＬＩＫＥ ＹＯＵ ＳＴＯＭＰＥＤ ＳＥＣＲＥＴ，ＯＲ ＳＨＯＵＬＤ Ｉ ＭＡＸ ＲＥＴＵＲＮ ＬＩＫＥ ＹＯＵ ＲＥＴＵＲＮＥＤ ＭＹ ＢＵＧＡＴＴＩＳ ＯＲ ＳＨＯＵＬＤ Ｉ ＭＡＸ ＥＤＧＥ ＬＩＫＥ ＹＯＵ ＥＤＧＥＤ ＯＵＴ ＳＥＣＲＥＫＴ ＦＲＯＭ ＳＴＡＲＬＡＤＤＥＲ？","tags":"#dota2#secret#loda#centaur#build","favourites":23,"__v":0,"created_on":"2015-04-27T01:07:43.434Z","score":0.0006349484424230501}]