[{"_id":"54b558e134b44c1d2984b373","id":108,"pasta":"Guys, this needs to stop.  Why do people hate on GrandGrant so much?  You little fags don't realize how much he's done for the NA Dota scene and how long he's been around.  I've met him in person and he was incredibly sincere and nice.  His blowjobs are shit though.","tags":"#dota2#grandgrant#na#scene#blowjobs","favourites":19,"__v":0,"created_on":"2015-01-13T10:48:33.371Z","score":0.00018132096264464643},{"_id":"550c39ca2ab05ce134dd328b","id":1241,"pasta":"I just don't get why people think twitch chat is funny. Maybe if I was like 15 and baked. Like how is it funny whenever they interview Chinese players for everyone to spam CHING CHONG for 5 minutes? Like does anyone really find that fucking funny? I mean you've got hundreds of people at once doing this stupid shit. SingSings stream is even more insane, it feels like 5000 people with tourettes just trying to say the most bluntly offensive things they possibly can for no reason. I don't get it at all, it's fucking stupid and a huge waste of time.","tags":"#twitch#antipasta#funny#baked#dota2","favourites":13,"__v":0,"created_on":"2015-03-20T12:24:00.880Z","score":0.00018061668860581745},{"_id":"54bfdacd3b0a330105ff5cb3","id":421,"pasta":"༼ つ ◕⌂◕ ༽つ(_̅_̅_̅_̅_̲̅_̅_̅_̅() FISSURE","tags":"#dota2#shaker#donger#fissure","favourites":18,"__v":0,"created_on":"2015-01-21T11:20:42.763Z","score":0.00017924319954527943},{"_id":"54d9168cc96a20695f2fb67d","id":746,"pasta":"EE sat in a dark room. The words \"EG Victory\" filled up the screen. Not even Black's TB could win this game. 4/2/7 KDA. Tears filled EE's eyes as he caressed his hand of midas. The sound of hard core anime music and crying filled the room. The door creaks open and Aui enters the room. \"I won Jacky.\" \"You do know what happens when I win.\" EE removed his clothes, carrying only EG's rapier trophy. Aui removed his clothes, \"I won $1,284,158. Thats how many hours your punishment will be.\" EE spent the next 1,284,158 hours being furiously fucked by his ex-teammate. After the punishment the semen covered EE arised. \"Thank you master, I can't wait to return the favor when I win first place.\" Aui smiled. \"In your dreams Jacky.\"","tags":"#dota2#EE#eg#victory#black^#midas#aui","favourites":16,"__v":0,"created_on":"2015-02-09T18:23:11.355Z","score":0.0001769383752243667},{"_id":"5525e21c7ca4658f518f3fe1","id":1430,"pasta":"Ｈｉ Ｄａｒｕｄｅ. Ｍｙ ｄａｄ ａｌｗａｙｓ ｔｏｌｄ ｍｅ ｔｈｉｓ ｓｔｏｒｙ ｗｈｅｒｅ ｈｅ ｓａｉｄ ｈｅ ｗａｓ ｂａｃｋｓｔａｇｅ ａｔ ａ ｃｌｕｂ ａｎｄ ｗａｌｋｅｄ ｕｐ ｔｏ ａ ＤＪ ｐｅｒｆｏｒｍｉｎｇ Ｓａｎｄｓｔｏｒｍ. Ｍｙ ｄａｄ ｈａｔｅｄ ｔｈｅ ｓｏｎｇ ａｎｄ ｔｏｌｄ ｔｈｅ ＤＪ ｔｈａｔ ｉｔ ｗａｓ ｒｅｐｅｔｉｔｉｖｅ ａｎｄ ｃｏｕｌｄｎ＇ｔ ｕｎｄｅｒｓｔａｎｄ ｗｈｙ ｐｅｏｐｌｅ ｌｉｋｅｄ ｉｔ. Ｇｅｔｔｉｎｇ ａ ｗｅｉｒｄ ｌｏｏｋ ｆｒｏｍ ｔｈｅ ＤＪ ｍｙ ｄａｄ ｒｅｔｕｒｎｅｄ ｂａｃｋｓｔａｇｅ ａｎｄ ｔａｌｋｅｄ ｔｏ ｔｈｅ ｍａｎａｇｅｒ ｗｈｏ ｔｈｅｎ ｉｎｆｏｒｍｅｄ ｈｉｍ ｔｈａｔ ｔｈｅ ＤＪ ｈｅ ｉｎｓｕｌｔｅｄ ｗａｓ ｉｎ ｆａｃｔ ｙｏｕ. Ｄｏ ｙｏｕ ｒｅｍｅｍｂｅｒ ｔｈｉｓ ｂｙ ａｎｙ ｃｈａｎｃｅ？ Ｍｙ ｄａｄ ｆｅｌｔ ｐｒｅｔｔｙ ｂａｄ ａｎｄ ｗｏｕｌｄ ａｐｏｌｏｇｉｚｅ ｉｆ ｇｉｖｅｎ ｔｈｅ ｃｈａｎｃｅ ｓｏ Ｉ＇ｍ ｄｏｉｎｇ ｉｔ ｏｎ ｂｅｈａｌｆ ｏｆ ｈｉｍ. Ｉ ｏｎ ｔｈｅ ｏｔｈｅｒ ｈａｎｄ ｈａｐｐｅｎ ｔｏ ｌｉｋｅ Ｓａｎｄｓｔｏｒｍ ａｎｄ ａｐｐｒｅｃｉａｔｅ ｉｔｓ ｍａｓｔｅｒｙ ｏｆ ｔｈｅ ｄａｎｃｅ ｓｃｅｎｅ. Ｔｈａｎｋ ｙｏｕ！","tags":"#darude#sandstorm#dota2#lol#general","favourites":12,"__v":0,"created_on":"2015-04-09T01:52:32.033Z","score":0.00017534671269990235},{"_id":"54c086c5e93bb9213040a1eb","id":475,"pasta":"The Dead Sea is a salt lake bordering Jordan to the east, and Israel and the West Bank to the west. It is also one of the world's saltiest bodies of water. It is 9.6 times as salty as the ocean.[6] This salinity makes for a harsh environment in which all but one animal can flourish, hence its name. The only creature that can live in such high salinity levels is the EG player PPD. He is also the reason for the dead seas high salinity.","tags":"#dota2#ppd#NA#salt#peter#dager#dead#sea","favourites":17,"__v":0,"created_on":"2015-01-22T03:07:56.497Z","score":0.00017092594972891717},{"_id":"54cca68b17cf38e278dd8aa1","id":634,"pasta":"Bulldog this is Clement. You've heard the news? About how we have a slot free? Well it's time I finally asked you; it's the question we've all known was coming since Secret began: do you have Loda's number so I can invite him to off-lane for us?","tags":"#dota2#bulldog#puppey#loda#news#free","favourites":16,"__v":0,"created_on":"2015-01-31T09:11:47.088Z","score":0.00016910770988266615},{"_id":"55178cf9d926d7b83d0f3b06","id":1351,"pasta":"Eg vs secret. It ends up being the most brutal 3 games secret players have played in their life as they lose to eg. As both teams are coming out of their booths rtz rips apart his secret jersey to reveal his eg jersey underneath. Everyone in key arena is shocked, the spectators, the casters, the teams, eg , secret. even gaben is shocked as he continues to stuff hotdogs in his mouth , two at a time. Everyone except ppd. it was all a ruse. the falling out, the call outs on twitter and interviews. ppd sent rtz to secret as a trojan horse, to weaken secret from the inside. Kky and ppy are left devastated and retire from dota2 immediately. Zai moves to the fgc scene and s4 continues to do s4 stuff. Fear officially adopts rtz and ppd ships sumail back to pakistan.\n","tags":"#dota2#eg#secret#ppd#rtz#salt","favourites":11,"__v":0,"created_on":"2015-03-29T02:54:33.244Z","score":0.00016195849188922848},{"_id":"551a5e562ee6f05c44f9310e","id":1369,"pasta":" ╠═══╣Lets build a ladder╠═══╣","tags":"#lets#build#a#ladder#dota2","favourites":11,"__v":0,"created_on":"2015-03-31T03:32:23.022Z","score":0.00016195849188922848},{"_id":"54c9cf869dbc7b685a74ee57","id":604,"pasta":" My name Jacky Mao desu. Gomen bad engrish. I growed up in small apartment and is make animu. Otoo-sama say \"Mao, animu sales very bad. Need you to have play professional DOT O2 in Amerika for make money for dakimakura for obaa-sama.\" I bring honor to nakama and obaa-sama. Purisu no kopi-pesuto desu. I krie everyday.","tags":"#dota2#eternalenvy#EE#bad#english#sama","favourites":15,"__v":0,"created_on":"2015-01-29T05:57:43.953Z","score":0.00015805895482987381},{"_id":"54c462d9ed70401f791aa72a","id":551,"pasta":"In the year 2040 after TI30, 90% of the world plays DotA. Nobody knows how it got so big. Maybe it was after Valve bought Riot. Maybe it was after Jeremy Lin converted the entire LA Lakers to DotA players. Most would say it was after the US President became a player. All we know is the engine of the world had stopped. DotA turned from enjoyment, to a disease. End times were coming. This was truly Armageddon.\nOur story starts in a small bunker in north Russia. One of the last colonies of cognitive refugees and the largest resistance force left. A dank and dark place hidden away from the world. A remnant of older, simpler times. Working in secret, scientists were looking for ways of shutting down the network, but servers in the future were autonomous and could fight off any physical or technological attack. They were so advanced, they could fix their own mistakes. There wasn't any point to even try to use any device connected to the internet. It is all controlled by the GABE-N. A cyborg created to preserve an old world tyrant. He controls all. He sees all. Big brother is watching you.\nA young woman knocks on a door to a dark room. All it contains is a bed, a fishing pole, and a thin man in a wheelchair, sitting catatonically aloof. The woman turned on a lamp, but the umbra of the room still stained the walls. She lifts the mans shirt to switch out his empty food IV for a new one.\n\"Are you feeling better today, Danil?\" asked the woman quietly. She waited patiently for any sign of life. As always, he just sat there staring at the wall. She knelt down and held his hand. \"We have good news, Major Korobkin says the project is finished.\" Again, she looks at him for any movement. He is as moribund as ever. \"This will all be over soon. We'll all be free of DotA once and for all.\" This news didn't phase or shift him. She stood up and headed for the door.\n\"I didn't know.\" The young woman nearly fell over hearing the words. This was the first time in a decade he had spoken. \"I didn't know it would turn out like this. It was just a game. They told me I could be the best. They told me I was the best. I was a just a boy, barely a man. I do not regret what I have done, it is what I have failed to do. I should have quit while I was ahead. We knew it would change the world. I am the epicenter of all of this. I am become death, destroyer of worlds.\" The woman was speechless. All she could do was hug the frail man.\nIn the depths of the bunker, beneath the miles of dirt, sat a team of engineers, scientist, and military personnel. They sat in silence. A Russian military officer opens the door. Everyone stands at attention.\n\"Major Korobkin, sir\" says a saluting scientist.\n\"Dismissed. We have the subject. Is everything operational?\"\n\"Yes sir, we just need to prepare the subject.\" The major makes a motion as 2 soldiers usher in a small man with a bag over its head. some scientists grab a special suit and other gadgets. The bag is removed and the subjects is suited up in a post-modern space suit.\n\"Your mission is simple. We are sending you to the year 2014. You must keep DotA from spreading. You must keep it away from the President of the United States. Do anything within your power to stop it. You are the chosen one.\"\n\"I know what I must do.\"replied the subject. \" I shall DDoS the east coast server.\" and so he did.","tags":"#dota2#2040#TI30#dendi#future#russia#disease","favourites":15,"__v":0,"created_on":"2015-01-25T03:27:35.666Z","score":0.0001550620999501158},{"_id":"54c00f093b0a330105ff5cff","id":458,"pasta":"-w33fresh","tags":"#dota2#w33","favourites":15,"__v":0,"created_on":"2015-01-21T20:35:50.580Z","score":0.00015273562583130476},{"_id":"54bfe61e3b0a330105ff5cc6","id":437,"pasta":"ＴＨＲＥＥ ＨＵＮＤＲＥＤ ＡＮＤ ＴＷＥＮＴＹ ＴＷＯ ＤＯＬＬＡＲＳ","tags":"#dota2#322#solo","favourites":15,"__v":0,"created_on":"2015-01-21T17:46:29.597Z","score":0.0001526535263614613},{"_id":"54bf0b782619c58503a1dc61","id":302,"pasta":"Stream has come and passed, the innocent can never last\n\nWake me up when singsing streams\n\nUnlike my subscription come to pass, 10 years has gone so slow\n\nWake me up when singsing streams\n\nHere comes the rain again, falling from the stars\n\nDrenched in my pain again, becoming who we are\n\nas my memory rests, but never forgets what I lost\n\nWake me up when singsing streams\n\nRing out the bells again\n\nLike we did when Stream began\n\nWake me up when singsing streams\n\nStream has come and passed, the innocent can never last\n\nWake me up when singsing streams\n\nUnlike my subscription come to pass, 10 years has gone so slow\n\nWake me up when singsing streams\n\nWake me up when singsing streams\n\nWake me up when singsing streams","tags":"#dota2#singsing#sing#streams#strim#10#years","favourites":15,"__v":0,"created_on":"2015-01-21T02:11:31.007Z","score":0.00015220168308465826},{"_id":"54f37c1c87d1bc685b1e95ce","id":945,"pasta":"Artour sighed as he put away his keyboard. Before leaving the player area, he quickly checked his phone. Still no texts from Samantha-chan, the goddess from chemistry class. He tried so desperately to win her over with his 100% NA LAN winrate but now he didn't even have that going for him anymore. Another deep sigh. But then Artour laid eyes on the most beautiful being. \"NAME IS GIGI COME FROM CHINA,\" she whispered into his ear. \"A-A-Artour,\" he managed to exhale, \"b-but the girls at lunch call me A-god!\" Gigi was now hugging Artour from behind, her hands expertly stroking the area of his manhood. \"Do you know how long our loving is going to last, Artour?\" she asked. \"H-how long?\" \"We'll roleplay it. I'll be Roshan. And you can be Alchemist...\" Artour pulsed with pleasure. he could barely contain himself now. \"If you really want, you can bring your friends timbersaw and enigma along...\" said Gigi as she winked at Zai and Universe standing behind Arteezy. \"dicks out boys...\" was all Arteezy managed to utter in his trembling voice. Gigi now pulled out a glove made purely of gold thread and put it on her right hand. She stroked Artour's face with it. \"A-god....Guess how painful this will be?\" Gigi smiled. Arteezy couldn't bring himself to say any words, he was only breathing harder and harder now. This was even better than Samantha. This was even better than ricing as SF. \"Let's just say you're an innocent little puck. And I have six null tallismans in my inventory....\" Artour collapsed to the floor, spasming as he orgasmed.","tags":"#dota2#arteezy#artour#qop#rtz","favourites":12,"__v":0,"created_on":"2015-03-01T18:29:53.854Z","score":0.0001513649777533271}]