[{"_id":"574a3553709549ef048c4bab","id":2804,"pasta":"Ｄｒａｋｕｓ， ｙｏｕ ｇｏｔｔａ ｓｔｏｐ． Ｙｏｕ＇ｖｅ ｍａｄｅ ａ ｍｅｍｅ ａｌｍｏｓｔ ｅｖｅｒｙ ｈｏｕｒ ｆｏｒ ｔｈｅ ｐａｓｔ ｆｅｗ ｗｅｅｋｓ． Ｉ ｋｎｏｗ ｉｔ＇ｓ ｈａｒｄ ｗａｉｔｉｎｇ ｆｏｒ ｔｈｅ ｎｅｘｔ ｄａｎｋｅｓｔ ｍｅｍｅ， ｂｕｔ ｔｈｉｓ ｍｅｍｅ ａｄｄｉｃｔｉｏｎ ｉｓ ｇｏｉｎｇ ｔｏ ｄｅｓｔｒｏｙ ｙｏｕ． Ｐｌｅａｓｅ， Ｄｒａｋｕｓ． Ｉｔ＇ｓ ｆｏｒ ｙｏｕｒ ｏｗｎ ｇｏｏｄ．","tags":"#dota2#drakus#memes","favourites":14,"__v":0,"created_on":"2016-05-29T00:18:27.521Z","score":0.0015347528682800214},{"_id":"574a34c4709549ef048c4ba5","id":2798,"pasta":"EternalEnvy stood back and looked at his work. Everything had been prepared; the ritual could now commence. He closed his eyes and made a quick prayer to Gaben.\n\"Through this sacrifice, may I prove worthy to receive that which I would most desire.\"\nHis eyes opened. It would be a great sacrifice indeed; but it would be worth it. OSFrog knew he had enough excesses to cover it. Terrorblade will receive an immortal in treasure 2, he promised himself. I have paid the price. He eyed the pentagram, a small urn sitting in the centre of it.\nWith that, he began the ritual, smoothly sliding down his pants and whipping out his stiffy, pre-lubed and harder than a level 16 Tiny. He intoned a demonic chant as he jerked his chodelike Chinese meat, slowly at first but growing faster with each stroke. He aimed the tip at the urn and moved his free hand over to his computer. His mouse moved quickly; he opened the recycle tab, tossing in items. The Marauder's Reflection set disappeared first, followed by the Eternal Purgatory. The remaining Terrorblade items formed a pentagram, the arcana at the centre. A humming noise filled the air, volume intensifying. As the screen started to glow a dark crimson, Jacky Mao came with the force of a thousand suns, and his hot load audibly splashed into the urn. A deep, throaty chuckle issued from his speakers, and everything went dark.\nWhen EE came to, the urn had disappeared, and a note was left in its place. He dashed over, tripping over his pants that were still down around his spindly ankles, and his eyes drank in the text.\nShriek when you see me.\nEternalEnvy sat down, and started giggling. His giggling grew louder, more maniacal, until the neighbours knocked on the door to complain, but he didn't care. He had won.\n\"NOW who's meta, bitches?\" he cackled.","tags":"#dota2#EE#EternalEnvy#Terrorblade#immortal#JackyMao","favourites":5,"__v":0,"created_on":"2016-05-29T00:16:04.472Z","score":0.0005747078180227426},{"_id":"5742b89e709549ef048c4b7b","id":2791,"pasta":"HEY MIRACLE, I'M TRYING TO LEARN INVOKER. I JUST HAVE A FEW QUESTIONS FOR YOU. SHOULD I MAX QUAS LIKE YOUR COOL AND CONSIDERED DECISION MAKING, WEX LIKE YOUR LIGHTNING REFLEXES, OR EXORT LIKE YOUR FIERY FIGHTING SPIRIT.","tags":"#dota2#miracle#learn#invoker","favourites":2,"__v":0,"created_on":"2016-05-23T08:00:30.584Z","score":0.00015397517931628742},{"_id":"5742a35b709549ef048c4b6e","id":2779,"pasta":"༼ ▀̿̿Ĺ̯̿̿▀̿ ̿ ༽ ʕ ͡•ᴥ ͡• ʔ ༼ ▀̿̿Ĺ̯̿̿▀̿ ̿ ༽ PROTECT THE BEAR !!!","tags":"#bear#dota2#protect","favourites":3,"__v":0,"created_on":"2016-05-23T06:29:47.985Z","score":0.00027389123491545776},{"_id":"57401c59709549ef048c4b5e","id":2773,"pasta":"RTZ！ strong！ invincibility！","tags":"#dota2#rtz#arteezy#strong","favourites":0,"__v":0,"created_on":"2016-05-21T08:29:13.388Z","score":0},{"_id":"57401c53709549ef048c4b5d","id":2772,"pasta":"Hello 2k trash? YOu realize the plaer you just dual midded is 5k mmr right? The meepo player that has over 400 meepo games and 70% winrate, you dual midded. You don't realize you are just 2k trash, you prob think you are good at this game. YOu are aboslute gabrage and should NEVER play dota agian, go fucking rot in lpq. Hope you never get out. How fucking dumb can you be, dual midding a 5k player, aer you FUKCING DUMB. Reported your steam too.","tags":"#dota2#salt#lowpriority#meepoplayers","favourites":1,"__v":0,"created_on":"2016-05-21T08:29:07.032Z","score":0},{"_id":"572c9d61709549ef048c4af1","id":2741,"pasta":"REKT STATUS | ☐ Not rekt  | ☑ Rekt |\n","tags":"#bind#rekt#status#dota2#lol","favourites":61,"__v":0,"created_on":"2016-05-06T13:34:25.746Z","score":0.003183199371795335},{"_id":"57163942709549ef048c4a88","id":2735,"pasta":"BEARS  WutFace CENTAURS  WutFace SATYRS  WutFace TROLLS  WutFace WOLVES  WutFace NOT DOTA TWO  WutFace DOTA ZOO  WutFace","tags":"#dota#dota2#dotazoo","favourites":3,"__v":0,"created_on":"2016-04-19T13:57:22.555Z","score":0.0001390916138058386},{"_id":"57163940709549ef048c4a87","id":2734,"pasta":"BEARS  WutFace CENTAURS  WutFace SATYRS  WutFace TROLLS  WutFace WOLVES  WutFace NOT DOTA TWO  WutFace DOTA ZOO  WutFace","tags":"#dota#dota2#dotazoo","favourites":2,"__v":0,"created_on":"2016-04-19T13:57:20.399Z","score":0.000078062498622632},{"_id":"5716389d709549ef048c4a79","id":2720,"pasta":"My name is Maximus RuleFive Fearidius, commander of the Armies of North America, General of the BrokeBack Legions, loyal servant to the true PJSalt Emperor. Father to a treacherous son BabyRage , friend to a treacherous offlaner SriHead . And I will have my vengeance, at this TI or the next. ","tags":"#dota2#fear#NA#rulefive#gladiator","favourites":2,"__v":0,"created_on":"2016-04-19T13:54:37.550Z","score":0.00007806021419409709},{"_id":"57163889709549ef048c4a78","id":2719,"pasta":"Synderen I think it's very brave of you to give up your casting job to play Dota. I don't know if I could do it knowing I'd never get my casting job back after people saw me feeding that much.","tags":"#synderen#dota2","favourites":1,"__v":0,"created_on":"2016-04-19T13:54:17.233Z","score":0},{"_id":"5716387f709549ef048c4a76","id":2717,"pasta":"OSfrog Give a man balance and he will quit after a patch, OSfrog give him unbalance and he will wait for balance for the rest of his life OSfrog\n","tags":"#dota2#icefrog","favourites":5,"__v":0,"created_on":"2016-04-19T13:54:07.680Z","score":0.0002478244020146247},{"_id":"570f9e2b709549ef048c4a4b","id":2709,"pasta":"I was having sex with this girl last night and she was so hot i came in like 15 seconds. I was pretty embarrassed, but she leaned over to me and whispered \"Don't worry, you still lasted longer than Synderen does in teamfights\".","tags":"#synderen#dota2","favourites":65,"__v":0,"created_on":"2016-04-14T13:42:03.994Z","score":0.002316408466882091},{"_id":"570f9e20709549ef048c4a4a","id":2708,"pasta":"\"How did you become a top tier caster Cap?\" Capitalist answered: \"I got a tier 5 game, spent the day hypecasting it, and got 2 more tier 5 games to cast. It was at this point that GodZ left Tobi and Tobi decided to hire the first guy that'd cosplay as Drow for him\".","tags":"#dota2#capitalist#tobiwan#godz","favourites":2,"__v":0,"created_on":"2016-04-14T13:41:52.965Z","score":0.00007238762952587565},{"_id":"5703df86709549ef048c49cd","id":2662,"pasta":"lost sheever to odpixel ✓ admiralFeels lost nara to s4 ✓ admiralFeels lost bubu to singsing ✓ admiralFeels lost helena to autism ✓ admiralFeels can't reach 8k ✓ admiralFeels must be bulldong admiralW","tags":"#dota2#admiralbulldog#alliance#foreverlonedruid","favourites":10,"__v":0,"created_on":"2016-04-05T15:53:42.009Z","score":0.00039909032401167416}]