[{"_id":"552b392eb55765bb15c69b02","id":1457,"pasta":"I watched the replay. Brood sits invis in midlane for just over 5 mins, leeching exp. All other 9 heroes sit in base. They all accumulate passive gold to the tune of about 1500 each. Then they abandon from inactivity, and all the gold goes to brood (she must buy items and then sell them?) Brood then gets a rapier and finishes.","tags":"#dota2#replay#brood","favourites":0,"__v":0,"created_on":"2015-04-13T00:02:48.339Z","score":0},{"_id":"552ade1db55765bb15c69aff","id":1456,"pasta":"﻿﻿ＨＥＹ    Ｓ４，    Ｉ＇Ｍ    ＴＲＹＩＮＧ    ＴＯ    ＬＥＡＲＮ    ＴＯ    ＰＬＡＹ    ＣＳ：ＧＯ．    Ｉ    ＪＵＳＴ    ＨＡＶＥ    Ａ    ＱＵＥＳＴＩＯＮ    ＡＢＯＵＴ    ＴＨＥ    ＥＱＵＩＰＭＥＮＴ：    ＳＨＯＵＬＤ    Ｉ    ＢＵＹ    ＳＭＯＫＥ    ＳＯ    Ｉ    ＣＡＮ    ＨＩＤＥ    ＬＩＫＥ    ＹＯＵ    ＨＩＤ    ＦＲＯＭ    ＡＬＬＩＡＮＣＥ，    ＦＬＡＳＨＢＡＮＧ    ＳＯ    Ｉ    ＣＡＮ    ＢＬＩＮＤ    ＬＩＫＥ    ＹＯＵ    ＢＬＩＮＤＥＤ    ＡＬＬＩＡＮＣＥ    ＦＡＮＳ，    ＯＲ    ＡＷＰ    ＳＯ    Ｉ    ＣＡＮ    ＳＮＩＰＥ    ＬＩＫＥ    ＹＯＵ    ＳＮＩＰＥＤ    ＬＯＤＡ＇Ｓ    ＨＥＡＲＴ","tags":"#dota2#s4#gustav#csgo#alliance#secret#learn","favourites":0,"__v":0,"created_on":"2015-04-12T20:56:01.699Z","score":0},{"_id":"552ac524b55765bb15c69afd","id":1455,"pasta":"If alliance win the summit 3 redemption vote i will do 24 hour strim with cam EleGiggle","tags":"#bulldog#dota2#admiralbulldog#donger#Kappa","favourites":0,"__v":0,"created_on":"2015-04-12T14:33:48.125Z","score":0},{"_id":"552a0c361528bd477913f6a5","id":1454,"pasta":"ＨＥＹ　ＡＵＩ，　Ｉ’Ｍ　ＴＲＹＩＮＧ　ＴＯ　ＬＥＡＲＮ　ＨＯＷ　ＴＯ　ＰＬＡＹ　ＳＫＹＷＲＡＴＨ　ＭＡＧＥ．　Ｉ　ＪＵＳＴ　ＨＡＶＥ　Ａ　ＱＵＥＳＴＩＯＮ　ＡＢＯＵＴ　ＴＨＥ　ＳＫＩＬＬ　ＢＵＩＬＤ：　ＳＨＯＵＬＤ　Ｉ　ＭＡＸ　ＡＲＣＡＮＥ　ＢＯＬＴ　ＬＩＫＥ　ＹＯＵ　ＢＯＬＴＥＤ　ＯＵＴ　ＯＦ　Ｃ９’Ｓ　ＲＯＳＴＥＲ，　ＣＯＮＣＵＳＳＩＶＥ　ＳＨＯＴ　ＬＩＫＥ　ＨＯＷ　ＹＯＵ　ＳＨＯＴ　ＹＯＵＲＳＥＬＦ　ＩＮ　ＴＨＥ　ＦＯＯＴ　ＷＨＥＮ　ＹＯＵ　ＪＯＩＮＥＤ　ＥＧ，　ＯＲ　ＡＮＣＩＥＮＴ　ＳＥＡＬ　ＳＯ　Ｉ　ＣＡＮ　ＳＥＡＬ　ＯＦＦ　ＡＮＹ　ＣＨＡＮＣＥ　ＯＦ　ＷＩＮＮＩＮＧ？","tags":"#dota2#aui#skywrath#mage#katka#eg#c9","favourites":1,"__v":0,"created_on":"2015-04-12T05:55:04.601Z","score":0},{"_id":"5529a476102d06226e905b86","id":1452,"pasta":"Ｔｏｂｉ ｉｓ ａ ｂｉｇ ｆｕｃｋｉｎｇ ｄｅａｌ. Ｔｈｉｓ ｍａｎ ｗｏｎ ｔｈｅ ＪｏｉｎＤｏｔａ ａｗａｒｄ ｆｏｒ ｂｅｓｔ ｃａｓｔｅｒ 2014, ｈｅ'ｓ ｎｏｔ ｏｎｅ ｏｆ ｔｈｏｓｅ ｐｅａｓａｎｔｓ ｔｈａｔ ｗｏｕｌｄ ｃａｓｔ ｇａｍｅｓ ｂｅｔｗｅｅｎ ａ ｂｕｎｃｈ ｏｆ Ｔｉｅｒ 2 ｔｅａｍｓ. Ｏｎｌｙ ｔｈｅ ｂｅｓｔ ｏｆ ｔｈｅ ｂｅｓｔ ｉｓ ｇｏｏｄ ｅｎｏｕｇｈ ｆｏｒ ｔｈｉｓ ｍａｎ, ｈｅ ｔｒｕｌｙ ｉｓ ａ ｂｌｅｓｓｉｎｇ ｔｏ ｔｈｅ Ｄｏｔａ ｃｏｍｍｕｎｉｔｙ. Ｒｅａｄｉｎｇ Ｔｉｅｒ 2 ｐｌａｙｅｒｓ ｎａｍｅ ｉｓ ｂｅｌｏｗ ｈｉｍ. Ｏｎｌｙ ｐｅａｓａｎｔｓ ｌｉｋｅ ＢＴＳ ｗｏｕｌｄ ｄｏ ｔｈａｔ.","tags":"#dota2#csgo#tobiwan#tobi","favourites":1,"__v":0,"created_on":"2015-04-11T21:57:01.779Z","score":0},{"_id":"5529862d102d06226e905b83","id":1451,"pasta":" H OpieOP H OpieOP H deIlluminati H deIlluminati","tags":"#dota2#sniper#shrapnel#emotes","favourites":0,"__v":0,"created_on":"2015-04-11T10:50:48.587Z","score":0},{"_id":"5528af37dc70229c6b68ad2d","id":1450,"pasta":"Can I just say I fucking love what NAHAZ (sorry, my phone autocorrects his name to full caps) brings to the table? If he were your regular 25 year old commentator, he'd be bringing something unique already, but with his age, he brings an air of credibility to the whole scene. When my gf looks at the casting panel and sees NAHAZ, she can't look at dota as \"just a game\". Thanks for being you, NAHAZ, and for being true to your passions, despite the stigma.","tags":"#dota2#nahaz#unique#credibility#satire","favourites":1,"__v":0,"created_on":"2015-04-11T04:31:29.847Z","score":0},{"_id":"5528af20dc70229c6b68ad2c","id":1449,"pasta":"I like really like PPD, hes probably my all time favorite person to watch at night with my tablet when im going to bed, usually get a pretty good laugh at him flaming someone (they always deserve it) and hes always very positive with his team. Hes my type of player, no bs and focused on what needs to get done, I just wish I had salt signed by him. Also is it true that when PPD was a baby his mom accidentally dropped him in a pile of salt at the salt mine his dad works at, and thats why hes been so salty ever since?","tags":"#dota2#ppd#salt#mine#flaming","favourites":0,"__v":0,"created_on":"2015-04-11T04:28:15.731Z","score":0},{"_id":"5526dcd50c88f703624a613d","id":1440,"pasta":"Ａ ｌｉｔｔｌｅ ｓｔｏｒｙ ａｂｏｕｔ Ｍｕｓｈｉ， ｂｅｆｏｒｅ ｈｅ ｉｓ ａ ｐｒｏｆｅｓｓｉｏｎａｌ ｐｌａｙｅｒ， ｈｅ ｗｏｒｋ ａｓ ａ ｗａｔｅｒ ｄｅｌｉｖｅｒｙ ｂｏｙ， ｔｅｃｈｎｉｃｉａｎ， ａｓｔｒｏ ｏｎ ｄｅｍａｎｄ ｃｕｓｔｏｍｅｒ ｓｅｒｖｉｃｅ ａｎｄ ａ ｆｅｗ ｐａｒｔ ｔｉｍｅ ｊｏｂ． Ｈｅ ｈａｄ ｔｏ ｔａｋｅ ｌｅａｖｅ ｔｏ ｐａｒｔｉｃｉｐａｔｅ Ｄｏｔａ ２ ｔｏｕｒｎａｍｅｎｔ ． Ｈｅ ｆｅｅｌｓ ｂａｄ ｆｏｒ ｕｎａｂｌｅ ｔｏ ａｔｔｅｎｄ ｔｏ ｗｏｒｋ，ｈｅ ｒｅｓｉｇｎ ｈｉｓ ｊｏｂ ｔｏ ｐｕｒｓｕｅ ｈｉｓ ｄｒｅａｍ． Ａｌｌ ｈｉｓ ｆａｍｉｌｙ ｄｉｓａｐｐｒｏｖｅ ａｎｄ ｓｔｒｏｎｇｌｙ ａｇａｉｎｓｔ ｈｉｓ ｄｒｅａｍ ａｓ ａ ｇａｍｅｒ， ｆｉｎａｎｃｉａｌｌｙ ａｎｄ ｅｎｖｉｒｏｎｍｅｎｔ ｉｓ ｓｏ ｈａｒｄ ｆｏｒ ｈｉｍ ｂｕｔ Ｍｕｓｈｉ ｉｓ ｑｕｉｔｅ ｓｔｕｂｂｏｒｎ， ｈｅ ｄｏｎ＇ｔ ｗａｎｔ ｔｏ ｇｉｖｅ ｕｐ ｈｉｓ ｄｒｅａｍ． Ａｆｔｅｒ ｆａｉｌｉｎｇ ２ ｙｅａｒｓ ｗｉｔｈｏｕｔ ａｎｙ ａｃｈｉｅｖｅｍｅｎｔ， ｈｅ ａｓｋ ｈｉｓ ｐａｒｅｎｔｓ ｔｏ ａｌｌｏｗ ｈｉｍ ｔｏ ｔｒｙ ｏｎｅ ｍｏｒｅ ｙｅａｒ． Ａｎｄ ｗｉｔｈｉｎ ｔｈａｔ ｏｎｅ ｙｅａｒ ｔｉｍｅ ｈｅ ｈａｄ ａｃｈｉｅｖｅｄ ａ ｒｅｓｕｌｔ ｔｈａｔ ｈｅ ｈａｄ ｎｅｖｅｒ ｔｈｏｕｇｈｔ ｈｅ ｃｏｕｌｄ ｍａｋｅ ｉｔ， ｗｈｉｃｈ ｉｓ Ｔｈｅ Ｉｎｔｅｒｎａｔｉｏｎａｌ ３ ｗｈｅｎ ｅｖｅｒｙｏｎｅ ｋｎｏｗ ｗｈｏ ｉｓ Ｍｕｓｈｉ． Ｈｉｓ ｐａｒｅｎｔｓ ａｒｅ ｖｅｒｙ ｐｒｏｕｄ ｏｆ ｈｉｍ ａｎｄ ｎｏｗ ｔｈｅｙ ｎｅｖｅｒ ｍｉｓｓｅｄ ｈｉｓ ｔｏｕｒｎａｍｅｎｔ ｇａｍｅｐｌａｙ． Ｍｕｓｈｉ＇ｓ Ｍｏｔｔｏ ： Ｎｅｖｅｒ ｇｉｖｅ ｕｐ！","tags":"#Mushi#NeverGiveUp#TI3#Dreams#dota2","favourites":0,"__v":0,"created_on":"2015-04-09T13:18:56.569Z","score":0},{"_id":"5526dcc50c88f703624a613c","id":1439,"pasta":"~卐卐 YOU HAVE BEEN VISITED BY THE SWASTIKA OF MEME FACES!! 卐卐~\nREPOST THIS 3 (THREE) TIMES IN THE NEXT 5 (FIVE) MINUTES OR YOU WILL JOIN THESE TORTURED SOULS IN THE SWASTIKA AS ANOTHER MEME FACE...\n눈 ͜ಎ눈                          눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈\n눈 ͜ಎ눈                          눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈\n눈 ͜ಎ눈                          눈 ͜ಎ눈\n눈 ͜ಎ눈                          눈 ͜ಎ눈\n눈 ͜ಎ눈                          눈 ͜ಎ눈\n눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈\n눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈\n                                       눈 ͜ಎ눈                          눈 ͜ಎ눈\n                                       눈 ͜ಎ눈                          눈 ͜ಎ눈\n                                       눈 ͜ಎ눈                          눈 ͜ಎ눈\n눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈                          눈 ͜ಎ눈\n눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈                          눈 ͜ಎ눈","tags":"#nazi#mods#dota2#lol#dota#4chan#maymay","favourites":5,"__v":0,"created_on":"2015-04-09T10:23:31.938Z","score":0.00005042734130633974},{"_id":"5526151ed49523105b248159","id":1435,"pasta":"Did you know Silencer used to be a father? He dated Naga (yeah, he's into that kinda shit) for 2 years in high school and married her a few years after that. They eventually had a mer-baby. Naga worked all week at the opera house so Nortrom was a stay at home dad. He dealt with crying every day and one day last worded the poor thing. After 5 agonizing seconds, his head exploded and Nortrom ran away for good. They say he's still out there, Last-Wording noisy kids. And that, son, is why you shut the fuck up when Daddy's trying to enjoy his two hours of free time a week and have a god damn beer.","tags":"#dota2#silencer#naga#dad#father","favourites":2,"__v":0,"created_on":"2015-04-09T05:18:43.484Z","score":0.000015869024549670382},{"_id":"55261504d49523105b248158","id":1434,"pasta":"You know those atomic clocks used in space that are always 100% accurate? IceFrog does something similar; an atomic scale! Unfortunately, IceFrog accidentally used Lead instead of Cesium, which is why Sniper is fucking broken","tags":"#dota2#icefrog#sniper#broken#clocks","favourites":2,"__v":0,"created_on":"2015-04-09T05:11:13.409Z","score":0.00001586866573186801},{"_id":"552614e6d49523105b248157","id":1433,"pasta":"Hi, I played against Sumail on a 7k account I bought. I'd get there myself, but i always queue with bad players and lose despite almost always being positive. Sumail took CK mid and when our jakiro said he's not a great mid sumail paused. He made us stay paused for 2 to 4 business days by promising to make us EG fill-ins if universe takes paternity leave after impregnating aui_2000. He then posted a link to a news article about a man killed by a letter-bomb while in a paused game of Defense of the Legends of the Storm of Newerth 2 (i think it was cnn). He then said nothing but \"New Meta fagots\" for the next 20 minutes because he was able to get brown boots 30 seconds earlier with jakiro's gold. He had arcane boots and dagon 2 at 40 minutes, but somehow we had all our towers. Sumail got first blood at 52 minutes when he Dagoned the afk bounty hunter and told us to report everyone on their team and help him push. I accidentally took the last hit on the tower and sumail went off for 10 minutes in all chat about how he would rape and kill my entire family in detail. He fed 6 times since he was in the middle of the lane but kept coming back to them to flame and then dying. I didn't say anything all game but i spoke up and called him \"desert trash\". Immediately both teams turned on me, spewing  personal and racial  insults for every race just to make sure i got offended. Our jungler pudge broadcast my location for the rest of the game and kept cliffing me. We won at 1 hour 42 minutes and that's how i got 18 games of low priority. Protip: don't insult a flaming pakistani","tags":"#dota2#sumail#bought#account#pakistan","favourites":4,"__v":0,"created_on":"2015-04-09T05:06:48.234Z","score":0.000039640184929416425},{"_id":"5525e2277ca4658f518f3fe2","id":1431,"pasta":"I run a 6-700 member guild full of angry foreigners this way. I originally did it to be an ass but now there are open guild parties for that guild literally 24/7, it's ridiculous. I refuse to play with them because everyone in the guild has ruined a game in some way lol.\n\nI also don't invite people just because they've had a bad game, you have to go above and beyond in your shit to get an invite lol. Usually it boils down to a combination of feeding all game and flaming everyone else. It's a very toxic guild, the chat is very angry seeming most of the time. It's hard to tell because it's mostly not in English lol.\n\nFor posterity, my guild is named \"You're God Awful at Dota\" and the tag is iFed","tags":"#feed#bulldog#singsing#arteezy#dota2","favourites":2,"__v":0,"created_on":"2015-04-09T01:56:21.434Z","score":0.000015859349536291074},{"_id":"5525e21c7ca4658f518f3fe1","id":1430,"pasta":"Ｈｉ Ｄａｒｕｄｅ. Ｍｙ ｄａｄ ａｌｗａｙｓ ｔｏｌｄ ｍｅ ｔｈｉｓ ｓｔｏｒｙ ｗｈｅｒｅ ｈｅ ｓａｉｄ ｈｅ ｗａｓ ｂａｃｋｓｔａｇｅ ａｔ ａ ｃｌｕｂ ａｎｄ ｗａｌｋｅｄ ｕｐ ｔｏ ａ ＤＪ ｐｅｒｆｏｒｍｉｎｇ Ｓａｎｄｓｔｏｒｍ. Ｍｙ ｄａｄ ｈａｔｅｄ ｔｈｅ ｓｏｎｇ ａｎｄ ｔｏｌｄ ｔｈｅ ＤＪ ｔｈａｔ ｉｔ ｗａｓ ｒｅｐｅｔｉｔｉｖｅ ａｎｄ ｃｏｕｌｄｎ＇ｔ ｕｎｄｅｒｓｔａｎｄ ｗｈｙ ｐｅｏｐｌｅ ｌｉｋｅｄ ｉｔ. Ｇｅｔｔｉｎｇ ａ ｗｅｉｒｄ ｌｏｏｋ ｆｒｏｍ ｔｈｅ ＤＪ ｍｙ ｄａｄ ｒｅｔｕｒｎｅｄ ｂａｃｋｓｔａｇｅ ａｎｄ ｔａｌｋｅｄ ｔｏ ｔｈｅ ｍａｎａｇｅｒ ｗｈｏ ｔｈｅｎ ｉｎｆｏｒｍｅｄ ｈｉｍ ｔｈａｔ ｔｈｅ ＤＪ ｈｅ ｉｎｓｕｌｔｅｄ ｗａｓ ｉｎ ｆａｃｔ ｙｏｕ. Ｄｏ ｙｏｕ ｒｅｍｅｍｂｅｒ ｔｈｉｓ ｂｙ ａｎｙ ｃｈａｎｃｅ？ Ｍｙ ｄａｄ ｆｅｌｔ ｐｒｅｔｔｙ ｂａｄ ａｎｄ ｗｏｕｌｄ ａｐｏｌｏｇｉｚｅ ｉｆ ｇｉｖｅｎ ｔｈｅ ｃｈａｎｃｅ ｓｏ Ｉ＇ｍ ｄｏｉｎｇ ｉｔ ｏｎ ｂｅｈａｌｆ ｏｆ ｈｉｍ. Ｉ ｏｎ ｔｈｅ ｏｔｈｅｒ ｈａｎｄ ｈａｐｐｅｎ ｔｏ ｌｉｋｅ Ｓａｎｄｓｔｏｒｍ ａｎｄ ａｐｐｒｅｃｉａｔｅ ｉｔｓ ｍａｓｔｅｒｙ ｏｆ ｔｈｅ ｄａｎｃｅ ｓｃｅｎｅ. Ｔｈａｎｋ ｙｏｕ！","tags":"#darude#sandstorm#dota2#lol#general","favourites":12,"__v":0,"created_on":"2015-04-09T01:52:32.033Z","score":0.00011697891955333459}]