[{"_id":"55cee13a2698f7be3d0ad883","id":1998,"pasta":"Haiiiiiii! ^____^ It's your kawaii Queen of Pain-chan desu-ne!!! (◕‿◕✿) I've been picked sooo many times at TI5 KYAAAAA!! >‿< my voice is sore, but that's fine because I'm the kind of girl who likes to get hurt! Can't wait to see you next game!!!","tags":"#dota2#queenofpain#ti5#theinternational","favourites":3,"__v":0,"created_on":"2015-08-15T06:50:34.623Z","score":0.0025156055744258374},{"_id":"55cee1392698f7be3d0ad882","id":1997,"pasta":"OSfrog THIS IS 17% LUCK OSfrog 17% SKILL OSfrog OSfrog 17% CONCENTRATED POWER OF WILL OSfrog 17% PLEASURE OSfrog 17% PAIN OSfrog 17% REASON TO UNINSTALL THE GAME OSfrog","tags":"#dota2#spirit_breaker#icefrog#balance#17%","favourites":0,"__v":0,"created_on":"2015-08-15T06:50:33.244Z","score":0},{"_id":"55cee1372698f7be3d0ad881","id":1996,"pasta":"(∩ ͡° ͜ʖ ͡°)⊃━☆ﾟ. * ･ ｡ﾟ. * 322 ☆ﾟ. * ･ ｡ﾟ. *","tags":"#dota2#322","favourites":5,"__v":0,"created_on":"2015-08-15T06:50:31.340Z","score":0.0044822727589151744},{"_id":"55cee12b2698f7be3d0ad87e","id":1993,"pasta":" ʕ ͡·ᴥ ͡· ʔ You've been visited by Hellbear Smasher of fortune. Clap your paws and copy paste this message 5 times without getting banned by mods and luck be with you for the next year ʕ ͡·ᴥ ͡· ʔ","tags":"#dota2#bear#twitch","favourites":2,"__v":0,"created_on":"2015-08-15T06:50:19.625Z","score":0.0014117973236024474},{"_id":"55cc12682ccec12862a3e7bc","id":1991,"pasta":"It all happened years ago when Twitch chat had had enough. They knew that something had to be done. Their plan was to kidnap a child, give him cancer, and make him meet IceFrog through Make-A-Wish Foundation. After kidnapping an orphan, they forced the poor kid to watch Twitch chat for 10 hours non-stop. He quickly fell terminally ill. Then they submitted the wish and waited. When the two finally met, IceFrog asked the boy if there was anything he wished for. After the kid told him his last wish, IceFrog fell silent. A tear rolled down his cheek as he answered: \"Yes, my little fansh*t, I will balance Glimmer Cape as your last wish.\". And thus in the patch 7.52 it finally happened, Glimmer Cape was nerfed. Its cooldown was increased by one second.","tags":"#dota2#twitch#icefrog#icefraud#glimmer","favourites":2,"__v":0,"created_on":"2015-08-13T03:43:36.923Z","score":0.001049105521827117},{"_id":"55cc125d2ccec12862a3e7b9","id":1988,"pasta":"I saw Artstyle walking into the event this afternoon and asked him to sign my badge. He agreed and signed it. It wasn't until he was walking away I noticed my badge wasn't signed. I was confused until I looked over at him and saw he had autographed his own badge.","tags":"#dota2#artstyle#shallowgrave#navibacktoukraine","favourites":5,"__v":0,"created_on":"2015-08-13T03:43:25.006Z","score":0.0033306454069121877},{"_id":"55cc12432ccec12862a3e7b8","id":1987,"pasta":"This is 17% luck, 17% skill, 17% concentrated power of will 17% pleasure; 17% pain, And a 17% reason to uninstall the game","tags":"#dota2#twitch","favourites":13,"__v":0,"created_on":"2015-08-13T03:42:59.973Z","score":0.008319818055842103},{"_id":"55cc12352ccec12862a3e7b6","id":1985,"pasta":"PogChamp You guys are absolutly revolting, calling every asian in dota Merlini. Privileged white people are ruining dota and I am getting angry, not to mention triggered. Don't you racists dare copy paste this, don’t even think about it. PogChamp","tags":"#dota2#merlini#white#people#triggered","favourites":0,"__v":0,"created_on":"2015-08-13T03:42:45.289Z","score":0},{"_id":"55cc12292ccec12862a3e7b5","id":1984,"pasta":"ti5 finals. Evil Genius vs Team Secret; Game Five\nAmazingly, Evil genius has managed to turn it around, and scrounge up two victories despite the first two games of the grand finals being devastating losses. Arteezy’s Max Backstab Riki build simply proved too strong for Evil Geniuses. Thankfully, while PPD was rushed to the medical tent to be treated for Salt poisoning Fear took his seat and banned it, but to complicate things further, Ice Frog, hallow be his name, took Suma1l’s advice from DACC at the start of the series, patching him out of reality, and into the game, where he became the new Storm Spirit. Fortuanatly, Gabe Newell’s son, Mason was on hand to take his place.\nEG thought they might actually be able to beat Secret in the final game, as S4 didn’t ban Suma1l Spirit, because he is cool. However, Secret finally breaks out their last pocket start, drafting Arteezy safelane farm techies. He builds midas first, followed by five more midases. Evil Geniuses were not expecting this, and are unable to counter it.Icefrog would later be quoted as saying “對不起，我真的很喜歡這個小怪物作為英雄”\nFinally, after three long hours, the game finally enters the mid game. Evil Geniuses, on radiant has been pushed back into their fountain, their ancient is exposed, Secret could end the game at any time, instead, they choose to fountain camp, killing Evil Geniuses over and over again. Finally, they drag Fear out, kicking and screaming, and bring him to Arteezy.\nFear’s life support system has begun to fail irl, both of his arms have snapped, yet he somehow managed to escape his base and take Dire’s top lane tier one, the first tower they have lost all game. Secret pledges to make an example of him.Arteezy must deal the final blow, to prove his loyalty to Secret, who have just revealed they are sponsored by Isis and the Illuminati.\nArteezy draws his midas, and prepares to deal the final blow, he fights back tears as he prepares to do what he knows he must. “Artour…” Fear finally says. “You were the last hope of NA dota.” Then fear dies irl and in game. there is no respawn timer. The audience falls silent, everyone can clearly hear the maniacal laughter of Team Secret. Finally, after several minutes, Zai stops laughing long enough to ask Arteezy why he is crying. “He was just some old man,” he reminds him.\nNo one is able to hear Arteezy’s response over the laughter. “He wasn’t just ‘some old man.’ He was my father.” The caliber of his sins are too much and as a final act of repentance, he screams “SUICIDE SQUAD, ATTACK!” and uses the bombs gifted to him by his sponsors to destroy himself, and take out the rest of his team. Sensing a chance to win, the Mason/Suma1l Archon blast out of their base, zip zopping all they way to Dire’s ancient, as techies mines were rigged to destroy every building on the map.\nThen tragedy strikes. The same black magic Puppey and Kuroky used to kill Na’Vi has brought them back as undead abominations. Dendi throws a perfect hook at Suma1l Spirit, catching him just as he runs out of mana.\nThe EG survivors yell to the audience, “NA DOTA, LEND US YOUR STRENGTH” but nothing happens because the NA dota scene is a joke. Finally though, a lone figure stands up in the crowd. Drinking one last Red Bull, Demon grows wings, and ascends to a higher plane of existence, becoming a being of pure energy, then sacrificing himself to give Suma1l a single bloodstone charge and just enough mana to escape and kill the xboct ghost, causing him to drop six rapiers. \"Classic Jimmy.\" Say all three Merlinis. A single tear running down their collective faces.\nWith his final bit of mana, he rockets towards the dire ancient, but alas, he wasn’t fast enough. Admiralbulldog destroys both ancients simultaneously, forever proving Rat Dota is best dota, winning the game for Alliance. The Aegis still goes to China for some reason.","tags":"#ti5#dota2#finals#arteezy","favourites":23,"__v":0,"created_on":"2015-08-13T03:42:33.114Z","score":0.013786846411446885},{"_id":"55cc12242ccec12862a3e7b4","id":1983,"pasta":"Hey EE I have a question about building Tiny. Should I max Avalanche like you give me an avalanche of feelings, Toss like you toss games away, Craggy Exterior like you are abrasive to your teammates, or Grow like the amount of times you throw grows?","tags":"#dota2#ee#eternalenvy#tiny#build","favourites":0,"__v":0,"created_on":"2015-08-13T03:42:28.608Z","score":0},{"_id":"55c6e04c93639d8d333a6438","id":1982,"pasta":"Haiiiiiii! ^____^ It's your kawaii Queen of Pain-chan desu-ne!!! (◕‿◕✿) I've been picked sooo many times at TI5 KYAAAAA!! >‿< my voice is sore, but that's fine because I'm the kind of gal who likes to get hurt! Can't wait to see you next game!!","tags":"#dota2#international#ti#flower#qop#qopypasta","favourites":20,"__v":0,"created_on":"2015-08-09T05:08:28.011Z","score":0.008075719411462038},{"_id":"55c6e00793639d8d333a6436","id":1980,"pasta":"░░░░░░░░░░░▄▄▄▄▄ ░░░░░░░▄▄█████████▄▄ ░░░░▄▀▀▀▀█▀▀▀▀▀▀█████▄ ░░▄██████░░REPOST░░░▀██ ░▐██████▌░░TO░RESURRECT▐▌ ░███████▌░░░░░░░░░░░░░░█ ▐████████░░░░HITLER░░░░░░█ ▐██████▌░░░░░▄▀▀▀▀▀▄░▀░▄▄▌ ░█▀▀███▀░░░░░░▄▀█▀░░░▐▄▄▄▌ ▐░▌▀▄░░░░░░░░░░▄▄▄▀░░░▌▀░▌ ░▌▐░░▌░░░░░░░░░░░▀░░░░▐░▐ ░▐░▀▄▐░░░░░░░░░░░▌▌░▄▄░▐░▌ ░░▀█░▄▀░░░░░░░░░▐░▐▄▄▄▄▀▐ ░░░▌▀░▐░░░░░░░░▄▀░░▀▀▀▀░▌ ░░░▐░░░░░░░░░▌░░░▄▀▀▀▀▄▐ ░░░▌░░░░░░░░░▐░░░░░▄▄░░▌ ░░█▀▄░░░▐░▐░░░░░░░░░░░█ ░█░█░▀▀▄░▌░█░░░▀▀▄▄▄▄▀ █░░░▀▄░░▀▀▄▄█░░░░░▄▀ ░░░░░░▀▄░░░░▀▀▄▄▄▀▐ █░░░░░░░▀▄░░░░░▐░▌▐ ░█░░░░░░░░▀▄░░░▌░▐▌▐ ░░█░░░░░░░░░█░▐░▄▄▌░█▀▄ ░░░█░░░░░░░░░█▌▐░▄▐░░▀▄▀▀▄▄ ░░░░█░░░░░░░░░▀▄░░▐░░░▀▄░░░▀▀▄▄ ░░░░░▀▄░▄▀█░░░░░█░░▌░░░░▀▄░░░░░█ .....l","tags":"#dota2#ti5","favourites":28,"__v":0,"created_on":"2015-08-09T05:07:19.082Z","score":0.010822446620932355},{"_id":"55c6dfbf93639d8d333a6435","id":1979,"pasta":"Hi, 5k player here who reported Bulldog. Bulldog was our position 1 Bloodcyka. He built boots of travel and had around 3 Eul's in his inventory. He would run back to base midfight with his 2000ms, buy a new Eul's and proceeded to yell \"GOTTA GO FAST\". We gave him position 1 farm so he could be a Racecar. His unorthodox build ruined our game and gave the enemy ez MMR. I felt it deserved a report.","tags":"#dota2#bulldog#bloodcyka#sonic","favourites":2,"__v":0,"created_on":"2015-08-09T05:06:07.424Z","score":0.0006942089193470916},{"_id":"55c6df6993639d8d333a6432","id":1976,"pasta":"HEY LEAFEATOR, I'M TRYING TO LEARN TO PLAY NECROPHOS. I JUST HAVE A QUESTION ABOUT THE SKILL BUILD: DO I MAX DEATH PULSE LIKE YOUR GUIDE BRINGS DEATH, HEARTSTOPPER AURA LIKE THE STOPPING HEARTS OF MY TEAMMATES WHEN I TELL THEM I WILL DO ANCIENTS OR SADIST LIKE THE CRAZY SADIST YOU ARE\n","tags":"#dota2#leafeator#necrophos#guide#reddit","favourites":0,"__v":0,"created_on":"2015-08-09T05:04:41.449Z","score":0},{"_id":"55c05fb9ccc3f041309573ef","id":1964,"pasta":"PLIIZ STAHP SPAMMING!!!! I want to have nice conversations about strats and itembuilds here!!! DON'T SPAM SHIT PLIZ!!!","tags":"#twitch#nospam#Dota2","favourites":3,"__v":0,"created_on":"2015-08-04T06:46:17.456Z","score":0.0008486139811455276}]