[{"_id":"5525a295c9171108466945d1","id":1429,"pasta":"(◕‿◕✿) IT'S TIME FOR AN AUTISM TEST! rtzW ✓ singsingWat ✓ wagaTa ✓ syndErwin ✓sourfacePoo ✓envyGebak ✓ CONGRATULATIONS ON NOT BEING AN AUTIST (◕‿◕✿)","tags":"#test#dota2#autism","favourites":2,"__v":0,"created_on":"2015-04-08T21:24:16.692Z","score":0.000039264884943464166},{"_id":"5524aec7b8946d192e783e40","id":1425,"pasta":"ARE YOU READY SECREKT FANSHITS? EleGiggle ARE YOU READY TO SEND MY KIDS TO COLLEGE? 4Head SoBayed THINK ILL SEND THEM TO BUGATTI UNIVERSITY EleGiggle","tags":"#dota2#bugatti#secret#college","favourites":9,"__v":0,"created_on":"2015-04-08T03:38:47.223Z","score":0.0002206518457864749},{"_id":"552454ddf13e0576299e163e","id":1423,"pasta":"I'm really enjoying Xyclopz's take on this draft. When he pointed out ching chong chang I wasn't sure but then he said bing ting tang and I could see his point of view. When he called the bingalingting that was when I knew he was a genius.","tags":"#xyclopz#SEA#Caster#Dota2","favourites":13,"__v":0,"created_on":"2015-04-07T19:00:48.828Z","score":0.00030836117182113826},{"_id":"55234f44d7aaddd319c2dfa5","id":1420,"pasta":"In the cold harsh winter that is the pre-TI landscape, the mighty team Leviathan lingers, waiting for an opportunity to strike. With more commitment than a lovestruck romantic, and more skills and dedication than a Navy Seal, the mighty members of Leviathan trod on through the snowy, harsh wasteland that is the North American dota 2 scene. Those that walk the rough paths through Mordor and escape unharmed are those which we should fear most, and being that Leviathan stands tall, the powers that have ruled this land for some time should take notice and cower. They are coming for you, EG. You cannot run, you cannot hide, all you can do is kiss your asses goodbye, because the tides they are a changing, and from those tides will rise a Leviathan.","tags":"#dota2#winter#EG#leviathan","favourites":1,"__v":0,"created_on":"2015-04-07T03:11:21.933Z","score":0},{"_id":"5522d71ed7aaddd319c2df9f","id":1417,"pasta":"cause I wanted to be like ixmike... I wanted to touch the stach..... I wanted to be cool. America.... It begins ","tags":"#dota2#ixmike#rapsong#parody","favourites":0,"__v":0,"created_on":"2015-04-06T17:17:46.019Z","score":0},{"_id":"5521a85d05bc3c2d7b4c6b7a","id":1413,"pasta":"THE HALLOWED ONE, THE MASTER OF STRATEGY, THE KING OF GANK, THE SULTAN OF PUSH, THE TSAR OF TEAMFIGHT, THE SLAYER OF EHOME, THE CAPTAIN OF THEYYEAR 2010, THE CHAMPION OF THE INTERNATIONAL THE ONE AND ONLY ARTSTYLE IS BACK TO NATUS VINCERE!!!","tags":"#dota2#artstyle#navi","favourites":5,"__v":0,"created_on":"2015-04-05T21:21:47.078Z","score":0.00012138467582601396},{"_id":"552072edc2046e616a47eb2f","id":1410,"pasta":"It was a tragic story of the bird family and thr evil Venomancer. Wielding the Hand of Midas, Venomancer turned the old father bird into gold, leaving the two childrens with a deadly plague ward. Knowing they cannot beat the almighty Venomancer, they avenge their father's death by killing the ward. One of them dies in the battle, while the other is poisoned badly, and would die as time pass by. Not long after, the Venomancer returns to watch the small bird die in suffer, but a huge rock smacks the poor bird with a fuckin tree, killing the last of the bird family in one swing.","tags":"#dota2#singsing#midas#venomancer","favourites":2,"__v":0,"created_on":"2015-04-04T23:06:35.863Z","score":0.00003792507639075777},{"_id":"552057bdc2046e616a47eb2d","id":1409,"pasta":"So no one has figured out why Alliance are doing so well? Last year they didn't perform very well at TI, and do you know why? Because of s4 and EGM (no offense guys, keep reading). With EGM and s4 Alliance could only play with 3/5 of their potential. Neither s4 or EGM has an A in their name, but now we have M[A]dshka, P[A]jkatt, [A]kke, Niqu[A] and Lod[A]. It is obvious that they should be doing well. ","tags":"#dota2#alliance#a#name#[A]","favourites":2,"__v":0,"created_on":"2015-04-04T21:19:06.151Z","score":0.000037900418197211906},{"_id":"55203effc2046e616a47eb2b","id":1408,"pasta":"OpieOP * x = 322 FIND THE VALUE OF X","tags":"#dota2#opieop#xboct#322","favourites":5,"__v":0,"created_on":"2015-04-04T19:35:16.386Z","score":0.00012025079914796754},{"_id":"5520374dc2046e616a47eb28","id":1407,"pasta":"HEY (insert team name here) FAN-HUMANS, TY FOR THE EASY CHILD SUPPORT PAYMENTS, NOW I CAN AFFORD TO PAY MY ILLEGITIMATE CHILDREN. NO MORE BABY MAMA DRAMA HERE 4Head","tags":"#dota2#bugatti#bets#child#support","favourites":7,"__v":0,"created_on":"2015-04-04T19:01:04.464Z","score":0.00016855471284578935},{"_id":"551f63b91726c1da61e62be0","id":1403,"pasta":"Halo Artur-sama, mi name es Carlito Raymundo, i born in Peru and i mental retarded because i peruvian, i a big fan of you stream and i love your music, give me a shot please. No copi pasterino capuccino alpaccino pl0x is me stori","tags":"#dota2#rtz#peru#arteezy#arttours","favourites":2,"__v":0,"created_on":"2015-04-04T03:26:27.869Z","score":0.00003765593897085865},{"_id":"551e0f5e7e4986a85d9bdb7b","id":1399,"pasta":"Hey S4 Big Fan of yours!!! I got kicked out of my house, ( Im 27) so Ive bought a ticket and am heading to sweden. I found your address on the internet. Im nott a creeper xd. Im a high skill dota player same mmr as you (3.9k) We could play dota togethor. You havent replied to any of my tweets so Im asking in chat. c u soon","tags":"#dota2#s4#kicked#house#same#MMR","favourites":3,"__v":0,"created_on":"2015-04-02T22:01:47.144Z","score":0.0000663895059744506},{"_id":"551e0efd7e4986a85d9bdb7a","id":1398,"pasta":" TQ Wheel Fanstraights 4Head EleGiggle I'll use your rares to buy new WHEELs for my DXRacer Bugatti 4Head EleGiggle 28% odds 4Head EleGiggle","tags":"#wheel#dota2#rares","favourites":0,"__v":0,"created_on":"2015-04-02T23:52:01.691Z","score":0},{"_id":"551d71ec3b30162b599ea7bd","id":1397,"pasta":"I sexually Identify as a Peyhey. Ever since I was a boy I dreamed of streamcheating against disgusting meme streamers. Barnyyy says to me that I should drink bleach and I’m fucking retarded but I don’t care, I’m beautiful. I’m creating a Reddit thread to make the hivemind hate Barnyyy for a week before they go back to bitching about the comeback mechanic and suma1l. Thank you for listening.","tags":"#dota2#barnyyy#sexually#identify#peyhey","favourites":2,"__v":0,"created_on":"2015-04-02T13:38:03.731Z","score":0.0000371481611073762},{"_id":"551d71ce3b30162b599ea7bc","id":1396,"pasta":" I sexually Identify as an Ice Ogre. Ever since I was a boy I dreamed of frost armoring over the jungle dropping cold sticky loads on disgusting sniper pickers. People say to me that a person being an ice ogre is Impossible and I’m fucking retarded but I don’t care, I’m beautiful. I’m having a plastic surgeon install blue skin and two heads, a club and a big dick on my body. From now on I want you guys to call me “Ogre-kun” and respect my right to frost armor from below and meme needlessly. If you can’t accept me you’re a ogrephobe and need to check your jungle privilege. Thank you for being so understanding.","tags":"#dota2#barny#sexually#identify#ice#ogre","favourites":1,"__v":0,"created_on":"2015-04-02T11:20:42.892Z","score":0}]