[{"_id":"54d923c3c96a20695f2fb680","id":748,"pasta":"ʕ ͡•ᴥ ͡• ʔ(_̅_̅_̅SALAMI_̅_̲̅_̅_̅_̅()","tags":"#dota2#tucker#the#fucker#singsing#bear","favourites":1,"__v":0,"created_on":"2015-02-09T20:47:25.717Z","score":0},{"_id":"54d916b3c96a20695f2fb67e","id":747,"pasta":"Potassium cykanide is a compound with the formula RTZ. This colorless crystalline salt, similar in appearance to rap, is highly soluble in twitch. Most RTZ is used in gold mining, necrobook synthesis, and ratting. Smaller applications include mid feeding for salt and tears.[2]\nRTZ is highly toxic. The moist solid plays only in small amounts of cykanide due to help from supports, which smells like EE's tears.[3] Not everyone, however, can smell this; the ability to do so is a genetic(asian) trait.","tags":"#dota2#rtz#arteezy#eternalenvy#ee#salt#potassium","favourites":9,"__v":0,"created_on":"2015-02-09T19:49:21.693Z","score":0.0006874683709524045},{"_id":"54d9168cc96a20695f2fb67d","id":746,"pasta":"EE sat in a dark room. The words \"EG Victory\" filled up the screen. Not even Black's TB could win this game. 4/2/7 KDA. Tears filled EE's eyes as he caressed his hand of midas. The sound of hard core anime music and crying filled the room. The door creaks open and Aui enters the room. \"I won Jacky.\" \"You do know what happens when I win.\" EE removed his clothes, carrying only EG's rapier trophy. Aui removed his clothes, \"I won $1,284,158. Thats how many hours your punishment will be.\" EE spent the next 1,284,158 hours being furiously fucked by his ex-teammate. After the punishment the semen covered EE arised. \"Thank you master, I can't wait to return the favor when I win first place.\" Aui smiled. \"In your dreams Jacky.\"","tags":"#dota2#EE#eg#victory#black^#midas#aui","favourites":16,"__v":0,"created_on":"2015-02-09T18:23:11.355Z","score":0.0011592553423805947},{"_id":"54d83cecb898625b08cd362e","id":743,"pasta":"THE POWER OF SALT SHALL PREVAIL PJSalt ","tags":"#dota2#ppd#peter#dager#salt#prevail","favourites":1,"__v":0,"created_on":"2015-02-09T04:50:57.221Z","score":0},{"_id":"54d81ddcb898625b08cd362a","id":741,"pasta":"i expect us to win every lan\" - s4 2015","tags":"#dota2#s4#lan#tournament","favourites":43,"__v":0,"created_on":"2015-02-09T02:36:25.354Z","score":0.002694862599274688},{"_id":"54d7c1544cdf1142657fb74e","id":735,"pasta":"Arteezy gets first blood on Suma1L mid and he says, \"That's how you do it, son.\" Then Universe comes down the lane, hand in hand with his princess, Aui_2000, and proclaims, \"Don't you talk to my nephew that way.\" But then Fear rolls down midlane in his wheelchair -- old man, Father Fear -- looks directly into Arteezy, his son's eyes and softly says, \"Where am I?\"","tags":"#dota2#sumail#eg#rtz#arteezy#first#blood","favourites":90,"__v":0,"created_on":"2015-02-08T19:17:32.926Z","score":0.005005374544925248},{"_id":"54d7205e1a3a7b6f61f33d0c","id":734,"pasta":"ʜᴇʏ ʙɢ I ᴄᴀɴ ʜᴇᴀʀ ʏᴏᴜ ғʀᴏᴍ ʜᴇʀᴇ","tags":"#dota2#dac##hey#BG#hear","favourites":2,"__v":0,"created_on":"2015-02-08T08:17:17.428Z","score":0.00011766161498162346},{"_id":"54d6d03b211684035da0a3c6","id":731,"pasta":"Hello SingSing, I am Jon, a Twitch Admin, I am here to inform you that you are showing too much skin. According to the 3rd article of the 22nd section of the twitch rules, showing too much skins would get you perma banned. Please stop showing your knees and corrupting our viewers..","tags":"#dota2#singsing#sing#twitch#322#admin","favourites":12,"__v":0,"created_on":"2015-02-08T02:32:14.216Z","score":0.0008634219945437054},{"_id":"54d68e678cf1074258038bca","id":728,"pasta":"Dota has great storylines, the story of Na'Vi the main character of the first 3 TI, IG's reign of terror, Alliance's rat dota dominance, that of EG... of Arteezy the young prodigy, burning/rotk brotherhood, Ehome LGD rivalry, SingSing's popularity, Dendi introducing AdmiralBulldog into the scene... IceIceIce and HyHy of SEA, old MYM with Maelk, Merlini, Misery, Loda.... so many great memories in the timeline of the teams and players.\n\nAnd then we have EE and his crew of Clown 9, the comic relief.﻿","tags":"#dota2#cloud9#EE#storylines","favourites":8,"__v":0,"created_on":"2015-02-07T21:01:17.625Z","score":0.0005895294420484088},{"_id":"54d68e568cf1074258038bc9","id":727,"pasta":"Hello my name is Alan Turing the mind behind the Bone(7)=(3+2+2) revelation. I have come out of hiding to release new information. I have been trying to break team secrets 'enigmas code' for several long weeks and it has come to my attention that there is an underlying code to be found. With the use of a rudimentary substitution cipher, which takes all letters of the alphabet and assigns them a number I have broken the code, when combining the players of team secret. Puppey = 99, Arteezy = 100, Kuroky = 101, S4 = 22 and taking the total of this substitution cipher it shows the true secret of team secret 99+100+101+22 = 322. 'Enigmas code' broken. Puppey plays Enigma, he is the enigmas code. Your minds have been awakened, do not take this information lightly. Puppey is the true 322 Hand of God, do not be fooled by the smoke and enchantments of Puppey Aka the Puppet Master, coincidence? You decide... Good day ladies and gents, from a true British war hero.","tags":"#dota2#turing#team#secret#dota#322","favourites":11,"__v":0,"created_on":"2015-02-07T17:42:12.743Z","score":0.000791239463285045},{"_id":"54d68e4b8cf1074258038bc8","id":726,"pasta":"I'm sorry, but did C9 already lose? Oh, that's right. The game isn't even over yet. In fact, it's only third game. Does not having the lead at third game count as a loss? Is that what you're saying? Because if you're saying that I can assure you that you're wrong. Why would you make this topic when the game is still on? C9 are still playing right now and they have been the best team in Dota for how many years now? They're playing one of the worst teams in the DAC who just happen to have a lead because they're feeding off the energy of playing in 3 million tournament. But you know what? They still fucking suck. C9 are one of the best fucking teams in DOTA, they went 13-3 last year and would of won ti4 if the carry didn't choke. Maybe you should shut the fuck up before you make retarded topics like this. You know why? Because you're going to be embarrassed when C9 wins and someone bumps this topic. Oh look at that, Secret just overextended and lost the whole team, just like Na'Vi did. Are you a fucking drunk? Are you retarded? Are you autistic? You are a fucking idiot and you should never make a topic on this board again and I'm fucking serious. I almost have a feeling you're the only guy making all these anti-C9 topics because you're a faggot hater who doesn't like the team because they're good. Fuck you, be good at something in YOUR life and then maybe try to troll these fucking teams on the board, like I give a fuck. It's so easy to spot out your threads now, you're a retard. Always doing stupid shit like this. Why don't you try to be a good poster? Just for once? For once in your fucking life try not to make a topic like this. That's just you, you're always right at getting it wrong. Fuck you. You are nothing.","tags":"#dota2#c9#lose#navi#secret","favourites":2,"__v":0,"created_on":"2015-02-07T17:08:35.718Z","score":0.00011608025042494235},{"_id":"54d68e388cf1074258038bc7","id":725,"pasta":"░░░▄▀█▓▓█████▓▓▓█ ░░░▄█▓▓█████████▓▓█▌ ░░█▓▓██▓▓▓▓▓▓█████▓█ ░▐███████████▓▓████▓█ ░▐▌██▀▐▀▐▀▐█▌▀▌▐▀█▓██ ░▐░██░▄▀▀▄░░▄▀▀▄▒█▓█▌ ░░░▐▌▌░(♥)▌░░░(♥)▌▒█▓█▌ ░░░░░▌░░▀░░░░░▀░▒█▓█▌ ░░░░▐█░░░░░▀░▀░▀░░▓▓░ ▄██▄ ░░░░███░░░░▄██▄▄▄▄▄█▄▄████ ░░░▐▓███░░███████████████▄ ░░▐░░▓░▓░░░▀██▀▀▀▀▀█▀▀████ ░░▐░░▓▄▄░▓░▄░░▄░▄░▓▓░░▀██▀ SHEEVER Stop!","tags":"#dota2#sheever#stop","favourites":0,"__v":0,"created_on":"2015-02-07T17:04:16.088Z","score":0},{"_id":"54d68e2e8cf1074258038bc6","id":724,"pasta":"You dont understand chat, you cant take pride in winning a tournament if you dominate from start to finish. Anime teaches us you have to overcome at least three to two odds if you want victory to be truly meaningful.","tags":"#dota2#anime#cloud9#322","favourites":0,"__v":0,"created_on":"2015-02-07T11:53:09.941Z","score":0},{"_id":"54d4eb9701ae2be31cb3df93","id":717,"pasta":"IceFrog doesn't exist (srs). Valve made it up; they always planned to take over DotA but needed to create a persona that the average gamer could relate to - a programming wizard kid who builds the game from his bedroom at night listening to the wishes of his followers as he balances the game. They build up the trust of the community until suddenly they release Dota 2 to the world under the guidance of this so-called \"IceFrog\". Pls no coperino pasterino","tags":"#dota2#reddit#TeDeumLaudamus#IceFrog#valve","favourites":12,"__v":0,"created_on":"2015-02-06T12:10:30.483Z","score":0.0008346793254856395},{"_id":"54d4ea5b01ae2be31cb3df91","id":715,"pasta":" I wish Eternal envy never became a popular dota 2 player. Now my entire family refuses to give their children vaccines in case they end up like EE. Please no copy vaccerino Kappa","tags":"#dota2#EE#eternalEnvy#vaccine#autism","favourites":6,"__v":0,"created_on":"2015-02-06T10:36:44.021Z","score":0.00043209252419268895}]