[{"_id":"56f83c09709549ef048c494e","id":2624,"pasta":"TheThing MAKE NA DOTA GREAT AGAIN! TheThing","tags":"#dota#dota2#trump#nadota#na","favourites":3,"__v":0,"created_on":"2016-03-27T20:01:13.927Z","score":0.00010190793048238184},{"_id":"56f83c03709549ef048c494d","id":2623,"pasta":"I start to play LD and watching Pro playing. why they Invest all item to little bear? sometime the bear dead and I be useless for 120 sec even buyback with almost zero item.\nI want to ask if there is any guide that all item focus on the main bear ( like playing troll or drow) and the little bear just work as bonus disable and pushing tool? not the main hero.","tags":"#dota2#lonedruid","favourites":3,"__v":0,"created_on":"2016-03-27T20:01:07.849Z","score":0.00010190784369520139},{"_id":"56f83b6d709549ef048c4946","id":2616,"pasta":" PuppeyFace it's a dirty game PuppeyFace it's a dirty world PuppeyFace i kicked w33ha like a pregnant girl PuppeyFace I stole RTC and Universe to get that paper PuppeyFace when it comes to screwing peter i got a major PuppeyFace","tags":"#dota#dota2#puppey#secret#rtz#w33#kick","favourites":16,"__v":0,"created_on":"2016-03-27T19:58:37.725Z","score":0.0005462811268602463},{"_id":"56ea34f4709549ef048c48ed","id":2585,"pasta":"Audience. We've had issues with the audience at previous events. Some Valve people lobbied to bring the audience back for Shanghai, feeling that they deserved another chance. That was a mistake. The audience are asses, and we won't be working with them again.","tags":"#dota2#2gd#Yames#Valve#Gaben","favourites":1,"__v":0,"created_on":"2016-03-17T04:39:16.845Z","score":0},{"_id":"56ea34f1709549ef048c48ec","id":2584,"pasta":"You're a piece of shit, wait nononono. You're 2 pieces of shit stuck together in a shit factory where they make shit you piece of shit. And do you know what they do to pieces of shit? Nothing, 'cause they are pieces of shit and you can't do anything with pieces of shit. I've tried and so far I got nothing out of you.","tags":"#rekt#shit#pieces#of#LoL#dota2","favourites":30,"__v":0,"created_on":"2016-03-17T04:39:13.586Z","score":0.0008370879843210718},{"_id":"56ea32a9709549ef048c48d7","id":2563,"pasta":"He is faster ᕙ DansGame ╱ He is stronger ᕙ DansGame ╱ Who is he ᕙ DansGame ╱ The mighty DONGER ᕙ DansGame ╱","tags":"#dota#dota2#admiral#bulldog#donger#bulldong","favourites":16,"__v":0,"created_on":"2016-03-17T04:29:29.652Z","score":0.0004832256136816797},{"_id":"56ea32a6709549ef048c48d6","id":2562,"pasta":"ｈｅｒｅ　ｉｎ　ｍｙ　ｇａｒａｇｅ　ｗｉｔｈ　ｍｙ　ｄｉｖｉｎｅ　ｒａｐｉｅｒ，　ｂｕｔ　ｙｏｕ　ｋｎｏｗ　ｗｈａｔ　ｉ　ｌｉｋｅ　ｍｏｒｅ　ｔｈａｎ　ｄｉｖｉｎｅ　ｒａｐｉｅｒｓ？　ｗａｒｄｓ．　ｔｈａｔｓ　ｗｈｙ　ｉ　ｂｏｕｇｔ　６　ｉｎｖｅｎｔｏｒｙ　ｓｌｏｔｓ　ｗｏｒｔｈ　ｏｆ　ｗａｒｄｓ　ａｎｄ　ｆｉｌｌｅｄ　ｔｈｅｍ　ａｌｌ　ｗｉｔｈ　ｗａｒｄｓ．ｉ　ｄｉｄｎ’ｔ　ｂｕｙ　ｔｈｅ　ｒａｐｉｅｒ　ｊｕｓｔ　ｔｏ　ｓｈｏｗ　ｏｆｆ，　ｉ　ｂｏｕｇｈｔ　ｉｔ　ａｓ　ａ　ｒｅｍｉｎｄｅｒ　ｔｈａｔ　ｔｈｅ　１０ｋ　ｄｒｅａｍ　ｉｓ　ｓｔｉｌｌ　ｐｏｓｓｉｂｌｅ","tags":"#dota2","favourites":2,"__v":0,"created_on":"2016-03-17T04:29:26.083Z","score":0.00005059105082146736},{"_id":"56ea306b709549ef048c48bb","id":2535,"pasta":"Low impact Abilities ? ✓ EleGiggle Forced Meta? ✓ 4Head no mana managment required ? ✓ BrokeBack greedy p2w system? ✓ SoBayed Must be League of Peasants ✓ SeemsGood\n","tags":"#dota2","favourites":3,"__v":0,"created_on":"2016-03-17T04:19:55.328Z","score":0.00009013647003914734},{"_id":"56ea2fd3709549ef048c48b6","id":2530,"pasta":"I just realized that these players must have played a decent amount of unranked games to unlocked ranked. Why is this realization so important? Let me explain to you. If these players have played a lot of Dota and still play like this, they must be mentally retarded. Do you think it's fun to laugh at retarded people? I don't think it's fun, and therefore I will not laugh.","tags":"#dota2","favourites":2,"__v":0,"created_on":"2016-03-17T04:17:23.864Z","score":0.000050586410231171766},{"_id":"56dfad26709549ef048c4878","id":2518,"pasta":"He just said to his team mate \"Hope you kill yourself\" because arteezy is losing and needs someone to blame. What if this guy was an RTZ fan who was depressed and rtz just pushed him over?Can we do something about this reddit? It is so unprofessional. I'm going to write to EG sponsors. Honestly EG never should have picked up Arteezy, he's clearly overrated and an immature kid.","tags":"#dota2#EG#Arteezy#RTZ#Right#Left","favourites":3,"__v":0,"created_on":"2016-03-09T04:57:10.423Z","score":0.00008282631570350846},{"_id":"56dfacf0709549ef048c4874","id":2514,"pasta":"OMGScoots MEN LIE OMGScoots WOMEN LIE OMGScoots STATS DONT OMGScoots","tags":"#dota2#mafia#nahaz#stats","favourites":9,"__v":0,"created_on":"2016-03-09T04:56:16.189Z","score":0.0002629554685412224},{"_id":"56b8f2246a87c39f5b271542","id":2510,"pasta":"Whatever kid. Oh I'm sorry did I fucking trigger you? Were you fucking triggered you little cry baby? Fuck off. Literally saying not a fucking word to you and you're gonna fucking mute me because you have a problem with me just fucking talking shit in all chat? Honestly go fuck yourself to the highest fucking caliber you fucking asshole. So sick of little fucking bitches like you who fucking have a fucking opinion like you're fucking sitting over there like, oh I'm some fucking problem to you because I'm not even fucking saying a fucking word to you. Fuck off. Call it what you fucking asshole? Hormonal? Kid you're a fucking bullshitter. You're a fucking bullshitter. Go fuck yourself. You ain't fucking nothing. You ain't fucking anyone. You ain't got a fucking clue in your fucking head who I am or what I'm fucking about. That I'm fucking calling these fucking kids tryhards, has your fucking panties in a bunch for what? For what? For fucking what kid? Honestly I'm fucking sick of kids like you. Literally go fuck yourself. Go fuck yourself and everything that you fucking stand for because I'm gonna tell you right now, you don't stand for shit kid. You don't stand for fucking shit. Please. Yeah, talk in all chat. Yeah like anybody fucking cares kid go find a fucking friend to talk to, right? Because you can't fucking talk to me, you can't fucking treat me like a fucking person. You ain't fucking real kid. You ain't fucking real. You ain't got a fucking real fucking bone in your fucking body kid. So go fucking all chat, and make some fucking friends. Alright? You can make some fucking friends because \"Oh, this guy's hormonal,\" pffft \"Uh I'm gonna mute him,\" pffft fuck off. You're literally a fucking cancer on this fucking world kid. Never fucking forget it.","tags":"#dota2#trigger#mute#hormonal#fucking","favourites":511,"__v":0,"created_on":"2016-02-08T19:53:08.826Z","score":0.006403078929804587},{"_id":"56b8f2106a87c39f5b271540","id":2508,"pasta":"why do you noobs think eg lost the majors and starladder? it's cuz rtz and sumail are too lazy to get 8k mmr. their work ethic and practice has translated to their in-game skill","tags":"#dota#eg#rtz#sumail#dota2","favourites":3,"__v":0,"created_on":"2016-02-08T19:52:48.839Z","score":0.00006323213921542988},{"_id":"56b8f20a6a87c39f5b27153f","id":2507,"pasta":"ACTS LIKE A TIER 1 PLAYER ✓ UncleNox POKES HIS NOSE INTO BACKSTAGE ✓ UncleNox GETS CHOKED in GAME ✓ UncleNox GETS CHOKED IRL ✓ UncleNox MUST BE LODA ✓ SeemsGood","tags":"#loda#alliance#dota2","favourites":7,"__v":0,"created_on":"2016-02-08T19:52:42.784Z","score":0.00015795692435605343},{"_id":"569ef2e2c41d20f176ef71e4","id":2489,"pasta":"So my friend who was slightly retarded (75 IQ) couldnt play dota with me, cause dota requires a lot of logic and brain, i downloaded him CS:GO and after 2 weeks i see he became global elite, i just wana say THANK YOU VALVE, for creating games like cs:go for every kind of people out there, people who cant play mentally challenging games like dota 2, starcraft and others, thanks you valve once again.","tags":"#dota2#csgo#retarded#brother","favourites":112,"__v":0,"created_on":"2016-01-20T02:37:22.218Z","score":0.001541671976989676}]