[{"_id":"551d71933b30162b599ea7ba","id":1394,"pasta":"HELLO I'AM LEGALLY BLIND AND CAN'T SEE THE SCORE THAT IS ON THE FKING SCREEN, SCORE?","tags":"#Score#Blind#Legally#Dota2","favourites":3,"__v":0,"created_on":"2015-04-02T16:33:59.357Z","score":0.000042357344043522324},{"_id":"551c3ed55a714a1e53683b99","id":1390,"pasta":"୧༼ಠ益ಠ༽୨QONK IS STRONK ୧༼ಠ益ಠ༽୨","tags":"#dota2#synderen#qonk#donger","favourites":1,"__v":0,"created_on":"2015-04-01T14:07:20.817Z","score":0},{"_id":"551b749b972b3991479554e9","id":1386,"pasta":"﻿Ｉ＇ｖｅ  ｈｅａｒｄ  ｎｕｍｅｒｏｕｓ  ｒｅｐｏｒｔｓ  ｆｒｏｍ  ｐｅｏｐｌｅ  ｓａｙｉｎｇ  ｔｈｅ  ｇａｍｅ  ｗｏｎ＇ｔ  ｓｕｒｖｉｖｅ  ａ  ｆｅｗ  ｍｏｒｅ  ｙｅａｒｓ  ｄｏｗｎ  ｔｈｅ  ｔｒａｃｋ．  Ｄｏ  ｙｏｕ  ｂｅｌｉｅｖｅ  ｔｈｉｓ  ｔｏ  ｂｅ  ｔｒｕｅ  ａｎｄ  ｗｉｌｌ  ｔｈｅ  ｇａｍｅ  ｓｌｏｗｌｙ  ｄｉｅ  ｏｕｔ？  Ｔｏ  ｂｅ  ｈｏｎｅｓｔ，  Ｉ  ｈａｖｅ  ｂｅｅｎ  ｐｌａｙｉｎｇ  ａ  ｌｏｔ  ｌｅｓｓ  ＤＯＴＡ  ｏｖｅｒ  ｔｈｅ  ｐａｓｔ  ｆｅｗ  ｍｏｎｔｈｓ，  ｄｕｅ  ｔｏ  ｕｎｓｔａｂｌｅ  ｍｅｔａ  ａｎｄ  ｐｅｒｓｏｎａｌ  ｒｅａｓｏｎｓ．  Ｉ  ｈａｖｅ  ａｌｓｏ  ｓｔｏｐｐｅｄ  ｆｏｌｌｏｗｉｎｇ  ｐｒｏ  ｇａｍｅｓ，  ｓｉｎｃｅ  ａｌｌ  ｍｙ  ｆａｖｏｒｉｔｅ  ｔｅａｍｓ  ｌｉｋｅ  ｃｌｏｕｄ９  ｋｅｅｐ  ｒｏｔａｔｉｎｇ  ｔｈｅｉｒ  ｌｉｎｅｕｐ．  Ｉ＇ｍ  ｓｔｉｌｌ  ｅｎｔｅｒｔａｉｎｅｄ  ｂｙ  ＲＴＺ，  Ｂｕｌｌｄｏｇ  ａｎｄ  Ｓｉｎｇ＇ｓ  ｓｔｒｅａｍｓ  ｈｏｗｅｖｅｒ．","tags":"#dota2#dedgaem#rtz#singsing#bulldog#arteezy","favourites":2,"__v":0,"created_on":"2015-04-01T03:16:04.555Z","score":0.000023772255578018444},{"_id":"551b7474972b3991479554e7","id":1384,"pasta":"Hi Treenis, I am trying to learn how to play Treant Protector. Should I skill Nature's Guise to blend in with Nazi mods? Should I skill Leech Seed to sap the life from twitch chat? Should I max Living armor to develop a wooden trunk like you? Or should I skill Overgrowth like you use to prevent Saenis from running away?","tags":"#treenis#way#wagamama#treenisway#dota2","favourites":1,"__v":0,"created_on":"2015-04-01T02:17:58.484Z","score":0},{"_id":"551b2be2972b3991479554da","id":1379,"pasta":"ＨＥＹ ＡＫＲＯＭＡ， Ｉ＇Ｍ ＴＲＹＩＮＧ ＴＯ ＬＥＡＲＮ ＴＯ ＰＬＡＹ ＡＢＡ﻿ＮＤＯＮ． Ｉ ＪＵＳＴ ＨＡＶＥ Ａ ＱＵＥＳＴＩＯＮ ＡＢＯＵＴ ＴＨＥ ＳＫＩＬＬ ＢＵＩＬＤ ： ＳＨＯＵＬＤ Ｉ ＭＡＸ ＭＩＳＴ ＣＯＩＬ ＬＩＫＥ ＹＯＵ ＤＥＮＹ ＹＯＵＲＳＥＬＦ ＦＲＯＭ ＴＨＥ ＧＡＭＥ， ＡＰＨＯＴＩＣ ＳＨＩＥＬＤ ＳＯ Ｉ ＣＯＵＬＤ ＲＥＭＯＶＥ ＢＵＦＦ ＬＩＫＥ ＹＯＵ ＲＥＭＯＶＥＤ ＹＯＵＲＳＥＬＦ ＦＲＯＭ ＴＨＥ ＧＡＭＥ ＯＲ ＣＵＲＳＥ ＯＦ ＡＶＥＲＮＵＳ ＳＯ Ｉ ＣＯＵＬＤ ＣＵＲＳＥ ＰＥＯＰＬＥ ＬＩＫＥ ＹＯＵ ＣＵＲＳＥＤ ＳＩＮＧＳＩＮＧ","tags":"#singsing#dota2#akroma#abaddon#abandon#build","favourites":2,"__v":0,"created_on":"2015-03-31T22:29:37.762Z","score":0.000023772255578018444},{"_id":"551b2bb5972b3991479554d7","id":1376,"pasta":"Ｈｅｙ ｓｉｎｇｓｉｎｇ ｃａｎ ｙｏｕ ｔｅａｃｈ ｍｅ ｈｏｗ ｔｏ ｐｌａｙ ｓｌａｒｋ？ Ｄｏ Ｉ ｌｅｖｅｌ ｐｏｕｎｃｅ ｆｉｒｓｔ ｌｉｋｅ ｙｏｕ ｐｏｕｎｃｅｄ ｏｎ Ｆｗｏｓｈ？ Ｄａｒｋ ｐａｃｔ ｌｉｋｅ ｔｈｅ ｄａｒｋ ｐａｃｔ ｙｏｕ ｍａｄｅ ｗｉｔｈ ｙｏｕｒ ｔｅａｍ ｔｏ ｎｅｖｅｒ ｓｔｒｅａｍ ａｇａｉｎ？ Ｏｒ ｅｓｓｅｎｃｅ ｓｈｉｆｔ ｌｉｋｅ ｙｏｕ ｓｈｉｆｔｅｄ ａｌｌ ｙｏｕｒ ｐｒｉｏｒｉｔｉｅｓ ｆｒｏｍ ｙｏｕｒ ｌｏｙａｌ ｆａｎｓ？","tags":"#dota2#singsing#fwosh#slark#build","favourites":7,"__v":0,"created_on":"2015-03-31T20:38:27.486Z","score":0.00010581074350563556},{"_id":"551ae6e6972b3991479554cf","id":1374,"pasta":"Hey Zai, I’m trying to learn to play Bristleback. I just have a question about the skill build. Should I max Nasal Goo like how you spew bullshit about IG vs VG, Quill Spray so I can spray bullshit all over chat or Warpath like how you declared war against Twitch Chat?","tags":"#dota2#zai#twitch#IG#Vici","favourites":2,"__v":0,"created_on":"2015-03-31T14:41:56.443Z","score":0.000023772255578018444},{"_id":"551ae6bb972b3991479554ce","id":1373,"pasta":"Dota 2 is dying. We have this CSGO caster casting our Dota 2 games. I am a small baby with cancer, and my dying wish is to see my favorite game Dota 2 casted by actual Dota 2 casters, not a CSGO caster wannabe. Please copy and paste my story after I die. Goodbye cruel world, I hope you all will not have to listen to CSGO casters such as Toby.","tags":"#dota2#tobiwan#toby#CSGO","favourites":0,"__v":0,"created_on":"2015-03-31T10:11:17.430Z","score":0},{"_id":"551a5e592ee6f05c44f9310f","id":1370,"pasta":"░░░░░░░░░░░░░░░░░░░░░░░HEY░░░░ ░░▄▀░░░▄░░░▄▀▀▄▀▄░░░░░CORE54░░░ ░█░░░░▐▐░░█░░▐▐░░▐░░░░░░▄▄░░░░ ░█░░░░░▀░░░▀▄░▀░░▐░░░░░▐░░▐░░░ ░█░░░░░░░▄░░▐░░░░▐░░░▄▄▐░░▐▄▄░ ░░▀▄░░░░▄░▀▀░▄░░▄▀░░▐░░▐░░▐░▐░ ░░░░▀░░░░▀▀▀▀░░▀░░░░▐░░░░░░░▐░","tags":"#dota2#hey#core54","favourites":0,"__v":0,"created_on":"2015-03-31T03:41:55.094Z","score":0},{"_id":"551a5e562ee6f05c44f9310e","id":1369,"pasta":" ╠═══╣Lets build a ladder╠═══╣","tags":"#lets#build#a#ladder#dota2","favourites":11,"__v":0,"created_on":"2015-03-31T03:32:23.022Z","score":0.00016195849188922848},{"_id":"5519d4cb6aff47dc40d56c54","id":1366,"pasta":"In all honesty, the pause is a part of my life now. I console my bladder up until the draft ends coz I know there will be a pause for sure for me to go pee and pick up a beer on the way back so I can pee again for the next match.","tags":"#dota2#pause#bladder","favourites":1,"__v":0,"created_on":"2015-03-30T21:53:58.693Z","score":0},{"_id":"5519b5d4ea38169238159db7","id":1363,"pasta":"ｊｏｉｎＤＯＴＡ, ｐｌｅａｓｅ ｓｔｏｐ ＤＤｏＳｉｎｇ ＢＴＳ, ｉ ｗａｎｔ ｔｏ ｗａｔｃｈ ｆａｎｔａｓｔｉｃ ｇａｍｅ ｏｆ Ｃ9.ＥｔｅｒｎａｌＥｎｖｙ ｔｈｒｏｗｉｎｇ ａｇａｉｎｓｔ Ｅｍｐｉｒｅ.","tags":"#dota2#ddos#bts","favourites":0,"__v":0,"created_on":"2015-03-30T10:18:04.494Z","score":0},{"_id":"5518bb5a693253a057a92506","id":1362,"pasta":"\"Be like salt making its way through cracks. Do not be assertive, but adjust to the object, and you shall find a way around or through it. If nothing within you stays rigid, outward things will disclose themselves. Empty your mind, be formless. Shapeless, like salt. If you put salt into a cup, it becomes the cup. You put salt into a bottle and it becomes the bottle. You put it in a teapot, it becomes the teapot. Now, salt can flow or it can crash. Be salt, my friend.\" - Peter ppd Pandam","tags":"#dota2#peter#dager#ppd#salt#quote","favourites":2,"__v":0,"created_on":"2015-03-30T02:28:17.958Z","score":0.000023772255578018444},{"_id":"55189735693253a057a92502","id":1360,"pasta":"As someone who is nearing 200 games of Techies, it is getting more and more frequent that I have a member of the opposite team finding and dewarding my mines, even after smoking in and knowing they do not have ward vision. Many of the times they are in very obscure spots, and I have even put them in useless spots to see if they would find them. Time after time they know exactly where they are, and after watching the replays, they never know that I am ever in the area OR placing mines there. This happens at least every 8-14 games out of 100, and it get quite annoying only being able to kill people with mines only recently placed. Out of the 14 games this has happened, 8 of them were DCs of the person dewarding them, just to come back and find them. the other 6 were just highly suspicious, but it wasn't blatant. This is ruining games and there is no reason someone should be able to cheat in this way. Even if I am able to still manage a ~65% winrate with this being a thing, I think 70% would be possible without it.\nI do not see a problem in making mines unviewable in spectate mode until the game is over, or giving casters in premades elevated privileges to see them, or even blocking spectators from the same IP as a player in the game. I understand that it might be a complex task to tackle, but ward/mine sniping via streams/spectate is becoming really rampant as I play more.","tags":"#dota2#techies#mines#200#games","favourites":1,"__v":0,"created_on":"2015-03-29T23:48:02.239Z","score":0},{"_id":"55188bc6693253a057a924ff","id":1359,"pasta":"(▀̿Ĺ̯▀̿ ̿) This is the throw Police, You're coming with us C9. (▀̿Ĺ̯▀̿ ̿)","tags":"#dota2#c9#throw#police","favourites":16,"__v":0,"created_on":"2015-03-29T22:52:39.260Z","score":0.00022706303577830768}]