[{"_id":"55c05fb3ccc3f041309573ed","id":1962,"pasta":"Dota 2 IS NO MOBA. Dota 2 is ARTSARPG or ARTSRPG (ActionRealTimeStrategyRolePlayingGame) OR EVEN ARTSWPSRPG (ActionRealTimeStrategyWithPausesSometimesRolePlayingGame)","tags":"#dota2#no#moba","favourites":2,"__v":0,"created_on":"2015-08-04T06:46:11.777Z","score":0.0004762664283177208},{"_id":"55c05f73ccc3f041309573e6","id":1955,"pasta":"WTF 3 MERLINIS PogChamp","tags":"#dota2#merlini","favourites":2,"__v":0,"created_on":"2015-08-04T06:45:07.651Z","score":0.0004762431070331622},{"_id":"55bd5ff1f300bfdf5990c0e2","id":1951,"pasta":"Once upon a time, I opened a LoL game. I entered the game, and I was promptly greeted by another player. I noticed it was a female player and I was pleasantly surprised. I told her of my great love for the female anatomy, particularly the breasts and the backside. To my surprise, she told me she also enjoyed these things. It was then that I realised, I was playing League of Lesbians.....","tags":"#lol#league#of#lesbians#dota2","favourites":22,"__v":0,"created_on":"2015-08-02T00:10:25.569Z","score":0.005225669057754768},{"_id":"55bd5fe7f300bfdf5990c0e1","id":1950,"pasta":"My name is Henrik, 25 year old man from Swedlandia. I am come play \"dota two\" in American to make money find wife and lose virgin. I find \"Gabriel Newman\", he fat man like me. He say,  \"we have job for you.\" Now I make $3.22/hr scrubbing toilet at \"ti5\" thank you for listening please no copy my story.","tags":"#dota2#admiralbulldog#henrik#ti5#toilets","favourites":5,"__v":0,"created_on":"2015-08-02T00:10:15.585Z","score":0.0013122186120131689},{"_id":"55bd5fd3f300bfdf5990c0df","id":1948,"pasta":"Artour Babaev BabyRage , the first of his name, slayer of Sumail, King of the Creeps, heir to the throne of Midas, protector of S4, Lord of the B O Y S, brother to EE-Sama, disciple of FEAR, BabyRage the Unrekt, Father of the Plebs.","tags":"#dota2#GoT#RTZ#Arteezy","favourites":7,"__v":0,"created_on":"2015-08-02T00:09:55.903Z","score":0.0018396833661116897},{"_id":"55bd5fa9f300bfdf5990c0db","id":1944,"pasta":"ＨＥＹ　ＪＩＭＭＹ，　Ｉ’Ｍ　ＴＲＹＩＮＧ　ＴＯ　ＬＥＡＲＮ　ＴＯ　ＰＬＡＹ　ＲＵＢＩＣＫ．　Ｉ　ＪＵＳＴ　ＨＡＶＥ　Ａ　ＱＵＥＳＴＩＯＮ　ＡＢＯＵＴ　ＴＨＥ　ＳＫＩＬＬ　ＢＵＩＬＤ：　ＳＨＯＵＬＤ　Ｉ　ＭＡＸ　ＴＥＬＥＫＥＮＥＳＩＳ ＳＯ Ｉ ＣＡＮ ＬＩＦＴ ＰＥＯＰＬＥ ＵＰ ＯＮＬＹ ＴＯ ＬＥＴ ＴＨＥＭ ＤＯＷＮ ＬＩＫＥ ＹＯＵ ＬＥＴ ＤＯＷＮ ＡＬＬ ＹＯＵＲ ＴＥＡＭＭＡＴＥＳ，　ＦＡＤＥ ＢＯＬＴ  ＬＩＫＥ ＨＯＷ ＹＯＵ ＦＡＤＥＤ ＩＮＴＯ ＯＢＳＣＵＲＩＴＹ，　ＯＲ　ＮＵＬＬ  ＦＩＥＬＤ　ＬＩＫＥ ＴＨＥ ＮＵＭＢＥＲ ＯＦ ＴＩＳ ＹＯＵ ＷＯＮ","tags":"#dota2#jimmy#learn#rubick","favourites":2,"__v":0,"created_on":"2015-08-02T00:09:13.657Z","score":0.0004133055126823595},{"_id":"55bd5f8cf300bfdf5990c0d9","id":1942,"pasta":"A Dota player and a LoL player walks into a bar. The Dota gamer turns around to the LoL gamer saying, \"LoL sucks!\" The LoL player couldn't deny. ","tags":"#dota2#lol#deny#joke","favourites":22,"__v":0,"created_on":"2015-08-02T00:08:44.323Z","score":0.005225308367589037},{"_id":"55bac082a92005fc4d048618","id":1941,"pasta":"PogChamp WTF PogChamp 3 MERLINIS PogChamp HOW IS THAT EVEN POSSIBLE?? PogChamp WTF PogChamp 3 MERLINIS PogChamp HOW IS THAT EVEN POSSIBLE?? PogChamp WTF PogChamp","tags":"#merlini#dota2#twitch","favourites":29,"__v":0,"created_on":"2015-07-31T00:25:38.021Z","score":0.0059375794981935855},{"_id":"55bac05fa92005fc4d048614","id":1937,"pasta":" League of Lesbians is actually really good I tried it. I suck really bad at DotA (200 mmr) and cannot hit skillshots and I also have ADHD xd. I tried LoL and the spam shots are so much easier to hit and the colors make my eyes bleed but it entertains my ADHD XDDDDDDDD pls no copy pasta xd","tags":"#dota2#league#ADHD","favourites":17,"__v":0,"created_on":"2015-07-31T00:25:03.059Z","score":0.0037245024616539904},{"_id":"55bac047a92005fc4d048613","id":1936,"pasta":"HＥY ＳＯＮＮＥＩＫＯ, ＣＡＮ YOU ＴＥＡＣＨ ＭＥ HOW TO PLAY TECHIES ? SHOULD ADD MINES ＦＩＲＳＴ LIKE ＨＯＷ YOU PLANT ＹＯＵＲ BOMBS ? ＯＲ ＳＨＯＵＬＤ Ｉ ＡＤＤ ＳＵＩＣＩＤＥ LIKE YOUＡＬＬＡＨ ＡＣＫＢＡＲ? ＯＲ ADD STATIＳ ＴＲＡＰ LIKE ＨＯＷ YOU STUNNED EVERYONE WHEN ＹＯＵＲ VISA GOT ＤＥＮＩＥＤ? ＯＲ ＤＯ I ＡＤＤ ＲＥＭＯＴＥ ＭＩＮＥＳ ＬＩＫＥ ＨＯＷ ＹＯＵ ＡＬＭＯＳＴ ＨＡＤ ＴＯ ＰＬＡＹ ＴＩ５ ＲＥＭＯＴＥＬＹ?","tags":"#dota2#visa#SONNEIKO#NAVI","favourites":2,"__v":0,"created_on":"2015-07-31T00:24:39.943Z","score":0.0003695121211173629},{"_id":"55bac015a92005fc4d048611","id":1934,"pasta":"ＨＥＹ ＫＯＲＯＫ ＳＨＯＵＬＤ Ｉ ＭＡＸ ＳＨＡＤＯＷ ＳＴＲＩＫＥ ＬＩＫＥ ＹＯＵ ＣＡＭＥ ＯＵＴ ＯＦ ＴＨＥ ＳＨＡＤＯＷＳ ＴＯ ＳＴＲＩＫＥ ＹＯＵＲ ＧＦ, ＢＬＩＮＫ ＬＩＫＥ ＳＨＥ ＤＩＤ ＷＨＥＮ ＹＯＵ ＰＵＮＣＨＥＤ ＨＥＲ ＩＮ ＴＨＥ ＦＡＣＥ, ＳＣＲＥＡＭ ＯＦ ＰＡＩＮ ＬＩＫＥ ＴＨＥ ＯＮＥ ＳＨＥ ＬＥＴ ＯＵＴ ＡＳ ＹＯＵ ＭＡＬＩＣＩＯＵＳＬＹ ＡＴＴＡＣＫＥＤ ＨＥＲ ＯＲ ＳＯＮＩＣ ＷＡＶＥ ＬＩＫＥ ＴＨＥ ＯＮＥ ＥＭＩＴＴＥＤ ＢＹ ＴＨＥ ＰＯＬＩＣＥ ＳＩＲＥＮＳ ＡＳ ＴＨＥＹ ＡＰＰＲＥＨＥＮＤＥＤ ＹＯＵ?","tags":"#korok#dota2#queenofpain#domesticabuse","favourites":2,"__v":0,"created_on":"2015-07-31T00:23:49.849Z","score":0.0003695005835922401},{"_id":"55b960f5a92005fc4d048604","id":1929,"pasta":"there were three men there.. three men in that hole, nervous as ever, sitting in that hole to keep\ncover from the wizzing projectiles. three men. three memes. we knew we needed to get out of that hole, but it was nearly too late. The enemy was pushing us at an unbelievable rate. I peek my head, and see a large vengence. Many men with their guns out, running with dirt, smeard on their faces.. it was time. My men scream in terror. \"Why gabe. Why?\" holding the cross in his hand. 6 men hop in the hole and start shooting. I see bullets fill my comrads body, blood shoots all around me and my other comrad. As I start to scream in terror, it seems as if its too late..  A sharp pain obvurs in my neck and suddenly beathing air is very hot, and instantly I stop breating.. My heart beats faster than a train at top speed. Before i know it, a fuse ticks in my mind, and I close my eyes, thinking about all the weed I could of been smoking.. My spirit is free. I am free. I leave the hole, and see all the faggots who just shot me.. as scarce as it is.. I fly, fly high up to the sunlight in the air. Black and white images in my sight, but one blink, and a throne was beheald in front of me.\nI look at the throne, and see my king.. Gaben.. Gaben smiles with a might, and presses his glasses upon his face. I thank Gaben, and praise gaben. Gaben greets me, and tours me around Seaven. He takes me to my NASA computer, and pulls up the steam library.. I notice something very abnormal and suddenly merate the biggest smile. My steam library is filled with millions of games.. And my latency is very low.. The peace in Seaven, is healthy, but before I do anything, I feel a tap upon my shoulder. It's my comrad! Looking sharp as ever aswell. We smile and hug eachother, and grasp upon our lives. Gaben is my leader we say, Gallahu Salebar I say, and sit down to open up dota.. Another day I say.. Another day.","tags":"#dota2#gaben#lol#allah","favourites":1,"__v":0,"created_on":"2015-07-29T23:25:41.618Z","score":0},{"_id":"55b960eaa92005fc4d048603","id":1928,"pasta":"Dear Doto community - this is a service announcement: This is an offical test for the twitch SPAM servers. We kindly asking you, the spam Kappa , with our beloved twichstar, and also a prime moderator at The International 5 event: AdmiralBulldog! Pls no copypasteriano.Dear Doto community - this is a service announcement: This is an offical test for the twitch SPAM servers. We kindly asking you, the spam Kappa , with our beloved twichstar, and also a prime moderator at The International 5 event: AdmiralBulldog! Pls no copypasteriano.","tags":"#dota2#kappa#admiralbulldog#spam\n","favourites":3,"__v":0,"created_on":"2015-07-29T23:25:30.851Z","score":0.0006232577943948967},{"_id":"55b960dea92005fc4d048602","id":1927,"pasta":"░░░░░░░░░░░░░░░▄▀▄░░░░░░░░░░░░░░░ ░░░░░░░░░░░░░▄▀░░░▀▄░░░░░░░░░░░░░ ░░░░░░░░░░░▄▀ Kappa ▄▀█░░░░░░░░░░░░░ ░░░░░░░░░▄▀ Kappa ▄▀░▄▀░▄▀▄░░░░░░░░░ ░░░░░░░▄▀ Kappa ▄▀░▄▀░▄▀ Kappa ▀▄░░░░░░ ░░░░░░░█▀▄ Kappa ▀█░▄▀ Kappa Kappa ▀▄░░░░ ░░░▄▀▄░▀▄░▀▄ Kappa ▀ Kappa ▄█▄ Kappa ▀▄░░░ ░▄▀░░░▀▄░▀▄░▀▄░ Kappa ▄▀░█░▀▄ Kappa ▀▄░ ░█▀▄ Kappa ▀▄░█▀ Kappa Kappa ▀█░▀▄░▀▄░▄▀█ ░▀▄░▀▄ Kappa ▀ Kappa ▄█▄ Kappa ▀▄░▀▄░█░▄▀░ ░░░▀▄░▀▄░ Kappa ▄▀░█░▀▄ Kappa ▀▄░░▀█▀░░ ░░░░░▀▄░▀▄░▄▀░▄▀░█▀ Kappa ▄▀█░░░░░░░ ░░░░░░░▀▄░█░▄▀░▄▀ Kappa ▄▀░▄▀░░░░░░░ ░░░░░░░░░▀█▀░▄▀ Kappa ▄▀░▄▀░░░░░░░░░ ░░░░░░░░░░░░░█▀▄░▄▀░▄▀░░░░░░░░░░░ ░░░░░░░░░░░░░▀▄░█░▄▀░░░░░░░░░░░░░ ░░░░░░░░░░░░░░░▀█▀░░░░░░░░░░░░░░░:","tags":"#Kappa#dota2#singsing#mods#core54#nazi#ascii","favourites":15,"__v":0,"created_on":"2015-07-29T23:25:18.540Z","score":0.003154371902138571},{"_id":"55b5413989b52e986e2b40f0","id":1916,"pasta":"JESUS FUCKING CHRIST THIS IS THE MOST RIDICULOUS DISPLAY OF SKILL I'VE EVER SEEN IN MY LIFE. I CAN'T BELIEVE I'M WATCHING THIS MAKING OF HISTORY LIVE.\nHe fucking FORCE STAFFED AN ILLUSION for a last hit onto an enemy Lion instead of rocketing him. He BLIND HOOKED A LUNA 15 SECONDS AFTER LOSING VISION. Using blademail to kill a sandstorming SK. What IS THIS MADNESS.","tags":"#dota2#MIRACLE\n","favourites":6,"__v":0,"created_on":"2015-07-19T20:52:02.804Z","score":0.0008653117431624561}]