[{"_id":"55b5412f89b52e986e2b40ef","id":1915,"pasta":"Plebs, mods, turbo, subs. Long ago, the four nation played together in harmony. Then, everything changed when the the plebs  spammed . Only Admiralbulldog, master of all chat, could stop them, but when the chat needed him most, he vanished. A hundred years passed and my brother and I discovered the new Admiralbulldog a streamer who did not qualify for TI5. And although his banning skills are great, he has a lot to learn before he's ready to become the nazi hitler. ","tags":"#dota2#admiralbulldog#avatar#donger","favourites":5,"__v":0,"created_on":"2015-07-19T13:18:26.158Z","score":0.0007103293145439658},{"_id":"55b193e089b52e986e2b40de","id":1913,"pasta":"I sexually identify as a terrorblade hellion. Ever since I was a boy I dreamed of metamorphosizeing into a giant raging demon and melting the faces of my opponents off with my unimaginable power. People say to me that a person being a demon is impossible and I’m fucking retarded but I don’t care, I’m majestic. I'm having a plastic surgeon install terrifying wings, huge mythical quality blades and long pointy horns on my body. From now on I want you to call me \"the Demon Marauder\" and respect my right to farm creeps endlessly and sunder my opponents with a 0.35 seconds cast time. If you cannot accept me and my many reflections of my soul you're a terrorphobe and need to check your champion privilege. Thank you for being so understanding.","tags":"#Dota2#sexually#identify#terrorblade#hellion","favourites":20,"__v":0,"created_on":"2015-07-19T03:30:19.379Z","score":0.002564567105469594},{"_id":"55b193c789b52e986e2b40dc","id":1911,"pasta":"RuleFive Fear has 2 sons : one ungratefull and stturborn who left home and think he is a nigga BabyRage The other is respectfull, no flame, such gentle arab boy but also think he is a nigga ANELE Old Man y u no retire from doto and take of your shittys","tags":"#dota2#sumail#twiTch#chat#rtz#fear","favourites":0,"__v":0,"created_on":"2015-07-18T05:00:45.858Z","score":0},{"_id":"55b193b389b52e986e2b40d9","id":1908,"pasta":"ＨＥＹ ＬＥＡＦＡＴＯＲ Ｉ ＡＭ ＴＲＹＩＮＧ ＴＯ ＡＮＣＩＥＮＴＳ ＮＥＣＲＯ． Ｉ ＪＵＳＴ ＨＡＶＥ Ａ ＱＵＥＳＴＩＯＮ ＡＢＯＵＴ ＴＨＥ ＳＫＩＬＬ ＢＵＩＬＤ． ＳＨＯＵＬＤ Ｉ ＭＡＸ ＳＡＤＩＳＴ， ＬＩＫＥ ＹＯＵ ＳＡＤＩＳＴＩＣＡＬＬＹ ＰＯＳＴＥＤ ＹＯＵＲ ＧＵＩＤＥ，ＤＥＡＴＨ ＰＵＬＳＥ， ＳＯ Ｉ ＣＡＮ ＦＥＥＬ ＬＩＫＥ ＮＥＣＲＯ＇Ｓ ＷＩＮＲＡＴＥ ＷＨＥＮ ＩＴ ＤＲＯＰＰＥＤ, ＯＲ ＨＥＡＲＴＳＴＯＰＰＥＲ ＡＵＲＡ， ＬＩＫＥ ＭＹ ＨＥＡＲＴ ＳＴＯＰＳ ＥＶＥＲＹ ＴＩＭＥ Ｉ ＳＥＥ ＡＮ ＡＮＣＩＥＮＴＳ ＮＥＣＲＯ？","tags":"#dota2#necro#necrophos#ancients","favourites":7,"__v":0,"created_on":"2015-07-17T21:31:37.092Z","score":0.0009394041821950665},{"_id":"55b193ad89b52e986e2b40d8","id":1907,"pasta":"EleGiggle Little Subscriber gays ? SoBayed u thought u WON ? SoBayed Mother Fuckers ? SoBayed spent 5$ to EleGiggle talk in chat for 5mins ? SoBayed or playing EleGiggle subgames which happen EleGiggle once a YEAR ? 4Head","tags":"#dota2#bulldog#subs","favourites":8,"__v":0,"created_on":"2015-07-17T08:56:17.712Z","score":0.0010492036469214947},{"_id":"55b1939f89b52e986e2b40d7","id":1906,"pasta":"Honestly, fuck this guy. Zero class, zero respect. He's a great captain and player, no doubt, but he still personifies all the shit","tags":"#ppd#dota2#nadota#salt","favourites":1,"__v":0,"created_on":"2015-07-23T12:10:30.490Z","score":0},{"_id":"55b1938889b52e986e2b40d4","id":1903,"pasta":" If I could save salt in a bottle\n The first thing that I'd like to do\n Is to rage every day till envy passes away\n Just to play doter with you\n If I could make pauses last forever\n If words could make uninstalls come true\n I'd rage every day like RTZ and then\n Again, I would play doter with you\n But there never seems to be enough time\n To TP top or drop my stick, once you flame me\n I've measured my words and I know\n That you're the one I want to go play doter with\n If I had a box just for reports\n And shitters that that should kill themselves\n The box would be empty, except for the memory of how\n All my reports were given to you\n But there never seems to be enough time\n To farm the things you want to, but w33haa will find them\n I've looked around enough to know\n That you're the one I want to go play doter with","tags":"#salt#ppd#dota2#doter#Kappa#meta","favourites":0,"__v":0,"created_on":"2015-07-23T09:46:56.287Z","score":0},{"_id":"55b1937e89b52e986e2b40d2","id":1901,"pasta":"eh, average play. Obvious QoP would blink, so it would be stupid to not blink to that exact spot and even fake your ult a little first to make her think you weren't going to do it!, 5/10","tags":"#dota2#8kmmr#qop","favourites":5,"__v":0,"created_on":"2015-07-22T07:11:12.674Z","score":0.0007874695471294955},{"_id":"55a84a4f4587967e7ca6a8a8","id":1893,"pasta":"Ｉ　ｏｎｃｅ　ｄｒａｎｋ　ａｎ　ｅｎｔｉｒｅ　ｂｏｔｔｌｅ　ｏｆ　ｓｏｙ　ｓａｕｃｅ　ｏｎ　ａ　ｄａｒｅ，　ｗｈｉｃｈ　Ｉ　ｔｈｏｕｇｈｔ　ｗａｓ　ａｌｌ　ｗｅｌｌ　ａｎｄ　ｇｏｏｄ．．．　ｕｎｔｉｌ　Ｉ　ｄｅｖｅｌｏｐｅｄ　ｅｘｔｒｅｍｅ　ｄｅｈｙｄｒａｔｉｏｎ　ａｎｄ　Ｈｙｐｅｒｎａｔｒｅｍｉａ　（ｈｔｔｐ：／／ｅｎ．ｗｉｋｉｐｅｄｉａ．ｏｒｇ／ｗｉｋｉ／Ｈｙｐｅｒｎａｔｒｅｍｉａ）．　Ｔｈｅｙ　ｈａｄ　ｔｏ　ｐｕｔ　ａｎ　ｉｖ　ｄｉｒｅｃｔｌｙ　ｉｎｔｏ　ｍｙ　ｖｅｉｎｓ　ｔｏ　ｒｅｈｙｄｒａｔｅ　ｍｅ．　Ｉｔ　ｗａｓ　ｔｈｅ　ｃｌｏｓｅｓｔ　Ｉ’ｖｅ　ｅｖｅｒ　ｂｅｅｎ　ｔｏ　ｄｙｉｎｇ．　Ｗｈａｔ　Ｉ’ｍ　ｇｅｔｔｉｎｇ　ａｔ　ｉｓ，　ｅｖｅｎ　ｔｈａｔ　ｗａｓ　ｎｏｔ　ｎｅａｒｌｙ　ａｓ　ｓａｌｔｙ　ａｓ　ｙｏｕ　ａｒｅ　ｒｉｇｈｔ　ｎｏｗ．\n","tags":"#dota2#soy#sauce#salt#ppd","favourites":62,"__v":0,"created_on":"2015-07-16T19:13:21.908Z","score":0.006252204149050932},{"_id":"55a84a314587967e7ca6a8a7","id":1892,"pasta":"Feeder, Rage Quitter, Trash Talker, Noob. Long ago, the four groups played together in ‘harmony’. Then, the low priority started. Only the Peenoise, master of all four, deserved getting reported, but when Peenoise became too cancerous, tsunami made them vanished. A hundred years passed, my friends and I discovered the Peenoise in SEA server. Although they are just fucking around in this server, I believe they can spread their ‘putang ina mo’ around the whole world.","tags":"#dota2#pinoy#avatar","favourites":16,"__v":0,"created_on":"2015-07-16T15:06:23.156Z","score":0.0019313111630912003},{"_id":"55a849584587967e7ca6a8a0","id":1885,"pasta":"Breaking News! Team Secret's offlane player Ludwig 'Zai' Wahlberg will not be attending The International 5 this year due to his ongoing twitch livestream, \"not stopping until im 6k\". ","tags":"#dota2#zai#6k","favourites":3,"__v":0,"created_on":"2015-07-13T07:22:10.543Z","score":0.00032409054002827185},{"_id":"55a8493b4587967e7ca6a89e","id":1883,"pasta":"The game has changed. I feel it in the versions. I see it in the shitposts. I smell it in the games.\nMuch that once was, is lost. For few that now play who remember.\nIt all began with the forging of the Great Memes.\nThree were given to Arteezy; youngest and cockiest of all memers.\nSeven, to iceiceice, great offlaner and trollsman of the chinese halls.\nAnd nine, nine memes were gifted to the bulldog, who above all else desired sheever.\nFor within these memes was bound the dank and the jokes to govern over each stream. But they were all of them deceived, for another meme was made. In the team of C9, in the flames of Tucker Fucker, the Dank Lord SingSing forged in secret, a master meme, to control all others. And into this meme he poured all his cruelty, his hairstyle and his will to draw all cocks.\nOne meme to rule them all.\nOne by one, the free peoples of DotA2 fell to the power of the meme. But there were some who resisted. A last alliance of men and grills marched against the armies of SingSing, and on the very slopes of TI, they fought for the freedom of DotA. Victory was near, but the power of the meme could not be undone. It was in this moment, when all hope had faded, that EternalEnvy, Team Leader of C9, kicked out SingSing from the team. And SingSing, enemy of the free peoples of DotA, was defeated.\nThe meme passed on to twitch chat, who had this one chance to destroy evil forever, but the dank memes are easily copypasta'd. And the meme of power has a will of its own.\nIt betrayed twitch, to its lag. And some things that should not have been forgotten were lost. History became legend. Legend became lore. And for two and a half thousand starladder seasons, the meme passed out of all knowledge.\nUntil, when chance came, it ensnared a new bearer. The meme came to the creature Mynuts, who took it deep into the tunnels under the Alliance Banner, and there it consumed him. The meme gave to Mynuts unnaturally dank name. For five hundred roaster changes it poisoned his games; and in the gloom of Mynuts's team, it waited.\nDankness crept back into the games of the dota. Rumor grew of a comic book in the East, whispers of a nameless team, and the Meme of Power perceived. Its time had now come. It abandoned Mynuts. But then something happened that the meme did not intend. It was picked up by the most unlikely team possible, compLexity of NA. For the time will soon come, where compLexity will shape the fortune of all...","tags":"#dota2#arteezy#lord#of#the#memes#singsing","favourites":4,"__v":0,"created_on":"2015-07-12T23:24:58.096Z","score":0.0004498113210934868},{"_id":"559ef1fc975fee4a2be08437","id":1872,"pasta":"Arteezy joined my game and demanded mid as Naga. I got really nervous because I watch his stream all the time and didn't want to make him upset, so I picked treant so he'd be safe. All the sudden, my mom called. She told me my dad had a stroke and was the hospital in critical condition. I wanted to leave, but I knew I'd be letting Arteezy down, so I stayed and played the game out. I finished 2/8/10 and Arteezy called me a fucking moron. My dad died before I made it to the hospital, but I know he'd say I did the right thing.","tags":"#dota2#rtz#arteezy#dad","favourites":15,"__v":0,"created_on":"2015-07-09T21:15:32.356Z","score":0.0014836268184374298},{"_id":"559ef1dd975fee4a2be08433","id":1868,"pasta":"﻿Ｈｅｙ  Ｅｒａ，  Ｉ＇ｍ  ｔｒｙｉｎｇ  ｔｏ  ｌｅａｒｎ  ｔｏ  ｐｌａｙ  ＳＦ．  Ｉ  ｊｕｓｔ  ｈａｖｅ  ａ  ｑｕｅｓｔｉｏｎ  ａｂｏｕｔ  ｔｈｅ  ｓｋｉｌｌ  ｂｕｉｌｄ：  Ｓｈｏｕｌｄ  Ｉ  ｍａｘ  ｒａｚｅ  ｌｉｋｅ  ｙｏｕ  ｒａｉｓｅｄ  ｍｙ  ｄｏｎｇｅｒ  ｗｈｅｎ  ｕ  ｓｔｒｅａｍ  ，  Ｎｅｃｒｏｍａｓｔｅｒｙ  ｓｏ  ｉ  ｇｅｔ  ｓｏｕｌｓ  ｌｉｋｅ  ｈｏｗ  ｙｏｕ  ｓｔｅａｌ  ｍｙ  ｓｏｕｌ  ，  ｏｒ  ｐｒｅｓｅｎｃｅ  ｏｆ  ｔｈｅ  ｄａｒｋ  ｌｏｒｄ  ","tags":"#Era#Dota2#HoNBoys","favourites":1,"__v":0,"created_on":"2015-07-08T19:48:47.767Z","score":0},{"_id":"559ef1aa975fee4a2be0842e","id":1863,"pasta":"He's a good analyst, a bit overated in my opinion. But defenitely okay to be in a top analyst panel! To say that he is one of the best analysts etc is really exageration, he analyzed like 10 games in a high level LAN, you need way more to compare him to Merlini, SyndereN or GoDz","tags":"#dota2#7ckingmad#7ckingbad#analyst#overrated","favourites":0,"__v":0,"created_on":"2015-07-08T00:10:39.433Z","score":0}]