[{"_id":"5517a43dd926d7b83d0f3b0d","id":1356,"pasta":"slack you are single handedly responsible for ruining dotacinema. i remember when i was a young boy i used to look up to the people in dotacinema but now tards like you get to cast and that makes me sad. what have you ever done to deserve this? you need to fucking just stop this and let dotacinema have quality over quantity","tags":"#siractionslacks#dotacinema#dota2#sunsfan","favourites":4,"__v":0,"created_on":"2015-03-29T06:49:24.208Z","score":0.00009113329747898613},{"_id":"55178cf9d926d7b83d0f3b06","id":1351,"pasta":"Eg vs secret. It ends up being the most brutal 3 games secret players have played in their life as they lose to eg. As both teams are coming out of their booths rtz rips apart his secret jersey to reveal his eg jersey underneath. Everyone in key arena is shocked, the spectators, the casters, the teams, eg , secret. even gaben is shocked as he continues to stuff hotdogs in his mouth , two at a time. Everyone except ppd. it was all a ruse. the falling out, the call outs on twitter and interviews. ppd sent rtz to secret as a trojan horse, to weaken secret from the inside. Kky and ppy are left devastated and retire from dota2 immediately. Zai moves to the fgc scene and s4 continues to do s4 stuff. Fear officially adopts rtz and ppd ships sumail back to pakistan.\n","tags":"#dota2#eg#secret#ppd#rtz#salt","favourites":11,"__v":0,"created_on":"2015-03-29T02:54:33.244Z","score":0.00024820544209258665},{"_id":"55175b0ad926d7b83d0f3b00","id":1349,"pasta":"I have played against this hero 53 times this month, had him on team 40 games. 43% win rate against him, 75% win rate with him. In total I have played 154 matches this month in the 5k bracket Euwest.\nbasically, he is a agility carry/pusher, and he has no real weaknesses.\nUnlike many other agi carries, he is not weak in lane and therefor in desperate need of support. He got ranged form, and low manacost/cd nukes with good damage, decent stats and str grow and bonus movement speed from melee form. You cant really shut this hero down early, simply because he is strong in lane, and even if you somehow manage to shut him down, he can just transition into the jungle. He is just really versatile. The typical reddit answer \"you have to shut him down early\" doesn't really work.\nHe is really good against rosh and can kill him early with just lifesteal. You cant run from him since he got bonus MS, bash and a ranged slow.\nThe ultimate is just... short cooldown super strong in teamfights and in pushes, hell often in a fight you can use it two times.\nHe is hard to kill, with his beloved bonus MS and the blind chance/dodge whatever u wanna call it.\nSo you wanna manfight him? He got bonus attack speed for hitting the same target, and the ult, bash chance, bonus hp, lets just add a fucking miss chance as well. Troll does manfights very well obviously.\nSince you cant manfight or run from him, you can try to juke him! Fuck no, his magical decent range no manacost flying axes also gives flying vision because why not.\nLose one teamfight mid game to this guy, and you for sure have to spend buybacks or u lose a lane of rax, just because of his short ulti cd.\nI mean, just compare Troll to heroes like Ursa, Naix, Slardar. They are so utterly shit compared to him.\nHe can get kited yes, but when u are able to kite a troll warlord, u could probably kite any melee hero in the game.\nThe thing that pisses me off is that jugger and axe got nerfed (deserved), but somehow they just overlooked troll. Now he has been in everygame for a couple of months and im just so tired of playing against this fucking hero. Seems like everybody and their moms know how to play this guy.","tags":"#dota2#troll#rant#blizzardplsnerf#smien","favourites":0,"__v":0,"created_on":"2015-03-29T01:38:38.636Z","score":0},{"_id":"5515d9894e521d0b278cb5bd","id":1344,"pasta":"Ｈｅｌｌｏ  ｍｙ  ｎａｍｅ  ｉｓ  ＯｐｉｅＯＰ  ＸＢＯＣＴ  ａｎｄ  Ｄｎｄｉ  ＤｅｎｄｉＦａｃｅ  ｉｓ  ＤＤＯＳＩＮＧ  ｍｅ  ｓｏ  ｔｈｅｙ  ｃａｎ  ｐｌａｙ  ４ｖ５  ａｎｄ  ｗｉｎ  ｃａｕｓｅ  Ｉ  ｗｏｎｔ  ｂｅ  ａｂｌｅ  ｔｏ  ｔｈｒｏｗ．  ４Ｈｅａｄ  Ｎｏ  ｃｏｐｅｒｙｉｎｏ  ｐａｓｔｅｒｉｎｏ  ｐｌｓ\n","tags":"#dota2#xboct#dendi#ddos#throw","favourites":3,"__v":0,"created_on":"2015-03-27T21:14:19.626Z","score":0.00006424273623302478},{"_id":"5515a8874e521d0b278cb5b6","id":1341,"pasta":"Hello my name is  XBOCT and Dendi is DDOSING me so they can play 4v5 and win cause I wont be able to throw. \nNo coperyino pasterino pls ,\n","tags":"#dota2#xboct#dendi#ddos","favourites":2,"__v":0,"created_on":"2015-03-27T16:47:09.424Z","score":0.00003599910810166838},{"_id":"5514dfeeb79c00ce446ab073","id":1337,"pasta":"﻿ＳＩＮＧＳＩＮＧ，  ＨＯＷ  ＤＯ  ＹＯＵ  ＰＬＡＹ  ＭＥＥＰＯ？  ＤＯ  ＹＯＵ  ＭＡＸ  ＰＯＯＦ，  ＬＩＫＥ  ＹＯＵ  ＰＯＯＦＥＤ  ＯＵＴ  ＯＦ  ＲＥＬＥＶＡＮＣＥ？  ＯＲ  ＤＯ  ＹＯＵ  ＭＡＸ  ＮＥＴ，  ＬＩＫＥ  ＹＯＵ  ＮＥＴＴＥＤ  ＺＥＲＯ  ＬＡＮ  ＷＩＮＳ  ＩＮ  ２０１５？  ＭＹ  ＦＡＶＯＲＩＴＥ  ＢＵＩＬＤ  ＩＳ  ＭＡＸＩＮＧ  ＧＥＯＳＴＲＩＫＥ，  ＬＩＫＥ ＹＯＵ  ＳＴＲＵＣＫ  ＲＯＣＫ  ＢＯＴＴＯＭ．  ＰＬＥＡＳＥ  ＡＮＳＷＥＲ","tags":"#dota2#singsing#meepo#build","favourites":64,"__v":0,"created_on":"2015-03-27T03:40:30.309Z","score":0.0011317816452377746},{"_id":"55143296b79c00ce446ab06a","id":1333,"pasta":"I was only 13 years old. I loved Dendi so much. I was the biggest fangay on his stream. I had all my items autographed by Dendi. I denied every creep for Dondo whilst playing Doto, praying for him to leave Na’Vi whilst masturbating at the way he played Pudge whilst his team fed. Dondo is supa, I say. Dondo is supamida. My friends in voice chat hear me and call me gay, but I knew they were just jealous because of my autographed DC hook. I called them Sumail fangays. They left the voice chat and unfriended me. I have no more friends on steam now, and I had 16 low prio games. I felt a vibe through my body, feeling something excstatic. An email on my iDick saying that someone is live on twitch. It’s dendi! I’m so happy! I go in and he says in his microphone “Pudge today.” I pull off my pants and take my pudge stuffed toy. I wrap its soft hook around my tiny shaft, and begin stroking up and down when I notice dendi got first blood after instapicking pudge on mid. Tears of joy run through my eyes, as my precum messes up the pudge toy, but I do it for Dendi. I can feel myself being close. Dendi screams “ez katka” in his mic as I let myself go onto the doll. Dendi turns off his stream after a ddos attack by isis agent sumail. I smile and cry in happiness, knowing he won the pudge game. Dendi is supa. Dendi is mida. Dondo the supamida.","tags":"#dondo#dendiface#dota2#dota#dendi","favourites":5,"__v":0,"created_on":"2015-03-26T13:23:44.783Z","score":0.00011320902684856537},{"_id":"551315ee0489a24c09a597cd","id":1323,"pasta":" Hɪ S4! I'ᴍ ʟᴇᴀʀɴɪɴɢ ᴛᴏ ᴘʟᴀʏ Pᴜᴄᴋ. Sʜᴏᴜʟᴅ I sᴋɪʟʟ Iʟʟᴜsᴏʀʏ ᴏʀʙ ʟɪᴋᴇ ʏᴏᴜ ᴊᴀᴜɴᴛᴇᴅ ᴏᴜᴛ ᴏғ Aʟʟɪᴀɴᴄᴇ ? Sʜᴏᴜʟᴅ I sᴋɪʟʟ Wᴀɴɪɴɢ Rɪғᴛ ʟɪᴋᴇ ʏᴏᴜ ʀɪғᴛᴇᴅ ᴛʜᴇ ʜᴇᴀʀᴛs ᴏғ Aʟʟɪᴀɴᴄᴇ ғᴀɴs ? Sʜᴏᴜʟᴅ ɪ sᴋɪʟʟ ᴘʜᴀsᴇ sʜɪғᴛ ʟɪᴋᴇ ʏᴏᴜ ᴅɪsᴀᴘᴘᴇᴀʀᴇᴅ ғʀᴏᴍ ᴛʜᴇ ᴛᴇᴀᴍ ᴏʀ sʜᴏᴜʟᴅ ɪ sᴋɪʟʟ ᴅʀᴇᴀᴍ ᴄᴏɪʟ ʟɪᴋᴇ ʜᴏᴡ Lᴏᴅᴀ sᴛɪʟʟ ᴅʀᴇᴀᴍs ᴏғ ʏᴏᴜ ᴊᴏɪɴɪɴɢ Aʟʟɪᴀɴᴄᴇ !","tags":"#S4#dota2#alliance#puck","favourites":6,"__v":0,"created_on":"2015-03-25T18:57:44.466Z","score":0.0001354812783133706},{"_id":"551315ea0489a24c09a597cc","id":1322,"pasta":" ﻿ᕕ（ ՞ ᗜ ՞ ）ᕗ Ｂ［Ａ］ＣＫＳＴＲＥＥＴ＇Ｓ Ｂ［Ａ］ＣＫ［Ａ］ＬＲＩＧＨＴ ᕕ（ ՞ ᗜ ՞ ）ᕗ","tags":"#dota2#alliance#backstreet#back","favourites":5,"__v":0,"created_on":"2015-03-25T18:12:00.652Z","score":0.00011246234113939173},{"_id":"551271250489a24c09a597c2","id":1319,"pasta":" wow ive seen 3 minutes of ur stream and i already hate you, im impressed!","tags":"#dota2#barnyyy#hate","favourites":4,"__v":0,"created_on":"2015-03-25T07:03:34.065Z","score":0.00008815165785545962},{"_id":"5511d4ceb1f316ab7721a9fa","id":1313,"pasta":" For the last year we have lived like rats. Afraid to show ourselves in the twitch channels. When people called \"where are you now, Alliance Fangays?\" we remained hidden. But now it's time for the rats to rise and reclaim what is ours! Alliance is back!","tags":"#dota2#alliance#rat#comeback","favourites":2,"__v":0,"created_on":"2015-03-24T21:13:04.756Z","score":0.000035169512084646613},{"_id":"5511995c2758871d56428300","id":1311,"pasta":"Viper_27: no one heeds my warnings Viper_27: no one Viper_27: now you fuckers pay Viper_27: PogChamp","tags":"#dota2#dotaloungebetsreddit#twitch#viper","favourites":10,"__v":0,"created_on":"2015-03-24T17:05:02.965Z","score":0.0002191568488339067},{"_id":"551180e32758871d564282fe","id":1310,"pasta":"Guys its no joke, bts got robbed with people invading their house with rifles and shit, stealing all electronical devices, thats what you get if you have ten thousnads of dollars of equippement and no scurity measurements i guess","tags":"#DotA2#BTS#robbed","favourites":0,"__v":0,"created_on":"2015-03-24T12:55:14.924Z","score":0},{"_id":"551180cb2758871d564282fd","id":1309,"pasta":"Ｉｔ  ｓｅｒｉｏｕｓｌｙ  ｂｒｅａｋｓ  ｉｍｍｅｒｓｉｏｎ．  Ｗｈｅｎ  Ｉ＇ｍ  ｑｕｅｕｉｎｇ  ｕｐ  ｆｏｒ  ａ  ｌｏｂｂｙ，  Ｉ＇ｍ  ｇｅｔｔｉｎｇ  ｍｙ  ｓｈｉｔ  ｒｅａｄｙ  ｆｏｒ  ｓｏｍｅ  ｍｉｎｄ－ｂｅｎｄｉｎｇ，  ｌｏｒｅ－ｆｕｃｋｉｎｇ  ｇａｍｅｐｌａｙ．  Ｔｈｅｎ  ｒｉｇｈｔ  ｔｈｅｒｅ  Ｉ  ｓｅｅ  ＢｉｇＤａｄｄｙＤ０ｅｓＴａｉｌ  ｐｏｒｋｉｎｇ  ｓｏｍｅ  ｈａｐｌｅｓｓ  ｍｕｄｂｌｏｏｄ  ｗｉｔｈ  ｏｂｓｃｅｎｅｌｙ  ｃｏｌｏｕｒｅｄ  ｈａｉｒ．  Ｈｅｒｅ  Ｉ  ａｍ，  ｊｕｓｔ  ａ  ｂｏｙ  ｔｒｙｉｎａ＇  ｐｌａｙ  ｓｏｍｅ  ｄｏｔｅｓ，  ａｎｄ  Ｖａｌｖｅ  ｄｏｎ＇ｔ  ｅｖｅｎ  ｈａｖｅ  ｔｈｅ  ｃｏｍｍｏｎ  ｃｏｕｒｔｅｓｙ  ｔｏ  ｇｉｖｅ  ｍｅ  ｓｏｍｅ  ｑｕａｌｉｔｙ  ｌｏｒｅ－ｅｆｆｉｃｉｅｎｔ  ｐｏｒｎ．  Ｔｈｅｒｅ  ａｒｅ  ｃｏｕｎｔｌｅｓｓ，  ｈａｒｄ－ｐｒｅｓｓｅｄ  ｃｏｎｔｅｎｔ  ｃｒｅａｔｏｒｓ  ｍａｋｉｎｇ  ｃｏｕｎｔｌｅｓｓ  ｔｏｐ－ｔｉｅｒ  ＳＦＭｓ  ｏｆ  ｔｈｅ  ｄｏｔｅｓ  ａｎｄ  ｔｈｅ  ｄｉｃｋ，  ｙｅｔ  Ｉ  ｇｅｔ  ｔｈｉｓ  ｓｈｉｔｐｏｓｔ－ｑｕａｌｉｔｙ  ｔｒａｓｈ  ｏｎ  ｍｙ  ｓｃｒｅｅｎ． ０／１０，  Ｖａｌｖｅ．  Ｙｏｕ  ｆｕｃｋｅｄ  ｍｅ  ｕｐ．","tags":"#dota2#bigdaddy#notail#lore","favourites":4,"__v":0,"created_on":"2015-03-24T10:48:09.797Z","score":0.00008754337237810799},{"_id":"551122ef2758871d564282fa","id":1308,"pasta":"Ｉｔ  ｓｅｒｉｏｕｓｌｙ  ｂｒｅａｋｓ  ｉｍｍｅｒｓｉｏｎ．  Ｗｈｅｎ  Ｉ＇ｍ  ｑｕｅｕｉｎｇ  ｕｐ  ｆｏｒ  ａ  ｌｏｂｂｙ，  Ｉ＇ｍ  ｇｅｔｔｉｎｇ  ｍｙ  ｓｈｉｔ  ｒｅａｄｙ  ｆｏｒ  ｓｏｍｅ  ｍｉｎｄ－ｂｅｎｄｉｎｇ，  ｌｏｒｅ－ｆｕｃｋｉｎｇ  ｇａｍｅｐｌａｙ．  Ｔｈｅｎ  ｒｉｇｈｔ  ｔｈｅｒｅ  Ｉ  ｓｅｅ  ＢｉｇＤａｄｄｙＤ０ｅｓＴａｉｌ  ｐｏｒｋｉｎｇ  ｓｏｍｅ  ｈａｐｌｅｓｓ  ｍｕｄｂｌｏｏｄ  ｗｉｔｈ  ｏｂｓｃｅｎｅｌｙ  ｃｏｌｏｕｒｅｄ  ｈａｉｒ．  Ｈｅｒｅ  Ｉ  ａｍ，  ｊｕｓｔ  ａ  ｂｏｙ  ｔｒｙｉｎａ＇  ｐｌａｙ  ｓｏｍｅ  ｄｏｔｅｓ，  ａｎｄ  Ｖａｌｖｅ  ｄｏｎ＇ｔ  ｅｖｅｎ  ｈａｖｅ  ｔｈｅ  ｃｏｍｍｏｎ  ｃｏｕｒｔｅｓｙ  ｔｏ  ｇｉｖｅ  ｍｅ  ｓｏｍｅ  ｑｕａｌｉｔｙ  ｌｏｒｅ－ｅｆｆｉｃｉｅｎｔ  ｐｏｒｎ．  Ｔｈｅｒｅ  ａｒｅ  ｃｏｕｎｔｌｅｓｓ，  ｈａｒｄ－ｐｒｅｓｓｅｄ  ｃｏｎｔｅｎｔ  ｃｒｅａｔｏｒｓ  ｍａｋｉｎｇ  ｃｏｕｎｔｌｅｓｓ  ｔｏｐ－ｔｉｅｒ  ＳＦＭｓ  ｏｆ  ｔｈｅ  ｄｏｔｅｓ  ａｎｄ  ｔｈｅ  ｄｉｃｋ，  ｙｅｔ  Ｉ  ｇｅｔ  ｔｈｉｓ  ｓｈｉｔｐｏｓｔ－ｑｕａｌｉｔｙ  ｔｒａｓｈ  ｏｎ  ｍｙ  ｓｃｒｅｅｎ． ０／１０，  Ｖａｌｖｅ．  Ｙｏｕ  ｆｕｃｋｅｄ  ｍｅ  ｕｐ．","tags":"#dota2#valve#notail","favourites":1,"__v":0,"created_on":"2015-03-24T08:27:11.845Z","score":0}]