[{"_id":"551106112758871d564282f3","id":1305,"pasta":"Hi, yes, im a peruvian doto 2 player, sorry if we usually have those kind of players... 6 years in the game and i´ve seen worst players... and they were not peruvians,... in fact they were from us, colombia, venezuela, whatever every country has a lot of good and bad players.... if you dont like to have those kind of support, try playing a rotating support without dying, YOU FUCKING PIECE OF SHIT, SUPPORT IS NOT AN EASY ROLL, KEEP FLAMING I HOPE YOU GET 400 MMR SO YOU CAN DELETE YOUR SHITTY ACCOUNT AND GET FUCKING SHREKT﻿","tags":"#dota2#CHILONGQUA#Peruvian#CarlosVelasco","favourites":4,"__v":0,"created_on":"2015-03-24T06:29:36.018Z","score":0.000058153031073115974},{"_id":"5510edcc32d34a8e3c3ec414","id":1304,"pasta":"WELP time to full screen. Sorry degenerates. Won't be seeing you ever again. Barnyyy is fantastic, even throbbing girl cocks couldn't pull me away. I got a chill in my spine reading that back...","tags":"#dota2#barnyyy#degenerates","favourites":1,"__v":0,"created_on":"2015-03-24T04:38:31.170Z","score":0},{"_id":"5510cb1b32d34a8e3c3ec40f","id":1301,"pasta":"I'm not trying to rant here, although it might come out as one. I just don't understand the mentality some people have on the game as a whole.\nI don't understand why being a \"tryhard\" is a thing in Dota 2, or why people complain about picking strong meta heroes, or smoking / whatever.\nComing from a background in Starcraft 2 it just baffles me. I've never played a ladder game of SC2 and had someone be like \"WOW HATCH FIRST WOW TRYHARD WHY DONT YOU JOIN GSL GEEZ\" so why is it that when people try everything they can to get an edge in a highly competitive game, they try to ostracize the person as some sort of anomaly that needs to be removed from the face of the game.\nI'd really like to see less of an accepting of this thought process as it stifles the chances of having that 70 minute back and forth game full of team fights, smoke ganks, mass buybacks, etc. THAT's the kind of game I play for, and I don't think I'm alone in this.\nIf that's not what you're out for and you just want to pick random heroes / do whatever, that's cool man. You do you. But don't rage at the guy on your team or the enemy team for doing his best to win the game. Besides, there's always AR or SD if you really want a diverse hero pool.\nTL;DR; Dota 2 is a highly competitive game and I have no idea why people trying to learn / practice have this negative aura around them in the eyes of some of the community. Please stop this, it detracts from the quality of the game. :C","tags":"#dota2#tryhard#rant#competitive","favourites":0,"__v":0,"created_on":"2015-03-24T01:57:08.572Z","score":0},{"_id":"5510cac932d34a8e3c3ec40d","id":1299,"pasta":" No gym for home, work out floor with 30, but is it for 20 like 30 lb when you no lift it to be for men, for 30 lbs instead? or half is 10 for 20 pounds?UMM HOW i word this... ok u take 20 lbs no lifting for 30lb if guy, so divide 2 u dont sit, u get 10 but for guy it no 30, so 20 would be for guy if u werent a girl ?","tags":"#dota2#rtz#donator#donation","favourites":0,"__v":0,"created_on":"2015-03-24T01:51:48.298Z","score":0},{"_id":"5510b6fa32d34a8e3c3ec407","id":1298,"pasta":"ⓨⓞⓤ ⓕⓤⓒⓚⓘⓝⓖ ⓞⓦⓔ ⓜⓔ Ⓟⓤⓡⓖⓔ. Ⓘⓣ ⓦⓐⓢ ⓑⓔⓒⓐⓤⓢⓔ ⓞⓕ ⓨⓞⓤⓡ ⓢⓣⓤⓟⓘⓓⓘⓣⓨ ⓘⓝ ⓣⓗⓘⓝⓚⓘⓝⓖ ⓣⓗⓐⓣ ⓐⓝ ⓵⓼ ⓨⓔⓐⓡ ⓞⓛⓓ ⓖⓘⓡⓛ ⓦⓞⓤⓛⓓ ⓕⓤⓒⓚ ⓨⓞⓤⓡ ⓟⓐⓣⓗⓔⓣⓘⓒ ⓢⓔⓛⓕ, ⓐⓝⓓ ⓨⓞⓤⓡ ⓢⓟⓘⓣⓔⓕⓤⓛⓛⓝⓔⓢⓢ ⓣⓗⓐⓣ ⓢⓗⓔ ⓦⓞⓤⓛⓓⓝ'ⓣ ⓓⓞ ⓢⓤⓒⓗ ⓐ ⓣⓗⓘⓝⓖ, ⓛⓔⓐⓓ ⓗⓔⓡ ⓣⓞ ⓠⓤⓘⓣⓣⓘⓝⓖ ⒹⓞⓣⒶ ⓐⓝⓓ ⓜⓞⓥⓘⓝⓖ ⓞⓝ ⓦⓘⓣⓗ ⓗⓔⓡ ⓛⓘⓕⓔ, ⓐⓝⓓ ⓝⓞⓦ ⓢⓗⓔ ⓓⓞⓔⓢⓝ'ⓣ ⓣⓡⓤⓢⓣ ⓜⓔ. \n \nⓌⓗⓨ ⓦⓞⓤⓛⓓ ⓨⓞⓤ ⓦⓐⓝⓣ ⓣⓞ ⓑⓔ ⓢⓞ ⓗⓤⓡⓣⓕⓤⓛ ⓣⓞ ⓐ ⓖⓘⓡⓛ ⓦⓗⓞ ⓨⓞⓤ ⓢⓤⓟⓟⓞⓢⓔⓓⓛⓨ ⓁⓄⓋⒺⒹ ⓢⓞ ⓜⓤⓒⓗ??﻿","tags":"#dota2#owe#me#purge#circle","favourites":3,"__v":0,"created_on":"2015-03-24T00:56:29.792Z","score":0.000041422608855659294},{"_id":"5510b6e632d34a8e3c3ec406","id":1297,"pasta":"Dota's comeback mechanics are just genius, I think every sports needs to have similar mechanics in the future. For example in football your goal could be made bigger by moving the goalposts if your team is winning a lot. Or maybe they could count one goal as two goals for the team that is behind. Or maybe punish leading team more for their mistakes. Red card instead of yellow and so on.\nI think comeback mechanics are the future of all competitions, as they make watching much more pleasant experience since you can't be sure if the best team wins or loses.","tags":"#dota2#comeback#satire#football","favourites":46,"__v":0,"created_on":"2015-03-24T00:39:29.761Z","score":0.0005546589265099014},{"_id":"551076e5e176d8400420cf56","id":1294,"pasta":"ＨＥＹ Ｓ４， Ｉ＇Ｍ ＴＲＹＩＮＧ ＴＯ ＬＥＡＲＮ ＴＯ ＰＬＡＹ ＭＡＧＮＵＳ． Ｉ ＪＵＳＴ ＨＡＶＥ Ａ ＱＵＥＳＴＩＯＮ ＡＢＯＵＴ ＴＨＥ ＳＫＩＬＬ ＢＵＩＬＤ： ＳＨＯＵＬＤ Ｉ ＭＡＸ ＳＨＯＣＫＷＡＶＥ ＬＩＫＥ ＹＯＵ ＳＨＯＣＫＥＤ ＥＶＥＲＹＯＮＥ ＷＨＥＮ ＹＯＵ ＬＥＦＴ ＡＬＬＩＡＮＣＥ， ＳＫＥＷＥＲ ＳＯ Ｉ ＣＡＮ ＥＳＣＡＰＥ ＬＩＫＥ ＹＯＵ ＥＳＣＡＰＥＤ ＡＬＬＩＡＮＣＥ， ＯＲ ＥＭＰＯＷＥＲ ＳＯ Ｉ ＣＡＮ ＣＬＥＡＶＥ ＬＩＫＥ ＹＯＵ ＣＬＥＡＶＥＤ ＬＯＤＡ＇Ｓ ＨＥＡＲＴ","tags":"#dota2#s4#learn#magnus#skill#build","favourites":49,"__v":0,"created_on":"2015-03-23T20:05:21.369Z","score":0.0005846506292460264},{"_id":"55106830e176d8400420cf53","id":1293,"pasta":"Shrapnel is named after Major-General Henry Shrapnel (1761–1842), a British artillery officer, whose experiments, initially conducted in his own time and at his own expense, culminated in the design and development of a new type of artillery shell ending with his famous catchphrase \"Hoho Haha\"","tags":"#dota2#sniper#henry#shrapnel#hoho#haha","favourites":45,"__v":0,"created_on":"2015-03-23T18:58:30.301Z","score":0.0005436098243018206},{"_id":"551056bee176d8400420cf50","id":1291,"pasta":"ВСЁ КОРАБЛЬ,ВСЁ В АРТСТАЙЛА МИНУС АРТСТАЙЛ,КУРОНИТИ УБИРАЕТ АРТСТАЙЛА, ГОБЛИН УЛЬТУЕТ,ЗАБРАТЬ НАДО ХОТЬ КОГО-ТО,СТЕНКУ СТАВИТ,ОЙОЙОЙ КАКАЯ ХОРОШАЯ СТЕНА У ТОЛСТОЙ СКАТИНЫ,ПЫТАЕТСЯ ЧТО-ТО СДЕЛАТЬ НЕУБИВАЕТ НИКОГО,ФОБОС УЛЬТУЕТ НИКОГО НЕ ЗАБИРАЕТ ЗДЕСЬ КРИПЫ ЛОСТА ПЫТАЮТСЯ ЧТО-ТО СДЕЛАТЬ ИХ ТУТЖЕУБИВАЕТКУНКА!НА ТОРРЕНТ ОПЯТЬ ВСЕ,ВСЕ ЧЕТВЕРО ПОПАДАЮТ НА ТОРРЕНТ,ДЕНДИ УХОДИТ ПРОСТО С ТП,ЗАБИРАЮТ ЛОСТА, ЗАБИРАЮТ ФОБОСА,ЗАБИРАЮТ ГОБЛАКА,МОЖНО ЛИВАТЬ,ЭТО БЛЯТЬ НЕ ИГРА, ЭТО ПРОСТО ПОШЛИ ОНИ НАХУЙ БЛЯТЬ","tags":"#dota2#v1lat#корабль","favourites":6,"__v":0,"created_on":"2015-03-23T17:14:36.437Z","score":0.00008872255540086555},{"_id":"550f5e662ab05ce134dd32f5","id":1287,"pasta":"ＩＸＭＩＫＥ88 ＩＳ ＴＨＥ ＨＥＲＯ ＹＯＵＲ ＭＯＴＨＥＲ ＮＥＥＤＳ, ＮＯＴ ＴＨＥ ＨＥＲＯ ＳＨＥ ＷＡＮＴＳ","tags":"#dota2#ixmike88#mother#needs#wants","favourites":2,"__v":0,"created_on":"2015-03-23T00:09:22.231Z","score":0.000023106978224834305},{"_id":"550f0acc2ab05ce134dd32ee","id":1282,"pasta":"It's hard to find a more infamous number in Dota. You would be dreaming to think of a danker Dota meme. While we sit in a circle high atop our tower of upvotes, furiously jerking over these three very important numbers, it's hard to take a step back and realize just how serious they actually are.\nFor those who are uninitiated, 322 is more than just a joke. Maybe you don't play Dota and have only ever known 322 as a highway, or 23x14. Maybe you have seen it typed in your pub games when Io builds a shadow blade. Maybe you've seen it in passing in discussions. Regardless, 322 might be big in the well informed Dota communities, but it's impact in the wider eSports scene feels small. Today, on March 22nd we aim to change that.\nSo what is 322? 322 is slang for a Dota match-fixing. Match-fixing is the process of playing a match in an organized sport in which the outcome is pre-determined. In June of 2013 during Star Ladder Season 6, just that happened. RoX.KIS Dota 2 squad was playing a group stage match vs zRAGE. The match was insignificant in regards to standings as both teams were out of the tournament at this point. Solo, RoX's captain, placed a $100 bet against his team in this match. A match that they were heavily favored to win.\nIt was a shock when zRAGE won the match; as many people betting in game items, factious funny money, and real currency, lost the safe bet. Upset happen in sports, often times that's the fun of betting in the first place. However when Solo was found to have placed a bet against his own team, everything changed. Controversy ran rapid through the Dota scene. Reputations were tarnished, player integrity ruined, and skeptics born. Solo received a lifetime ban from Star Ladder. His team and organization were also punished to a lesser extent. All of this fuss, and what did Solo get out of it? $322. A meme is born.\nMatch-fixing isn't a new conundrum in the world of eSports. You're most likely familiar with this term because of it's traditional sports shenanigans. Could you imagine Kobe rolling on into the sports book and dropping a stack against the Lakers? No? That's right because player's simply cant bet against your own team in professional sports. It's against the rules, and in many cases just strait illegal. Maybe you've heard about the 1919 world series? Or Tim Donaghy? Or the Italian Football Scandal?\nIn addition to existing offline, match-fixing has plagued a myriad of other prestigious eSports titles. Broodwar was rocked in 2010 when the Korean news confirmed Match Fixing going on in Starcraft. KeSPA banned 11 professional players, who received massive fines once they were confirmed to have bet against themselves. In addition gaming was these players documented professions in Korea, these illegal acts were punishable by law. since The loyal Broodwar community felt quite betrayed.\nCounter Strike community has run rampant with allegations and confirmed match fixing reports already in 2015. Back in January iBUYPOWER caused quite the mess when they were found to have thrown a match against NetCodeGuides. Mind you that at this point in time the iBuy team was playing and representing as a premiere American team. After heavy bets were placed by a group of people with insider information, the clowny match and subsequent loss was just the tip of the iceberg. Ultimately Valve, the game's developer, levied lifetime suspensions on those involved. Not a month later in February Valve had to dish out additional bans, in the process setting a firm precedent on what happens when you bet on games when you're a pro.\nLeague of Legends has not stopped itself from cutting a nice ol' hunk of drama pie for itself either. Last year Ahq e-Sports Club was confirmed to be fixing matches. Their team manager was tricking one of their players into throwing games, which was fueling his eSports gambling addiction in attempt to make back the team's salary money which he lost prior. This story is more notable as the player who was aiding in fixing the matches was so distraught, he attempted to hill himself by leaping off a twelve story building.\nAgain we find outselves back in Dota 2 where the match fixing did not stop with Solo. Arrow Gaming, namely it's players DDZ and Lance, were ousted after rumors were posted to reddit that they were involved with betting and match fixing incidents which were plaguing the SEA region. After much work and many lies were spit to attempt to cover tracks, the two players admitted to match fixing.\nBut what ever happened to Solo? His ban was lifted after a year. He continues to play on professional Dota 2 teams to this day. 322 is more than a meme. It embodies an entire controversy. Match-fixing is real. Gambling problems are serious. There are professional players in every major eSport that have dabbled in, or considered the abominable behavior. Fixing matches has the ability to undermine so much in an industry we are working so hard to grow. It's becoming more than just a game, and criminals need to be treated to the highest of standards. We can not be tolerant of short term player bans, or new teams containing known offenders. Valve with their firm hand in a step in the right direction regarding Counter Strike in 2015.\nHappy 322 to you. Let us look forward to the amazing year of competition ahead, and the continued growth of a joy we all share.\npls no coperino pasterino masterino kappacino ty","tags":"#dota2#322#infamous#number","favourites":4,"__v":0,"created_on":"2015-03-22T11:40:30.504Z","score":0.00005754686323186192},{"_id":"550f0ab42ab05ce134dd32ed","id":1281,"pasta":"ＸＹＣＬＯＰＺ ＩＳ ＴＨＥ ＡＳＩＡＮ ＭＯＲＧＡＮ ＦＲＥＥＭＡＮ, ＨＥ ＨＡＳ ＴＨＥ ＶＯＩＣＥ ＯＦ ＡＮ ＡＮＧＥＬ","tags":"#dota2#xyclopz#asian#morgan#freeman","favourites":10,"__v":0,"created_on":"2015-03-22T17:53:43.769Z","score":0.00014397312599924518},{"_id":"550e46b92ab05ce134dd32d2","id":1272,"pasta":"One the first day, a great leader has risen and showed us how to rule with an iron fist. His name was Jobis the all mighty,  he ruled humbly and not as a hitler, i am here to tell you about the great story of our leader and master JOBIS. In the wee hours of the first day jobis didnt only cure us from the riots and mayhem of the remenants of the last moderators, they not only let the riots occur all through out the chat, but incouraged them, but then when our all mighty jobis was modded, the chat instantly  was purified. Its these dark times that i have forgotten how a leader can arise from the volitile cancer, also known as the SirActionSlacks chat. If not for jobis the civillians of the chat would have no purpose, but. WITH JOBIS WE ALL HAVE A PURPOSE AND SOMETHING TO STRIVE FOR. ALL HAIL JOBIS. ","tags":"#dota2#siractionslacks#memes","favourites":1,"__v":0,"created_on":"2015-03-22T04:29:42.881Z","score":0},{"_id":"550e16dd2ab05ce134dd32cf","id":1271,"pasta":"Fear already has sons, they're called Arteezy & Sumail. Arteezy is the passion child from his first Russian/Uzbekistan lover Katia Babevsky. A few years later he spent a hot spicy summer in Pakistan where he fell in love with Chicken Curry and a brown hooker called Anika. 9 months later, Sumail was born. There's a reason why they call him Old man Doto. His Sperm gives birth to legends. RuleFive","tags":"#dota2#fear#arteezy#sumail#rtz#dota#sons","favourites":4,"__v":0,"created_on":"2015-03-22T00:58:36.785Z","score":0.000057397183432924625},{"_id":"550cdbad2ab05ce134dd32ba","id":1261,"pasta":"\"Shit XBOCT, my back hurts, there are cockroaches on my feet and we are losing the lanes, what should we do? What would Puppey do?\" says Dendi while sitting on his plastic chair and trying to fight off the vicious cockroaches.\"It's ok buddy i know what to do\" says Xboct as he gently pours Vodka into the keyboard while pulling a lighter out of his pocket.","tags":"#dota2#dendi#xboct#majorallstars#puppey#navi","favourites":3,"__v":0,"created_on":"2015-03-21T02:45:13.782Z","score":0.00004071981861698048}]