[{"_id":"564dbb5c14bb47530dfef234","id":2310,"pasta":" FeelsBirthdayMan \"Dad,who is Tucker?\" FeelsBadMan \"That was a long time ago son, when Singsing's chat was not the source of cancer and autism, Singsing had a best friend named Tucker, I would've shed tears of joy when I saw Singsing and Tucker play together, but then,the reddit nation attacked, flaming Tucker untill one day he couldn't take it anymore and stopped playing with Singsing. I would give anything just to see them play together just one more time like they used to, FeelsBadMan , but that will never happen. \" ","tags":"#singsing#tucker#dota2#twitch","favourites":1,"__v":0,"created_on":"2015-11-19T12:06:52.826Z","score":0},{"_id":"564dbb2614bb47530dfef231","id":2307,"pasta":"Guys I found a solution to audio being early by 0.5s. I just placed my speakers 171.5m from my screen. The sound will take exactly half a second later to reach me in typical temperature and pressure.","tags":"#dota2#bts#audio#general","favourites":10,"__v":0,"created_on":"2015-11-19T12:05:58.318Z","score":0.00012933377489141222},{"_id":"564dba8e14bb47530dfef22b","id":2301,"pasta":"Ｄｏｔａ  ｉｓ  ｒｅａｌｌｙ  ｂｅｃｏｍｉｎｇ  ａ  ｇｒｅａｔ  ｇａｍｅ  ａｎｄ  ｉｓ  ｓｔａｒｔｉｎｇ  ｔｏ  ｔｒｕｌｙ  ｂｅｃｏｍｅ  ａ  ｇａｍｅ  ｏｆ  ｓｔａｔｓ．  Ｗｉｔｈ  ｇｒａｐｈｓ  ｌｉｋｅ  ｔｈｅｓｅ  ｗｅ  ｃａｎ  ｔｕｒｎ  ｄｏｔａ  ｉｎｔｏ  ａ  ｓｃｉｅｎｃｅ．  Ｔｈａｎｋ  ｙｏｕ．  Ｐｌｅａｓｅ  ｎｏ  ｃｏｐｙ  ｐａｓｔｅｒｉｎｏ．\n","tags":"#dota2","favourites":2,"__v":0,"created_on":"2015-11-19T12:03:26.258Z","score":0.000020725535215160466},{"_id":"564dba6414bb47530dfef228","id":2298,"pasta":"Honestly if you're in LP you're literally a piece of shit and should kill yourself because you're so fucking awful. If it were up to me you'd have to burn your hand on a hot stove and flay your pinky finger before you can play our sacred Dota 2 again. Personally I've never been in LP so that means anyone that has is a fucking retard. I'm obviously a bastion of true character and moral grounds, so I can say this.- Average Redditor, 10/23/2015\n","tags":"#dota2#reddit#lowpriority","favourites":2,"__v":0,"created_on":"2015-11-19T12:02:44.699Z","score":0.000020725481637721655},{"_id":"564db8f114bb47530dfef224","id":2294,"pasta":" ʜᴇʟʟᴏ, ɪ ᴀᴍ ᴀ 6000 ᴍᴍʀ ᴋᴏʀᴇᴀɴ sᴜᴘᴇʀᴍᴏᴅᴇʟ ɢʀɪʟʟ admiralDream ✌ ᴀɴᴅ ɪ ᴡᴏᴜʟᴅ ᴊᴜsᴛ ʟɪᴋᴇ ᴛᴏ ʟᴇᴛ ʏᴏᴜ ᴋɴᴏᴡ ᴛʜᴀᴛ ɪ ᴄᴀɴ ᴄᴀʀʀʏ ᴀʟʟ ᴅᴀʏ ᴀɴᴅ ғᴜᴄᴋ ᴀʟʟ ɴɪɢʜᴛ ♡‿‿♡","tags":"#dota2","favourites":1,"__v":0,"created_on":"2015-11-19T11:56:33.026Z","score":0},{"_id":"564db71414bb47530dfef223","id":2293,"pasta":"\"LMFAO wHo cAREAS HAHA Xd\"","tags":"#Artour#dota2","favourites":11,"__v":0,"created_on":"2015-11-19T11:48:36.853Z","score":0.00014119361628585773},{"_id":"564db68b14bb47530dfef21f","id":2289,"pasta":"▬▬▬▬▬▬▬▬▬▬ஜ۩۞۩ஜ▬▬▬▬▬▬▬▬▬▬ᴛᴏ ᴘʀᴏᴛᴇᴄᴛ ᴛʜᴇ ᴄʜᴀᴛ ғʀᴏᴍ ᴅᴇᴠᴀsᴛᴀᴛɪᴏɴ. ᴛᴏ ᴜɴɪᴛᴇ ᴀʟʟ sᴘᴀᴍᴍᴇʀs ᴡɪᴛʜɪɴ ᴏᴜʀ ɴᴀᴛɪᴏɴ. ᴛᴏ ᴅᴇɴᴏᴜɴᴄᴇ ᴛʜᴇ ᴇᴠɪʟ ᴏғ bans ᴀɴᴅ ᴍᴏᴅs. ᴛᴏ ᴇxᴛᴇɴᴅ ᴏᴜʀ sᴘᴀᴍ ᴛᴏ ᴛʜᴇ sᴛᴀʀs ᴀʙᴏᴠᴇ. ᴄᴏᴘʏ! ᴘᴀsᴛᴇ! ᴄʜᴀᴛ sᴘᴀᴍ ʙʟᴀsᴛ ᴏғғ ᴀᴛ ᴛʜᴇ sᴘᴇᴇᴅ ᴏғ ʟɪɢʜᴛ! sᴜʀʀᴇɴᴅᴇʀ ᴍᴏᴅs ᴏʀ ᴘʀᴇᴘᴀʀᴇ ᴛᴏ ғɪɢʜᴛ! Yeah ᴛʜᴀᴛs ʀɪɢʜᴛ!▬▬▬▬▬▬▬▬▬▬ஜ۩۞۩ஜ▬▬▬▬▬▬▬▬▬▬","tags":"#dota2#twitch#twitchchat","favourites":2,"__v":0,"created_on":"2015-11-19T11:46:19.238Z","score":0.00002072421126449507},{"_id":"564db66114bb47530dfef21d","id":2287,"pasta":"Hi guys, I'm new to DOTA of the Ancients 2 and thought I could learn something from this stream, but clearly this Admiral Bull Dog is not a professional player. I am 1.8k MMR and make fewer misteaks than him. Can you guys point me to a stream of a DOTA of the Ancients 2 Worlds winner?","tags":"#dota2#misteaks#DotaOfTheAncients2","favourites":2,"__v":0,"created_on":"2015-11-19T11:45:37.081Z","score":0.000020724156922371622},{"_id":"563fff8b59b2d28c5e790470","id":2265,"pasta":"Just another day at 5k mmr. I pick the renowed windranger and say I want mid. Blue picked sf and also wants mid. I go safelane. We have an AM. I became support at minute 4. No couriers and wards just the strength of our skills and hearts. Seven minutes into the game I got flamed. Ten minutes into the game sf died three times. I rotate top. I gank. I died. I got flamed. \"Time to get serious\" is what I said. Thirty minutes into the game our carry lost hope and afk at base. My CM is out of control. Sf is feeding. The perfect time. Finished my aghs/daedalus. I thrive in a 1v9 situation. Odds are stacked I lose my composure. My heart beats faster with every kill. I die multiple times before realizing my true fate. I am windranger. I powershoot to victory. My teammates flame me. I mute them. I windrun. I bkb. I kill. Everything up to this point is a mere act. Two man shackles that baffles their minds. I kill. Enemy WW glimmer capes to safety. I powershoot. I kill. Not once have I doubted my ability. Couriers are everywhere. Fools. I am windranger. The racks melt at my focus fire. No buyback on the enemy team. I unmute to see what the fools have to say. \"You're doing it wr\". I muted them again. The enemy ancient never stood a chance. A grin appears on my face while typing \"gg\". I don't complain. I don't flame. I am windranger. The game ends. ","tags":"#dota2#5k#windrunner","favourites":18,"__v":0,"created_on":"2015-11-09T02:06:03.498Z","score":0.0002080173768907132},{"_id":"563fff7259b2d28c5e79046e","id":2263,"pasta":"KKona MY KKona DREAM KKona IS KKona ONE KKona PAGE KKona FULL KKona OF KKona KKONAS KKona PLS KKona HELP KKona ME KKona FULFILL KKona IT KKona","tags":"#dota2#bttv#KKona","favourites":2,"__v":0,"created_on":"2015-11-09T02:05:38.266Z","score":0.00001962116825924839},{"_id":"563006dc9c4390371389d149","id":2261,"pasta":"OVERRATED PLAYERS ✓ RECENTLY SHUFFLED ROSTERS ✓ TROLLY PLAYS AND THROWS ✓ FAT CASTERS ✓ TIER 4 TEAMS ✓ POOR QUALITY PLAY ✓ MUST BE NA DOTA BrokeBack ","tags":"#dota2#NA#NAdota","favourites":20,"__v":0,"created_on":"2015-10-27T23:21:00.247Z","score":0.00021475451027302752},{"_id":"5622fcc284d2175224d8533e","id":2250,"pasta":"NotATK Chinese supports?✔ ANELE Pakistani Mid? ✔ 4Head Trash Carry? ✔ EleGiggle Indian Offlane? ✔ SoBayed Only 1 relevant team? ✔ FailFish MUST BE NA DOTA 4Head EleGiggle","tags":"#dota2#na#EvilGeniuses#EG","favourites":18,"__v":0,"created_on":"2015-10-18T01:58:26.594Z","score":0.00018665494376736427},{"_id":"5622fcb884d2175224d8533d","id":2249,"pasta":"GORGEOUS TONE OF GRAY ✓ Kappa TIMELESS DESIGN ✓ Kappa THE ORIGINAL KING OF THE EMOTES ✓ Kappa LOTS OF ADORABLE VERSIONS ✓ Kappa MUST BE  Kappa ✓ Kappa","tags":"#twitch#general#dota2#emotes#checkmark","favourites":23,"__v":0,"created_on":"2015-10-18T01:58:16.941Z","score":0.00023139327588643738},{"_id":"5622fca784d2175224d8533c","id":2248,"pasta":"CHECK MARK ✓ 4Head CHECK MARK ✓ EleGiggle CHECK MARK ✓ SoBayed CHECK MARK ✓ PogChamp MUST BE CHECK MARK ✓ SeemsGood","tags":"#dota2#checkmark","favourites":21,"__v":0,"created_on":"2015-10-18T01:57:59.637Z","score":0.00021372553848214828},{"_id":"5622fc1884d2175224d85338","id":2244,"pasta":"Kreygasm Our Loda, who art in Alliance. Hallowed be thy carry; Thy 322 come, I wont be glum, As rares will be lost like usual. Give us this day, an ez win, and we shall say ALLIANCE IS BACK. As we forgive s4 his time at Team Secret; lead us not into an early disband, but deliver us a TI6 victory. Amen Kreygasm","tags":"#Dota2#Loda#Alliance","favourites":10,"__v":0,"created_on":"2015-10-18T01:55:36.207Z","score":0.00010986603400984463}]