[{"_id":"559ef1a8975fee4a2be0842d","id":1862,"pasta":"He's a good drafter, a bit overated in my opinion. But defenitely okay to be in a top team! To say that he is one of the best drafters etc is really exageration, he drafted like 10 games in a high level LAN, you need way more to compare him to Puppey, s4 or PPD","tags":"#dota2#7ckingmad#7ckingbad#overrated#drafter","favourites":0,"__v":0,"created_on":"2015-07-08T00:09:44.497Z","score":0},{"_id":"559ef1a5975fee4a2be0842c","id":1861,"pasta":"Ummmm :/ excuse me mr slacks but i thought the point of dirtmaul was to \"get the plebs down and dirty and fight for the streamers\" but this \"Carl\" also known as s4 from team secret is a professional player, I'm sorry but i don't see how this is the essence of dirtmaul :/ long time viewer really disappointed here :////","tags":"#dota2#dirtmaul2#S4#siractionslacks#Fwoshy","favourites":2,"__v":0,"created_on":"2015-07-09T13:51:08.555Z","score":0.00016309957784172742},{"_id":"559ef1a4975fee4a2be0842b","id":1860,"pasta":"Hi guys. This year will be the year of self-improvement for me. My goals are to lose weight; fight internet porn addiction and also get some grills in my life. GL in 2015, please no copy pasta","tags":"#dota2#admiralbulldog#twitch#donation","favourites":2,"__v":0,"created_on":"2015-07-09T09:26:50.062Z","score":0.0001622653582534647},{"_id":"559ef170975fee4a2be08427","id":1856,"pasta":"this guy is not capitalist this guy is a man named rodriguez del gato and he is part of the mexican cartel please beware of his stream","tags":"#dota2#DotACapitalist#DIRTMAUL","favourites":5,"__v":0,"created_on":"2015-07-07T20:02:09.923Z","score":0.0004936153440745062},{"_id":"559b549ef17ca0ca6d772bde","id":1852,"pasta":"Hello Zai i come from the future, the year current is 2332. I want to inform you that you transfered your mind into a cyborg and you're still, trying to achieve 6k. You've missed 322 TIs . When i was about to enter my traveling machine your MMR was 5999 and you had just lost a game. Please go to sleep Zai, i'm not joking this is serious!!","tags":"#dota2#zai#future#6k#TI","favourites":2,"__v":0,"created_on":"2015-07-05T20:27:40.620Z","score":0.00014755641389195632},{"_id":"559b5495f17ca0ca6d772bdd","id":1851,"pasta":"Ｂｒｅａｋｉｎｇ Ｎｅｗｓ！ Ｔｅａｍ Ｓｅｃｒｅｔ ｏｆｆｌａｎｅ ｐｌａｙｅｒ Ｌｕｄｗｉｇ ＇Ｚａｉ＇ Ｗａｈｌｂｅｒｇ ｗｉｌｌ ｎｏｔ ｂｅ ａｔｔｅｎｄｉｎｇ Ｔｈｅ Ｉｎｔｅｒｎａｔｉｏｎａｌ ５ ｔｈｉｓ ｙｅａｒ ｄｕｅ ｔｏ ｈｉｓ ｔｗｉｔｃｈ ｌｉｖｅｓｔｒｅａｍ， \"ｎｏｔ ｓｔｏｐｐｉｎｇ ｕｎｔｉｌ ｉｍ ６ｋ\"． Ｚａｉ ｉｓ ｓｔｉｌｌ ｃｕｒｒｅｎｔｌｙ ｑｕｅｕｉｎｇ ｉｎ ＥＵ Ｗｅｓｔ ａｔｔｅｍｐｔｉｎｇ ｔｏ ｇｅｔ ６ｋ ｍｍｒ． Ｈｉｓ ｃｕｒｒｅｎｔ ｍｍｒ ｉｓ ４１００． Ｐｌｅａｓｅ Ｐｒａｙ ｆｏｒ Ｚａｉ．","tags":"#dota2#secret#teamsecret#zai#6k","favourites":2,"__v":0,"created_on":"2015-07-05T18:35:39.144Z","score":0.00014726033211977436},{"_id":"5597363da28b796c71d39efe","id":1840,"pasta":"Episode IV, A NEW TWITTER GUY It is a period of civil war. LGD PR people, striking from a hidden base, have won their first victory against the evil Galactic Empire. During the battle, LGD spies managed to steal secret plans to the Empire’s ultimate weapon, the TWITTERSPHERE, an armored social media outlet with enough power to inspire 5 r/dota2[1] posts. Pursued by the Empire’s sinister agents, Princess xiao8 races home aboard her starship, custodian of the stolen plans that can save her people and restore freedom to TI5….","tags":"#lgd#empire#dota2","favourites":0,"__v":0,"created_on":"2015-07-02T23:53:56.268Z","score":0},{"_id":"5597362fa28b796c71d39efd","id":1839,"pasta":"Ｈｉ  Ｖａｌｖｅ，  Ｉ＇ｍ  ｔｒｙｉｎｇ  ｔｏ  ｌｅａｒｎ  ｈｏｗ  ｔｏ  ｐｌａｙ  ｄｏｔａ  ２．  Ｓｈｏｕｌｄ  Ｉ  ｂｕｙ  ａ  ｈｅａｒｔ  ｔｏ  ｒｅｐａｉｒ  ｍｉｎｅ  ａｆｔｅｒ  ｙｏｕ  ｂｒｏｋｅ  ｉｔ  ｗｉｔｈ  ｕｎｔｉｍｅｌｙ  ｒｅｌｅａｓｅ  ｏｆ  Ｉｍｍｏｒｔａｌ  ＩＩＩ  ｃｈｅｓｔ，  ｂｕｙ  Ｂｕｔｔｅｒｆｌｙ  ｓｏ  Ｉ  ｃａｎ  ａｖｏｉｄ  ｅｖｅｒｙｔｈｉｎｇ  ｌｉｋｅ  ｉｃｅＦｒａｕｄ  ｄｏｅｓ  ｏｒ  ｓｈｏｕｌｄ  ｉ  ｂｕｙ  ａ  ｍｉｄａｓ  ｓｏ  ｉ  ｃａｎ  ｇｅｔ  ｒｉｃｈ  ａｎｄ  ｂｅ  ｕｓｅｌｅｓｓ？","tags":"#dota2#valve#hearthofterrasque#broken","favourites":12,"__v":0,"created_on":"2015-07-02T21:48:51.251Z","score":0.0010109224949121553},{"_id":"5597361fa28b796c71d39efc","id":1838,"pasta":"༼ʕっ•ᴥ•ʔっ(_̅_̅_̅_̅_̅F̲I̲S̲S̲U̲R̲E̲_̅_̅_̅_̅()﻿ \n( ͡º ͜ʖ ͡º) \n( ͡°╭͜ʖ╮͡° ) \nつ ◕_◕ ༽つ \n{ ͡• ͜ʖ ͡•} \n( ง͡° ͜ʖ ͡°)ง \n(ง ͠° ͟ل͜ ͡°)ง \n[̲̅$̲̅(̲̅5̲̅)̲̅$̲̅] \nʕ ͡·ᴥ ͡· ʔ ","tags":"#dota2#earthshaker#dongers\n","favourites":1,"__v":0,"created_on":"2015-07-01T22:58:02.911Z","score":0},{"_id":"559735d0a28b796c71d39ef8","id":1834,"pasta":"ヽ(◉◡◔)ﾉ  HEY GUYS MY NAME IS ARISE I'M A ROMANIAN DOTA PLAYER THAN PLANS TO GO PROFESSIONAL  ヽ(◉◡◔)ﾉ ","tags":"#arise#singsing#dota2#professional","favourites":3,"__v":0,"created_on":"2015-07-03T21:44:54.502Z","score":0.0002502661820162621},{"_id":"559735a4a28b796c71d39ef6","id":1832,"pasta":"You're joking right? Cuz you MUST be fucking joking..Those are SYNDEREN THROWS you FUCKING IDIOT! That may have been the single stupidest thing I've ever seen written in my entire life. I'm a doto player, 6 years, I have 6k mmr in and around the greater EU area, yea.. thats right.. all the throws, they're all mine...and I have to wake up and see this garbage sully my masterpiece gameplay. I'm debating whether or not to delete this thing just so other people don't have to read that and squirm with discomfort knowing that there are people like you who play dota. You think you know dota? You would't last 19 games on my level. I'm so upset with you, seriously. OMNI has A BOUGHT ACCOUNT, SYNDEREN has THROWS. Don't you know that? Don't you? Well now you do, you shit! Unbelievable.","tags":"#dota2#synderen#throws#bought#account","favourites":3,"__v":0,"created_on":"2015-07-01T15:53:08.287Z","score":0.00023698191515570974},{"_id":"55922df7dd62532d34ee3738","id":1829,"pasta":"Gerg Lard is a joke. He gets a job at an SF tech start up and becomes a disgusting caricature of the yuppie, characterless plague infesting the bay. With every Apple watch he buys (yes, he bought one of those disgusting things) or Lyft ride Vulcun expenses for him, he descends deeper into his transformation into a mediocre, tasteless blob. Your shitty collection of mid-tier alcohol doesn't make you more refined. Your Nike trainers you wear to every place we go makes you look like an over-sized twelve year old that found his father's credit card and his brother's hair gel. You are eSports' basic bitch; running around in a Twitch hoodie, spending 50% of your time at events at the hotel bar, tweeting out your personal problems on Twitter. Caster, manager, \"eSports\" guy at Vulcun, \"personality\": Jack of all Trades but actually just bad at all of them. Your transcendence into a meme has been your greatest accomplishment. Fuck you Greg.","tags":"#dota2#whatiship#gerg","favourites":4,"__v":0,"created_on":"2015-06-29T21:18:10.411Z","score":0.00031874007194150893},{"_id":"55922de2dd62532d34ee3735","id":1826,"pasta":"IM SIGNING TO SAY AUI FUCK YOU IM NOT ACTUALLY SIGNING THIS SHIT SOMEONE REMOVE MY SIGNATURE BUT FUCK YOU AUI. FUCK YOU, OK?! I'M GONNA PICK TECHIES EVERY DAY OF MY GOD DAMN LIFE AND CREATE OVER 60 MINUTE LONG GAMES AND END UP 20 / 10 / 50 AND FUCKING BLOWING SHIT UP LIKE IT'S 9 / 11 ALL OVER AGAIN IN YOUR CUNT. HOW DO YOU LIKE THAT HUH. DEAL. WITH. IT","tags":"#dota2#fuck#you#aui_2000#aui","favourites":3,"__v":0,"created_on":"2015-06-29T00:22:21.450Z","score":0.00022286954558236254},{"_id":"558f79077bc415727ec982ee","id":1817,"pasta":"Hello, cykas and cykettes! Welcome to \"Blyat or Nyat!\" I'm your host, Chuck Wunderfukh!","tags":"#dota2#gameshow#cyka#blyat#ruskie#hailhydra","favourites":59,"__v":0,"created_on":"2015-06-27T16:32:29.079Z","score":0.003579556129319717},{"_id":"558e468263aff1a558465ef9","id":1811,"pasta":"Do you know what time is it? I just bought my manta style so it's 3 AM. ༼⌐■ل͟■༽༼⌐■ل͟■༽༼⌐■ل͟■༽ ","tags":"#Dota2#mantastyle#op","favourites":12,"__v":0,"created_on":"2015-06-26T13:17:36.792Z","score":0.0008736550015174313}]