[{"_id":"550c39ca2ab05ce134dd328b","id":1241,"pasta":"I just don't get why people think twitch chat is funny. Maybe if I was like 15 and baked. Like how is it funny whenever they interview Chinese players for everyone to spam CHING CHONG for 5 minutes? Like does anyone really find that fucking funny? I mean you've got hundreds of people at once doing this stupid shit. SingSings stream is even more insane, it feels like 5000 people with tourettes just trying to say the most bluntly offensive things they possibly can for no reason. I don't get it at all, it's fucking stupid and a huge waste of time.","tags":"#twitch#antipasta#funny#baked#dota2","favourites":13,"__v":0,"created_on":"2015-03-20T12:24:00.880Z","score":0.00019759590289298483},{"_id":"550b34192ab05ce134dd326a","id":1228,"pasta":"I come to this subreddit to follow the game and pro scene and I leave with a terrible taste in my mouth. Autism is a reality in all of our lives and it isn't something that should have these negative connotations attached to it. It's offensive to us that have loved ones who have been placed on the spectrum and it is especially offensive to anybody with autism who's reading these comments. I know this is the internet, but please people, grow up. Be a better person. Autism, depression, and suicide are serious issues that can feed on your negativity. Also, there are so many better insults out there...","tags":"#dota2#reddit#autism#EternalEnvy#ee","favourites":1,"__v":0,"created_on":"2015-03-19T20:20:33.009Z","score":0},{"_id":"550af90a2ab05ce134dd3261","id":1226,"pasta":"HEY RELATEABLEDOTA, I'M TRYING TO LEARN TO PLAY DRAGON KNIGHT. I JUST HAVE A QUESTION ABOUT THE SKILL BUID. SHOULD I MAX DRAGON BREATH FIRE FOR THE MOST GENERIC DAMAGE DEALING SPELL IN THE GAME, DRAGON TAIL FOR THE MOST GENERIC POINT AND CLICK STUN IN THE GAME, OR DRAGON BLOOD SO I CAN DIE SLIGHTLY SLOWER","tags":"#dota2#dragonknight#skill#build","favourites":18,"__v":0,"created_on":"2015-03-19T16:22:52.693Z","score":0.0002627744826577295},{"_id":"550a47c72ab05ce134dd323f","id":1212,"pasta":"Moonly (Moon Lee) is a world reknowned scam artist and hacker. Also known as a 'script kiddie', Moonly is best known for his most effective scam; making false donations to popular streamers (mainly women like SingSing and Fwoshy) in order to advertide his phishing website, then infecting visitors to the site with Trojans. Those coming into contact with Moon Lee in any form are encouraged to contact the authorities. If possible, please call President Barack Obama and warn him about this dangerous individual.","tags":"#dota2#singsing#moonly#moon#lee#sing","favourites":0,"__v":0,"created_on":"2015-03-19T03:24:13.073Z","score":0},{"_id":"550a1e0c2ab05ce134dd3235","id":1208,"pasta":"I'm here in the terrifying ghettos of Romania to speak with teamless legend Turtoi \"Ar1sE\" Ionut and learn what I can about what adherents call the \"true Son of Magnus\". Turning the corner to his crack den I step over a gutter running with blood from the smashed open head of a young Asian boy still clutching his anime figurines. I remind myself this is a man from oldschool Romanian DotA in Garena channels, an ex-quarterback. Above the doorframe, carved letters: \"Measure ur words\".\n","tags":"#dota2#ar1se#EE#romanian#ghettos","favourites":2,"__v":0,"created_on":"2015-03-19T00:33:37.216Z","score":0.000024685196692649166},{"_id":"550960b8b47c3d010fd965f7","id":1177,"pasta":"The Black Rat, Rattus Rattus, was first described by Henrik Ahnberg in his 18th century work “A Dong’s guide to Dota”. An elusive and hardy creature, the rat excels at damaging structures and retreating at the first sign of danger, only to begin its attack anew once the threat has passed. Unlike many of his peers, Ahnberg greatly respected the rat, finding many of its features similar to his own. His love for the rat became so great that he soon left the world of men and descended into the sewers to live among the rats, eventually becoming their king.","tags":"#dota2#admiralbulldog#rat#bulldong","favourites":126,"__v":0,"created_on":"2015-03-18T07:41:43.933Z","score":0.0013739739908308465},{"_id":"5508f32eb47c3d010fd9658e","id":1134,"pasta":"bulldog is the meme king? i'm sorry but this dude is anything but a king..he's more like a jester doing everything he can to entertain ppl for a few donations and subs. I really have nothing against him if anything i acknowledge that he's was one of the best players in the competitive scene and is still very good but now? The closest thing i can compare his steam to is with these girls on chaturbate with the oh if i do this they tip me mentality (Kappa, sheever, 4head and kreygasm noises amongst other things). It really saddens me that a person of this caliber has to resort such mannerism to get daily views and yes i am aware that he's not streaming for charity and that what he does allows him to get a good income but he could have a bit more tact and be perhaps a bit of a role model to inspire others to stream/play. There more shit to talk about like how what pro players do competitively or more specifically in pubs really affect us the regular joes trying to have fun, win games and show what we are worth (just to be clear i'm refering to pubbers trying to immitate high risk low reward builds/ flat out clowny builds+ laning they saw x or y do) but who the hell cares what a 4k mmr scrub thinks.. cheers lads","tags":"#dota2#bulldog#bulldong#meme#king","favourites":0,"__v":0,"created_on":"2015-03-18T03:25:08.144Z","score":0},{"_id":"5508e1a4b47c3d010fd9657b","id":1127,"pasta":"That was like watching a shark attack. He surfaced, grabbed and mutilated a victim by the shoreline while everyone panicked, and then disappeared from view again. I've never seen someone get so into role playing with Slark.","tags":"#dota2#eternalenvy#ee#slark#slahser\n","favourites":2,"__v":0,"created_on":"2015-03-18T02:21:29.966Z","score":0.00002454476712709233},{"_id":"5508db5bb47c3d010fd9656f","id":1122,"pasta":"I hear \"ho ho, ha ha!\" in my sleep. I'm constantly on edge around short people. My dad was watching American Sniper this weekend and I had PTSD.","tags":"#dota2#fuck#sniper#hoho#haha","favourites":58,"__v":0,"created_on":"2015-03-18T01:54:44.085Z","score":0.0007130800679102382},{"_id":"5508c781b47c3d010fd96530","id":1096,"pasta":"Why do you choose to start Gerg live during Canada Cup so that Maut cannot join? Why do you hate maut? Was it because he banned charlie from his chat yesterday? Is maut getting too big for high grounds tv and you are trying to push him out of the organization?","tags":"#dota2#gerg#maut#canada#cup","favourites":1,"__v":0,"created_on":"2015-03-18T00:27:09.494Z","score":0},{"_id":"550866ac9c40b75805998494","id":1045,"pasta":"Hello I'm Synderen. I sexually identify as a pig molester. Ever since I was a boy I dreamed of walking through pigsties, diddling sexy piglets. People say to me that having sex with pigs is illegal and I'm retarded but I don't care, I'm Danish. I’m having a plastic surgeon implant pig tails, ears and a snout on my body. From now on I want you to call me “Porky” and respect my right to be sexually aroused by mammals that serve as food for millions all over the world. If you can’t accept me you’re a swinophobe and need to check your sus privilege. I'm moving back to Denmark so I can marry my favorite pig, which I've always fantasized about. Thank you for being so understanding.","tags":"#dota2#synderen#pig#molester#porky","favourites":41,"__v":0,"created_on":"2015-03-17T17:29:19.442Z","score":0.0005296905714621363},{"_id":"550863e69c40b75805998490","id":1042,"pasta":"ヽ(◉◡◔)ﾉ•︻̷┻̿═━一 HO HO! HA HA! I HAVE DOWN SYNDROME ヽ(◉◡◔)ﾉ•︻̷┻̿═━一","tags":"#dota2#sniper#down#syndrome#shrapnel","favourites":37,"__v":0,"created_on":"2015-03-17T11:05:27.224Z","score":0.00048437353584597704},{"_id":"5507613887d1bc685b1e969e","id":1040,"pasta":" █♥█ ＶＩＶＡ ＰＥＲＵ█♥█","tags":"#dota2#smash#viva#peru#flag","favourites":4,"__v":0,"created_on":"2015-03-16T22:59:56.386Z","score":0.000060886669289896385},{"_id":"55075e2287d1bc685b1e969c","id":1039,"pasta":"Synderen: \"Sorry for my englandën, Im danish. I come frøm small danish tøwn where we molëst pigs for å living. Fadër said \"synderen, pig hårvest is bad this yëar, you have to go plåy proffesional Døtå to save your fåmily\", änd I said \"But fadër, I only have a bought account and chat EleGiggle and 4Head me\". This is my story, please nø cøpy-tipoldeforældrerino\"","tags":"#dota2#Synderen#english#danish","favourites":7,"__v":0,"created_on":"2015-03-16T21:11:28.316Z","score":0.00010843773114665489},{"_id":"55075e1887d1bc685b1e969b","id":1038,"pasta":"༼ つ ◕_◕ ༽つ THE PIGGLET IS READY, OUR DICKS ARE SLIDING IN, WITH THIS CHANT I SUMMON SYNDEREN ༼ つ ◕_◕ ༽つ","tags":"#dota2#syndereN#pigglet#dicks#chant","favourites":2,"__v":0,"created_on":"2015-03-16T20:14:31.661Z","score":0.000024356563517765012}]