[{"_id":"55072b9c87d1bc685b1e9698","id":1037,"pasta":"༼ つ ◕_◕ ༽つ MY VODKA IS STRONG. MY GODLIKES ARE EASY. WITH THIS CHANT, I SUMMON VLADTEEZY ༼ つ ◕_◕ ༽つ","tags":"#dota2#synderen#vlad#vodka#russia","favourites":2,"__v":0,"created_on":"2015-03-16T11:13:46.395Z","score":0.000022250739684928575},{"_id":"5506770887d1bc685b1e9695","id":1035,"pasta":"Man goes to doctor. Says he's depressed. Says life seems harsh and cruel. Says he feels all alone in a threatening world where what lies ahead is vague and uncertain. Doctor says \"Treatment is simple. Great grill streamer SingSing is online tonight. Go and watch her. That should pick you up\". Man bursts into tears. Says, \"But doctor...I am SingSing\".","tags":"#dota2#singsing#clown#sing#depressed#stream","favourites":10,"__v":0,"created_on":"2015-03-15T23:17:03.514Z","score":0.00013845808844651877},{"_id":"5505d59c87d1bc685b1e968f","id":1032,"pasta":"Hello everybody this is Slahser and this is my way of dewarding. Normally when people deward they will place it in the spot that covers the most ward spots however while this method may work i believe my way is also viable. First you need to build Boots of travel and a flying courier and a refresher quelling blade. Secondly you need to be a hero nobody expects to be the one to deward preferably choosing a hero like phantom assassin.\nNext you must place your sentry ward to find the deward, this is where my method differs from the standard. I place my ward in the most obscure spot so that if it spots the ward its very unlikely to get dewarded due to this obscurity. This method is very effective against heroes like mirana, nyx, stealth assassin, and Bounty hunter\nOnce you have spotted a ward you use your quelling blade refresh said quelling blade so you will be able to instantly destroy wards and the enemy side wont know who did it and assume an important support did the dewarding. Urns isnt core but is heavily recommended since i believe it supports PA style of stealth dewarding","tags":"#dota2#slahser#dewarding","favourites":28,"__v":0,"created_on":"2015-03-15T16:19:28.321Z","score":0.00034530673610191226},{"_id":"5505d57e87d1bc685b1e968e","id":1031,"pasta":"I fucking love Jackie Mao. And I love the reddit hate for him as well. He's a nerd. A natural born fucking autist. He watches anime, virgin, slurps, dreams of nihon, 0 social skills, prolly even got a dakimakura of some anime character. At the end of an interview they say \"ok so this is our last question, its a joke question...haha whats your favorite hentai?\" he answers honestly without hesitation then waits patiently to be let in on the joke. I fuckin love this guy. HE's the hero our dota 2 deserves, but he's NOT the hero you fuckin normalcools want because you fucking 2.5kmmr sunbreathers want to live in a fantasy world where Dota Gods like EE have jobs, grillfriends, and even live on their own, so that it can be something you can comprehend, something you can relate to, something even you too can dream of achieving. Well, that wont happen. You will never understand eternal envy and you will never understand Dota.","tags":"#dota2#eternalenvy#ee#love#autist#hentai","favourites":23,"__v":0,"created_on":"2015-03-15T16:03:11.099Z","score":0.00029111168587515874},{"_id":"5504fdc887d1bc685b1e9684","id":1028,"pasta":"It's time to get angry at 4K MMR players, the best time of the day. Every fucking day. I play scrims, I get depressed. Even though I win them. And then I play these 4k MMR games and I lose hope in humanity. That's my life. Every day. I play on my smurf and I lose hope in myself, and then I play on my main account and I lose hope in everybody else. And at the end of the day I have no friends. That's life. The life of Jacky Mao.","tags":"#dota2#ee#jacky#mao#angry#4k","favourites":48,"__v":0,"created_on":"2015-03-15T02:43:04.189Z","score":0.0005462896356932573},{"_id":"5504972c87d1bc685b1e9681","id":1027,"pasta":"sheever, i am a casual stupid fat SJW boy with dunning kruger, can you please make me a mod - all this mysoginistic rasist rapists around here trigger muh parallelepipedic paleo OSD. Kappa","tags":"#dota2#sheever#sjw#dunning#rapists","favourites":1,"__v":0,"created_on":"2015-03-14T15:30:14.256Z","score":0},{"_id":"5503bc3787d1bc685b1e967d","id":1025,"pasta":"｀、｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ༼ຈ ل͜ຈ༽ﾉ•︻̷┻̿═━一 h a h a  i n  t h e  s t r e e t s,  h o h o  i n t h e s h e e t sヽ༼ຈل͜ຈ༽ﾉ•︻̷┻̿═━一 ヽ｀ヽ｀、ヽヽ｀ヽ｀、｀ヽ｀、ヽヽ｀ヽ｀、ヽヽ｀ヽ、ヽヽ｀ヽ","tags":"#dota2#sniper#haha#hoho#sheets","favourites":33,"__v":0,"created_on":"2015-03-14T03:30:06.970Z","score":0.0003943935331036187},{"_id":"5503698d87d1bc685b1e967b","id":1024,"pasta":"Ａｆｔｅｒ　３　ｙｅａｒｓ　ｏｆ　Ｄｏｔａ　２　ｏｎ　ＵＳ　Ｅａｓｔ，　Ｉ　ｃａｎ　ｓａｆｅｌｙ　ｓａｙ　Ｄｏｔａ　ｈａｓ　ｍａｄｅ　ｍｅ　ｒａｃｉｓｔ．　Ｅｖｅｒｙ　ｔｉｍｅ　Ｉ　ｈｅａｒ　ｓｏｍｅｏｎｅ　ｓｐｅａｋ　ｗｉｔｈ　ａ　Ｓｐａｎｉｓｈ　ａｃｃｅｎｔ　Ｉ　ｃｒｉｎｇｅ　ａｎｄ　ｔｈｏｕｇｈｔｓ　ｏｆ　ｍｙ　ｐｕｂｓ　ｃｏｍｅ　ｔｏ　ｍｉｎｄ．．．　Ｗｈｙ　ｄｉｄ　ｈｅ　ｇｏ　ＡＡ　ｃａｒｒｙ？　Ｗｈｙ　ｄｉｄ　ｈｅ　ｙｅｌｌ　ａｔ　ｍｅ　ｆｏｒ　ｎｏｔ　ｓｕｐｐｏｒｔｉｎｇ　ｈｉｍ　ｅｎｏｕｇｈ　ａｓ　ａｎ　ｏｆｆｌａｎｅｒ？　Ｍａｙｂｅ　Ｉ＇ｌｌ　ｎｅｖｅｒ　ｋｎｏｗ，　ｂｕｔ　ｎｏｗ，　ａｌｌ　Ｉ　ｋｎｏｗ　ｉｓ　Ｉ　ｃａｎ＇ｔ　ｓｔａｎｄ　ｔｈｅｉｒ　ｐｏｏｒ　ｇｒａｍｍａｒ　ａｎｄ　ｔｈｅ　ａｎｎｏｙｉｎｇ　ａｃｃｅｎｔｓ　ｆｏｌｌｏｗｅｄ　ｂｙ　ｔｈｅ　ｓｔｕｐｉｄｅｓｔ　ｆｕｃｋｉｎｇ　ｔｈｉｎｇｓ　Ｉ　ｈａｖｅ　ｅｖｅｒ　ｈｅａｒｄ．　ＧＧ　ｌｉｆｅ．\n","tags":"#dota2#peru#russians#us#east#racist","favourites":0,"__v":0,"created_on":"2015-03-13T22:11:59.037Z","score":0},{"_id":"550301b787d1bc685b1e9679","id":1023,"pasta":"༼ つ ◕_◕ ༽つ MY LUBE IS READY. MY DICK IS GETTING LONGER. WITH THIS CHANT I SUMMON THE BULLDONGER! ༼ つ ◕_◕ ༽つ","tags":"#dota2#admiralbulldog#bulldog#bulldong#chant","favourites":32,"__v":0,"created_on":"2015-03-13T13:15:30.861Z","score":0.00038281650190750293},{"_id":"5503019487d1bc685b1e9678","id":1022,"pasta":"Ｈｅ ｉｓ ａ ｒｅａｌ ｈｕｍａｎ ｂｅａｎ． Ｉ ｈｏｌｅ－ｈａｒｄｅｄｌｙ ａｇｒｅｅ， ｂｕｔ ａｌｌｏｗ ｍｅ ｔｏ ｐｌａｙ ｄｏｕｂｌｅｓ ａｄｖｏｃａｔｅ ｈｅｒｅ ｆｏｒ ａ ｍｏｍｅｎｔ． Ｆｏｒ ａｌｌ ｉｎｔｅｎｓｉｖｅ ｐｕｒｐｏｓｅｓ Ｉ ｔｈｉｎｋ ｙｏｕ ａｒｅ ｗｒｏｎｇ． Ｉｎ ａｎ ａｇｅ ｗｈｅｒｅ ｆａｌｓｅ ｍｏｒａｌｓ ａｒｅ ａ ｄｉａｍｏｎｄ ｄｏｚｅｎ， ｔｒｕｅ ｖｉｒｔｕｅｓ ａｒｅ ａ ｂｌｅｓｓｉｎｇ ｉｎ ｔｈｅ ｓｋｉｅｓ． Ｗｅ ｏｆｔｅｎ ｐｕｔ ｏｕｒ ｆａｌｓｅ ｍｏｒａｌｉｔｙ ｏｎ ａ ｐｅｔａｌ ｓｔｏｏｌ ｌｉｋｅ ａ ｂｕｎｃｈ ｏｆ ｐｒｅ－Ｍａｄｏｎｎａｓ， ｂｕｔ ｙｏｕ ａｌｌ ｓｅｅｍ ｔｏ ｂｅ ｔａｋｉｎｇ ｓｏｍｅｔｈｉｎｇ ｖｅｒｙ ｖａｌｕａｂｌｅ ｆｏｒ ｇｒａｎｉｔｅ． Ｓｏ Ｉ ａｓｋ ｏｆ ｙｏｕ ｔｏ ｍｕｓｔａｒｄ ｕｐ ａｌｌ ｔｈｅ ｓｔｒｅｎｇｔｈ ｙｏｕ ｃａｎ ｂｅｃａｕｓｅ ｉｔ ｉｓ ａ ｄｏｇｇｙ ｄｏｇ ｗｏｒｌｄ ｏｕｔ ｔｈｅｒｅ． Ａｌｔｈｏｕｇｈ ｔｈｅｒｅ ｉｓ ｓｏｍｅ ｍｅｒｉｔ ｔｏ ｗｈａｔ ｙｏｕ ａｒｅ ｓａｙｉｎｇ ｉｔ ｓｅｅｍｓ ｌｉｋｅ ｙｏｕ ｈａｖｅ ａ ｈｕｇｅ ｓｈｉｐ ｏｎ ｙｏｕｒ ｓｈｏｕｌｄｅｒ． Ｉｎ ｙｏｕｒ ａｒｇｕｍｅｎｔ ｙｏｕ ｓｅｅｍ ｔｏ ｔｈｒｏｗ ｅｖｅｒｙｔｈｉｎｇ ｉｎ ｂｕｔ ｔｈｅ ｋｉｄｓ Ｎｓｙｎｃ， ａｎｄ ｅｖｅｎ ｔｈｏｕｇｈ ｙｏｕ ａｒｅ ｈａｖｉｎｇ ａ ｆｅｅｌ ｄａｙ ｗｉｔｈ ｔｈｉｓ Ｉ ａｍ ｈｅｒｅ ｔｏ ｂｒｉｎｇ ｙｏｕ ｂａｃｋ ｉｎｔｏ ｒｅａｌｉｔｙ． Ｉ ｈａｖｅ ａ ｓｉｃｋ ｓｅｎｓｅ ｗｈｅｎ ｉｔ ｃｏｍｅｓ ｔｏ ｔｈｅｓｅ ｔｙｐｅｓ ｏｆ ｔｈｉｎｇｓ． Ｉｔ ｉｓ ａｌｍｏｓｔ ｓｐｏｏｋｙ， ｂｅｃａｕｓｅ Ｉ ｃａｎｎｏｔ ｔｕｒｎ ａ ｂｌｏｎｄｅ ｅｙｅ ｔｏ ｔｈｅｓｅ ｇｌａｒｉｎｇ ｆｌａｗｓ ｉｎ ｙｏｕｒ ｒｈｅｔｏｒｉｃ． Ｉ ｈａｖｅ ｚｅｒｏ ｔａｌｌｅｒ ａｎｔｓ ｗｈｅｎ ｉｔ ｃｏｍｅｓ ｔｏ ｐｅｏｐｌｅ ｓｐｏｕｔｉｎｇ ｏｕｔ ｈａｔｅ ｉｎ ｔｈｅ ｎａｍｅ ｏｆ ｍｏｒａｌ ｒｉｇｈｔｅｏｕｓｎｅｓｓ． Ｙｏｕ ｊｕｓｔ ｎｅｅｄ ｔｏ ｒｅｍｅｍｂｅｒ ｗｈａｔ ｃｏｍｅｓ ａｒｏｕｎｄ ｉｓ ａｌｌ ａｒｏｕｎｄ， ａｎｄ ｗｈｅｎ ｓｕｐｐｌｙ ａｎｄ ｃｏｍｍａｎｄ ｆａｉｌｓ ｙｏｕ ｗｉｌｌ ｂｅ ｔｈｅ ｆｉｒｓｔ ｔｏ ｇｏ． Ｍａｋｅ ｍｙ ｗｏｒｄｓ， ｗｈｅｎ ｙｏｕ ｇｅｔ ｄｏｗｎ ｔｏ ｂｒａｓｓ ｓｔａｃｋｓ ｉｔ ｄｏｅｓｎ＇ｔ ｔａｋｅ ｒｏｃｋｅｔ ａｐｐｌｉａｎｃｅｓ ｔｏ ｇｅｔ ｔｗｏ ｂｉｒｄｓ ｓｔｏｎｅｄ ａｔ ｏｎｃｅ． Ｉｔ＇ｓ ｃｌｅａｒ ｗｈｏ ｍａｋｅｓ ｔｈｅ ｐａｎｔｓ ｉｎ ｔｈｉｓ ｒｅｌａｔｉｏｎｓｈｉｐ， ａｎｄ ｓｏｍｅｔｉｍｅｓ ｙｏｕ ｊｕｓｔ ｈａｖｅ ｔｏ ｓｗａｌｌｏｗ ｙｏｕｒ ｐｒｉｚｅ ａｎｄ ａｃｃｅｐｔ ｔｈｅ ｆａｃｔｓ． Ｙｏｕ ｍｉｇｈｔ ｈａｖｅ ｔｏ ｃｏｍｅ ｔｏ ｔｈｉｓ ｃｏｎｃｌｕｓｉｏｎ ｔｈｒｏｕｇｈ ｄｅｎｉａｌ ａｎｄ ｅｒｒｏｒ ｂｕｔ Ｉ ｓｗｅａｒ ｏｎ ｍｙ ｍｏｔｈｅｒ＇ｓ ｍａｔｉｎｇ ｎａｍｅ ｔｈａｔ ｗｈｅｎ ｙｏｕ ｐｕｔ ｔｈｅ ｐｅｔａｌ ｔｏ ｔｈｅ ｍｅｄａｌ ｙｏｕ ｗｉｌｌ ｐａｓｓ ｗｉｔｈ ｆｌｙｉｎｇ ｃａｒｐｅｔｓ ｌｉｋｅ ｉｔ’ｓ ａ ｐｅａｃｈ ｏｆ ｃａｋｅ．","tags":"#dota2#general#human#bean","favourites":1,"__v":0,"created_on":"2015-03-13T08:22:41.258Z","score":0},{"_id":"5501f93d87d1bc685b1e9673","id":1020,"pasta":"I was a top player in HoN, now after a long break I'm trying to get back into the competitive scene. I stream everyday all day pubs, leagues, scrims, random single player tests, and tournaments.\nMy viewers told me to post my information here as I'm fairly insightful and although can be trolly, I take the game seriously.","tags":"#dota2#eternalenvy#ee#HoN#stream","favourites":2,"__v":0,"created_on":"2015-03-12T18:52:31.584Z","score":0.000021793396682094663},{"_id":"5501f91c87d1bc685b1e9672","id":1019,"pasta":"Ｙｏｕ ｍａｋｅ ｃａｔａｓｔｒｏｐｈｉｃａｌｌｙ ｂａｄ， ｎｅａｒｌｙ ｇａｍｅ ｌｏｓｉｎｇ ｄｅｃｉｓｉｏｎｓ ａｔ ３２：２０ ａｎｄ ３４：５０ ａｎｄ ｙｅｔ ｙｏｕ ｂｌａｍｅ ｙｏｕｒ ｔｅａｍ？\n\nＧｅｔ ｏｖｅｒ ｙｏｕｒｓｅｌｆ ｋｉｄ．Ｉ’ｍ ６ｋ ａｎｄ ｗｏｕｌｄ ｐｒｏｂａｂｌｙ ｌｏｓｅ ａ ｍａｊｏｒｉｔｙ ｏｆ ｍｙ １ｖ１ ｍａｔｃｈｕｐｓ ａｇａｉｎｓｔ ｙｏｕ， ｂｕｔ Ｉ ｇｕａｒａｎｔｅｅ Ｉ ｗｏｕｌｄ ｅｎｄ ｕｐ ｗｉｎｎｉｎｇ ９／１０ ｇａｍｅｓ ｂｅｃａｕｓｅ ｍｙ ｄｅｃｉｓｉｏｎ ｍａｋｉｎｇ ｉｓ １０ｘ ｗｈａｔ ｙｏｕｒｓ ｉｓ．\n\nＹｏｕ ｔｈｉｎｋ ｂｅｃａｕｓｅ ｙｏｕｒｅ ｓｏｍｅ ｐｒｏ ｐｌａｙｅｒ ｙｏｕ ｃａｎ ｂｅ ａ ｄｉｓｇｕｓｔｉｎｇ ｒｕｄｅ ｋｉｄ ｔｏ ｅｖｅｒｙｏｎｅ ｗｈｅｎ ｔｈｅｙ ｍａｋｅ ａ ｍｉｓｔａｋｅ， ａｎｄ ｔｈｅｎ ｓｈｅｅｐｉｓｈｌｙ ｓｈｒｕｇ ｏｆｆ ｙｏｕｒ ｏｗｎ ａｗｆｕｌ ｐｌａｙ ｗｉｔｈ ａ ｓｍｕｇ ”ｗｅ ｌｏｓｔ” ｉｎ ｖｏｉｃｅ ｃｈａｔ ｌｉｋｅ ｉｔｓ ｓｏｍｅｈｏｗ ｅｖｅｒｙｏｎｅ’ｓ ｆａｕｌｔ ａｎｄ ｎｏｔ ｊｕｓｔ ｙｏｕｒ ｏｗｎ ｓｈｉｔｔｙ ｍｉｓｔａｋｅｓ．\n\nＹｏｕｒ ｔｅｒｒｉｂｌｅ ｌａｔｅ ｇａｍｅ ｄｅｃｉｓｉｏｎ ｍａｋｉｎｇ ｉｓ ｗｈｙ Ｃ９ ｗｉｌｌ ｎｅｖｅｒ ｂｅ ａｎ ｅｌｉｔｅ ｔｅａｍ． Ｅｖｅｎ ｓｏ， ｔｒｙ ｂｅｉｎｇ ａ ｎｉｃｅｒ ｐｅｒｓｏｎ ｌｉｋｅ Ｗａｇａ ａｎｄ ｍａｙｂｅ ｙｏｕｒ ｓｕｐｅｒｉｏｒ ｍｅｃｈａｎｉｃａｌ ｓｋｉｌｌ ｃａｎ ａｌｌｏｗ ｙｏｕ ｔｏ ｃｏｎｓｉｓｔｅｎｔｌｙ ｓｔａｙ ａｂｏｖｅ ７ｋ ｅｖｅｎ ｔｈｏｕｇｈ ｙｏｕｒ ａｗｆｕｌ ｘｂｏｃｔ－ｌｉｋｅ ｓｔｒａｔｅｇｉｃ ｍｉｓｔａｋｅｓ ｗｉｌｌ ａｌｗａｙｓ ｂｅ ｔｈｅｒｅ ｔｏ ｂｒｉｎｇ ｙｏｕ ｄｏｗｎ．","tags":"#dota2#ee#eternalenvy#arrogant#bad#6k","favourites":1,"__v":0,"created_on":"2015-03-12T14:05:28.532Z","score":0},{"_id":"5501f7e287d1bc685b1e9671","id":1018,"pasta":"ｈｅｙ  ｆｗｏｓｈ  ｉｍ  ｔｒｙｉｎｇ  ｔｏ  ｌｅａｒｎ  ｔｏ  ｐｌａｙ  ＬＣ．  ｉ  ｊｕｓｔ  ｈａｖｅ  ａ  ｑｕｅｓｔｉｏｎ  ａｂｏｕｔ  ｔｈｅ  ｓｋｉｌｌ  ｂｕｉｌｄ．  ｓｈｏｕｌｄ  ｉ  ｍａｘ  ｏｖｅｒｗｈｅｌｍｉｎｇ  ｏｄｄｓ  ｌｉｋｅ  ｙｏｕｒ  ｏｄｄｓ  ｔｏ  ｄａｔｅ  ｓｉｎｇｓｉｎｇ，  ｐｒｅｓｓ  ｔｈｅ  ａｔｔａｃｋ  ｌｉｋｅ  ｙｏｕ  ｐｒｅｓｓｅｄ  ｙｏｕｒ  ａｔｔａｃｋｓ  ｏｎ  ｏｕｒ  ｃｕｔｅ  ａｓｉａｎ  ｍｏｄｅｌ  ｇｒｉｌｌ，  ｏｒ  ｍｏｍｅｎｔ  ｏｆ  ｃｏｕｒａｇｅ  ｌｉｋｅ  ｓｉｎｇ  ｎｅｅｄｅｄ  ｔｏ  ａｓｋ  ｙｏｕ  ｏｕｔ？","tags":"#dota2#singsing#fwosh#sing#lc","favourites":2,"__v":0,"created_on":"2015-03-12T18:57:59.794Z","score":0.00002179385986496696},{"_id":"5501f7b787d1bc685b1e9670","id":1017,"pasta":"You make catastrophically bad, nearly game losing decisions at 32:20 and 34:50 and yet you blame your team?\nGet over yourself kid. I'm 6k and would probably lose a majority of my 1v1 matchups against you, but I guarantee I would end up winning 9/10 games because my decision making is 10x what yours is.\nYou think because you're some pro player you can be a disgusting rude kid to everyone when they make a mistake, and then sheepishly shrug off your own awful play with a smug \"we lost\" in voice chat like its somehow everyone's fault and not just your own shitty mistakes.\nYour terrible late game decision making is why C9 will never be an elite team. Even so, try being a nicer person like Waga and maybe your superior mechanical skill can allow you to consistently stay above 7k even though your awful xboct-like strategic mistakes will always be there to bring you down.","tags":"#dota2#EE#EternaLEnVy#bad#arrogant","favourites":3,"__v":0,"created_on":"2015-03-12T13:28:24.026Z","score":0.00003878257291936038},{"_id":"5500b14387d1bc685b1e966a","id":1016,"pasta":" Kappa                                                                          You are permanently banned from talking in FearDarkness","tags":"#dota2#ban#fear#fenrir","favourites":2,"__v":0,"created_on":"2015-03-11T07:24:35.541Z","score":0.000021614549799204255}]