[{"_id":"5578a9cb7d2300ce44f0cef2","id":1750,"pasta":" http://i.imgur.com/jBOXI8z.jpg Amber TI-born of the House Dota, the First of Her Name, the Unflamed, Queen of Hearthstone, Queen of the Followers and the Subscribers and the First Chat, Khaleesi of the Great Twitch Sea, Crosser of Doubles, and Mother of Mangoes","tags":"#dota2#mother#mangoes","favourites":5,"__v":0,"created_on":"2015-06-09T22:49:40.101Z","score":0.00027408673838720993},{"_id":"5576a0387d2300ce44f0ceec","id":1748,"pasta":" ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ํํํํํํํํํํํํํํํํํํํํํํํํํํỎ̷͖͈̞̩͎̻̫̫̜͉̠̫͕̭̭̫̫̹̗̹͈̼̠̖͍͚̥͈̮̼͕̠̤̯̻̥̬̗̼̳̤̳̬̪̹͚̞̼̠͕̼̠̦͚̫͔̯̹͉͉̘͎͕̼̣̝͙̱̟̹̩̟̳̦̭͉̮̖̭̣̣̞̙̗̜̺̭̻̥͚͙̝̦̲̱͉͖͉̰̦͎̫̣̼͎͍̠̮͓̹̹͉̤̰̗̙͕͇͔̱͕̭͈̳̗̭͔̘̖̺̮̜̠͖̘͓̳͕̟̠̱̫̤͓͔̘̰̲͙͍͇̙͎̣̼̗̖͙̯͉̠̟͈͍͕̪͓̝̩̦̖̹̼̠̘̮͚̟͉̺̜͍͓̯̳̱̻͕̣̳͉̻̭̭̱͍̪̩̭̺͕̺̼̥̪͖̦̟͎̻̰ ͬͤ ͬͬͤ ͦͬͬͤ ͬͦͬͬͤ ͤͬͦͬͬͤ ͬͤͬͦͬͬͤ ͬͬͤͬͦͬͬͤ ͦͬͬͤͬͦͬͬͤ ͬͦͬͬͤͬͦͬͬͤ ͤͬͦͬͬͤͬͦͬͬͤ ͬͦͬͬͤͬͦͬͬͤ ͦͬͬͤͬͦͬͬͤ ͬͬͤͬͦͬͬͤ ͬͤͬͦͬͬͤ ͤͬͦͬͬͤ ͬͦͬͬͤ ͦͬͬͤ ͬͬͤ ͬͤ ͤ Ỏ̷͖͈̞̩͎̻̫̫̜͉̠̫͕̭̭̫̫̹̗̹͈̼̠̖͍͚̥͈̮̼͕̠̤̯̻̥̬̗̼̳̤̳̬̪̹͚̞̼̠͕̼̠̦͚̫͔̯̹͉͉̘͎͕̼̣̝͙̱̟̹̩̟̳̦̭͉̮̖̭̣̣̞̙̗̜̺̭̻̥͚͙̝̦̲̱͉͖͉̰̦͎̫̣̼͎͍̠̮͓̹̹͉̤̰̗̙͕͇͔̱͕̭͈̳̗̭͔̘̖̺̮̜̠͖̘͓̳͕̟̠̱̫̤͓͔̘̰̲͙͍͇̙͎̣̼̗̖͙̯͉̠̟͈͍͕̪͓̝̩̦̖̹̼̠̘̮͚̟͉̺̜͍͓̯̳̱̻͕̣̳͉̻̭̭̱͍̪̩̭̺͕̺̼̥̪͖̦̟͎̻̰ด้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็ ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ํํํํํํํํํํํํํํํํํํํํํํํํํํỎ̷͖͈̞̩͎̻̫̫̜͉̠̫͕̭̭̫̫̹̗̹͈̼̠̖͍͚̥͈̮̼͕̠̤̯̻̥̬̗̼̳̤̳̬̪̹͚̞̼̠͕̼̠̦͚̫͔̯̹͉͉̘͎͕̼̣̝͙̱̟̹̩̟̳̦̭͉̮̖̭̣̣̞̙̗̜̺̭̻̥͚͙̝̦̲̱͉͖͉̰̦͎̫̣̼͎͍̠̮͓̹̹͉̤̰̗̙͕͇͔̱͕̭͈̳̗̭͔̘̖̺̮̜̠͖̘͓̳͕̟̠̱̫̤͓͔̘̰̲͙͍͇̙͎̣̼̗̖͙̯͉̠̟͈͍͕̪͓̝̩̦̖̹̼̠̘̮͚̟͉̺̜͍͓̯̳̱̻͕̣̳͉̻̭̭̱͍̪̩̭̺͕̺̼̥̪͖̦̟͎̻̰ ͬͤ ͬͬͤ ͦͬͬͤ ͬͦͬͬͤ ͤͬͦͬͬͤ ͬͤͬͦͬͬͤ ͬͬͤͬͦͬͬͤ ͦͬͬͤͬͦͬͬͤ ͬͦͬͬͤͬͦͬͬͤ ͤͬͦͬͬͤͬͦͬͬͤ ͬͦͬͬͤͬͦͬͬͤ ͦͬͬͤͬͦͬͬͤ ͬͬͤͬͦͬͬͤ ͬͤͬͦͬͬͤ ͤͬͦͬͬͤ ͬͦͬͬͤ ͦͬͬͤ ͬͬͤ ͬͤ ͤ Ỏ̷͖͈̞̩͎̻̫̫̜͉̠̫͕̭̭̫̫̹̗̹͈̼̠̖͍͚̥͈̮̼͕̠̤̯̻̥̬̗̼̳̤̳̬̪̹͚̞̼̠͕̼̠̦͚̫͔̯̹͉͉̘͎͕̼̣̝͙̱̟̹̩̟̳̦̭͉̮̖̭̣̣̞̙̗̜̺̭̻̥͚͙̝̦̲̱͉͖͉̰̦͎̫̣̼͎͍̠̮͓̹̹͉̤̰̗̙͕͇͔̱͕̭͈̳̗̭͔̘̖̺̮̜̠͖̘͓̳͕̟̠̱̫̤͓͔̘̰̲͙͍͇̙͎̣̼̗̖͙̯͉̠̟͈͍͕̪͓̝̩̦̖̹̼̠̘̮͚̟͉̺̜͍͓̯̳̱̻͕̣̳͉̻̭̭̱͍̪̩̭̺͕̺̼̥̪͖̦̟͎̻̰ด้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็ ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ํํํํํํํํํํํํํํํํํํํํํํํํํํỎ̷͖͈̞̩͎̻̫̫̜͉̠̫͕̭̭̫̫̹̗̹͈̼̠̖͍͚̥͈̮̼͕̠̤̯̻̥̬̗̼̳̤̳̬̪̹͚̞̼̠͕̼̠̦͚̫͔̯̹͉͉̘͎͕̼̣̝͙̱̟̹̩̟̳̦̭͉̮̖̭̣̣̞̙̗̜̺̭̻̥͚͙̝̦̲̱͉͖͉̰̦͎̫̣̼͎͍̠̮͓̹̹͉̤̰̗̙͕͇͔̱͕̭͈̳̗̭͔̘̖̺̮̜̠͖̘͓̳͕̟̠̱̫̤͓͔̘̰̲͙͍͇̙͎̣̼̗̖͙̯͉̠̟͈͍͕̪͓̝̩̦̖̹̼̠̘̮͚̟͉̺̜͍͓̯̳̱̻͕̣̳͉̻̭̭̱͍̪̩̭̺͕̺̼̥̪͖̦̟͎̻̰ ͬͤ ͬͬͤ ͦͬͬͤ ͬͦͬͬͤ ͤͬͦͬͬͤ ͬͤͬͦͬͬͤ ͬͬͤͬͦͬͬͤ ͦͬͬͤͬͦͬͬͤ ͬͦͬͬͤͬͦͬͬͤ ͤͬͦͬͬͤͬͦͬͬͤ ͬͦͬͬͤͬͦͬͬͤ ͦͬͬͤͬͦͬͬͤ ͬͬͤͬͦͬͬͤ ͬͤͬͦͬͬͤ ͤͬͦͬͬͤ ͬͦͬͬͤ ͦͬͬͤ ͬͬͤ ͬͤ ͤ Ỏ̷͖͈̞̩͎̻̫̫̜͉̠̫͕̭̭̫̫̹̗̹͈̼̠̖͍͚̥͈̮̼͕̠̤̯̻̥̬̗̼̳̤̳̬̪̹͚̞̼̠͕̼̠̦͚̫͔̯̹͉͉̘͎͕̼̣̝͙̱̟̹̩̟̳̦̭͉̮̖̭̣̣̞̙̗̜̺̭̻̥͚͙̝̦̲̱͉͖͉̰̦͎̫̣̼͎͍̠̮͓̹̹͉̤̰̗̙͕͇͔̱͕̭͈̳̗̭͔̘̖̺̮̜̠͖̘͓̳͕̟̠̱̫̤͓͔̘̰̲͙͍͇̙͎̣̼̗̖͙̯͉̠̟͈͍͕̪͓̝̩̦̖̹̼̠̘̮͚̟͉̺̜͍͓̯̳̱̻͕̣̳͉̻̭̭̱͍̪̩̭̺͕̺̼̥̪͖̦̟͎̻̰ด้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็","tags":"#Dota2#error#twitch","favourites":158,"__v":0,"created_on":"2015-06-09T03:10:38.381Z","score":0.0057562056870337315},{"_id":"5576a02f7d2300ce44f0ceeb","id":1747,"pasta":"/me Hello Singsing, I must thank you for introducing me to this game. My son is, well I guess the nice way to say it is \"mentally challenged\" but that doesn't do it justice. My son is fucking retarded. And he could only achieve 400 MMR on DotA2 but he's now ranked 3rd in HotS!!!! His life is so much better now that his confidence has been boosted. Thanks again.","tags":"#dota2#hots#singsing","favourites":2,"__v":0,"created_on":"2015-06-07T20:12:55.184Z","score":0.0000833629445584582},{"_id":"5576a0017d2300ce44f0cee9","id":1745,"pasta":"Is there a Dota 2 player that could even possibly EVEN TOUCH London Conspiracy Madara? Let alone defeat him. And I'm not talking about XtremeXPC International Madara who played mostly third position offlane role and placed 2nd in Battle of Central Europe Season 1 against Oslik Gaming playing Dark Seer and Doom. Hell, I'm not even talking about the Madara that placed 1st in GameAthlon Greece LAN and eGaming 2014 Greece LAN. I'm also not talking about the Madara that placed 2nd in Dota Regions against Not Today playing Nature's Prophet and Faceless Void or the Madara that placed 2nd in GFinity League against GOOMBA Gaming. I'm definitely NOT talking about the Madara that placed 1st in Dota Legends against Skarmory playing Tidehunter and Faceless Void. I'm talking about London Conspiracy Madara with 1st place at Star Ladder Pro Series Season 11 playing Luna and Jakiro and placed 1st at Deadly Gaming Cup Season 1 playing Juggernaut, Viper, Alchemist, and Slark and placed 1st MSI Dragon Battle #2 playing Troll and Puck and capable of knocking out EG at MLG with teammates like Keyser Soze, SkyLark, SKANKS224, standin ThuG and team captain SsaSpartan that plays position 1/2 core heroes like Leshrac, Queen of Pain, Gyrocopter and Phantom Lancer while being very skilled at both securing farm and executing team fights.","tags":"#dota2#esports#madara#lc","favourites":4,"__v":0,"created_on":"2015-06-07T16:25:20.371Z","score":0.0002077074410060885},{"_id":"55769fd07d2300ce44f0cee5","id":1741,"pasta":"Ｊａｃｋｙ Ｍａｏ ｐｕｔｓ ｔｈｅ ＥＥ ｉｎ ＦＥＥＤ","tags":"#dota2#feed#ee#eternalenvy","favourites":2,"__v":0,"created_on":"2015-06-07T04:01:01.735Z","score":0.00008245128964224868},{"_id":"55738f897d2300ce44f0ced5","id":1738,"pasta":"The year is 2077. I stand at a window of my mansion and revel at my prized possessions - the vast acres of suburban real estate that my father and grandfather endlessly toiled to build up, and now, I have inherited it all. My grandson stands next to me and asks, \"grandpa, can I be a big businessman like you when I grow up?\"\n\"Of course,\" I said, \"this will all be yours someday.\"\nI walk over to my computer and sit on my gold-plated, diamond crusted seat. I open Reddit, a leading and most-trusted source for world news. The top headline reads, \"Immortal III treasure released.\"\n\"Marvelous!\" I chuckle to myself. This is just in time to boost the TI67 prize pool. I purchase several chests as a present for my grandson's compendium. As I click \"checkout\" on the website, I can't help but take a peek in one of the chests.\n\"Why, it's a shiny Zeus hammer!\"\nI cannot resist but open the chest. I receive a Crystal Maiden staff.\n\"This is no Zeus hammer,\" I thought. Let me just open another.\nTo my dismay, I still have not found the elusive Zeus treasure. I continue to buy more and more chests, determined that my wealth would eventually overpower Valve's determination to hide the chest from me. This quickly escalated to precisely 90,663,887,774 chests purchased, and not a single Zeus hammer lay between my wrinkly hands.\nSlowly, a cloud of darkness consumed my mind. I began dreaming of Valve's logo being carved and stamped on every piece of real estate I owned. I have thrown all my wealth away in search of this treasure. My grandson's future--no longer secured.\nI only have a few pennies left at this point, and I decided to spend them on internet bandwidth to search reddit for guidance. I went back to the Dota 2 subreddit to make sense of this all. I see a post on the front page titled, \"I opened one treasure with my level 1 compendium and look what I got :D!!!\" I clicked the post, only to see Zeus with all his might, holding a shiny, golden hammer, engulfed by lightening. Merlini himself would be blinded by such beauty.\nAt this point, my grandson came to me and climbed on my lap. \"whoa,\" he said, \"I want one of those!\" He asked if he can have just one Zeus hammer when he's a \"rich business man\" like me. I slowly carried him off my lap, with tears running down my eyes I told him,\n\"Of course, Kappa.\"","tags":"#dota2#zeus#hammer#chest#compendium#reddit","favourites":15,"__v":0,"created_on":"2015-06-05T07:58:56.590Z","score":0.0007219882143303244},{"_id":"55738f847d2300ce44f0ced4","id":1737,"pasta":"Ｔｏｄａｙ，　ａ　ｐｉｎｏｙ　ｓｃａｍｍｅｒ　ａｄｄｅｄ　ｍｅ　ｔｏ　ｓｃａｍ　ｍｙ　ｉｔｅｍｓ．　Ｍｅ，　ｂｅｉｎｇ　ａ　ｓｙｍｐａｔｈｅｔｉｃ　ｓｏｕｌ，　ｄｏｎａｔｅｄ　ａ　＄０．０２　ｉｔｅｍ　ｔｏ　ｈｉｍ．　ｉ’ｍ　ｈａｐｐｙ　ｔｈａｔ　ｉ　ｍａｄｅ　ｔｈｉｓ　ｄｅｃｉｓｉｏｎ　ａｓ　ｔｈｉｓ　＄０．０２　ｗｉｌｌ　ａｌｌｏｗ　ｍｅ　ｔｏ　ｅｎｄ　ｈｕｎｇｅｒ　ａｎｄ　ｂｕｉｌｄ　ｈｏｓｐｉｔａｌｓ　ａｎｄ　ｓｃｈｏｏｌｓ　ｆｏｒ　ｔｈｉｓ　ｐｏｏｒ，　ｐｉｔｉｆｕｌ　ｎａｔｉｏｎ　ｃａｌｌｅｄ 　Ｐｈｉｌｌｉｐｅｎｉｓ．　（ｐｌｓ　ｎｏ　ｃｏｐｙ　ｐａｓｔａ）","tags":"#dota2#scam#peenoise#pinoy","favourites":8,"__v":0,"created_on":"2015-06-05T07:46:15.501Z","score":0.0004051456393431832},{"_id":"55737ba17d2300ce44f0ced0","id":1733,"pasta":"I... See, I like to know with who I'm playing as. I don't wanna see the player with me as \"Crystal Maiden\" I wanna see him by his true name, \"NiggaFuck9000\".\nIf I disable names, if I treat these people like heroes, at which point there stops being a diference between playing with humans and playing with bots?","tags":"#dota2#crystal#maiden#player","favourites":1,"__v":0,"created_on":"2015-06-06T04:29:54.015Z","score":0},{"_id":"55737b917d2300ce44f0cecf","id":1732,"pasta":"I once drank an entire bottle of soy sauce on a dare, which I thought was all well and good... until I developed extreme dehydration and Hypernatremia (http://en.wikipedia.org/wiki/Hypernatremia). They had to put an iv directly into my veins to rehydrate me. It was the closest I've ever been to dying.\nWhat I'm getting at is, even that was not nearly as salty as you are right now.","tags":"#dota2#ppd#peter#dager#salt","favourites":88,"__v":0,"created_on":"2015-06-06T03:28:43.092Z","score":0.003352031380592031},{"_id":"55737b627d2300ce44f0cecc","id":1729,"pasta":"I sexually Identify as Malia. Ever since I was a boy I dreamed of being among the best supports. \nPeople say to me that a person being Malia other than himself is impossible and I’m fucking retarded but I don’t care, I’m beautiful. \nI’m having a plastic surgeon installing a small chinese dick, a stomach capable of digering nems and an Hitler haircut.\nFrom now i want u guys to call me \"the amazing venomancer\" and respect my right to farm desolator as Lion.\nIf you can't accept u're a Maliaphobe and need to check your aegis deny privilege.Thank u for being so understanding.","tags":"#dota2#sexually#identify#malia","favourites":0,"__v":0,"created_on":"2015-06-05T21:29:26.102Z","score":0},{"_id":"55737b537d2300ce44f0cecb","id":1728,"pasta":"ლ(́◉◞౪◟◉‵ლ) let me hold your mangoes for a while ლ(́◉◞౪◟◉‵ლ)","tags":"#dota2#double#crosser#mango#radboys","favourites":22,"__v":0,"created_on":"2015-06-05T17:30:33.337Z","score":0.0010186174390408717},{"_id":"55737b447d2300ce44f0cec9","id":1726,"pasta":"I sexually identify as a midget. Ever since I was 20 feet tall I dreamt of crushing grill only tournaments. People say I'm sexist and black people aren't supposed to be midgets, but I don't care, I'm pro at dota. I'm having a surgeon reduce my height and host me black midget only dota tournaments. From now on I want you to call me supreme ruler of midget dota and respect my right to refuse playing against normal pro players. If you can't accept me you are a heightist feminazi and you need to check your dwarf privilege. Thank you.","tags":"#dota2#sexually#identify#midget","favourites":1,"__v":0,"created_on":"2015-06-05T09:58:59.128Z","score":0},{"_id":"5570fcd17e8e4e5c6734aeb9","id":1725,"pasta":"10 ʏᴇᴀʀs sɪɴᴄᴇ ᴀᴍʙᴇʀ sᴛʀɪᴍ. ɪ ᴡᴀʟᴋ ᴛʜʀᴏᴜɢʜ ᴛʜᴇ ᴇᴍᴘᴛʏ sᴛʀᴇᴇᴛs ᴛʀʏɪɴɢ ᴛᴏ ᴛʜɪɴᴋ ᴏғ sᴏᴍᴇᴛʜɪɴɢ ᴇʟsᴇ ʙᴜᴛ ᴍʏ ᴘᴀᴛʜ ᴀʟᴡᴀʏs ʟᴇᴀᴅs ᴛᴏ ᴛʜᴇ sᴛʀᴇᴀᴍ. ɪ sᴛᴀʀᴇ ᴀᴛ ᴛʜᴇ sᴄʀᴇᴇɴ ғᴏʀ ʜᴏᴜʀs ᴀɴᴅ ᴛʀʏ ᴛᴏ sᴜᴍᴍᴏɴ ᴛʜᴇ ɢᴏᴅᴅᴇss. ɪ ᴡᴀᴛᴄʜ ᴏᴛʜᴇʀ ɢɪʀʟs sᴛʀᴇᴀᴍɪɴɢ ʙᴜᴛ ɪᴛ ɪs ɴᴏ ɢᴏᴏᴅ. ɪ ғʟᴀᴍᴇ ᴏᴅᴩɪxᴇʟ ɪɴ ʜɪs ᴄʜᴀɴɴᴇʟ ᴀɴᴅ ᴛʀʏ ᴛᴏ ʀᴇsɪsᴛ ᴛʜᴇ ɴᴀᴢɪ ᴍᴏᴅs ʙᴜᴛ ɪᴛ ɪs ᴀʟʟ ᴍᴇᴀɴɪɴɢʟᴇss. ᴛʜᴇ ᴇɴᴅ ɪs ɴᴇᴀʀ.ɪ ᴛʜᴇɴ ᴜsᴜᴀʟʟʏ ᴡᴀᴛᴄʜ ᴛʜᴇ ᴍᴀɴɢᴏ ʀᴀɪᴅ ᴠᴏᴅ ᴀɴᴅ ᴄʀʏ ᴍʏsᴇʟғ ᴛᴏ sʟᴇᴇᴘ.","tags":"#dota2#mango#double_crosser","favourites":11,"__v":0,"created_on":"2015-06-04T23:09:08.011Z","score":0.0005422892453466411},{"_id":"5570bf0d7e8e4e5c6734aeb5","id":1723,"pasta":"Hi, -1k player here who reported Double_Crosser. Double_Crosser was our position 4 jakiro. She built a slipper of agility and had around 3 mangoes in her inventory. She would dive under tower in the middle of a fight, mango herself, die, and proceeded to yell \"CROSSER'S WAY\". We gave her position 4 farm so she could be a position 1.Granted, her unorthodox build didn't work and lost us the game but I still felt it deserved a report","tags":"#double#crosser#mango#ti5mango#dota2#jakiro","favourites":5,"__v":0,"created_on":"2015-06-04T12:54:19.190Z","score":0.00025101402114525686},{"_id":"556e29cee1c2cab63db19a17","id":1715,"pasta":" The movie tells a story about a small baby, who rages instead of crying, who swears like a drunk fuck instead of saying polite things. No one knows who the fuck he is or what disorder he has, but we know one thing, his name is Arteezy Babyrage. Watch as he struggles to get the rampage while playing with 4 killstealing russians, watch as he says fuck in 20 different languages because of a stolen creep, watch as he smashes the keyboard into 4 pieces because his teammate took a rune he wanted to bottle. Just to show his rage in the purest form. Also co-directed by Michael Bay for those sweet special effects","tags":"#dota2#rages#arteezy#rtz#drunk","favourites":11,"__v":0,"created_on":"2015-06-02T21:45:55.240Z","score":0.0005251908651239047}]