[{"_id":"5604ec2ddbbbe94d05d1751a","id":2176,"pasta":"ʜᴇʟʟᴏ ᴍʏ ɴᴀᴍᴇ ɪs ᴜɴɢɢᴏʏ ᴀɴᴅ ᴛʜɪs ɪs ᴍʏ ᴡᴀʏ ᴏғ ᴘʟᴀʏɪɴɢ ᴇᴀʀᴛʜsʜᴀᴋᴇʀ. ɪ sᴛᴀʀᴛ ᴛʜᴇ ɢᴀᴍᴇ ʙʏ ғᴇᴇᴅɪɴɢ ғᴏʀ 15 ᴍɪɴᴜᴛᴇs, ɪ ʙᴜʏ ʙʀᴏᴡɴ ʙᴏᴏᴛs ᴀɴᴅ ᴛᴡᴏ ɪʀᴏɴ ʙʀᴀɴᴄʜᴇs ᴀɴᴅ ᴄᴏɴᴛɪɴᴜᴇ ᴛᴏ ᴛʜʀᴏᴡ. ᴜsɪɴɢ ᴛʜɪs ᴍᴇᴛʜᴏᴅ ɪ ʜᴀᴠᴇ ᴍᴀɴᴀɢᴇᴅ ᴛᴏ ʀᴇᴀᴄʜ 1.3ᴋ ᴍᴍʀ.","tags":"#dota2#earthshaker#unggoy#playstyle","favourites":1,"__v":0,"created_on":"2015-09-25T06:39:41.990Z","score":0},{"_id":"56038854dbbbe94d05d17511","id":2173,"pasta":"OSfrog shazamicon IM OVER HERE! shazamicon OSfrog HO HO SoBayed LOOKING FOR ME? OSfrog shazamicon HAHA!! OSfrog shazamicon ZIP ZAP SoBayed ZIIIIIIIP OSfrog","tags":"#dota2#storm#spirit#icefrog#patch","favourites":3,"__v":0,"created_on":"2015-09-24T05:21:24.122Z","score":0.000028165967509550156},{"_id":"56038833dbbbe94d05d17510","id":2172,"pasta":"I TriHard SOLD TriHard COCAINE TriHard TO TriHard A TriHard PREGNANT TriHard GIRL TriHard IM TriHard NOT TriHard A TriHard DRUG TriHard DEALER TriHard IM TriHard A TriHard LIFE TriHard SAVER TriHard","tags":"#RTZ#Dota2#bestmusicNA","favourites":33,"__v":0,"created_on":"2015-09-24T05:20:51.877Z","score":0.00028389470436756707},{"_id":"56038818dbbbe94d05d1750e","id":2170,"pasta":" It is currently 2:69am here in Zimbabwe. I traded my last cow for some credit at the local internet cafe. I am currently streaming at 5kb/s on mobile quality and I have Uni tomorrow. Please can you hurry up Zyori.\n","tags":"#dota2#moonduck#cow#zimbabwe","favourites":5,"__v":0,"created_on":"2015-09-24T05:20:24.912Z","score":0.00005018589987333235},{"_id":"560387dedbbbe94d05d1750b","id":2167,"pasta":"I pick antimage and go safelane\nThe enemy offlane is huskar undying duo lane\nOne of my supports has gone top the other is jungling on bane\nI resign myself to pulling the small camp, but then I hear it\nI am ruptured, bloodseeker is already level 6 and ganking from mid\nAs I die the last thing I see is \"report am shit carry feeder\" from 0/5 shadowfiend","tags":"#dota2#safelane#antimage#carry","favourites":3,"__v":0,"created_on":"2015-09-24T05:19:26.621Z","score":0.00002816580175535686},{"_id":"560387c4dbbbe94d05d1750a","id":2166,"pasta":"I'm the most dedicated player I know. I take pubs just as seriously as if it was finals at TI. I never give up. Playing against megas? I keep playing. Down 40 kills? I keep playing. Half of your team afk in base? I keep playing. Why? Because I'm Anti-mage.\n\nThis hero is the ultimate 1v9 hero. If played correctly you literally can't lose with this hero. You may be thinking that if you played any hero correctly then you can't lose either but that's simply not true. Anti-mage is unique with this characteristic.\n\nI go safelane. I farm. The offlaner tries to contest but I am too good. I blink on him. I trade. I back off. We both salve up. He's got no mana. I've won the lane, like always. I am Anti-mage. Nothing matters more than farm. I control the lane. I'm farming so close to my tower that I'm impossible to gank. I can not die. I will never die.\n\n16 minutes. Battlefury, Power treads, Poor mans shield, Vladmir's Offering. I've already won. Nothing can stop me now but myself. I am fearless. I push out lanes. I take towers. I force rotations. I am Anti-mage. Thousands of calculations going on in my head. I keep track of glyph, five individual teleport scroll cooldowns, how much each enemy is farming and when they will have specific items, relative position of both couriers etc. I can not lose now. Manta, Heart, Butterfly, Abyssal. I've not finished farming.\n\n\"Fucking AM picker, no skill\" The flame only fuels me. \"Wow, nice work AM you took racks\" I don't need your praise peasant. I'm fucking Anti-mage. The rest of the my 'team' is irrelevant. They only get in the way of my goal. The enemy ancient.\n\nMoonshard, Boots of Travel 2. I buy the wards, the gems are on me. I take the throne. I've won the game. 900GPM. Pathetic, I could do better. I'm not trying hard enough. I've failed.\n\n\"Match found\". I pick Anti-mage. I am Anti-mage.","tags":"#dota2#antimage#farm","favourites":9,"__v":0,"created_on":"2015-09-24T05:19:00.621Z","score":0.00008942073022982751},{"_id":"560387bddbbbe94d05d17509","id":2165,"pasta":"I'm the most dedicated player I know. I take pubs just as seriously as if it was finals at TI. I never give up. Teammates flaming me in all chat? I keep stacking. Teammates disconnecting? I keep stacking. Ganked by enemy mid? I keep stacking. Why? Because I'm Necro.\n\nThis hero is the ultimate ancients hero. If you stack correctly you literally can't lose with this hero. You may be thinking that if you go ancients with any hero you can't lose but that's simply not true. Necro is unique with this characteristic.\n\nI go ancients. I stack. The ancients tries to attack me but I am too good. I walk out of range. I wait. I level heartstopper. I stack again. Ancients at 75% hp. I have 98%. I've won again, like always. I am Necro. Nothing matters more than ancients. I control the spawn times. I'm stacking so close to :00 that sometimes no ancients spawn. I can not die. I will never die.\n\n16 minutes. Almost done with Midas. I've already won. Nothing can stop me now but myself. I am fearless. I keep stacking. I level heartstopper. I level stats. I am Necro. Thousands of calculations going on in my head. I keep track of the ancients, one individual hand of Midas cooldown, how much I am farming and when will I have treads, relative position of ancients etc. I can not lose now. Midas, Staff of Wizardry, Null talisman, boots. I've not finished farming.\n\n\"Fucking retard afk necro\" The flame only fuels me. \"gg necro 0-7 report\" I don't need your praise peasant. I'm fucking Necro. The rest of the my 'team' is irrelevant. They only get in the way of my goal. Farming ancients. Power treads finished. I also buy tp, since I have none on me. Enemies take the throne. I've lost the game. 176GPM. Pathetic allies, I couldn't really do better. I did my best. I've succeeded.\n\n\"Match found\". I pick Necro. I go ancients.","tags":"#dota2#necro#ancients","favourites":0,"__v":0,"created_on":"2015-09-24T05:18:53.486Z","score":0},{"_id":"55fd08aadbbbe94d05d174ec","id":2162,"pasta":"Fucking AM picker, no skill\" The flame only fuels me. \"Wow, nice work AM you took racks\" I don't need your praise peasant. I'm fucking Anti-mage. The rest of the my 'team' is irrelevant. They only get in the way of my goal. The enemy ancient.","tags":"#dota2#antimage#picker#lone#wolf","favourites":4,"__v":0,"created_on":"2015-09-19T07:03:06.447Z","score":0.00003866176906508039},{"_id":"55fc564f7831e444174c3097","id":2156,"pasta":"R Σ M A K Σ B O Y S \n\nSAFΣ TO LΣAVΣ ","tags":"#dota2#sigma#fata#remake","favourites":0,"__v":0,"created_on":"2015-09-18T18:22:07.392Z","score":0},{"_id":"55fc564a7831e444174c3096","id":2155,"pasta":"Ａｆｔｅｒ  ｗａｔｃｈｉｎｇ  ｔｈｅ  ＥＭＢＡＲＡＳＳＩＮＧ  ｐｅｒｆｏｒｍａｎｃｅ  ｂｙ  ａｌｌｉａｎｃｅ，  Ｉ  ｗａｓ  ｒｅｍｉｎｄｅｄ  ｏｆ  ｔｈｅ  ｒｅｌｅａｓｅ  ｏｆ  Ｄｏｔａ  ２  Ｒｅｂｏｒｎ．  Ａｓ  ｉｔ  ｔｕｒｎｓ  ｏｕｔ，  ｒｅｂｏｒｎ  ａｎｄ  ａｌｌｉａｎｃｅ  ｈａｖｅ  ｍａｎｙ  ｓｉｍｉｌａｒｉｔｉｅｓ．  Ｍｕｃｈ  ｌｉｋｅ  Ａｌｌｉａｎｃｅ，  ｔｈｅ  ｄｏｔａ  ｃｌｉｅｎｔ  ｗａｓ  ｖｅｒｙ  ｇｏｏｄ  ｉｎ  ｔｈｅ  ｐａｓｔ，  ｂｕｔ  ＡＢＳＯＬＵＴＥ  ＧＡＲＢＡＧＥ  ａｔ  ｔｈｅ  ｍｏｍｅｎｔ．  Ｍｏｒｅｏｖｅｒ，  ｂｏｔｈ  Ａｌｌｉａｎｃｅ  ａｎｄ  Ｒｅｂｏｒｎ  ｈａｖｅ  ＲＵＩＮＥＤ  ｔｈｅ  ｅｎｊｏｙｍｅｎｔ  ｏｆ  ｔｈｅ  ｐｅｏｐｌｅ  ｗｈｏ  ｕｓｅｄ  ｔｏ  ｌｉｋｅ  ｔｈｅｍ  ｉｎ  ｔｈｅｉｒ  ｐｒｅｖｉｏｕｓ  ｆｏｒｍｓ．  Ａｌｌｉａｎｃｅ  ｆａｎｓ  ｃａｎ  ｎｏｗ  ｂａｒｅｌｙ  ｓｔａｎｄ  ｔｏ  ｗａｔｃｈ  Ａｌｌｉａｎｃｅ  ｐｌａｙ，  ｊｕｓｔ  ａｓ  Ｄｏｔａ  ｆａｎｓ  ｃａｎ  ｂａｒｅｌｙ  ｓｔａｎｄ  ｔｏ  ｐｌａｙ  Ｒｅｂｏｒｎ．  Ａｎｏｔｈｅｒ  ｓｉｍｉｌａｒｉｔｙ  ｂｅｔｗｅｅｎ  Ａｌｌｉａｎｃｅ  ａｎｄ  Ｒｅｂｏｒｎ  ｉｓ  ｔｈｅ  ｓｍａｌｌ  ｇｒｏｕｐ  ｏｆ  ｃｒａｚｙ  ｐｅｏｐｌｅ  ｗｈｏ  ｔｒｙ  ｔｏ  ｄｅｆｅｎｄ  ｔｈｅｍ．  Ｉｆ  ｙｏｕ  ｃｒｉｔｉｃｉｚｅ  Ａｌｌｉａｎｃｅ，  ｓｏｍｅｏｎｅ  ｗｉｌｌ  ｓａｙ  ｉｔ＇ｓ  ｊｕｓｔ  ＂ｎｏｔ  ｔｈｅｉｒ  ｐａｔｃｈ．＂  Ｓｉｍｉｌａｒｌｙ，  ｉｆ  ｙｏｕ  ｄｅｓｃｒｉｂｅ  Ｒｅｂｏｒｎ  ａｓ  ａｎｙｔｈｉｎｇ  ｏｔｈｅｒ  ｔｈａｎ  Ａ  ＳＴＥＡＭＩＮＧ  ＰＩＬＥ  ＯＦ  ＴＲＡＳＨ，  ｓｏｍｅｏｎｅ  ｗｉｌｌ  ｓａｙ  ｔｈａｔ  ｉｔ＇ｓ  ａ  ｎｅｗ  ｒｅｌｅａｓｅ  ａｎｄ  Ｖａｌｖｅ  ｉｓ  ｗｏｒｋｉｎｇ  ｏｎ  ｉｔ．  Ｂｕｔ  ｏｎｅ  ｉｍｐｏｒｔａｎｔ  ｄｉｆｆｅｒｅｎｃｅ  ｂｅｔｗｅｅｎ  Ａｌｌｉａｎｃｅ  ａｎｄ  Ｒｅｂｏｒｎ  ｉｓ  ｔｈａｔ  ａ  ｎｅｗ  ｐａｔｃｈ  ｍｉｇｈｔ  ｏｎｅ  ｄａｙ  ｃｕｒｅ  Ａｌｌｉａｎｃｅ＇ｓ  ｗｏｅｓ，  ｂｕｔ  ｎｏ  ａｍｏｕｎｔ  ｏｆ  ｐａｔｃｈｅｓ  ｃａｎ  ｆｉｘ  Ｒｅｂｏｒｎ．","tags":"#Dota2#Reborn#client#Alliance","favourites":1,"__v":0,"created_on":"2015-09-18T18:22:02.026Z","score":0},{"_id":"55fc56337831e444174c3095","id":2154,"pasta":"I RATE NA 9/11 ✈▌▌","tags":"#twitch#dota2#lol#NA#rating#911","favourites":49,"__v":0,"created_on":"2015-09-18T18:21:39.565Z","score":0.0003888112697465319},{"_id":"55fa2db27831e444174c308a","id":2153,"pasta":" Hi PPD, I'm trying to learn how to play Tiny. I just have a question about the skill build. Should I max Avalanche, so I can bury people like how you buried Aui's hopes and dreams, Toss so I can toss people around like how you toss your teammates to other teams, Craggy Exterior so I can be tough and strong, like how Aui has to be after you left him teamless, or Grow so I can grow my ego to the size of yours?","tags":"#dota2#PPD#Tiny#Skill#build#aui2000","favourites":1,"__v":0,"created_on":"2015-09-17T03:04:18.491Z","score":0},{"_id":"55fa2d337831e444174c3085","id":2148,"pasta":"can support playerss and offlfane paklyesr hsut teh fUCK up aobut item builds on carries","tags":"#RTZ#Dota2#GoodKappaStudios","favourites":2,"__v":0,"created_on":"2015-09-17T03:02:11.632Z","score":0.00001533524368283355},{"_id":"55f7910e7831e444174c3067","id":2140,"pasta":"Teams going against AUI always pick Tusk because they know kicking is biggest weakness 4Head EleGiggle","tags":"#dota2#Aui200#DigitalChaos","favourites":5,"__v":0,"created_on":"2015-09-15T03:31:26.602Z","score":0.00004828232696525516},{"_id":"55f4f08a7831e444174c304d","id":2133,"pasta":"ＨＥＹ ＧＡＭＢＩＴ ＩＭ ＬＥＡＲＮＩＮＧ ＨＯＷ ＴＯ ＰＬＡＹ ＲＵＢＩＣＫ, Ｉ ＪＵＳＴ ＨＡＶＥ ＯＮＥ ＱＵＥＳＴＩＯＮ ＡＢＯＵＴ ＴＨＥ ＳＫＩＬＬ ＢＵＩＬＤ, ＤＯ Ｉ ＭＡＸ ＴＥＬＥＫＩＮＥＳＩＳ ＳＯ Ｉ ＣＡＮ ＬＩＦＴ ＨＥＲＯＥＳ ＬＩＫＥ ＹＯＵ ＧＯＴ ＹＯＵＲ ＭＭＲ ＬＩＦＴＥＤ? ＳＨＯＵＬＤ Ｉ ＭＡＸ ＦＡＤＥ ＢＯＬＴ ＬＩＫＥ ＹＯＵＲ ＭＭＲ ＷＩＬＬ ＦＡＤＥ ＩＦ ＹＯＵ ＥＶＥＲ ＰＬＡＹ ＳＯＬＯ ＲＡＮＫＥＤ ＡＧＡＩＮ, ＯＲ ＮＵＬＬ ＦＩＥＬＤ ＳＯ Ｉ ＣＡＮ ＨＡＶＥ ＳＩＭＩＬＡＲ ＧＡＭＥ ＩＭＰＡＣＴ ＴＯ ＹＯＵ?","tags":"#dota2#boosting#traitorsgambit#dotawiththelads","favourites":1,"__v":0,"created_on":"2015-09-13T03:42:02.784Z","score":0}]