[{"_id":"5508e013b47c3d010fd96574","id":1124,"pasta":"☐ Not rekt\n\n☑ Rekt\n\n☑ Really Rekt\n\n☑ Tyrannosaurus Rekt\n\n☑ Cash4Rekt.com\n\n☑ Grapes of Rekt\n\n☑ Ship Rekt\n\n☑ Rekt markes the spot\n\n☑ Caught rekt handed\n\n☑ The Rekt Side Story\n\n☑ Singin' In The Rekt\n\n☑ Painting The Roses Rekt\n\n☑ Rekt Van Winkle\n\n☑ Parks and Rekt\n\n☑ Lord of the Rekts: The Reking of the King\n\n☑ Star Trekt\n\n☑ The Rekt Prince of Bel-Air\n\n☑ A Game of Rekt\n\n☑ Rektflix\n\n☑ Rekt it like it's hot\n\n☑ RektBox 360\n\n☑ The Rekt-men\n\n☑ School Of Rekt\n\n☑ I am Fire, I am Rekt\n\n☑ Rekt and Roll\n\n☑ Professor Rekt\n\n☑ Catcher in the Rekt\n\n☑ Rekt-22\n\n☑ Harry Potter: The Half-Rekt Prince\n\n☑ Great Rektspectations\n\n☑ Paper Scissors Rekt\n\n☑ RektCraft\n\n☑ Grand Rekt Auto V\n\n☑ Call of Rekt: Modern Reking 2\n\n☑ Legend Of Zelda: Ocarina of Rekt\n\n☑ Rekt It Ralph\n\n☑ Left 4 Rekt\n\n☑ www.rekkit.com\n\n☑ Pokemon: Fire Rekt\n\n☑ The Shawshank Rektemption\n\n☑ The Rektfather\n\n☑ The Rekt Knight\n\n☑ Fiddler on the Rekt\n\n☑ The Rekt Files\n\n☑ The Good, the Bad, and The Rekt\n\n☑ Forrekt Gump\n\n☑ The Silence of the Rekts\n\n☑ The Green Rekt\n\n☑ Gladirekt\n\n☑ Spirekted Away\n\n☑ Terminator 2: Rektment Day\n\n☑ The Rekt Knight Rises\n\n☑ The Rekt King\n\n☑ REKT-E\n\n☑ Citizen Rekt\n\n☑ Requiem for a Rekt\n\n☑ REKT TO REKT ass to ass\n\n☑ Star Wars: Episode VI - Return of the Rekt\n\n☑ Braverekt\n\n☑ Batrekt Begins\n\n☑ 2001: A Rekt Odyssey\n\n☑ The Wolf of Rekt Street\n\n☑ Rekt's Labyrinth\n\n☑ 12 Years a Rekt\n\n☑ Gravirekt\n\n☑ Finding Rekt\n\n☑ The Arekters\n\n☑ There Will Be Rekt\n\n☑ Christopher Rektellston\n\n☑ Hachi: A Rekt Tale\n\n☑ The Rekt Ultimatum\n\n☑ Shrekt\n\n☑ Rektal Exam\n\n☑ Rektium for a Dream\n\n☑ www.Trekt.tv\n\n☑ Erektile Dysfunction","tags":"#general#rekt#checkboxes#long","favourites":770,"__v":0,"created_on":"2015-03-18T02:16:47.340Z","score":0.010796965816794063},{"_id":"55087df39c40b7580599849f","id":1048,"pasta":"hi every1 im new!!!!!!! holds up spork my name is katy but u can call me t3h PeNgU1N oF d00m!!!!!!!! lol…as u can see im very random!!!! thats why i came here, 2 meet random ppl like me _… im 13 years old (im mature 4 my age tho!!) i like 2 watch invader zim w/ my girlfreind (im bi if u dont like it deal w/it) its our favorite tv show!!! bcuz its SOOOO random!!!! shes random 2 of course but i want 2 meet more random ppl =) like they say the more the merrier!!!! lol…neways i hope 2 make alot of freinds here so give me lots of commentses!!!!\nDOOOOOMMMM!!!!!!!!!!!!!!!! <--- me bein random again _^ hehe…toodles!!!!!\n\nlove and waffles,\n\nt3h PeNgU1N oF d00m","tags":"#Katy#spork#PenguinOfDoom#4chan#reddit","favourites":605,"__v":0,"created_on":"2015-03-17T18:57:02.418Z","score":0.008802972661760868},{"_id":"5508b111b47c3d010fd964e4","id":1065,"pasta":"Gr8 b8, m8. I rel8, str8 appreci8, and congratul8. I r8 this b8 an 8/8. Plz no h8, I'm str8 ir8. Cr8 more, can't w8. We should convers8, I won't ber8, my number is 8888888, ask for N8. No calls l8 or out of st8. If on a d8, ask K8 to loc8. Even with a full pl8, I always have time to communic8 so don't hesit8. dont forget to medit8 and particip8 and masturb8 to allevi8 your ability to tabul8 the f8. We should meet up m8 and convers8 on how we can cre8 more gr8 b8, I'm sure everyone would appreci8, no h8. I don't mean to defl8 your hopes, but its hard to dict8 where the b8 will rel8 and we may end up with out being appreci8d, I'm sure you can rel8. We can cre8 b8 like alexander the gr8, stretch posts longer than the Nile's str8s. We'll be the captains of b8, 4chan our first m8s the growth r8 will spread to reddit and like real est8 and be a flow r8 of gr8 b8, like a blind d8 we'll coll8, meet me upst8 where we can convers8, or ice sk8 or lose w8 infl8 our hot air baloons and fly, tail g8. We could land in Kuw8, eat a soup pl8 followed by a dessert pl8 the payment r8 won't be too ir8 and hopefully our currency won't defl8. We'll head to the Israeli-St8, taker over like Herod the gr8 and b8 the jewish masses, 8 million, m8. We could interrel8 communism, thought it's past it's maturity d8, a department of st8, volunteer st8. reduce the infant mortality r8, all in the name of making gr8 b8 m8.","tags":"#general#8#gr8#b8#m8","favourites":549,"__v":0,"created_on":"2015-03-17T22:51:37.615Z","score":0.008129988147281114},{"_id":"5508a27e0ec6f6600dbaacba","id":1063,"pasta":"What the ( ͡° ͜ʖ ͡°) did you just ( ͡° ͜ʖ ͡°) say about me, you little ( ͡° ͜ʖ ͡°)? I'll have you know I graduated top of my ( ͡° ͜ʖ ͡°) in the ( ͡° ͜ʖ ͡°), and I've been involved in numerous secret ( ͡° ͜ʖ ͡°) on ( ͡° ͜ʖ ͡°), and I have over 300 confirmed ( ͡° ͜ʖ ͡°). I am trained in ( ͡° ͜ʖ ͡°) warfare and I'm the top ( ͡° ͜ʖ ͡°) in the entire US armed ( ͡° ͜ʖ ͡°). You are nothing to me but just another ( ͡° ͜ʖ ͡°). I will wipe you the ( ͡° ͜ʖ ͡°) out with precision the ( ͡° ͜ʖ ͡°) of which has never been seen before on this ( ͡° ͜ʖ ͡°), mark my ( ͡° ͜ʖ ͡°) words. ( ͡° ͜ʖ ͡°) think ( ͡° ͜ʖ ͡°) can get away with saying that ( ͡° ͜ʖ ͡°) to me over the ( ͡° ͜ʖ ͡°)? Think again, ( ͡° ͜ʖ ͡°). As we speak I am contacting my secret network of ( ͡° ͜ʖ ͡°) across the ( ͡° ͜ʖ ͡°) and your ( ͡° ͜ʖ ͡°) is being ( ͡° ͜ʖ ͡°) right now so you better ( ͡° ͜ʖ ͡°) for the ( ͡° ͜ʖ ͡°), ( ͡° ͜ʖ ͡°). The ( ͡° ͜ʖ ͡°) that wipes out the pathetic little thing you call ( ͡° ͜ʖ ͡°). You're ( ͡° ͜ʖ ͡°) dead, ( ͡° ͜ʖ ͡°). I can be ( ͡° ͜ʖ ͡°), anytime, and I can ( ͡° ͜ʖ ͡°) you in over seven hundred ( ͡° ͜ʖ ͡°), and that's just with my bare ( ͡° ͜ʖ ͡°). Not only am I extensively trained in ( ͡° ͜ʖ ͡°) combat, but I have access to the entire ( ͡° ͜ʖ ͡°) of the United States ( ͡° ͜ʖ ͡°) and I will use it to its full extent to wipe your miserable ( ͡° ͜ʖ ͡°) off the face of the ( ͡° ͜ʖ ͡°), you little ( ͡° ͜ʖ ͡°). If only you could have known what unholy retribution your little ( ͡° ͜ʖ ͡°) comment was about to bring down upon ( ͡° ͜ʖ ͡°), maybe you would have held your ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°). But you couldn't, you didn't, and now you're paying the price, you ( ͡° ͜ʖ ͡°). I will ( ͡° ͜ʖ ͡°) fury all over ( ͡° ͜ʖ ͡°) and ( ͡° ͜ʖ ͡°) will ( ͡° ͜ʖ ͡°) in it. You're ( ͡° ͜ʖ ͡°) dead, ( ͡° ͜ʖ ͡°).","tags":"#general#donger#navy#seal#lenny","favourites":491,"__v":0,"created_on":"2015-03-17T21:47:22.372Z","score":0.007403176363883319},{"_id":"5508cd9cb47c3d010fd96548","id":1106,"pasta":"(╯°□°）╯︵ ┻━┻","tags":"#twitch#general#flip#table","favourites":394,"__v":0,"created_on":"2015-03-18T00:48:54.478Z","score":0.006167426124107982},{"_id":"55087e299c40b758059984a1","id":1050,"pasta":"Here's the thing. You said a \"jackdaw is a crow.\"\n\nIs it in the same family? Yes. No one's arguing that.\n\nAs someone who is a scientist who studies crows, I am telling you, specifically, in science, no one calls jackdaws crows. If you want to be \"specific\" like you said, then you shouldn't either. They're not the same thing.\n\nIf you're saying \"crow family\" you're referring to the taxonomic grouping of Corvidae, which includes things from nutcrackers to blue jays to ravens.\n\nSo your reasoning for calling a jackdaw a crow is because random people \"call the black ones crows?\" Let's get grackles and blackbirds in there, then, too.\n\nAlso, calling someone a human or an ape? It's not one or the other, that's not how taxonomy works. They're both. A jackdaw is a jackdaw and a member of the crow family. But that's not what you said. You said a jackdaw is a crow, which is not true unless you're okay with calling all members of the crow family crows, which means you'd call blue jays, ravens, and other birds crows, too. Which you said you don't.\n\nIt's okay to just admit you're wrong, you know?","tags":"#reddit#unidan#jackdaw#crow#wrong","favourites":384,"__v":0,"created_on":"2015-03-17T18:38:13.871Z","score":0.006021576306158708},{"_id":"5508934e65f4abef0cfbe4fa","id":1054,"pasta":"What the dank did you just blazing say about me, you little meme? I’ll have you know I ayy’d top of my lmao in the Dank Memers, and I’ve been involved in numerous secret raids on 9GAG, and I have over 420 confirmed memes. I am trained in gnome warfare and I’m the top sweglord in the entire /r/dank_meme forces. You are nothing to me but just another 9Fag. I will smoke you the fuck out with memes the likes of which have never been seen before on this Earth, mark my fucking words. You think you can get away with saying that shit to me over the Internet? Think again, memer. As we speak I am posting my secret network of dank memes across reddit and your karma is being rekt right now so you better prepare for the storm, shitposter. The storm that wipes out the pathetic little thing you call your karma. You’re fucking downvoted, kid. I can meme anywhere, anytime, and I can dank you in over sixty nine ways, and that’s just with non-dank memes. Not only am I extensively trained in danked memeing, but I have access to the entire stash of Snoop’s dankest kush and I will use it to its full extent to blaze your miserable memes off the face of the thread, you little shit. If only you could have known what unholy retribution your little “clever” comment was about to bring down upon you, maybe you wouldn’t have posted those shitty memes. But you did, you had to, and now you’re paying the price, you little 4chan. I will blow my dank smoke all over you and you will choke in it. You’re fucking memed, kiddo.","tags":"#general#navy#seal#dank#memes","favourites":327,"__v":0,"created_on":"2015-03-17T20:32:08.749Z","score":0.005268898184168478},{"_id":"5508814c9c40b758059984a6","id":1052,"pasta":"Omg hai ___^ I’m anon-san and I absolutely luuuv @__@ anime <3 and my fav is naurto!!! Okies so anyways, im going to tell you about the BEST day of my life when I met my hot husband sasuke!! <333333333 OMFGZ HE WAS SOOOOO FREAKIN KAWAII IN PERSON!!! Supa kawaii desu!!!!!!!! ^___________________________________^\nWhen I walked onto Tokyo street =____=I looked up and saw…SASUKE!!!!!!!!!!!!!!! <33333333333333333333333333333333333333333333333333333333333333!!!! “ KONNICHIWA OMGZZZZZZZZZZZZZZZZ SUPA SUPA SUPA KAWAII SASUKE-SAMA!!!!!” I yelled n____n then he turned chibi then un-chibi!! he looked at me [O.O;;;;;;;;;;;] and then he saw how hot I am *___* he grabbed my hand and winked ~_^ then pulled me behind a pocky shop o_o and started to kiss me!!!!!! [OMG!!! HIS TOUNGE TASTED LIKE RAMEN!!! RLY!! >.> <.< >.< (O) (O) (O)] then I saw some baka fat bitch watching us and I could tell she was undressing him with her eyes!!!!!!! [ -___________-;;;;; OMG I COULDN’T BELIEVE IT EITHER!!! (ò_ó) (ò_ó) (ò_ó)] so I yelled “UH UH BAKA NEKO THAT’S MY MAN WHY DON’T YOU GO HOOK UP WITH NARUTO CAUSE SASUKE-SAMA LOVES ME!!! (ò_ó)” then sasuke held me close =^= and said he would only ever love me and kissed me again!!!!!!! ** (O)/ then we went to his apartment and banged all night long and made 42 babies and they all became ninjas!!!!!!!!!!!!!!! Nyaaaaa!!! (^___<) ^______________;;;;;;;;;;;;;;;;","tags":"#general#weeaboo#naruto#sasuke","favourites":263,"__v":0,"created_on":"2015-03-17T19:31:35.042Z","score":0.0043898418479921646},{"_id":"5508948165f4abef0cfbe4fb","id":1055,"pasta":"Who is this\n>Semen Demon\n>Jizz Genie\n>Baby Batter Bringer\n>Cum Caresser\n>Lovegoo Lass\n>Sperm Summoner\n>Ejaculate Empress\n>Mayonnaise Maiden\n>Jizz Jockey\n>Spunk Monk\n>Sodomy Sentinel\n>Penile Perpetrator\n>Erection Confection\n>Salami Tsunami\n>Boner Condoner\n>Fluid Druid\n>Urethral Umpire\n>Wang Wizard\n>Knackers Knight\n>Prick Pirate\n>Dong Dominator\n>Cock Khan\n>Stiffy Sultan\n>Sausage Sergeant\n>Middle Leg Major\n>Pole Privateer\n>Shaft Specialist\n>Pecker Prodigy\n>Boner Benefactor\n>Baloney Poney Behemoth\n>Dick Juice Masseuse\n>Tallywhacker Smacker\n>Man Muscle Steam Shovel\n>Baby Batter Bladder\n>Willy Ghillie\n>Butt Hut\n>Glans Fans\n>Spooge Scrooge\n>Ejaculate Advocate\n>Skeet Treat\n>Wang Wrangler\n>Jism Prism\n>Smegma Savant\n>Anal Aficionado\n>Testicular Temptress","tags":"#general#alliteration#love","favourites":254,"__v":0,"created_on":"2015-03-17T20:32:39.158Z","score":0.0042655368390986815},{"_id":"54eb4710c200ce525fb25da2","id":902,"pasta":"10/10 quality thread, an emotional rollercoaster that kept me on the edge of my seat the entire time. I laughed, I cried, I learned 42 new ways to season and cook a pork shoulder. Truly a new standard has been set that all future threads will be held in comparison to.","tags":"#reddit#quality#thread#shit#post","favourites":246,"__v":0,"created_on":"2015-02-23T14:06:06.856Z","score":0.00341374092501765},{"_id":"550517d487d1bc685b1e9686","id":1029,"pasta":"I sexually Identify as a steel beam. Ever since 9/11 I dreamed of getting drawn closer and closer to my melting point by jet fuel under the Twin Tower letting them drop on disgusting foreigners. People say to me that a person being a steel beam is Impossible and I’m fucking retarded but I don’t care, I’m beautiful. I’m having a plastic surgeon install steel beams and jet fuel on my body. From now on I want you guys to call me “Steel Beam” and respect my right to not melt by jet fuel and kill needlessly. If you can’t accept me you’re a steeliphobe and need to check your metallic privilege. Thank you for being so understanding.","tags":"#general#sexually#identify#steel#beam","favourites":246,"__v":0,"created_on":"2015-03-15T05:25:32.492Z","score":0.004051068840775947},{"_id":"54fb95f187d1bc685b1e9646","id":1001,"pasta":"Darude- status\n☐ Not Sandstorm\n☑ Sandstorm","tags":"#general#twitch#darude#sandstorm","favourites":170,"__v":0,"created_on":"2015-03-08T00:21:02.434Z","score":0.002784041774615321},{"_id":"55090bc4b47c3d010fd965df","id":1172,"pasta":"Lindsay was 12 when it first started. One morning she awoke to find odd little crumbs in her bed. At first she thought they were crackers, but as she was getting dressed for school she noticed a small little tan 'O' laying on the floor next to her nightstand. It was a cheerio. She picked it up and looked at it for a moment, its wholesome oaty contours seeming perfectly harmless. She threw it away, assuming that her bratty older sister was responsible. Little did she know that it was an omen of the pure mind bending horror which was soon to follow. That weekend her mother went shopping.\n\nShe had gotten in the habit of doing all the grocery shopping for the month at once, so the kitchen was packed full of bags and boxes as the girls went about putting things away. Lindsay was disappointed when she noticed that the only cereal her mother had gotten was Cheerios. It was always Cheerios. Four economy-sized boxes worth, no less. Lindsay had never liked Cheerios, even though her sister seemed to love them. They were too plain. Too boring, She thrust the boxes carelessly up onto the shelf above the refrigerator and went searching through the other bags to see if her mother had gotten anything that was actually edible. Later that night she was tossing and turning in bed, her stomach full of slightly too much Butterfinger ice cream. The house was silent. Everyone else was in bed. Or should have been. Lindsay had almost dozed off when a soft, dry rustling sound brought her back to wakefulness. At first she thought it was the cat scratching at her door, but as she sat up she realized it was coming from somewhere inside the room. A twinge of fear shivered through her body. They'd never had rats or mice in the house before. Was it a bug?\n\nWhatever it was, it sounded big. Lindsay was scared. She felt the urge to huddle underneath her blankets and hide until it went away. Instead, she gathered her courage and reached out to turn on the lamp beside her bed. Just as she touched it, the noise suddenly stopped. She flicked it on and jumped back into the center of her bed, clutching the sheets tightly around her as light spilled out into the room. There was nothing there. She peeked carefully over the sides of her bed, seeing only the rug and a few Girls' Life magazines. Taking her heaviest pillow to use as a weapon, she got out of bed and padded slowly towards the door. Right as she reached it she froze. looking down. Peeking out from the crack beneath her round half-circle of a cheerio. Puzzled, she opened the door. Before her loomed a seven-foot wall of cheerios.\n\nThey covered the doorway completely as the entire hallway had been filled with them. And they were moving. They were alive and crawling over each other like a mass of legless insects, filling the air with the heavy smell of whole grain oats. Lindsay ran and jumped back onto her bed. She huddled and clutched the pillow over her head, and screamed. She was still screaming when her parents came in. Her mother soothed her, wanting to know what was the matter. The cheerios were gone. Lindsay told her that it was just a nightmare. She didn't want them to think she was crazy. After a little while her parents left, her father muttering something about 'night terrors' as they walked back upstairs.\n\nWhen they were gone, Lindsay stuffed her blanket under the crack of her door and sat up with the light on. She tried her best to stay awake all night, but after a few hours she finally fell asleep. When she awoke there were a handful of crumbs in her bed. For a few weeks afterward Lindsay was able to sleep on the floor in her sister Susan's room, though she had to use all of her allowance as a bribe. Then her parents found out and made her go back to her own room. Lindsay's dad got her a lock for the door, telling her it would help her to feel safe. It didn't.\n\nThe very first night she was back in her room, she heard the rustling noise again. She'd kept the lamp on but this time the light didn't seem to help. She huddled there, watching the door and hoping it would go away. Then the blanket moved. She'd stuffed it under the door again as tightly as she could, but now the corner of it was being pushed back into her room by something on the other side. Lindsay was pretty sure she knew that something was. The cheerios were coming for her. Just then the lamp went out and the room plunged into darkness. She stifled a scream, telling herself it was just a nightmare.\n\nCheerios couldn't move or unplug lights. They didn't come after people. Then something light and dry brushed against her cheek, and all rational thought left her mind as she was seized in the cold grip of terror. She opened her mouth to scream, gagging as it was immediately filled with tiny rings of cereal. She felt it moving all over her body. She bit and chewed and spit, trying to clear her mouth so she could call for help. But no matter how much of it she crunched up, more always took its place. The cheerios seemed to collect into narrow tendrils as they snaked over her body. She shuddered in shock and disbelief as she felt the buttons of her pajama top being pulled open one by one. Suddenly she was grabbed around the arms and ankles and lifted up above the bed, her face toward the ceiling.\n\nDry, searching fingers of cereal probed into the waistband of her pj bottoms and yanked them down just as her shirt was pulled up over her head. She was still too young to wear a bra, and she immediately felt the cheerios coil around her small, developing breasts and squeeze them roughly. Lindsay whimpered and kicked as her panties were stripped off. No, she thought, it couldn't want that. *Please* let it not be that... Her legs were quickly restrained while another tendril slid up slowly along her inner thigh. thousands more gripped her buttocks, holding her up and kneading her firm athletic flesh as more began circling over her nipples. Lindsay gasped through her nose, her mouth still full of cheerios. It was weird and horrible, but the touching felt good at the same time.\n\nThen she felt the tendril rubbing lightly over her exposed labia, and she thrashed about uselessly as it began nudging and probing at her most private spot. It caressed the lips of her young vulva almost tenderly for a few long minutes before she felt it nudge harder at the entrance to her vagina. Her body stiffened as she felt it pushing inside her. It felt rough, even though the surface had been moistened by her fearful sweat and the natural wetness within her. The cheerio tendril entered her slowly, relentlessly. It didn't thrust in and out like she'd expected it to, instead it seemed to be pouring itself into her, filling her vagina with tiny cereal O's.\n\nShe could feel them snapping and crunching inside her as she clenched down to try and keep them out. The tendrils on her body seemed to get stronger. groping at her breasts and ass and tugging hard at her nipples. She felt her pussy stretching as it was packed full of rapacious cheerios, the growing pressure sending mixed tingles of pain and pleasure rippling through her body. Then she felt the presence of yet another narrow tendril rubbing insistently against the tight pucker of her butthole. Lindsay came as it pushed inside her, her body shivering uncontrollably as she was reluctantly overcome by pulsing waves of ecstasy. At that moment there was a quiet knock on the door. Her mother's voice called out, asking if she was okay. The cheerios quickly drew away, vanishing into the darkness just as abruptly as they'd arrived.\n\nLindsay could still feel some remnants in her vagina and ass as she got up weakly and pulled her pjs back on. Her mother looked concerned when Lindsay opened the door, but the explanation of another nightmare seemed to put her at ease. When she'd gone back up to bed, Lindsay went into the bathroom and sat on the toilet, feeling ashamed and violated as she let the last of the soggy cereal mush drip out of her body. She still hated cheerios. Now more than ever.","tags":"#general#cheerios#rape#erotica#nonconsent#nsfw","favourites":168,"__v":0,"created_on":"2015-03-18T05:10:43.202Z","score":0.003027804325232098},{"_id":"5508c04db47c3d010fd9650b","id":1080,"pasta":"So ur with ur honey and yur making out wen the phone rigns. U anser it n the vioce is \"wut r u doing wit my daughter?\" U tell ur girl n she say \"my dad is ded\". THEN WHO WAS PHONE?","tags":"#4chan#creepy#who#was#phone","favourites":166,"__v":0,"created_on":"2015-03-17T23:39:39.694Z","score":0.0029909849218273236},{"_id":"54b2ee7bce7b585004706dc5","id":44,"pasta":"I sexually Identify as an Attack Helicopter. Ever since I was a boy I dreamed of soaring over the oilfields dropping hot sticky loads on disgusting foreigners. People say to me that a person being a helicopter is Impossible and I'm fucking retarded but I don't care, I'm beautiful. I'm having a plastic surgeon install rotary blades, 30 mm cannons and AMG-114 Hellfire missiles on my body. From now on I want you guys to call me \"Apache\" and respect my right to kill from above and kill needlessly. If you can't accept me you're a heliphobe and need to check your vehicle privilege. Thank you for being so understanding.","tags":"#general#tumblr#attack#helicopter#reynad","favourites":164,"__v":0,"created_on":"2015-01-11T21:42:07.663Z","score":0.0017886357231655654}]