[{"_id":"5508e013b47c3d010fd96574","id":1124,"pasta":"☐ Not rekt\n\n☑ Rekt\n\n☑ Really Rekt\n\n☑ Tyrannosaurus Rekt\n\n☑ Cash4Rekt.com\n\n☑ Grapes of Rekt\n\n☑ Ship Rekt\n\n☑ Rekt markes the spot\n\n☑ Caught rekt handed\n\n☑ The Rekt Side Story\n\n☑ Singin' In The Rekt\n\n☑ Painting The Roses Rekt\n\n☑ Rekt Van Winkle\n\n☑ Parks and Rekt\n\n☑ Lord of the Rekts: The Reking of the King\n\n☑ Star Trekt\n\n☑ The Rekt Prince of Bel-Air\n\n☑ A Game of Rekt\n\n☑ Rektflix\n\n☑ Rekt it like it's hot\n\n☑ RektBox 360\n\n☑ The Rekt-men\n\n☑ School Of Rekt\n\n☑ I am Fire, I am Rekt\n\n☑ Rekt and Roll\n\n☑ Professor Rekt\n\n☑ Catcher in the Rekt\n\n☑ Rekt-22\n\n☑ Harry Potter: The Half-Rekt Prince\n\n☑ Great Rektspectations\n\n☑ Paper Scissors Rekt\n\n☑ RektCraft\n\n☑ Grand Rekt Auto V\n\n☑ Call of Rekt: Modern Reking 2\n\n☑ Legend Of Zelda: Ocarina of Rekt\n\n☑ Rekt It Ralph\n\n☑ Left 4 Rekt\n\n☑ www.rekkit.com\n\n☑ Pokemon: Fire Rekt\n\n☑ The Shawshank Rektemption\n\n☑ The Rektfather\n\n☑ The Rekt Knight\n\n☑ Fiddler on the Rekt\n\n☑ The Rekt Files\n\n☑ The Good, the Bad, and The Rekt\n\n☑ Forrekt Gump\n\n☑ The Silence of the Rekts\n\n☑ The Green Rekt\n\n☑ Gladirekt\n\n☑ Spirekted Away\n\n☑ Terminator 2: Rektment Day\n\n☑ The Rekt Knight Rises\n\n☑ The Rekt King\n\n☑ REKT-E\n\n☑ Citizen Rekt\n\n☑ Requiem for a Rekt\n\n☑ REKT TO REKT ass to ass\n\n☑ Star Wars: Episode VI - Return of the Rekt\n\n☑ Braverekt\n\n☑ Batrekt Begins\n\n☑ 2001: A Rekt Odyssey\n\n☑ The Wolf of Rekt Street\n\n☑ Rekt's Labyrinth\n\n☑ 12 Years a Rekt\n\n☑ Gravirekt\n\n☑ Finding Rekt\n\n☑ The Arekters\n\n☑ There Will Be Rekt\n\n☑ Christopher Rektellston\n\n☑ Hachi: A Rekt Tale\n\n☑ The Rekt Ultimatum\n\n☑ Shrekt\n\n☑ Rektal Exam\n\n☑ Rektium for a Dream\n\n☑ www.Trekt.tv\n\n☑ Erektile Dysfunction","tags":"#general#rekt#checkboxes#long","favourites":2197,"__v":0,"created_on":"2015-03-18T02:16:47.340Z","score":0.005117068562799761},{"_id":"54b344916bd15d33165d28a9","id":55,"pasta":"My Grandfather smoked his whole life. I was about 10 years old when my mother said to him, 'If you ever want to see your grandchildren graduate, you have to stop immediately.'. Tears welled up in his eyes when he realized what exactly was at stake. He gave it up immediately. Three years later he died of lung cancer. It was really sad and destroyed me. My mother said to me- 'Don't ever smoke. Please don't put your family through what your Grandfather put us through.\" I agreed. At 28, I have never touched a cigarette. I must say, I feel a very slight sense of regret for never having done it, because your post gave me cancer anyway.","tags":"#reddit#cancer#post#smoking#grandpa","favourites":1647,"__v":0,"created_on":"2015-01-12T03:03:39.683Z","score":0.0034327149718543647},{"_id":"54b2ee7bce7b585004706dc5","id":44,"pasta":"I sexually Identify as an Attack Helicopter. Ever since I was a boy I dreamed of soaring over the oilfields dropping hot sticky loads on disgusting foreigners. People say to me that a person being a helicopter is Impossible and I'm fucking retarded but I don't care, I'm beautiful. I'm having a plastic surgeon install rotary blades, 30 mm cannons and AMG-114 Hellfire missiles on my body. From now on I want you guys to call me \"Apache\" and respect my right to kill from above and kill needlessly. If you can't accept me you're a heliphobe and need to check your vehicle privilege. Thank you for being so understanding.","tags":"#general#sexually#identify#attack#helicopter","favourites":1433,"__v":0,"created_on":"2015-01-11T21:42:07.663Z","score":0.0030549863387013387},{"_id":"5508b111b47c3d010fd964e4","id":1065,"pasta":"Gr8 b8, m8. I rel8, str8 appreci8, and congratul8. I r8 this b8 an 8/8. Plz no h8, I'm str8 ir8. Cr8 more, can't w8. We should convers8, I won't ber8, my number is 8888888, ask for N8. No calls l8 or out of st8. If on a d8, ask K8 to loc8. Even with a full pl8, I always have time to communic8 so don't hesit8. dont forget to medit8 and particip8 and masturb8 to allevi8 your ability to tabul8 the f8. We should meet up m8 and convers8 on how we can cre8 more gr8 b8, I'm sure everyone would appreci8, no h8. I don't mean to defl8 your hopes, but its hard to dict8 where the b8 will rel8 and we may end up with out being appreci8d, I'm sure you can rel8. We can cre8 b8 like alexander the gr8, stretch posts longer than the Nile's str8s. We'll be the captains of b8, 4chan our first m8s the growth r8 will spread to reddit and like real est8 and be a flow r8 of gr8 b8, like a blind d8 we'll coll8, meet me upst8 where we can convers8, or ice sk8 or lose w8 infl8 our hot air baloons and fly, tail g8. We could land in Kuw8, eat a soup pl8 followed by a dessert pl8 the payment r8 won't be too ir8 and hopefully our currency won't defl8. We'll head to the Israeli-St8, taker over like Herod the gr8 and b8 the jewish masses, 8 million, m8. We could interrel8 communism, thought it's past it's maturity d8, a department of st8, volunteer st8. reduce the infant mortality r8, all in the name of making gr8 b8 m8.","tags":"#general#8#gr8#b8#m8","favourites":1398,"__v":0,"created_on":"2015-03-17T22:51:37.615Z","score":0.0035088368725616553},{"_id":"5508a27e0ec6f6600dbaacba","id":1063,"pasta":"What the ( ͡° ͜ʖ ͡°) did you just ( ͡° ͜ʖ ͡°) say about me, you little ( ͡° ͜ʖ ͡°)? I'll have you know I graduated top of my ( ͡° ͜ʖ ͡°) in the ( ͡° ͜ʖ ͡°), and I've been involved in numerous secret ( ͡° ͜ʖ ͡°) on ( ͡° ͜ʖ ͡°), and I have over 300 confirmed ( ͡° ͜ʖ ͡°). I am trained in ( ͡° ͜ʖ ͡°) warfare and I'm the top ( ͡° ͜ʖ ͡°) in the entire US armed ( ͡° ͜ʖ ͡°). You are nothing to me but just another ( ͡° ͜ʖ ͡°). I will wipe you the ( ͡° ͜ʖ ͡°) out with precision the ( ͡° ͜ʖ ͡°) of which has never been seen before on this ( ͡° ͜ʖ ͡°), mark my ( ͡° ͜ʖ ͡°) words. ( ͡° ͜ʖ ͡°) think ( ͡° ͜ʖ ͡°) can get away with saying that ( ͡° ͜ʖ ͡°) to me over the ( ͡° ͜ʖ ͡°)? Think again, ( ͡° ͜ʖ ͡°). As we speak I am contacting my secret network of ( ͡° ͜ʖ ͡°) across the ( ͡° ͜ʖ ͡°) and your ( ͡° ͜ʖ ͡°) is being ( ͡° ͜ʖ ͡°) right now so you better ( ͡° ͜ʖ ͡°) for the ( ͡° ͜ʖ ͡°), ( ͡° ͜ʖ ͡°). The ( ͡° ͜ʖ ͡°) that wipes out the pathetic little thing you call ( ͡° ͜ʖ ͡°). You're ( ͡° ͜ʖ ͡°) dead, ( ͡° ͜ʖ ͡°). I can be ( ͡° ͜ʖ ͡°), anytime, and I can ( ͡° ͜ʖ ͡°) you in over seven hundred ( ͡° ͜ʖ ͡°), and that's just with my bare ( ͡° ͜ʖ ͡°). Not only am I extensively trained in ( ͡° ͜ʖ ͡°) combat, but I have access to the entire ( ͡° ͜ʖ ͡°) of the United States ( ͡° ͜ʖ ͡°) and I will use it to its full extent to wipe your miserable ( ͡° ͜ʖ ͡°) off the face of the ( ͡° ͜ʖ ͡°), you little ( ͡° ͜ʖ ͡°). If only you could have known what unholy retribution your little ( ͡° ͜ʖ ͡°) comment was about to bring down upon ( ͡° ͜ʖ ͡°), maybe you would have held your ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°). But you couldn't, you didn't, and now you're paying the price, you ( ͡° ͜ʖ ͡°). I will ( ͡° ͜ʖ ͡°) fury all over ( ͡° ͜ʖ ͡°) and ( ͡° ͜ʖ ͡°) will ( ͡° ͜ʖ ͡°) in it. You're ( ͡° ͜ʖ ͡°) dead, ( ͡° ͜ʖ ͡°).","tags":"#general#donger#navy#seal#lenny","favourites":1385,"__v":0,"created_on":"2015-03-17T21:47:22.372Z","score":0.003481200421093591},{"_id":"55e79068ee33c6aa3d629de3","id":2098,"pasta":"Life is like a cabbage: Sometimes it is green and crunchy, sometimes dad stabs the cat with a knife because his foot ball team lose again\n\nLife is like a cabbage: sometimes it is green and round, and sometimes mom wish you were never born\n\nIf you throw a cabbage in the air he will alway come right back down to you because he is lonely without you.\n\nIf there is a fire in your house make sure you save all the cabbages before you even think about finding your children\n\nA cabbage does not wear a watch but he always have time for you\n\nInstead of drinking coffee in the morning try laying down with a cabbage on your stomach and you will be wide awake trust me\n\nIf you push a cabbage under water he will alway float right back up to the top because he miss you so much\n\nA cabbage does not have ears but that does not mean that he is immune to your lies\n\nSome time you think about a cabbage and you get so excited that forget to go to sleep again for five days\n\nSometimes you hate your life and dont want to be alive anymore but then you think about cabbage and know that everything will be ok\n\nYou can paint a cabbage green but that is a waste of paint because he is already green you idiot\n\nIf you run out of pillows maybe try using a cabbage\n\nYou can tell a cabbage has gone bad if he is wearing a leather jacket\n\nif you are sad put a cabbage in your back pack and carry him every where so it feel like you have a friend that want to spend time with you\n\nA cabbage is so pretty but you are real ugly\n\nYou can ask a cabbage for financial advice but he will not say any thing because he is a cabbage\n\nYou can put a cabbage on the hood of your car. People will not under stand what you are doing but at least you are doing some thing\n\nIf you put plastic eyeballs on a cabbage and take him to the movies it might feel like you have a friend I hate my life\n\nDr. Suess did not ever make a poem about cababge And now he is dead\n\nA cabbage can not get pregnant believe me I tried\n\nYou can put a cabbage in a baby carriage amd take him for a walk and people will say \"who this\" and you can say \"he is my cabbaby\"\n\nIf you want to trick your parents put a cabbage on your pillow at night and they will think you are sleeping but you are actually crying","tags":"#general#Cabbage#Life#NiceLayers","favourites":1265,"__v":0,"created_on":"2015-09-03T00:12:24.410Z","score":0.005561461227465662},{"_id":"55087df39c40b7580599849f","id":1048,"pasta":"hi every1 im new!!!!!!! holds up spork my name is katy but u can call me t3h PeNgU1N oF d00m!!!!!!!! lol…as u can see im very random!!!! thats why i came here, 2 meet random ppl like me _… im 13 years old (im mature 4 my age tho!!) i like 2 watch invader zim w/ my girlfreind (im bi if u dont like it deal w/it) its our favorite tv show!!! bcuz its SOOOO random!!!! shes random 2 of course but i want 2 meet more random ppl =) like they say the more the merrier!!!! lol…neways i hope 2 make alot of freinds here so give me lots of commentses!!!!\nDOOOOOMMMM!!!!!!!!!!!!!!!! <--- me bein random again _^ hehe…toodles!!!!!\n\nlove and waffles,\n\nt3h PeNgU1N oF d00m","tags":"#Katy#spork#PenguinOfDoom#4chan#reddit","favourites":1159,"__v":0,"created_on":"2015-03-17T18:57:02.418Z","score":0.002999660421156955},{"_id":"54b3239ec17052750ece1b3e","id":46,"pasta":"What the fuck did you just fucking say about me, you little bitch? I’ll have you know I graduated top of my class in the Navy Seals, and I’ve been involved in numerous secret raids on Al-Quaeda, and I have over 300 confirmed kills. I am trained in gorilla warfare and I’m the top sniper in the entire US armed forces. You are nothing to me but just another target. I will wipe you the fuck out with precision the likes of which has never been seen before on this Earth, mark my fucking words. You think you can get away with saying that shit to me over the Internet? Think again, fucker. As we speak I am contacting my secret network of spies across the USA and your IP is being traced right now so you better prepare for the storm, maggot. The storm that wipes out the pathetic little thing you call your life. You’re fucking dead, kid. I can be anywhere, anytime, and I can kill you in over seven hundred ways, and that’s just with my bare hands. Not only am I extensively trained in unarmed combat, but I have access to the entire arsenal of the United States Marine Corps and I will use it to its full extent to wipe your miserable ass off the face of the continent, you little shit. If only you could have known what unholy retribution your little “clever” comment was about to bring down upon you, maybe you would have held your fucking tongue. But you couldn’t, you didn’t, and now you’re paying the price, you goddamn idiot. I will shit fury all over you and you will drown in it. You’re fucking dead, kiddo.","tags":"#general#navy#seal#kiddo#gorilla#warfare","favourites":994,"__v":0,"created_on":"2015-01-12T01:30:01.410Z","score":0.0022525392474688375},{"_id":"55097608b47c3d010fd96603","id":1185,"pasta":"ヽ༼ຈل͜ຈ༽ﾉ ʀᴀɪsᴇ ᴜʀ ᴅᴏɴɢᴇʀs ヽ༼ຈل͜ຈ༽ﾉ\n(ง°ل͜°)ง I TRIED TO SILENCE MY DONGER ONCE; BOY THAT WENT WELL (ง°ل͜°)ง\nᕦ༼ຈل͜ຈ༽ᕤ Flex your dongers ᕦ༼ຈل͜ຈ༽ᕤ\nᕦ༼ຈل͜ຈ༽ᕤ ＤＯ ＹＯＵ ＥＶＥＮ ＤＯＮＧ? ᕦ༼ຈل͜ຈ༽ᕤ\n┌༼ຈل͜ຈ༽┐ lower your dongers ┌༼ຈل͜ຈ༽┐\n(ง ͠° ل͜ °)ง THE UNSEEN DONGER IS THE DEADLIEST (ง ͠° ل͜ °)ง\n(ง ͠° ل͜ °)ง heres a tip. And a dong behind it (ง ͠° ل͜ °)ง\n(ง ͠ ͠° ل͜ °)ง ᴛᴏ ᴅᴏɴɢᴇʀ, ᴏʀ ɴᴏᴛ ᴛᴏ ᴅᴏɴɢᴇʀ (ง ͠ ͠° ل͜ °)ง\n(ง ͠ ͠° ل͜ °)ง sᴏᴜɴᴅs ᴅᴏɴɢᴇʀᴏᴜs... ɪᴍ ɪɴ (ง ͠ ͠° ل͜ °)ง\n(ง ͠° ل͜ °)ง ᴍᴀsᴛᴇʀ ʏᴏᴜʀ ᴅᴏɴɢᴇʀ, ᴍᴀsᴛᴇʀ ᴛʜᴇ ᴇɴᴇᴍʏ (ง ͠° ل͜ °)ง\n(ง ͠ ͠° ل͜ °)ง ᴛʜᴇ ᴅᴏɴɢᴇʀ ᴀʟsᴏ ʀɪsᴇs (ง ͠ ͠° ل͜ °)ง\n(ง ͠ ͠° ل͜ °)ง YOUR DONGERS ARE INFERIOR (ง ͠ ͠° ل͜ °)ง\n(ง ͠ ͠° ل͜ °)ง MY RIGHT DONGER IS A LOT STRONGER THAN MY LEFT DONGER (ง ͠ ͠° ͟ل͜ ͡°)ง\n(ง ͠ ͠° ل͜ °)ง NEVER UNDERESTIMATE THE POWER OF THE DONGER (ง ͠ ͠° ل͜ °)ง\nヽ( ° ͜ʖ͡°)ﾉ ʀuʙ ᴍʏ ᴅᴏɴɢᴇʀ ヽ( ° ͜ʖ͡°)ﾉ\n(ง •̀_•́)ง focus your dongers (ง •̀_•́)ง\n༼ ºل͟º༼ ºل͟º༼ ºل͟º༼ ºل͟º ༽ºل͟º ༽ºل͟º ༽YOU CAME TO THE WRONG DONGERHOOD༼ ºل͟º༼ ºل͟º༼ ºل͟º༼ ºل͟º ༽ºل͟º ༽ºل͟º ༽\n༼ ºل͟º ༼ ºل͟º ༼ ºل͟º ༽ ºل͟º ༽ ºل͟º ༽ YOU PASTARINO'D THE WRONG DONGERINO ༼ ºل͟º ༼ ºل͟º ༼ ºل͟º ༽ ºل͟º ༽ ºل͟º ༽\n༼ ºل͟º༼ ºل͟º༽ºل͟º ༽ YOU COPERINO﻿ FRAPPUCCIONO PASTARINO'D THE WRONG DONGERINO ༼ ºل͟º༼ ºل͟º༽ºل͟º ༽\n༼ ºل͟º༼ ºل͟º༼ ºل͟º༼ ºل͟º ༽ºل͟º ༽ºل͟º ༽You either die a DONG, or live long enough to become the DONGER༼ ºل͟º༼ ºل͟º༼ ºل͟º༼ ºل͟º ༽ºل͟º ༽ºل͟º ༽\nᕙ༼ຈل͜ຈ༽ᕗ. ʜᴀʀᴅᴇʀ,﻿ ʙᴇᴛᴛᴇʀ, ғᴀsᴛᴇʀ, ᴅᴏɴɢᴇʀ .ᕙ༼ຈل͜ຈ༽ᕗ\n(ง ͠° ل͜ °)ง LET ME DEMONSTRATE DONGER DIPLOMACY (ง ͠° ل͜ °)ง\n(ง'̀-'́)ง ＤＯＮＧ ＯＲ ＤＩＥ (ง'̀-'́)ง\nヽ༼ຈل͜ຈ༽ﾉ raise your dongers ヽ༼ຈل͜ຈ༽ﾉ\nヽ༼ຈل͜ຈ༽ﾉ VOICE OF AN ANGEL ヽ༼ຈل͜ຈ༽ﾉ\nヽ༼ຈل͜ຈ༽ﾉ LETS GET DONGERATED ヽ༼ຈل͜ຈ༽ﾉ\nヽ༼ຈل͜ຈ༽ﾉ RAISE YOUR BARNO ヽ༼ຈل͜ຈ༽ﾉ\nヽ༼ຈل͜ຈ༽ﾉITS A HARD DONG LIFE ヽ༼ຈل͜ຈ༽ﾉ\nヽ༼ຈل͜ຈ༽ﾉ \"I have a dong\" ヽ༼ຈل͜ຈ༽ﾉ - Martin Luther King Jr.\nヽ༼ຈل͜ຈ༽ﾉ WHAT DOESNT KILL ME ONLY MAKES ME DONGER ᕙ༼ຈل͜ຈ༽ᕗ\nノ(ಠ_ಠノ ) ʟᴏᴡᴇʀ ʏᴏᴜʀ ᴅᴏɴɢᴇʀs ノ(ಠ_ಠノ)\nヽ༼Ὸل͜ຈ༽ﾉ HOIST THY DONGERS ヽ༼Ὸل͜ຈ༽ﾉ\n༼ ºل͟º ༽ I AM A DONG ༼ ºل͟º ༽\n༼ ºل͟º༽ I DIDN'T CHOOSE THE DONGLIFE, THE DONGLIFE CHOSE ME ༼ ºل͟º༽\n༼ ºل͟º༽ NO ONE CARED WHO I WAS UNTIL I PUT ON THE DONG ༼ ºل͟º༽\n༼ ºººººل͟ººººº ༽ I AM SUPER DONG ༼ ºººººل͟ººººº ༽\n┌∩┐༼ ºل͟º ༽┌∩┐ SUCK MY DONGER ┌∩┐༼ ºل͟º ༽┌∩┐\nζ༼Ɵ͆ل͜Ɵ͆༽ᶘ FINALLY A REAL DONG ζ༼Ɵ͆ل͜Ɵ͆༽ᶘ\n<ᴍᴇssᴀɢᴇ ᴅᴏɴɢᴇʀᴇᴅ>\nヽ༼ʘ̚ل͜ʘ̚༽ﾉIS THAT A DONGER IN YOUR POCKET?ヽ༼ʘ̚ل͜ʘ̚༽ﾉ\n༼ ͡■ل͜ ͡■༽ OPPA DONGER STYLE ༼ ͡■ل͜ ͡■༽\n( ° ͜ ʖ °) REGI OP ( ° ͜ ʖ °)\n(▀̿ ̿Ĺ̯̿̿▀̿ ̿) IM DONG,JAMES DONG (▀̿ ̿Ĺ̯̿̿▀̿ ̿)\n(ง⌐□ل͜□)ง WOULD YOU HIT A DONGER WITH GLASSES (ง⌐□ل͜□)ง\nʕ•ᴥ•ʔ CUDDLE UR DONGERS ʕ•ᴥ•ʔ\nლ(́◉◞౪◟◉‵ლ) let me hold your donger for a while ლ(́◉◞౪◟◉‵ლ)\nヽ༼ຈل͜ຈ༽ง MY RIGHT DONG IS ALOT STRONGER THAN MY LEFT ONE ヽ ༼ຈل͜ຈ༽ง\n(✌ﾟ∀ﾟ)☞ May the DONG be with you! ☚(ﾟヮﾟ☚)\nѰζ༼ᴼل͜ᴼ༽ᶘѰ HIT IT WITH THE FORK Ѱζ༼ᴼل͜ᴼ༽ᶘѰ\n(ง ͡ʘ ͜ʖ ͡ʘ)ง GO FABBBYYY GO (ง ͡ʘ ͜ʖ ͡ʘ)ง\n( ° ͡ ͜ ͡ʖ ͡ °)ﾉ RAISE YOUR GENJAS ヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉ\n༼ ºل͟º༼ ºل͟º༽ºل͟º ༽ Chester Cheeto Support our Dongers ༼ ºل͟º༼ ºل͟º༽ºل͟º ༽\nヽ༼ຈل͜ຈ༽ﾉ NEVER UNDERESTIMATE THE POWER OF THE DONG CODE ヽ༼ຈل͜ຈ༽ﾉ\nヽ༼° ل͜ °༽ﾉ DONGMACIA NOW AND FOREVER ヽ༼° ل͜ °༽ﾉ\n(ง ͠° ل͜ °)ง DON'T YOU DONG ME, SUMMONER?? (ง ͠° ل͜ °)ง\nง ͠° ل͜ °)ง MASTER YOUR DONGER, MASTER THE ENEMY (ง ͠° ل͜ °)ง\n(ง ͠° ل͜ °)ง FOR MY FATHER THE DONG (ง ͠° ل͜ °)ง\n╭∩╮( °﻿ ͜ʖ͡°)wнαт doeѕɴт ĸιll мe мαĸeѕ мe doɴɢer ( °﻿ ͜ʖ͡°)╭∩╮\n(ง ͠° ل͜ °)ง KNOWN IF THE DONGERS WERE TURNED I WOULD SHOW YOU NO DONG (ง ͠° ل͜ °)ง\n(っ◕‿◕)っpenetrate nintendude's anus (っ◕‿◕)っ\n(ง ͠° ل͜ °)ง Your donger belongs in a museum (ง ͠° ل͜ °)ง\nヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉ YOU CAME TO THE WRONG GENJAHOOD ヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉ\n( ° ͜ʖ͡°) Mom always said my donger was big for my age ( ° ͜ʖ͡°)\n( ° ͜ʖ͡°) I WAS BORN WITH A NEEDLESSLY LARGE DONGER ( ° ͜ʖ͡°)\n( ° ͜ʖ͡°) IS THAT A DONGER IN YOUR POCKET? ( ° ͜ʖ͡°)\n(ง ͠° ل͜ °)ง Vi? Stands For DONGER (ง ͠° ل͜ °)ง\nヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉ I BELIEVE I CAN DONGヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉ\nΨ༼ຈل͜ຈ༽Ψ﻿ HIT IT WITH A DONGER Ψ༼ຈل͜ຈ༽Ψ\n༼ʘ̚ل͜ʘ̚༽ I NEED A DONGTOR ༼ʘ̚ل͜ʘ̚༽\nヽ༼ຈل͜ຈ༽ﾉ Darude your Sandstorms ヽ༼ຈل͜ຈ༽ﾉ\n༼ ºل͟º༼ ºل͟º༼ ºل͟º༼ ºل͟º ༽ºل͟º ༽ºل͟º ༽ºل͟º ༽ 7 DEADLY DONGERS ༼ ºل͟º༼ ºل͟º༼ ºل͟º༼ ºل͟º ༽ºل͟º ༽ºل͟º ༽ºل͟º ༽\nヽ( ͝° ͜ʖ͡°)ﾉ IMAGINE IF I HAD A REAL DONGER ヽ( ͝° ͜ʖ͡°)ﾉ\n~(˘▾˘~) Wave Your Dongers (~˘▾˘)~\nwork it ᕙ༼ຈل͜ຈ༽ᕗ harder make it (ง •̀_•́)ง better do it ᕦ༼ຈل͜ຈ༽ᕤ faster raise ur ヽ༼ຈل͜ຈ༽ﾉ donger\nɳ༼ຈل͜ຈ༽ɲ more than ever hour after ɳ༼ຈل͜ຈ༽ɲ\nヽ ༼ຈل͜ຈ༽ﾉ our work is always dongers ヽ༼ຈل͜ຈ༽ﾉ\nヽ༼ຈل͜ຈ༽ﾉ FOREVER DONG ヽ༼ຈل͜ຈ༽ﾉ\n༼ ºل͟º ༼ ºل͟º ( ° ͡ ͜ ͡ʖ ͡ °) ºل͟º ༽ ºل͟º ༽ 5 MEN 1 DREAM 9 EYEBROWS ༼ ºل͟º ༼ ºل͟º( ° ͡ ͜ ͡ʖ ͡ °) ºل͟º ༽ ºل͟","tags":"#general#oh#god#the#dongers#long#list#all","favourites":858,"__v":0,"created_on":"2015-03-18T12:54:20.125Z","score":0.0023387312789649142},{"_id":"5508934e65f4abef0cfbe4fa","id":1054,"pasta":"What the dank did you just blazing say about me, you little meme? I’ll have you know I ayy’d top of my lmao in the Dank Memers, and I’ve been involved in numerous secret raids on 9GAG, and I have over 420 confirmed memes. I am trained in gnome warfare and I’m the top sweglord in the entire /r/dank_meme forces. You are nothing to me but just another 9Fag. I will smoke you the fuck out with memes the likes of which have never been seen before on this Earth, mark my fucking words. You think you can get away with saying that shit to me over the Internet? Think again, memer. As we speak I am posting my secret network of dank memes across reddit and your karma is being rekt right now so you better prepare for the storm, shitposter. The storm that wipes out the pathetic little thing you call your karma. You’re fucking downvoted, kid. I can meme anywhere, anytime, and I can dank you in over sixty nine ways, and that’s just with non-dank memes. Not only am I extensively trained in danked memeing, but I have access to the entire stash of Snoop’s dankest kush and I will use it to its full extent to blaze your miserable memes off the face of the thread, you little shit. If only you could have known what unholy retribution your little “clever” comment was about to bring down upon you, maybe you wouldn’t have posted those shitty memes. But you did, you had to, and now you’re paying the price, you little 4chan. I will blow my dank smoke all over you and you will choke in it. You’re fucking memed, kiddo.","tags":"#general#navy#seal#dank#memes","favourites":819,"__v":0,"created_on":"2015-03-17T20:32:08.749Z","score":0.0022456954402315234},{"_id":"54bc36b17a2aab2665bc536d","id":256,"pasta":"卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐\n Repost this windmill of friendship if you think \n\n     Europe should embrace racial diversity \n卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐 卐","tags":"#twitch#reddit#windmill#friendship","favourites":719,"__v":0,"created_on":"2015-01-18T20:11:47.655Z","score":0.001746326656237385},{"_id":"5508cd9cb47c3d010fd96548","id":1106,"pasta":"(╯°□°）╯︵ ┻━┻","tags":"#twitch#general#flip#table","favourites":708,"__v":0,"created_on":"2015-03-18T00:48:54.478Z","score":0.0019896406175108536},{"_id":"5508948165f4abef0cfbe4fb","id":1055,"pasta":"Who is this\n>Semen Demon\n>Jizz Genie\n>Baby Batter Bringer\n>Cum Caresser\n>Lovegoo Lass\n>Sperm Summoner\n>Ejaculate Empress\n>Mayonnaise Maiden\n>Jizz Jockey\n>Spunk Monk\n>Sodomy Sentinel\n>Penile Perpetrator\n>Erection Confection\n>Salami Tsunami\n>Boner Condoner\n>Fluid Druid\n>Urethral Umpire\n>Wang Wizard\n>Knackers Knight\n>Prick Pirate\n>Dong Dominator\n>Cock Khan\n>Stiffy Sultan\n>Sausage Sergeant\n>Middle Leg Major\n>Pole Privateer\n>Shaft Specialist\n>Pecker Prodigy\n>Boner Benefactor\n>Baloney Poney Behemoth\n>Dick Juice Masseuse\n>Tallywhacker Smacker\n>Man Muscle Steam Shovel\n>Baby Batter Bladder\n>Willy Ghillie\n>Butt Hut\n>Glans Fans\n>Spooge Scrooge\n>Ejaculate Advocate\n>Skeet Treat\n>Wang Wrangler\n>Jism Prism\n>Smegma Savant\n>Anal Aficionado\n>Testicular Temptress","tags":"#general#alliteration#love","favourites":684,"__v":0,"created_on":"2015-03-17T20:32:39.158Z","score":0.0019322979326010649},{"_id":"5508814c9c40b758059984a6","id":1052,"pasta":"Omg hai ___^ I’m anon-san and I absolutely luuuv @__@ anime <3 and my fav is naurto!!! Okies so anyways, im going to tell you about the BEST day of my life when I met my hot husband sasuke!! <333333333 OMFGZ HE WAS SOOOOO FREAKIN KAWAII IN PERSON!!! Supa kawaii desu!!!!!!!! ^___________________________________^\nWhen I walked onto Tokyo street =____=I looked up and saw…SASUKE!!!!!!!!!!!!!!! <33333333333333333333333333333333333333333333333333333333333333!!!! “ KONNICHIWA OMGZZZZZZZZZZZZZZZZ SUPA SUPA SUPA KAWAII SASUKE-SAMA!!!!!” I yelled n____n then he turned chibi then un-chibi!! he looked at me [O.O;;;;;;;;;;;] and then he saw how hot I am *___* he grabbed my hand and winked ~_^ then pulled me behind a pocky shop o_o and started to kiss me!!!!!! [OMG!!! HIS TOUNGE TASTED LIKE RAMEN!!! RLY!! >.> <.< >.< (O) (O) (O)] then I saw some baka fat bitch watching us and I could tell she was undressing him with her eyes!!!!!!! [ -___________-;;;;; OMG I COULDN’T BELIEVE IT EITHER!!! (ò_ó) (ò_ó) (ò_ó)] so I yelled “UH UH BAKA NEKO THAT’S MY MAN WHY DON’T YOU GO HOOK UP WITH NARUTO CAUSE SASUKE-SAMA LOVES ME!!! (ò_ó)” then sasuke held me close =^= and said he would only ever love me and kissed me again!!!!!!! ** (O)/ then we went to his apartment and banged all night long and made 42 babies and they all became ninjas!!!!!!!!!!!!!!! Nyaaaaa!!! (^___<) ^______________;;;;;;;;;;;;;;;;","tags":"#general#weeaboo#naruto#sasuke","favourites":631,"__v":0,"created_on":"2015-03-17T19:31:35.042Z","score":0.001806311259589636},{"_id":"550517d487d1bc685b1e9686","id":1029,"pasta":"I sexually Identify as a steel beam. Ever since 9/11 I dreamed of getting drawn closer and closer to my melting point by jet fuel under the Twin Tower letting them drop on disgusting foreigners. People say to me that a person being a steel beam is Impossible and I’m fucking retarded but I don’t care, I’m beautiful. I’m having a plastic surgeon install steel beams and jet fuel on my body. From now on I want you guys to call me “Steel Beam” and respect my right to not melt by jet fuel and kill needlessly. If you can’t accept me you’re a steeliphobe and need to check your metallic privilege. Thank you for being so understanding.","tags":"#general#sexually#identify#steel#beam","favourites":630,"__v":0,"created_on":"2015-03-15T05:25:32.492Z","score":0.0017918212108055743}]