[{"_id":"54c43ba5ed70401f791aa727","id":550,"pasta":"I probably shouldn't but just one more text fa- no. ̤Nͪo̓ ̹m̽oͅr͘e̊ THE DONGERS ma̎y͑b̊e ̧̎on̈́e̍ͩ̊ ̾m̳͉͒o̝̎r̠̀e͊̀ ̑I ̫̝͢c̝͌a̸̛̠͗n̢̼ͩ'̝͙t̀҉ ̠̣͐̎s͓̒ͥ͞to̝͉ͬ̃p̠ ̹M̆̌Ȗ͛S̥̖̼͗ͅT̛͔̪̯ͤ̓ ̈R̥̍̄̓͝A̭̼͔I̶͕S̨̝͕̹̅̈́̈́͘E̷̠̖͙̗̾̄ͣ͡ ̠̣̓̅ͧ̆ͥ͡͝Ḑ̰ͪͣͥ͊͞Ò̟͕̈́͢N̫̞̖͍͎ͫͯ̕Ğ̷̭͛̍̉Ę̤͕̂R̸̯̣̟̔S̫̭̽͛̈̇ ̣̙̆͑ͩ͢A̡̚y̤̣̦̓͆̏ͩY̗̻̗̣ͦ͘͡ ̜͇̿L̹̯͐͝m͚̲͖a͙̒̆͂̒͋Ỏ̫̲͏̨̡A̡̼̹̙̣͋ͤ͂̈̔Y̶̺͖̞̲͐́y̏y̛̗͇ͨy̧͍̮̙̓̿͐ͭY͕̙ͩ̊ͮ̄͗̂̅͘Y̛͎̲ͤy̢̗ͅ҉Y͍̪͍̐̎ͧYy̷̡̭̜y̲̗̬̤ͪ͋̽̎Ỷy͓̲̱͛͡Y̻Y̭Y̻͔̓͋ ͈͙̹͈̟̽̀ͫ̽l͙ͨ̀m̛͚͆͋͋ȧ̲͓͈̊o̹̮͌͗","tags":"#general#twitch#dongers#can't#stop#ayy#lmao","favourites":10,"__v":0,"created_on":"2015-01-25T00:38:17.767Z","score":0.0005572138118104325},{"_id":"54c42f7ced70401f791aa71e","id":546,"pasta":"( ͡° ͜ʖ ͡°) Eᴠᴇʀʏ 60 sᴇᴄᴏɴᴅs ɪɴ Mᴜʀɪᴄᴀ, 60,000 ʙᴜʀɢᴇʀs ᴀʀᴇ ᴅɪɢᴇsᴛᴇᴅ. Tᴏɢᴇᴛʜᴇʀ ᴡᴇ ᴄᴀɴ sᴛᴏᴘ ᴛʜɪs. Pʟᴇᴀsᴇ sᴘʀᴇᴀᴅ ᴛʜᴇ ᴡᴏʀᴅ. ( ͡° ͜ʖ ͡°)","tags":"#twitch#general#america#MURICA#burgers#digested","favourites":10,"__v":0,"created_on":"2015-01-24T23:49:07.850Z","score":0.0005568850628894819},{"_id":"54b470cf7622b32a1cea7b6b","id":80,"pasta":"Here's the thing. You said a \"ASCII is a copypasta.\"\nIs it in the same family? Yes. No one's arguing that.\nAs someone who is an autist who studies copypastas, I am telling you, specifically, in autism, no one calls ASCIIs copypastas. If you want to be \"specific\" like you said, then you should too. They're not the same thing.\nIf you're saying \"copypasta family\" you're referring to the autistic grouping of /r/copypasta, which includes things from neckbearded autists to highly intelligent apes like myself.\nSo your reasoning for calling ASCII a copypasta is because random people \"say that only autists use ASCII?\" Let's get dongers and creepypastas in there, then, too.","tags":"#reddit#ascii#unidan#copypasta#family","favourites":12,"__v":0,"created_on":"2015-01-13T01:11:34.270Z","score":0.0005437926045127622},{"_id":"54b60568f6a1885137f43cf7","id":197,"pasta":"Copypasta is internet slang for any block of text that gets copied and pasted over and over again, typically disseminated by individuals through online discussion forums and social networking sites. Although it shares some characteristics with spam in the sense they’re both unsolicited (and often considered a nuisance), copypastas are mainly spread through human operators whereas the latter is automatically generated by electronic messaging systems.","tags":"#general#copypasta#definition","favourites":9,"__v":0,"created_on":"2015-01-14T05:55:11.270Z","score":0.0004245673359763002},{"_id":"54bf0c362619c58503a1dc65","id":304,"pasta":"Hello, I am currently 15 years old and I want to become a Tusk the walrus. I know there’s a million people out there just like me, but I promise you I’m different. On December 14th, I’m moving to Antartica; home of the greatest walruses. I’ve already cut off my arms, and now slide on my stomach everywhere I go as training. I may not be a walrus yet, but I promise you if you give me a chance and the support I need, I will become the greatest walrus. Pls no copy pasterino cappucino fellucino dongerino","tags":"#general#twitch#walrus#15#years#old","favourites":7,"__v":0,"created_on":"2015-01-21T02:17:23.315Z","score":0.00037199391739335577},{"_id":"54c67eb6f63c027608a745d5","id":577,"pasta":"↓ ᶠᵘᶜᵏ ᵗʰᶦˢ ᵍᵘʸ ↓","tags":"#twitch#general#fuck#this#guy","favourites":6,"__v":0,"created_on":"2015-01-26T17:33:15.032Z","score":0.00035176212739710636},{"_id":"54c1da9415b4d6835b3394ec","id":515,"pasta":"if you’re reading this, you’ve been in coma for almost 20 years now. We’re trying a new technique. We don’t know where this message will end up in your dream, but we hope it works. Please wake up, we miss you.","tags":"#general#coma#20#years#dream#wake#up","favourites":6,"__v":0,"created_on":"2015-01-23T05:19:16.887Z","score":0.000331061780865326},{"_id":"54ce92d0574e442b035d5fca","id":656,"pasta":" ( ͡° ͜ʖ ͡°) Every 60 seconds in Brazil, Germany scores a goal. Together we can stop this. Please spread the word ( ͡° ͜ʖ ͡°)","tags":"#general#twitch#brazil#germany#60#seconds#goal","favourites":5,"__v":0,"created_on":"2015-02-01T18:10:59.696Z","score":0.0003265354850082863},{"_id":"54b335c69b268c8a13613afb","id":53,"pasta":"Here's the thing. You said \"SEALs are Special Forces.\"\nCan they fall under the same command? Yes. No one's arguing that, you little bitch.\nAs someone who has over 300 confirmed kills, I am telling you, specifically, in the military, no one calls SEALs SF. If you want to be \"specific\" like you said, then you shouldn't either. They're not the same thing.\nIf you're saying \"Special Operations\" you're referring to the United States Special Operations Command, which includes things from Army Rangers to my secret network of spies across the USA.\nSo your reasoning for calling a SEAL SF is because random people \"call the gorilla ones SF?\" Let's get SOW and MRR in there, then, too.\nAlso, calling someone DEVGRU or SEAL Team Six? It's not one or the other, that's not how Special Operations Command works. They're both. A SEAL is a SEAL and a member of USSOCOM. But that's not what you said. You said a SEAL is SF, which is not true unless you're okay with calling all operators of the USSOCOM family SF, which means you'd call Rangers, Pararescuemen, and other operators SF, too. Which you said you don't.\nIt's okay to just admit you're fucking dead, kiddo.","tags":"#reddit#navy#seals#unidan#kiddo","favourites":7,"__v":0,"created_on":"2015-01-12T02:45:52.974Z","score":0.00032365245007405106},{"_id":"54c332849f0237fc62377a2a","id":536,"pasta":"( ͡° ͜ʖ ͡°)","tags":"#twitch#general#le#lenny#face","favourites":5,"__v":0,"created_on":"2015-01-24T05:49:49.257Z","score":0.0002796944544235592},{"_id":"54c2c8e59f0237fc62377a14","id":526,"pasta":"EU was originally discovered when Walker texas ranger rode a horse across the atlantic and found himself there. he named it Eastern USA, or \"EU\" for short","tags":"#twitch#general#EU#USA#horse#east#walker#texas","favourites":5,"__v":0,"created_on":"2015-01-23T21:38:38.556Z","score":0.00027807122172663094},{"_id":"54b335309b268c8a13613af9","id":52,"pasta":"Okay. There's an incredibly easy way to solve this. Go to PM. Give me your Skype name. I'll add you and you can talk to me. I will also give you my LinkedIn profile. You can check it while you're talking to me and see that the photo and I are the same person, and also that I have almost a decade's worth of Australian reality TV productions under my belt. Amongst my contacts is the name of the current series producer of Australia's Next Top Model. You will be able to see that we've worked on several productions together. This is a 100% legitimate offer. You know why? I'm sick of little shits like you sitting there thinking you know ANYTHING about my industry. You don't know SHIT. So get your ass on Skype and I will show you exactly that. Ball's in your court. edit: And it you're too chickenshit to do that, you can go back through my history and see the numerous times I've talked about this subject on reddit in the last two years. edit2: Quick, I don't want you thinking you can wait three hours and then say I had time to fake stuff. Do it right now. Come on, you were quick enough to answer my first post. Within a minute, in fact. You're so damn confident, all over this thread, with your ignorant bullshit about an industry you're nowhere near. Step up, son. I'm already logged into Skype. edit3: No-show. Of course. Don't know what I was thinking. With a name like 'swagsmoker420', you're probably 12 fucking years old.","tags":"#reddit#skype#producer#swagsmoker420#","favourites":6,"__v":0,"created_on":"2015-01-12T02:44:52.846Z","score":0.00027802899743061937},{"_id":"54b3352f9b268c8a13613af8","id":51,"pasta":"Dear 4chan,\nCongratulations, you got a reaction from users. That's what you wanted, right? Well, I've decided I don't like people like you. You've messed with the community of the wrong psychopath. Before you get excited, you haven't even made me angry. I am a hard person to make angry. However, I despise people like you.\nYour pitiful hacking skills are hilarious. Hacking accounts and putting up proxies are level 1. Can you hack into encrypted files? Can you tear through firewalls without leaving a mark? Your silly little proxy won't protect you. I've hacked into many computers and spied on the users. I've hacked into games. I have been hacking since I had a computer. It's what I was raised to do.\nYou have no idea to the extent of fear which you should be feeling. All you are is just a community of internet creeps. Have you ever murdered anyone? I have no empathy and I will probably feel joy peeling your skin off your face.\nYou think I'm giving you an empty threat? Believe that. I have contacts in dark places that you don't want to know about. If you live even close to me you better fear for your life.\nTrack my IP if you want to, but I am smart enough to use a library computer. Hack into my account if you want, but it'll just make it easier for me to track you.\nWith love,\nA psychopath\nP.S. I would fear for your life while you still have it.","tags":"#tumblr#4chan#anon#hack","favourites":6,"__v":0,"created_on":"2015-01-12T02:43:47.191Z","score":0.00027802589820547744},{"_id":"54b3352b9b268c8a13613af6","id":49,"pasta":"I am very secure about my pizza. You have obviously never tasted pizza if you think mine look bad, and that is very sad for you. You should get a pizza right away so you will have some knowledge of pizza and not sound like a fool when you speak. Again, I would ask you to prove your own pizza making skills if you think you are capable of judging others so harshly. But that would require something well beyond your capabilities. You really should try pizza, it is quite delicious and you won't sound so stupid when you comment.","tags":"#reddit#secure#pizza#salt","favourites":6,"__v":0,"created_on":"2015-01-12T02:41:57.080Z","score":0.00027802070058740967},{"_id":"54c1da7215b4d6835b3394ea","id":513,"pasta":"☆ ☆ ☆ ☆ ☆ ☆ AMERICA☆ ☆ ☆ ☆ ☆ ☆ ☆ ☆ ☆ Land of the Free and the Fat☆ ☆ ☆ Home of the Burger☆ ☆ ☆ ☆ RACISM, CRIME, AND EQUALITY FOR ALL (but black people)☆ ☆ ☆ ☆ The Strongest Rascals in the World ☆ ☆ ☆ Copy and paste this if your a fat, proud American 9/11","tags":"#general#twitch#MURICA#fat#burger#racism#crime","favourites":5,"__v":0,"created_on":"2015-01-23T04:39:52.784Z","score":0.0002747579643057488}]