[{"_id":"5508b608b47c3d010fd964ef","id":1070,"pasta":"Due to extensive research done by the University of Pittsburgh, diamond has been confirmed as the hardest metal known to man. The research is as follows. Pocket-protected scientists built a wall of iron and crashed a diamond car into it at 400 miles per hour, and the car was unharmed. They then built a wall out of diamond and crashed a car made of iron moving at 400 miles an hour into the wall, and the wall came out fine. They then crashed a diamond car made of 400 miles per hour into a wall, and there were no survivors. They crashed 400 miles per hour into a diamond traveling at iron car. Western New York was powerless for hours. They rammed a wall of metal into a 400 mile per hour made of diamond, and the resulting explosion shifted the earth's orbit 400 million miles away from the sun, saving the earth from a meteor the size of a small Washington suburb that was hurtling towards mid-western Prussia at 400 billion miles per hour. They shot a diamond made of iron at a car moving at 400 walls per hour, and as a result caused over 9000 wayward airplanes to lose track of their bearings, and make a fatal crash with over 9000 buildings in downtown New York. They spun 400 miles at diamond into iron per wall. The results were inconclusive. Finally, they placed 400 diamonds per hour in front of a car made of wall traveling at miles per iron, and the result proved without a doubt that diamonds were the hardest metal of all time, if not the hardest metal known to man.","tags":"#general#miles#per#iron#diamonds#metal","favourites":153,"__v":0,"created_on":"2015-03-17T23:10:49.326Z","score":0.002152512403337108},{"_id":"550894c265f4abef0cfbe4fe","id":1058,"pasta":"There were a lot of things we couldn't do in an SR-71 Blackbird, but we were the fastest guys on the block and loved reminding our fellow aviators of this fact. People often asked us if, because of this fact, it was fun to fly the jet. Fun would not be the first word I would use to describe flying this plane - intense, maybe, even cerebral. But there was one day in our Sled experience when we would have to say that it was pure fun to be the fastest guys out there, at least for a moment.\n\nIt occurred when Walt and I were flying our final training sortie. We needed 100 hours in the jet to complete our training and attain Mission Ready status. Somewhere over Colorado we had passed the century mark. We had made the turn in Arizona and the jet was performing flawlessly. My gauges were wired in the front seat and we were starting to feel pretty good about ourselves, not only because we would soon be flying real missions but because we had gained a great deal of confidence in the plane in the past ten months. Ripping across the barren deserts 80,000 feet below us, I could already see the coast of California from the Arizona border. I was, finally, after many humbling months of simulators and study, ahead of the jet. I was beginning to feel a bit sorry for Walter in the back seat.\n\nThere he was, with no really good view of the incredible sights before us, tasked with monitoring four different radios. This was good practice for him for when we began flying real missions, when a priority transmission from headquarters could be vital. It had been difficult, too, for me to relinquish control of the radios, as during my entire flying career I had controlled my own transmissions. But it was part of the division of duties in this plane and I had adjusted to it. I still insisted on talking on the radio while we were on the ground, however. Walt was so good at many things, but he couldn't match my expertise at sounding smooth on the radios, a skill that had been honed sharply with years in fighter squadrons where the slightest radio miscue was grounds for beheading. He understood that and allowed me that luxury. Just to get a sense of what Walt had to contend with, I pulled the radio toggle switches and monitored the frequencies along with him.\n\nThe predominant radio chatter was from Los Angeles Center, far below us, controlling daily traffic in their sector. While they had us on their scope (albeit briefly), we were in uncontrolled airspace and normally would not talk to them unless we needed to descend into their airspace. We listened as the shaky voice of a lone Cessna pilot who asked Center for a read-out of his ground speed. Center replied: “November Charlie 175, I'm showing you at ninety knots on the ground.”\n\nNow the thing to understand about Center controllers was that whether they were talking to a rookie pilot in a Cessna or to Air Force One, they always spoke in the exact same, calm, deep, professional tone that made one feel important. I referred to it as the \"Houston Center voice.\" I have always felt that after years of seeing documentaries on this country's space program and listening to the calm and distinct voice of the Houston controllers, that all other controllers since then wanted to sound like that and that they basically did. And it didn't matter what sector of the country we would be flying in, it always seemed like the same guy was talking. Over the years that tone of voice had become somewhat of a comforting sound to pilots everywhere. Conversely, over the years, pilots always wanted to ensure that, when transmitting, they sounded like Chuck Yeager, or at least like John Wayne. Better to die than sound bad on the radios. Just moments after the Cessna's inquiry, a Twin Beech piped up on frequency, in a rather superior tone, asking for his ground speed in Beech. “I have you at one hundred and twenty-five knots of ground speed.”\n\nBoy, I thought, the Beechcraft really must think he is dazzling his Cessna brethren. Then out of the blue, a navy F-18 pilot out of NAS Lemoore came up on frequency. You knew right away it was a Navy jock because he sounded very cool on the radios. “Center, Dusty 52 ground speed check.” Before Center could reply, I'm thinking to myself, hey, Dusty 52 has a ground speed indicator in that million-dollar cockpit, so why is he asking Center for a read-out? Then I got it, ol' Dusty here is making sure that every bug smasher from Mount Whitney to the Mojave knows what true speed is. He's the fastest dude in the valley today, and he just wants everyone to know how much fun he is having in his new Hornet. And the reply, always with that same, calm, voice, with more distinct alliteration than emotion: “Dusty 52, Center, we have you at 620 on the ground.”\n\nAnd I thought to myself, is this a ripe situation, or what? As my hand instinctively reached for the mic button, I had to remind myself that Walt was in control of the radios. Still, I thought, it must be done - in mere seconds we'll be out of the sector and the opportunity will be lost. That Hornet must die, and die now. I thought about all of our Sim training and how important it was that we developed well as a crew and knew that to jump in on the radios now would destroy the integrity of all that we had worked toward becoming. I was torn. Somewhere, 13 miles above Arizona, there was a pilot screaming inside his space helmet. \n\nThen, I heard it - the click of the mic button from the back seat. That was the very moment that I knew Walter and I had become a crew. Very professionally, and with no emotion, Walter spoke: “Los Angeles Center, Aspen 20, can you give us a ground speed check?” There was no hesitation, and the replay came as if was an everyday request. “Aspen 20, I show you at one thousand eight hundred and forty-two knots, across the ground.”\n\nI think it was the forty-two knots that I liked the best, so accurate and proud was Center to deliver that information without hesitation, and you just knew he was smiling. But the precise point at which I knew that Walt and I were going to be really good friends for a long time was when he keyed the mic once again to say, in his most fighter-pilot-like voice: “Ah, Center, much thanks, we're showing closer to nineteen hundred on the money.” For a moment Walter was a god. And we finally heard a little crack in the armor of the Houston Center voice, when L.A. came back with, “Roger that Aspen. Your equipment is probably more accurate than ours. You boys have a good one.”\n\nIt all had lasted for just moments, but in that short, memorable sprint across the southwest, the Navy had been flamed, all mortal airplanes on freq were forced to bow before the King of Speed, and more importantly, Walter and I had crossed the threshold of being a crew. A fine day's work. We never heard another transmission on that frequency all the way to the coast. For just one day, it truly was fun being the fastest guys out there.","tags":"#general#blackbird","favourites":139,"__v":0,"created_on":"2015-03-17T20:20:03.823Z","score":0.001984159697997511},{"_id":"550894c765f4abef0cfbe4ff","id":1059,"pasta":"Hearing the difference now isn’t the reason to encode to FLAC. FLAC uses\nlossless compression, while MP3 is ‘lossy’. What this means is that for\neach year the MP3 sits on your hard drive, it will lose roughly 12kbps,\nassuming you have SATA – it’s about 15kbps on IDE, but only 7kbps on\nSCSI, due to rotational velocidensity. You don’t want to know how much\nworse it is on CD-ROM or other optical media.\n\nI started\ncollecting MP3s in about 2001, and if I try to play any of the tracks I\ndownloaded back then, even the stuff I grabbed at 320kbps, they just\nsound like crap. The bass is terrible, the midrange…well don’t get me\nstarted. Some of those albums have degraded down to 32 or even 16kbps.\nFLAC rips from the same period still sound great, even if they weren’t\nstored correctly, in a cool, dry place. Seriously, stick to FLAC, you\nmay not be able to hear the difference now, but in a year or two, you’ll\nbe glad you did.","tags":"#general#audio#FLAC","favourites":128,"__v":0,"created_on":"2015-03-17T20:29:34.751Z","score":0.0018515524746245792},{"_id":"55097608b47c3d010fd96603","id":1185,"pasta":"ヽ༼ຈل͜ຈ༽ﾉ ʀᴀɪsᴇ ᴜʀ ᴅᴏɴɢᴇʀs ヽ༼ຈل͜ຈ༽ﾉ\n(ง°ل͜°)ง I TRIED TO SILENCE MY DONGER ONCE; BOY THAT WENT WELL (ง°ل͜°)ง\nᕦ༼ຈل͜ຈ༽ᕤ Flex your dongers ᕦ༼ຈل͜ຈ༽ᕤ\nᕦ༼ຈل͜ຈ༽ᕤ ＤＯ ＹＯＵ ＥＶＥＮ ＤＯＮＧ? ᕦ༼ຈل͜ຈ༽ᕤ\n┌༼ຈل͜ຈ༽┐ lower your dongers ┌༼ຈل͜ຈ༽┐\n(ง ͠° ل͜ °)ง THE UNSEEN DONGER IS THE DEADLIEST (ง ͠° ل͜ °)ง\n(ง ͠° ل͜ °)ง heres a tip. And a dong behind it (ง ͠° ل͜ °)ง\n(ง ͠ ͠° ل͜ °)ง ᴛᴏ ᴅᴏɴɢᴇʀ, ᴏʀ ɴᴏᴛ ᴛᴏ ᴅᴏɴɢᴇʀ (ง ͠ ͠° ل͜ °)ง\n(ง ͠ ͠° ل͜ °)ง sᴏᴜɴᴅs ᴅᴏɴɢᴇʀᴏᴜs... ɪᴍ ɪɴ (ง ͠ ͠° ل͜ °)ง\n(ง ͠° ل͜ °)ง ᴍᴀsᴛᴇʀ ʏᴏᴜʀ ᴅᴏɴɢᴇʀ, ᴍᴀsᴛᴇʀ ᴛʜᴇ ᴇɴᴇᴍʏ (ง ͠° ل͜ °)ง\n(ง ͠ ͠° ل͜ °)ง ᴛʜᴇ ᴅᴏɴɢᴇʀ ᴀʟsᴏ ʀɪsᴇs (ง ͠ ͠° ل͜ °)ง\n(ง ͠ ͠° ل͜ °)ง YOUR DONGERS ARE INFERIOR (ง ͠ ͠° ل͜ °)ง\n(ง ͠ ͠° ل͜ °)ง MY RIGHT DONGER IS A LOT STRONGER THAN MY LEFT DONGER (ง ͠ ͠° ͟ل͜ ͡°)ง\n(ง ͠ ͠° ل͜ °)ง NEVER UNDERESTIMATE THE POWER OF THE DONGER (ง ͠ ͠° ل͜ °)ง\nヽ( ° ͜ʖ͡°)ﾉ ʀuʙ ᴍʏ ᴅᴏɴɢᴇʀ ヽ( ° ͜ʖ͡°)ﾉ\n(ง •̀_•́)ง focus your dongers (ง •̀_•́)ง\n༼ ºل͟º༼ ºل͟º༼ ºل͟º༼ ºل͟º ༽ºل͟º ༽ºل͟º ༽YOU CAME TO THE WRONG DONGERHOOD༼ ºل͟º༼ ºل͟º༼ ºل͟º༼ ºل͟º ༽ºل͟º ༽ºل͟º ༽\n༼ ºل͟º ༼ ºل͟º ༼ ºل͟º ༽ ºل͟º ༽ ºل͟º ༽ YOU PASTARINO'D THE WRONG DONGERINO ༼ ºل͟º ༼ ºل͟º ༼ ºل͟º ༽ ºل͟º ༽ ºل͟º ༽\n༼ ºل͟º༼ ºل͟º༽ºل͟º ༽ YOU COPERINO﻿ FRAPPUCCIONO PASTARINO'D THE WRONG DONGERINO ༼ ºل͟º༼ ºل͟º༽ºل͟º ༽\n༼ ºل͟º༼ ºل͟º༼ ºل͟º༼ ºل͟º ༽ºل͟º ༽ºل͟º ༽You either die a DONG, or live long enough to become the DONGER༼ ºل͟º༼ ºل͟º༼ ºل͟º༼ ºل͟º ༽ºل͟º ༽ºل͟º ༽\nᕙ༼ຈل͜ຈ༽ᕗ. ʜᴀʀᴅᴇʀ,﻿ ʙᴇᴛᴛᴇʀ, ғᴀsᴛᴇʀ, ᴅᴏɴɢᴇʀ .ᕙ༼ຈل͜ຈ༽ᕗ\n(ง ͠° ل͜ °)ง LET ME DEMONSTRATE DONGER DIPLOMACY (ง ͠° ل͜ °)ง\n(ง'̀-'́)ง ＤＯＮＧ ＯＲ ＤＩＥ (ง'̀-'́)ง\nヽ༼ຈل͜ຈ༽ﾉ raise your dongers ヽ༼ຈل͜ຈ༽ﾉ\nヽ༼ຈل͜ຈ༽ﾉ VOICE OF AN ANGEL ヽ༼ຈل͜ຈ༽ﾉ\nヽ༼ຈل͜ຈ༽ﾉ LETS GET DONGERATED ヽ༼ຈل͜ຈ༽ﾉ\nヽ༼ຈل͜ຈ༽ﾉ RAISE YOUR BARNO ヽ༼ຈل͜ຈ༽ﾉ\nヽ༼ຈل͜ຈ༽ﾉITS A HARD DONG LIFE ヽ༼ຈل͜ຈ༽ﾉ\nヽ༼ຈل͜ຈ༽ﾉ \"I have a dong\" ヽ༼ຈل͜ຈ༽ﾉ - Martin Luther King Jr.\nヽ༼ຈل͜ຈ༽ﾉ WHAT DOESNT KILL ME ONLY MAKES ME DONGER ᕙ༼ຈل͜ຈ༽ᕗ\nノ(ಠ_ಠノ ) ʟᴏᴡᴇʀ ʏᴏᴜʀ ᴅᴏɴɢᴇʀs ノ(ಠ_ಠノ)\nヽ༼Ὸل͜ຈ༽ﾉ HOIST THY DONGERS ヽ༼Ὸل͜ຈ༽ﾉ\n༼ ºل͟º ༽ I AM A DONG ༼ ºل͟º ༽\n༼ ºل͟º༽ I DIDN'T CHOOSE THE DONGLIFE, THE DONGLIFE CHOSE ME ༼ ºل͟º༽\n༼ ºل͟º༽ NO ONE CARED WHO I WAS UNTIL I PUT ON THE DONG ༼ ºل͟º༽\n༼ ºººººل͟ººººº ༽ I AM SUPER DONG ༼ ºººººل͟ººººº ༽\n┌∩┐༼ ºل͟º ༽┌∩┐ SUCK MY DONGER ┌∩┐༼ ºل͟º ༽┌∩┐\nζ༼Ɵ͆ل͜Ɵ͆༽ᶘ FINALLY A REAL DONG ζ༼Ɵ͆ل͜Ɵ͆༽ᶘ\n<ᴍᴇssᴀɢᴇ ᴅᴏɴɢᴇʀᴇᴅ>\nヽ༼ʘ̚ل͜ʘ̚༽ﾉIS THAT A DONGER IN YOUR POCKET?ヽ༼ʘ̚ل͜ʘ̚༽ﾉ\n༼ ͡■ل͜ ͡■༽ OPPA DONGER STYLE ༼ ͡■ل͜ ͡■༽\n( ° ͜ ʖ °) REGI OP ( ° ͜ ʖ °)\n(▀̿ ̿Ĺ̯̿̿▀̿ ̿) IM DONG,JAMES DONG (▀̿ ̿Ĺ̯̿̿▀̿ ̿)\n(ง⌐□ل͜□)ง WOULD YOU HIT A DONGER WITH GLASSES (ง⌐□ل͜□)ง\nʕ•ᴥ•ʔ CUDDLE UR DONGERS ʕ•ᴥ•ʔ\nლ(́◉◞౪◟◉‵ლ) let me hold your donger for a while ლ(́◉◞౪◟◉‵ლ)\nヽ༼ຈل͜ຈ༽ง MY RIGHT DONG IS ALOT STRONGER THAN MY LEFT ONE ヽ ༼ຈل͜ຈ༽ง\n(✌ﾟ∀ﾟ)☞ May the DONG be with you! ☚(ﾟヮﾟ☚)\nѰζ༼ᴼل͜ᴼ༽ᶘѰ HIT IT WITH THE FORK Ѱζ༼ᴼل͜ᴼ༽ᶘѰ\n(ง ͡ʘ ͜ʖ ͡ʘ)ง GO FABBBYYY GO (ง ͡ʘ ͜ʖ ͡ʘ)ง\n( ° ͡ ͜ ͡ʖ ͡ °)ﾉ RAISE YOUR GENJAS ヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉ\n༼ ºل͟º༼ ºل͟º༽ºل͟º ༽ Chester Cheeto Support our Dongers ༼ ºل͟º༼ ºل͟º༽ºل͟º ༽\nヽ༼ຈل͜ຈ༽ﾉ NEVER UNDERESTIMATE THE POWER OF THE DONG CODE ヽ༼ຈل͜ຈ༽ﾉ\nヽ༼° ل͜ °༽ﾉ DONGMACIA NOW AND FOREVER ヽ༼° ل͜ °༽ﾉ\n(ง ͠° ل͜ °)ง DON'T YOU DONG ME, SUMMONER?? (ง ͠° ل͜ °)ง\nง ͠° ل͜ °)ง MASTER YOUR DONGER, MASTER THE ENEMY (ง ͠° ل͜ °)ง\n(ง ͠° ل͜ °)ง FOR MY FATHER THE DONG (ง ͠° ل͜ °)ง\n╭∩╮( °﻿ ͜ʖ͡°)wнαт doeѕɴт ĸιll мe мαĸeѕ мe doɴɢer ( °﻿ ͜ʖ͡°)╭∩╮\n(ง ͠° ل͜ °)ง KNOWN IF THE DONGERS WERE TURNED I WOULD SHOW YOU NO DONG (ง ͠° ل͜ °)ง\n(っ◕‿◕)っpenetrate nintendude's anus (っ◕‿◕)っ\n(ง ͠° ل͜ °)ง Your donger belongs in a museum (ง ͠° ل͜ °)ง\nヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉ YOU CAME TO THE WRONG GENJAHOOD ヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉ\n( ° ͜ʖ͡°) Mom always said my donger was big for my age ( ° ͜ʖ͡°)\n( ° ͜ʖ͡°) I WAS BORN WITH A NEEDLESSLY LARGE DONGER ( ° ͜ʖ͡°)\n( ° ͜ʖ͡°) IS THAT A DONGER IN YOUR POCKET? ( ° ͜ʖ͡°)\n(ง ͠° ل͜ °)ง Vi? Stands For DONGER (ง ͠° ل͜ °)ง\nヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉ I BELIEVE I CAN DONGヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉ\nΨ༼ຈل͜ຈ༽Ψ﻿ HIT IT WITH A DONGER Ψ༼ຈل͜ຈ༽Ψ\n༼ʘ̚ل͜ʘ̚༽ I NEED A DONGTOR ༼ʘ̚ل͜ʘ̚༽\nヽ༼ຈل͜ຈ༽ﾉ Darude your Sandstorms ヽ༼ຈل͜ຈ༽ﾉ\n༼ ºل͟º༼ ºل͟º༼ ºل͟º༼ ºل͟º ༽ºل͟º ༽ºل͟º ༽ºل͟º ༽ 7 DEADLY DONGERS ༼ ºل͟º༼ ºل͟º༼ ºل͟º༼ ºل͟º ༽ºل͟º ༽ºل͟º ༽ºل͟º ༽\nヽ( ͝° ͜ʖ͡°)ﾉ IMAGINE IF I HAD A REAL DONGER ヽ( ͝° ͜ʖ͡°)ﾉ\n~(˘▾˘~) Wave Your Dongers (~˘▾˘)~\nwork it ᕙ༼ຈل͜ຈ༽ᕗ harder make it (ง •̀_•́)ง better do it ᕦ༼ຈل͜ຈ༽ᕤ faster raise ur ヽ༼ຈل͜ຈ༽ﾉ donger\nɳ༼ຈل͜ຈ༽ɲ more than ever hour after ɳ༼ຈل͜ຈ༽ɲ\nヽ ༼ຈل͜ຈ༽ﾉ our work is always dongers ヽ༼ຈل͜ຈ༽ﾉ\nヽ༼ຈل͜ຈ༽ﾉ FOREVER DONG ヽ༼ຈل͜ຈ༽ﾉ\n༼ ºل͟º ༼ ºل͟º ( ° ͡ ͜ ͡ʖ ͡ °) ºل͟º ༽ ºل͟º ༽ 5 MEN 1 DREAM 9 EYEBROWS ༼ ºل͟º ༼ ºل͟º( ° ͡ ͜ ͡ʖ ͡ °) ºل͟º ༽ ºل͟","tags":"#general#oh#god#the#dongers#long#list#all","favourites":124,"__v":0,"created_on":"2015-03-18T12:54:20.125Z","score":0.0018124114885651856},{"_id":"54b2ee7bce7b585004706dc5","id":44,"pasta":"I sexually Identify as an Attack Helicopter. Ever since I was a boy I dreamed of soaring over the oilfields dropping hot sticky loads on disgusting foreigners. People say to me that a person being a helicopter is Impossible and I'm fucking retarded but I don't care, I'm beautiful. I'm having a plastic surgeon install rotary blades, 30 mm cannons and AMG-114 Hellfire missiles on my body. From now on I want you guys to call me \"Apache\" and respect my right to kill from above and kill needlessly. If you can't accept me you're a heliphobe and need to check your vehicle privilege. Thank you for being so understanding.","tags":"#general#tumblr#attack#helicopter#reynad","favourites":164,"__v":0,"created_on":"2015-01-11T21:42:07.663Z","score":0.0014941743183750033},{"_id":"54b344916bd15d33165d28a9","id":55,"pasta":"My Grandfather smoked his whole life. I was about 10 years old when my mother said to him, 'If you ever want to see your grandchildren graduate, you have to stop immediately.'. Tears welled up in his eyes when he realized what exactly was at stake. He gave it up immediately. Three years later he died of lung cancer. It was really sad and destroyed me. My mother said to me- 'Don't ever smoke. Please don't put your family through what your Grandfather put us through.\" I agreed. At 28, I have never touched a cigarette. I must say, I feel a very slight sense of regret for never having done it, because your post gave me cancer anyway.","tags":"#reddit#cancer#post#smoking#grandpa","favourites":131,"__v":0,"created_on":"2015-01-12T03:03:39.683Z","score":0.001238986288313797},{"_id":"54f2b8cd87d1bc685b1e95c8","id":943,"pasta":"░░░░█▒▒▄▀▀▀▀▀▄▄▒▒▒▒▒▒▒▒▒▄▄▀▀▀▀▀▀▄\n░░▄▀▒▒▒▄█████▄▒█▒▒▒▒▒▒▒█▒▄█████▄▒█\n░█▒▒▒▒▐██▄████▌▒█▒▒▒▒▒█▒▐██▄████▌▒█\n▀▒▒▒▒▒▒▀█████▀▒▒█▒░▄▒▄█▒▒▀█████▀▒▒▒█\n▒▒▐▒▒▒░░░░▒▒▒▒▒█▒░▒▒▀▒▒█▒▒▒▒▒▒▒▒▒▒▒▒█\n▒▌▒▒▒░░░▒▒▒▒▒▄▀▒░▒▄█▄█▄▒▀▄▒▒▒▒▒▒▒▒▒▒▒▌\n▒▌▒▒▒▒░▒▒▒▒▒▒▀▄▒▒█▌▌▌▌▌█▄▀▒▒▒▒▒▒▒▒▒▒▒▐\n▒▐▒▒▒▒▒▒▒▒▒▒▒▒▒▌▒▒▀███▀▒▌▒▒▒▒▒▒▒▒▒▒▒▒▌\n▀▀▄▒▒▒▒▒▒▒▒▒▒▒▌▒▒▒▒▒▒▒▒▒▐▒▒▒▒▒▒▒▒▒▒▒█\n▀▄▒▀▄▒▒▒▒▒▒▒▒▐▒▒▒▒▒▒▒▒▒▄▄▄▄▒▒▒▒▒▒▄▄▀\n▒▒▀▄▒▀▄▀▀▀▄▀▀▀▀▄▄▄▄▄▄▄▀░░░░▀▀▀▀▀▀\n▒▒▒▒▀▄▐▒▒▒▒▒▒▒▒▒▒▒▒▒▐\n░▄▄▄░░▄░░▄░▄░░▄░░▄░░░░▄▄░▄▄░░░▄▄▄░░░▄▄▄\n█▄▄▄█░█▄▄█░█▄▄█░░█░░░█░░█░░█░█▄▄▄█░█░░░█\n█░░░█░░█░░░░█░░░░█░░░█░░█░░█░█░░░█░█░░░█\n▀░░░▀░░▀░░░░▀░░░░▀▀▀░░░░░░░░░▀░░░▀░▀▄▄▄▀﻿","tags":"#general#ayy#lmao#alien#ASCII","favourites":75,"__v":0,"created_on":"2015-03-01T06:59:21.552Z","score":0.0010448965424591915},{"_id":"5508c0d0b47c3d010fd9650f","id":1084,"pasta":"Dude you need to quit fucking snap chatting mckenna. Stop. She doesn't respond with anything meaningful for a reason and she's not interested in you.\n\nWho am I?\n\nThe man whom she is in love with.\n\nShe already told me not to worry, she's not interested in you. Sorry I bothered you kid.\n\nI've dated her since 2 summers ago. If you aren't trying to get at my woman or being inappropriate I don't care if you snap her occasionally.\n\nJust don't try anything man. You'll embarrass yourself and anger me.\n\nWe are in love and we're making love tomorrow. So if you have any ill intentions with my woman you can forget it right now. I'm the biggest and best she's ever had, only man she's ever loved and the only man who could truly satisfy her physically. You will never have her. And she loves me.\n\nI don't have any problems with you if you are over my woman and realize you will never be with or touch her again.\n\nI apologize for coming off as a dick, just me and kenna are really deep in love and we've been through a lot and I just moved back home and it makes me a little jealous and angry to see a man she used to date before me is snap chatting her....\n\nWe don't need any extra bullshit or drama right now, so don't bring us any please is all I ask friend.\n\nIf you try to talk to her any way but as a brother, or you try to see her at all, if she tells me you do anything inappropriate or anything outside of what a strict brother like friend would do,we are going to have a huge problem.\n\nI will leave you alone now dude if you're not trying to get at the woman who I love and whom is in love with me.\n\nThat entire summer she was with me. She left kyle for me. She's been with me ever since, she even loved me and made love to me before she EVER let anything happen with you. You didn't please her. She didn't have strong feelings for you at all. And she immediately ended shit with you for me once she knew I loved her too. So get any ideas of the past out of your head.\n\nNone of this truth should bug you if you're over her but I'm just making sure. I hate when my baby's friends have ill intentions and she thinks they are just friends and have no alternative motive. But idk if I trust you at all.\n\nIf I can trust you to not stress me and my baby or fuck with our love tell me.\n\nI will leave you alone and apologize.\n\nBut if you aren't over her and you're tryna \"get some\" or you're tryna get back in her life, it's NOT HAPPENING. She said you were nothing to her, and the sex was bad anyway haha. You're small and weak and she said it all felt wrong after being with me. She's been with me ever since. We're in love. And tomorrow me and her will be together in my room making love alll day how we always have together. If you have a problem speak up like a man or tell me our love doesn't bug you and I'll apologize, it's simple.\n\nSo??? What is it? You are after my woman then huh?!\n\nTell me the fucking truth man. Don't you dare be disrespectful and gross enough to bring it up, but if if you ask her about anything she shared with me about your weak ass, she may be nice and lie to you, or she may not care and tell you the truth. Either way. I'm her soullmate and her boyfriend of the past two years almost. And she tells me everything and NEVER lies to me. I don't care haha. Just stay away from my kenna.\n\nI sincerely apologize if you have no ill intentions and aren't trying to make moves with my woman. And i respect you as a guy in the service. I'm sure you're an ok dude. But just as a friend. You're nothing to my kenna but a brother like friend.\n\nI just wanna be sure you know it and don't forget it.\n\nFind a nice classy woman where you are stationed, marry her.... But back off of mine. You will never even compare to me in her eyes. Not even close haha.I just don't need you interfering with me and kenna's love. It's our lives man. It's really not cool....\n\nGoodbye man, good luck. Respect to you being in the service. Sorry to bring your day down with my crazy bullshit but. Me and kenna are head over heels.... I can't help but be crazy about her. I love her with all of my heart and I will protect her from her untrustworthy fake friends. Not saying you are one. But you're dodging telling me what's going on in your head so I'm questioning a lot right now.\n\nJust know I'm never gonna hurt her, I'm always going to have her back, I'd give my life for her without hesitation, and I will protect her from anything, everything, and anyone.\n\nShe is the love of my life. I fully intend to marry and give kenna my children. And we've talked a lot about it. Just don't make shit harder than it already is.\n\nI just moved back and me and her miss eachother so badly and we are FINALLY go to see eachother tomorrow and make love for the first time since halloween....\n\nI hope you don't hate me man. I'm a good dude. Just protective of the woman who holds my heart. And who's heart I hold and must protect.\n\nI hope you can understand.\n\nShe promised me there's nothing at all to worry about with you and that she's not interested:\"/ I wish I knew before I embarrassingly went off on you. I'm so sorry man.\n\nI'm sorry.\n\nPlease don't mention this to my baby:/ I'm really embarrassed and while she will understand, I just feel like an ass for attacking you when you have nothing with my kenna and no intention to.\n\nGood bye brother. I hope you find your one true love someday. It'll make you crazy, trust me, but you'll find her one day. I found mine when I was really young. And it's my kenna :)","tags":"#reddit#cringe#snapchat#mckenna#stop","favourites":60,"__v":0,"created_on":"2015-03-17T23:57:55.520Z","score":0.000978504196023583},{"_id":"55096116b47c3d010fd965f9","id":1179,"pasta":">my face when Americans call chips “french fries”\n>my face when Americans call crisps “chips”\n>my face when Americans call lifts “elevators”\n>my face when Americans call chocolate globbernaughts “candy bars”\n>my face when Americans call merry fizzlebombs “fireworks”\n>my face when Americans call wunderbahboxes a “computer”\n>my face when Americans call meat water “gravy”\n>my face when Americans call electro-rope “power cables”\n>my face when Americans call beef wellington ensemble with lettuce a “burger”\n>my face when Americans call whimsy flimsy mark and scribblies “pens”\n>my face when Americans call twisting plankhandles “doorknobs”\n>my face when Americans call breaddystack a “sandwich”\n>my face when Americans call their hoghity toghity tippy typers “keyboards”\n>my face when Americans call nutty-gum and fruit spleggings “PB&J”\n>my face when Americans call an upsy stairsy an “escalator”\n>my face when Americans call a knittedy wittedy sheepity sleepity a “sweater”\n>my face when Americans call a rickity-pop a “gear shift”\n>my face when Americans call a choco chip bucky wicky a “cookie”\n>my face when Americans call peepee friction pleasure “sex”\n>my face when Americans call a pip pip gollywock a “screwdriver”\n>my face when Americans call a rooty tooty point-n-shooty a “gun” \n>my face when Americans call ceiling-bright a “lightbulb”\n>my face when Americans call blimpy bounce bounce a “ball”\n>my face when Americans call a slippery dippery long reppy a “snake”\n>my face when Americans call cobble-stone-clippity-clops “roads”","tags":"#4chan#british#mfw#americans","favourites":57,"__v":0,"created_on":"2015-03-18T06:55:24.746Z","score":0.0009389707382577749},{"_id":"5509039bb47c3d010fd965d6","id":1168,"pasta":"I sexually identify as a shitposter. Ever since I was a serious poster I dreamed of spamming ironic memes and posting copypastas. Moderators message me saying that shitposting is against the rules and they'll ban me, but I don't care, they're Nazis. I'm having the Chinese take ownership of my alt accounts, spam multiple threads for me, and hide my IP address behind several proxies. From now on I want you guys to call me \"#Swagefrog\" and respect my right to funpost above all and funpost needlessly. If you report me you're just mad cuz rekt and need to check to see if you've been posting memes lately.","tags":"#general#sexually#identify#shit#poster","favourites":55,"__v":0,"created_on":"2015-03-18T04:23:09.383Z","score":0.0009101940972608198},{"_id":"5508c7c2b47c3d010fd96534","id":1099,"pasta":"Hi! Few things to start off with =] 1. Yes I added you because you are a female gamer, 'tis a great thing to see! 2. I'm Brian 3. Don't be intimidated, but I'm not a stereotypical guy. If anything, I'll be the one in the kitchen =D.","tags":"#general#female#xbox#kitchen#gamer","favourites":51,"__v":0,"created_on":"2015-03-18T00:24:10.837Z","score":0.0008525548879224756},{"_id":"54f00fb287d1bc685b1e95a4","id":927,"pasta":"░░░░░░░░░░░░░░░░.░░░░░░░░░░░░░░ \n░░░░░░░░░░░░░█░░░░░░░░░░░░░░░░░░ \n░░░░░░░░░░░░░█░░░░░░░░░░░░░░░░░░ \n░░░░░░░░░░░░█░█░░░░░░░░░░░░░░░░░ \n░░▄░░░░░░░░░█░█░░░░░░░░░▄▄░░░░░░ \n░░█▀▄░░░░░░█░░░█░░░░░░▄▀█░░░░░░░ \n░░▀▄░▀▄░░░░█░░░█░░░░▄▀░▄▀░░░░░░░ \n░░░█░░░▀▄░░█░░░█░░▄▀░░░█░░░░░░░░ \n░░░░█░░░░█░█░░░█░█░░░░█░░░░░░░░░ \n░░░░░█░░░░█░█░█░█░░░░█░░░░░░░░░░ \n█▄▄▄▄░▀▄░░░██░██░░░▄▀░▄▄▄▄▄▄░░░░ \n▀▄░░░▀▀▄█▄░▀█░█▀░▄█▄▀▀░░░▄▀░░░░░ \n░░▀▀▀▄▄▄▄▄███████▄▄▄▄▄▀▀▀░░░░░░░ \n░░░░░░░░▄▀▀░███░▀▀▄░░░░░░░░░░░░░ \n░░░░░░▄█▄▄▄▀░█░▀▄▄▄█░░▄░░▄▄░▄▄▄░ \n░░░░░░░░░░░░░▀▄░░░░▀▄▀█░█░░██░░█ \n░░░░░░░░░░░░░░▀░░░░█▄▄█▄░▄▀░█░░█ \n░░░░░░░░░░░░░░░░░░░░░░█░█▄▄▄▀▄▄▀","tags":"#general#ASCII#420#blaze#it#pot#weed#marijuana","favourites":59,"__v":0,"created_on":"2015-02-27T06:33:17.582Z","score":0.0008409825963445027},{"_id":"55088335da039e130c5dc5ba","id":1053,"pasta":"Ever since I got the kinky idea to jam my Longshot up my girlfriend's pussy, she won't have my cock anymore. Sometimes I come home from work and I hear her moaning upstairs. She tries to hide it, she even pretended to be having an affair to throw me off the track, and justify her not wanting to have sex with me. But I know that she's been fucking that Longshot every day while I'm not there. It smells like her pussy whenever I use it, too. Sometimes while I'm out nerfing with my buddies, and I'm camped out in a sniper position, I get the urge to lick her dried pussy juices off my Longshot. One time I actually spent the entire game hidden in the bushes licking my Longshot all over. In some sick way my Longshot has become the sexual link between my girlfriend and I.","tags":"#general#longshot","favourites":45,"__v":0,"created_on":"2015-03-17T19:36:50.633Z","score":0.000765221392365257},{"_id":"55087f8a9c40b758059984a4","id":1051,"pasta":"Look who it is again, ID Heaven. I'm fed up with your shit faggot. The other day when you called me a newfag, yeah, haven't forgotten about that yet.\nFuck you I've been on here for months and probably get on here more than you anyways. Don't you know that you make yourself look like a newfag when you call others newfag?\nJust because you learned how to hack your name and change it to \"Heaven\" does not give you the right to disrespect anyone at any time.","tags":"#4chan#heaven#newfag#shit","favourites":45,"__v":0,"created_on":"2015-03-17T19:20:14.776Z","score":0.000765153166145455},{"_id":"55087de59c40b7580599849e","id":1047,"pasta":"My name is nick and I dream of becoming a dragon. People tell me I'm a dragonkin and I like the ring of that. I'm saving up money to have wings made out of my ribs and skin attached to my back. I've recently began drinking pure ethanol and swallowing matches. Nothing has happened yet, except I've had to have my stomach pumped 4 times; and the doctors are telling me to stop ingesting ethanol. Can you believe those cis white males in the STEM field? They're telling me to give up on my dream? This is why I need feminism, so I can't be discriminated against for drinking ethanol so I can be a dragon. I thought this was 2015? Social justice should be all over this. Anyways, I told those doctors they were scum, and to check their privilege. I then went on Tumblr and posted about it, inciting a response from other rational, like-minded people; who then emailed the hospital, informing them of the oppression and getting those monster “doctors” fired. Being thankful to the awesome tumblr community, I bravely volunteered to spy on an internet cesspit known as 4chan. I was promptly triggered and asked them to stop, to which they proceeded to call me offensive words and posted even more triggering material. I then self-diagnosed myself with PTSD and told Tumblr about it. I was amazed with the outcome! They started a hashtag called #stop4Chan. That's when I decided to use the pronouns xe/xim/xer to describe my self. As well, I've started to wear some classier clothes, so now I wear a fedora. With great class comes great privilege, so I tell 4chan I'll hack them. That's how I decided I'm a dragonkin.","tags":"#general#dragonkin#dream#dragon","favourites":44,"__v":0,"created_on":"2015-03-17T18:43:00.099Z","score":0.0007504837835676956}]