[{"_id":"54f51a3c87d1bc685b1e95e1","id":954,"pasta":"What the fuck are you doing in my fucking swamp you little Farquaad? I'll have you know I graduated top of my class in the brogres, and I've been involved in numerous secret raids on your anus, and have ogre 300 confirmed layers. I am trained in making early 2000's pop cultural references, and am the top ogre in the entire far far away armed forces. You are nothing to me but another Drek. I will wipe you out with precision the likes of which have never been seen in Dreamworks, mark my fucking words. You think you can get away with saying that dreck to me over the swamp? Think again, fucker. As we speak I am contacting my secret network of fairy tale creatures across Far Far Away and your IP is being traced right now so you better prepare for the storm, Farquaad. The storm that will end your fucking life. It's fucking ogre, Donkey. I can be anywhere, anytime, and I can kill you in over seven hundred ways, and that's just with my bare asscheeks. Not only am I shrextensively trained in onionade combat, but I have access to the entire arsenal of the Fairy Godmothers Factory and I will use it to its full shrextent to wipe your miserable little ass of of the face of mah swamp, you little shit. If only you could have known what unholy retribution your little clever comment was about to bring down upon you, maybe you would have held your fucking tongue. But you couldn't, you didn't, and now you're paying the price, you goddamn Rumpelstiltskin. I will shrek fury all ogre you and you will drown in it. You're fucking dead, Pinocchio.","tags":"#general#shrek#navy#seal#farquaad","favourites":49,"__v":0,"created_on":"2015-03-03T02:19:36.439Z","score":0.0007378132302699572},{"_id":"5508d9dbb47c3d010fd96568","id":1119,"pasta":"geraffes are so dumb.\nEDIT: sorry, the only reason i say this is that this geraffe in this picture is trying to eat a painting. i should say that this one particular geraffe is dumb.\nEDIT: hey asshats quit downvoting me i am not the one who tried to eat the wall.\nEDIT: hey before you hit that down arrow why don't you ask yourself why you can't take a joke you losers. jesus the pc crap has extended to long horses? because that is all those things are, and no one was bawling when that chimp got shot for eating that lady's face. so are you racist for long horses over gorillas? hippocrites.\nEDIT: is it a bunch of peta lamebrains doing this? did my one little joke hit some kind of tree-hugger blog or some shit? i have never so much as even spit on a geraffe! wtf? i ate lion one time, it was in a burger; i had alligator, and something they told me was eagle but i'm positive it was just chicken. whatever anyone is saying about me and geraffes is not even true. but go on farteaters, downvote away. it shows how stupid you are.\nEDIT: spelling.\nEDIT: this is such shit. i have never received as much as one single downvote in my life and you peckers are jumping on this stupid geraffe-loving bandwagon. that is a dumb goddamn wall-licking geraffe and that is all. i'm not going to apologize to you idiots any more.\nEDIT: you know, now my feelings are hurt. the amount of downvotes piled on me is just excessive. god for-fucking-bid i had commented on a post about an antteater, i would be at -1000 by now. you people are horrible","tags":"#reddit#giraffes#geraffes#long#horses","favourites":43,"__v":0,"created_on":"2015-03-18T01:48:59.267Z","score":0.0007375982880799737},{"_id":"5508e2adb47c3d010fd96580","id":1130,"pasta":"nicememe\nOHHohhihoHhee! You tickled my MEME bone! One uUPSWAGpswag for le fine gentleruser ͡ʘ ͜ʖ ͡ʘ)ง (ง ͡ʘ ͜ʖ ͡ʘ)ง (ง ͡ʘ ͜ʖ ͡ʘ)ง (ง ͡ʘ\n͜ʖ ͡ʘ)ง\nit seems >>>(you)have contracted DUBS-ITIS!!(ง ͡ʘ* ͜ʖ ͡ʘ)ง(ง ͡ʘ ͜ʖ ͡ʘ)ง(ง ͡ʘ ͜ʖ ͡ʘ)งvv(ง ͡ʘ ͜ʖ ͡ʘ)ง! LR*L CZECH 'EM OHOOGOOGOREE XDDdd >if (you) BROWS this MEME past the front page (you) must comment FOR YOU ,and\nWHATA ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) v( ͡° ͜ʖ ͡°) vv ( ͡° ͜ʖ ͡°) v( ͡° ͜ʖ ͡°) vv( ͡° ͜ʖ ͡°) (ง ͡ʘ ͜ʖ ͡ʘ)ง(ง ͡ʘ ͜ʖ ͡ʘ)งv(ง ͡ʘ ͜ʖ ͡ʘ)ง( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) v ( ͡° ͜ʖ ͡°) v( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°)(ง ͡ʘ ͜ʖ ͡ʘ)งv(ง ͡ʘ ͜ʖ ͡ʘ)ง(*ง ͡ʘ ͜ʖ ͡ʘ)ง v( ͡° ͜ʖ ͡°) v (ง ͡ʘ ͜ʖ ͡ʘ)ง (ง ͡ʘ ͜ʖ ͡ʘ)ง *\nFUCK MAN xD i just fall of my chair cuz i couldnt and i CANT stop laugh xDXDXDXDXDDDDDXXXXXXDDDDDD OMGOSH DDDDDXXXX(ง ͡ʘ ͜ʖ ͡ʘ)งXDDDDD DDDDDD LOOOOOOOLLLLL ( ͡° ͜ʖ ͡°) ( ͡°(ง ͡ʘ ͜ʖ ͡ʘ)ง ͜ʖ ͡°) ( ͡° ͜ʖ ͡°(ง ͡ʘ ͜ʖ ͡ʘ)ง(ง ͡ʘ ͜ʖ ͡ʘ)งv) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) le nyan cat? hahahaha le mayonaise. fucking epic ass meme i love that fucking meme so much man wait let me just gets crack pipe out smoke some of ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) that good 420 shit :) rips a bong AHHHHHHHHH YES!!!!!!!!!!!!!!! FUCKI(ง ͡ʘ ͜ʖ ͡ʘ)ง(ง ͡ʘ ͜ʖ ͡ʘ)งN HOLY SHITTTT I CANT JUST STOP LAUGHIN(ง ͡ʘ ͜ʖ ͡ʘ)ง(ง ͡ʘ ͜ʖ ͡ʘ)งG CAUSE HE HE HE HE HE JUST TO FUNNY MAN!!!1\nEPIC MEMEING /b/ro (ง ͡ʘ ͜ʖ ͡ʘ)งBAZINGA BAZINGA BAZINGAAAAAAAAAAAAAAAAA ZIMBABWE is this a le new epic meme? screen kappeD!!1011!!(ง ͡ʘ ͜ʖ ͡ʘ)ง ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) vvvvvv( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) vvv( ͡° ͜ʖ ͡°) vv\nCLICK THE \"\"\"\"SHARE\"\"\"\" BUTTON TO ENSURE PROPER BREADING OF YOUR TENDIES ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡+ ͜ʖ ͡+) ( ͡+ ͜ʖ ͡+)( ͡+ ͜ʖ ͡+) ( ͡° ͜ʖ ͡°)","tags":"#general#nice#meme#memed#shit#post","favourites":41,"__v":0,"created_on":"2015-03-18T02:27:53.446Z","score":0.0007083584342551483},{"_id":"54b591a2e90c10d22e88b974","id":120,"pasta":"▌▌✈ ▌▌✈ ▌▌✈ ▌▌✈ ▌▌✈ ▌▌Sorry i dropped my bag of 9/11 ▌▌✈ ▌▌✈ ▌▌✈ ▌▌✈ ▌▌✈ ▌▌","tags":"#twitch#9/11#bag#airplane","favourites":65,"__v":0,"created_on":"2015-01-13T21:42:54.355Z","score":0.0006932307293986976},{"_id":"55097effb47c3d010fd9660d","id":1190,"pasta":"Just held the door for an Asian guy and he said \"sank you\"... So I punched him in the face. I can't believe somebody brought up Pearl Harbor like that.","tags":"#general#asian#pearl#harbor#sank","favourites":39,"__v":0,"created_on":"2015-03-18T13:30:17.613Z","score":0.0006811453891675938},{"_id":"54f811f887d1bc685b1e960b","id":974,"pasta":"This is bullshit - you're oversimplifying a complex situation to the point of no longer adding anything useful to the discussion","tags":"#reddit#bullshit#oversimplifying#complex","favourites":37,"__v":0,"created_on":"2015-03-05T05:55:44.998Z","score":0.000589511213764339},{"_id":"54ff6f1787d1bc685b1e9665","id":1014,"pasta":"Hello President Obama, for years the MLG community has been ostracized and persecuted. This is the 21st century, and discrimination should no longer be allowed. This is why I urgently ask you to begin the legalization of gay weed. Thank you.","tags":"#general#obama#legalize#gay#weed","favourites":35,"__v":0,"created_on":"2015-03-10T21:51:27.520Z","score":0.0005858062980069425},{"_id":"5505d5a987d1bc685b1e9690","id":1033,"pasta":"Don't be racist \nBe like Mario \nHe's Italian\nMade by japenese\nLooks Mexican\nJumps like a black man\nAnd grabs coins like Jews﻿\nAnd Speaks English","tags":"#general#racist#mario","favourites":33,"__v":0,"created_on":"2015-03-15T17:57:44.031Z","score":0.000577601542054851},{"_id":"5508bacbb47c3d010fd964f9","id":1075,"pasta":"I'd just like to interject for a moment. What you're referring to as Linux, is in fact, GNU/Linux, or as I've recently taken to calling it, GNU plus Linux. Linux is not an operating system unto itself, but rather another free component of a fully functioning GNU system made useful by the GNU corelibs, shell utilities and vital system components comprising a full OS as defined by POSIX.\n\nMany computer users run a modified version of the GNU system every day, without realizing it. Through a peculiar turn of events, the version of GNU which is widely used today is often called \"Linux\", and many of its users are not aware that it is basically the GNU system, developed by the GNU Project.\n\nThere really is a Linux, and these people are using it, but it is just a part of the system they use. Linux is the kernel: the program in the system that allocates the machine's resources to the other programs that you run. The kernel is an essential part of an operating system, but useless by itself; it can only function in the context of a complete operating system. Linux is normally used in combination with the GNU operating system: the whole system is basically GNU with Linux added, or GNU/Linux. All the so-called \"Linux\" distributions are really distributions of GNU/Linux. ","tags":"#general#Richard#Stallman#linux#GNU#InstallGentoo","favourites":32,"__v":0,"created_on":"2015-03-17T23:32:30.252Z","score":0.0005722617520304996},{"_id":"5508d42ab47c3d010fd9655c","id":1115,"pasta":"Awesome pics. Great size. Look thick. Solid. Tight. Keep us all posted on your continued progress with any new progress pics or vid clips. Show us what you got man. Wanna see how freakin' huge, solid, thick and tight you can get. Thanks for the motivation. ","tags":"#general#bodybuilding#fitness#thick#solid#tight","favourites":31,"__v":0,"created_on":"2015-03-18T01:20:50.037Z","score":0.0005571610516016414},{"_id":"550894a065f4abef0cfbe4fc","id":1056,"pasta":"|̧̯͖͖͓̼̝̰̻̞̘̪̣̟͖ͧͨ̔̈͒͆̌ͨͤͭͩ͌͂̀͢͞͞ͅ|͚͓̣ͣ͑̐̒̐̇̃͊ͧ̅ͭ̉̑͐ͯ͑̏̽͟͝ͅ|̷̖̠̺̻̦̫͈͎̗̖̟͖̖̩̞͓ͪ͑͗͐̋̾ͤͥ͑̒́̈́̎̒̎́͒̀̚͠͠|̵̵̟̦͔͔̓̉̆͋̚͝|̵̵̛͈̩̼̜̥̹̺̝̖̬̠͓͙̖̃̽̇̂̚͘͠|̛̰̗̱͈͎̘͕͍̞͙̳̳̩͈̦͇ͬ͗̂̊͂͌̉̄̊͊̔͊͊ͪ̀̕͟|̒̃̅͋̎̾͛̽ͤ͐̿̄̅ͯ͆̐ͭ̇̚͘҉͓̩̖̯ͅ|̡̟̣͚̥̗̙͉͇̲̼̩͖̗͙͛̔̓ͦ̓̾̿ͪ͠ͅ|̭̟̟̯̪͐̓̈̔̽̑ͥͯ̉̑̍͠͡|̋͌͆̊ͮ͛͒́͋̃̆͛̚͜͏̪̫̥̤͕̮͈̞̰͞ͅͅ|̛̳͙̟͕͈̟͖̮́́͐ͫ̓ͧ̔͊̏̿ͪ͘͢|̛̙̺̺̜͕̤͇̝͓͍͙̠̺͉̲̥̊ͪͪ̊̍ͬ̅͋͘͞ͅ|̢̡̼̼̙͚̟̼̺̮͍̲̩̬͗̈ͣͥ̍͑͊ͪ̚̚͘͞|̋̂̇̅̒͌̏̈́̓̔̄̈́̋ͤ̑̏̈̈́͢҉҉̤̖̳̭̟̥̥̻̲͍͍̣̺͚̹̗|̵̧̝̲̪̙̘̫̗̪͍̪̝̙͙̣̼͚̫̬ͪ̇͂̋͐̉͗̋̈́ͪ͟͞|̧̯̗̱̺̝͈͉̖̝̘̼̻͈̲̉̓ͨ̎ͬ́|̡͉̗̣͍̲̙̓ͪ̒͒͛ͪ̒ͬ̾ͥͣ͌͟|͛͒̅ͮͭͮ̉̿̑̊̇̒ͩ̓̐̋ͫ̀͏҉̶̖̪̥͕̝͕̩̝̭͇̳͎̩̼̝̘̠̱|̶̸̤̰̯̳̭̥̬̪̘͈̼͎̪̗͙̐̈́͌̆̂̏̾ͫ́͘͝|̛̠̰̖̬̘̝͙̻͉̜̘̙̫̤̬̙̼͆ͨ̎̀̄ͯ̈ͫ͐ͫ͜͡͞ͅͅ|͍̳͍̹͍̙̬ͪͭ̄ͪ̈ͧ̽͐͛̓̇̄̇̄̄ͯ̾̀͜|͔͉͎͓͍̘̠̼̒̒̓̇͆ͤͨ̐̅̑́ͥ͌̕ͅͅ|̢̀̊͐̂ͣ͂̾ͫ͗͆̒͑͟҉̲̦̝͉̮̹̺̰ͅ|̵̹̻̯̝͇͍̼ͧ͒̾̚͠|̛ͯ̓ͮͪ̋͋ͣͭ͛̀͆ͦ͂̎ͮ͒҉̷̪͉̜̜͍̜̦͕̗̻̦͙͜","tags":"#general#broken#text","favourites":30,"__v":0,"created_on":"2015-03-17T19:54:16.632Z","score":0.000540690674681371},{"_id":"54b6b333f6a1885137f43d01","id":199,"pasta":"☐ Not REKT \n\n☑ REKT \n\n☑ REKTangle \n\n☑ SHREKT \n\n☑ REKT-it Ralph \n\n☑ Total REKTall \n\n☑ The Lord of the REKT \n\n☑ The Usual SusREKTs \n\n☑ North by NorthREKT \n\n☑ REKT to the Future \n\n☑ Once Upon a Time in the REKT \n\n☑ The Good, the Bad, and the REKT \n\n☑ LawREKT of Arabia \n\n☑ Tyrannosaurus REKT \n\n☑ eREKTile dysfunction","tags":"#general#twitch#rekt#checkboxes","favourites":42,"__v":0,"created_on":"2015-01-14T18:10:31.549Z","score":0.0004805956405841165},{"_id":"54b59746e90c10d22e88b986","id":130,"pasta":" (_̅_̅_̅_̅_̲м̲a̲я̲i̲j­̲u̲a̲n̲a̲_̅_̅_̅()ด้็็็็็้็็็็็้็็็็็้็็็็็้็็็็็้็็็็็้็็็็็","tags":"#general#marijuana#weed#joint","favourites":42,"__v":0,"created_on":"2015-01-13T22:08:02.381Z","score":0.00047836190114412146},{"_id":"5508babcb47c3d010fd964f8","id":1074,"pasta":"It should be noted that I have an IQ at the 100th percentile at 15 years old. While I know from my Advanced Placement Statistics class that this is not possible, I know from my Advanced Placement Computer Science class that the likely explanation is that the number was rounded because my integer IQ value score had reached MAX_INT.\n\nIt should be noted that I consider myself an inventor and free-thinker; even when I was very young I used to plan out the most elaborate inventions in my mind, and never accepted the tripe that the teachers, or even my parents, good-hearted as they were, laid onto me. My parents knew I was something special -- they always told me so, after all, but they never did financially support my endeavors to construct some of the incredible contraptions that arose from my mind. It's one of the things that made me realize that nobody could see the \"big picture\" like I could -- and nobody could see the details like I could either.\n\nIt should be noted that I know that I am very mature for my age. Most others are so concerned with those of their preferred gender and what they think about them. They engage in such stupid activites that end up damaging themselves and those around them, mentally, spiritually, and emotionally. I'm a big contributor to the brony community here on Reddit and DeviantART and many people have lauded me for my works.\n\nIt should be noted that even though I've just used the word spiritually, I'm no big proponent of religion. I believe that everyone should be able to believe what they want to, as long as their beliefs do not harm others. I truly respect the Buddhist and Sikh faiths, but reject the Islamic dogma. It's funny how they claim to be a religion of peace and then they kill people and the people of the religion as a whole do not try to distance themselves from those whom they label 'extremists'.\n\nIt should be noted that I'm also a pacifist -- something which separates me from the rest in my high school; something that I'm probably best known for over there. One time, somebody called me a \"pony-loving faggot,\" and punched me in the face, breaking my nose. By the way, I strongly support his right to free speech and think that the word 'faggot' can be humorous if we do not let it have an effect on us. Anyway, I have an extreme tolerance to pain, and I didn't want to hurt him too badly if I didn't have to, so I faked tears, crying, shitting my pants, and vomiting to defuse the situation in a tactical manner.\n\nIt should be noted that the spectacle of my tolerance to pain and indifference to physical damage seems to have made all of the girls at my school attracted to me. They seem to be very intimidated by my presence; they always make weird looks at me and try to avoid me. However, I have watched a lot of anime, giving me some insight into a far more civilized and advanced foreign culture. I know from watching anime and old films that being mysterious and debonair and reserved impresses women, so I've begun to take up more antiquated and verbose speech, and refer to my classmates only by 'Mister' or 'Miss' and their last name. I also have begun to wear a suit and tie to class, and bring my work in a briefcase. I can see it working; everybody seems to be intimidated/attracted by/to me now; everybody seems hesitant to talk to me.\n\nWhat the fuck do you think now, you little bitch, now that you have learned something about me? I believe your behaviour in this thread has been totally assholish and I think that I am a greater contributor to society than you will ever be. If you're an engineer, chances are that I know more about engineering than you do. I bought an Arduino and know how to do Logic Gates, so I consider myself an expert electrical engineer. PI = 3.14159265358979 anyone? I heard even engineers don't know that many digits on average. I also have a very good understanding of physics, better than most scientists. I know this because I understand the concepts better than they do, and I don't even need to know Calculus! Newton was a fucking idiot like Romney is - I'd never vote for either of them.","tags":"#reddit#neckbeard#SAT#engineer#IQ#DarqWolff","favourites":26,"__v":0,"created_on":"2015-03-17T23:20:44.698Z","score":0.00047831704016400046},{"_id":"54e137608c7aeb193319938a","id":810,"pasta":"What the darn-diddily-doodily did you just say about me, you little witcharooney? I’ll have you know I graduated top of my class at Springfield Bible College, and I’ve been involved in numerous secret mission trips in Capital City, and I have over 300 confirmed baptisms. I am trained in the Old Testament and I’m the top converter in the entire church mission group. You are nothing to me but just another heathen. I will cast your sins out with precision the likes of which has never been seen before in Heaven, mark my diddily-iddilly words. You think you can get away with saying that blasphemy to me over the Internet? Think again, friendarino. As we speak I am contacting my secret network of evangelists across Springfield and your IP is being traced by God right now so you better prepare for the storm, maggorino. The storm that wipes out the diddily little thing you call your life of sin. You’re going to Church, kiddily-widdily. Jesus can be anywhere, anytime, and he can turn you to the Gospel in over infinity ways, and that’s just with his bare hands. Not only am I extensively trained in preaching to nonbelievers, but I have access to the entire dang- diddily Bible collection of the Springfield Bible College and I will use it to its full extent to wipe your sins away off the face of the continent, you diddily-doo satan-worshipper. If only you could have known what holy retribution your little “clever” comment was about to bring down upon you from the Heavens, maybe you would have held your darn-diddily-fundgearoo tongue. But you couldn’t, you didn’t, and now you’re clean of all your sins, you widdillo-skiddily neighborino. I will sing hymns of praise all over you and you will drown in the love of Christ. You’re farn-foodily- flank-fiddily reborn, kiddo-diddily.","tags":"#reddit#navy#seal#ned#flanders#300","favourites":33,"__v":0,"created_on":"2015-02-16T00:17:50.007Z","score":0.00047493715294310207}]