[{"_id":"54c0077c3b0a330105ff5cf1","id":453,"pasta":"( ͡° ͜ʖ ͡°) Every 60 seconds in Africa, a minute passes. Together we can stop this. Please spread the word ( ͡° ͜ʖ ͡°) ","tags":"#twitch#general#africa#60#seconds#stop#this","favourites":187,"__v":0,"created_on":"2015-01-21T18:35:06.240Z","score":0.001796255408931574},{"_id":"54f2b8cd87d1bc685b1e95c8","id":943,"pasta":"░░░░█▒▒▄▀▀▀▀▀▄▄▒▒▒▒▒▒▒▒▒▄▄▀▀▀▀▀▀▄\n░░▄▀▒▒▒▄█████▄▒█▒▒▒▒▒▒▒█▒▄█████▄▒█\n░█▒▒▒▒▐██▄████▌▒█▒▒▒▒▒█▒▐██▄████▌▒█\n▀▒▒▒▒▒▒▀█████▀▒▒█▒░▄▒▄█▒▒▀█████▀▒▒▒█\n▒▒▐▒▒▒░░░░▒▒▒▒▒█▒░▒▒▀▒▒█▒▒▒▒▒▒▒▒▒▒▒▒█\n▒▌▒▒▒░░░▒▒▒▒▒▄▀▒░▒▄█▄█▄▒▀▄▒▒▒▒▒▒▒▒▒▒▒▌\n▒▌▒▒▒▒░▒▒▒▒▒▒▀▄▒▒█▌▌▌▌▌█▄▀▒▒▒▒▒▒▒▒▒▒▒▐\n▒▐▒▒▒▒▒▒▒▒▒▒▒▒▒▌▒▒▀███▀▒▌▒▒▒▒▒▒▒▒▒▒▒▒▌\n▀▀▄▒▒▒▒▒▒▒▒▒▒▒▌▒▒▒▒▒▒▒▒▒▐▒▒▒▒▒▒▒▒▒▒▒█\n▀▄▒▀▄▒▒▒▒▒▒▒▒▐▒▒▒▒▒▒▒▒▒▄▄▄▄▒▒▒▒▒▒▄▄▀\n▒▒▀▄▒▀▄▀▀▀▄▀▀▀▀▄▄▄▄▄▄▄▀░░░░▀▀▀▀▀▀\n▒▒▒▒▀▄▐▒▒▒▒▒▒▒▒▒▒▒▒▒▐\n░▄▄▄░░▄░░▄░▄░░▄░░▄░░░░▄▄░▄▄░░░▄▄▄░░░▄▄▄\n█▄▄▄█░█▄▄█░█▄▄█░░█░░░█░░█░░█░█▄▄▄█░█░░░█\n█░░░█░░█░░░░█░░░░█░░░█░░█░░█░█░░░█░█░░░█\n▀░░░▀░░▀░░░░▀░░░░▀▀▀░░░░░░░░░▀░░░▀░▀▄▄▄▀﻿","tags":"#general#ayy#lmao#alien#ASCII","favourites":131,"__v":0,"created_on":"2015-03-01T06:59:21.552Z","score":0.001709050661879832},{"_id":"5597438ea28b796c71d39f08","id":1844,"pasta":"\"lol.\" Are, are you fucking shitting me right now?! I spend five nipply minutes pouring my heart into that comment, and you have the gaudy nerve to empty the drops of \"wit\" out of your cock cave JUST to say \"lol\"?! You're a special kind of stupid, dick blister. I swear to fucking God if I ever see you in real life I'm going to throw my pubes in a nugget fucking blender and feed you a protein shake that tastes like my fuckin' nut sweat. You are worth the equivalent of a fresh out of the shower shit. Except shit smells better, you fucking cumjar. I bet you still laugh at the word \"69\". Do you? That make your 2-incher stand on end faggot? I bet you're smirking right now you filthy cunt chalupa. Fuck you, and your parents, for producing such a God damn horrifying stench trench. Take a rope and swallow it. Then, deepthroat a bottle of cyanide, and shove a stick of TNT up your fuckin' pucker hole. Kill yourself. ","tags":"#general#5#minutes#heart","favourites":20,"__v":0,"created_on":"2015-07-04T02:20:21.166Z","score":0.0016414940292587444},{"_id":"55552186d8a10121136da80a","id":1635,"pasta":"I want to turn into Luna's bodysuit\nShe wouldn't notice anything weird and wear me into the battle\nAnd then I would tease her naughty bits\nI would gently lick her nipples and play with her cunny\nNot too much though, just enough to get her aroused\nAs she would kill more enemies and get carried away by the slaughter I would increase my \"assault\"\nBy the end of the battle she would be very close and I would give her the pleasure of finishing the \"job\" herself, enjoying every last drop she let into me\nHowever, the story wouldn't end here\nMuch to her surprise, she wouldn't be able to take me off\nMultiple tongues I would've grown inside the suit would caress her plump breasts, stiff nipples, perfect tummy, fit ass and her clitoris\nI would grow two penises right inside the suit which would fill her unexperienced pussy and virgin ass\nThey would vibrate as she moaned and quivered around, helpless and increasingly aroused\nTwo pulsing penises inside her loin and tongues working every single inch of her body wouldn't take too long to bring her to another pleasant ending\nThat wouldn't be it yet though\nFor the last stage, I would begin to pump her with my penises while intensely vibrating around her erogenous zones\nAfter giving her yet another orgasm, I would turn back into a fat-ass self insert and run away","tags":"#dota2#luna#4chan#bodysuit","favourites":50,"__v":0,"created_on":"2015-05-14T21:42:30.687Z","score":0.0015187317919047297},{"_id":"556e61ad6f5b1e5714c0ef19","id":1720,"pasta":"What the bones did you just skellington say about me, you little smoothskin? I’ll have you know I graduated top of my class in the spooky skeletons trumpet school, and I’ve been involved in numerous secret raids on halloween, and I have over 300 confirmed doots. I am trained in scary spooking and I’m the top trumpeter in the entire spooky graveyard. You are nothing to me but just another little baby to be spooked. I will wig you the heck out with spookiness the likes of which has never been seen before on this Earth, mark my spooky words. You think you can get away with saying that hogwash to me over the Internet? Think again, spooker. As we speak I am contacting my secret network of spooky mummies and ghosts across the creepy crypt and your bedroom closet is being traced right now so you better prepare for the storm, doot. The storm that spooks out the pathetic little thing you call your wits. You’re hecka spooked, kid. I can spook anywhere, anytime, and I can spook you in over seven hundred ways, and that’s just with my trumpet. Not only am I extensively trained in spooky scaring, but I have access to the entire trumpet of the spooky skeletal abyss and I will use it to its full extent to spook your miserable butt off the face of the continent, doot doot doot. If only you could have known what spooky retribution your little “clever” comment was about to bring down upon you, maybe you would have held on to your hat. But you couldn’t, you didn’t, and now you’re paying the price, you dumb little baby. I will spook skellingtons all over you and you will drown in them. You’re spooked, kiddo.","tags":"#general#navy#seal#mr#skeltal#spooky","favourites":35,"__v":0,"created_on":"2015-06-03T02:08:36.379Z","score":0.001460277529683737},{"_id":"55096116b47c3d010fd965f9","id":1179,"pasta":">my face when Americans call chips “french fries”\n>my face when Americans call crisps “chips”\n>my face when Americans call lifts “elevators”\n>my face when Americans call chocolate globbernaughts “candy bars”\n>my face when Americans call merry fizzlebombs “fireworks”\n>my face when Americans call wunderbahboxes a “computer”\n>my face when Americans call meat water “gravy”\n>my face when Americans call electro-rope “power cables”\n>my face when Americans call beef wellington ensemble with lettuce a “burger”\n>my face when Americans call whimsy flimsy mark and scribblies “pens”\n>my face when Americans call twisting plankhandles “doorknobs”\n>my face when Americans call breaddystack a “sandwich”\n>my face when Americans call their hoghity toghity tippy typers “keyboards”\n>my face when Americans call nutty-gum and fruit spleggings “PB&J”\n>my face when Americans call an upsy stairsy an “escalator”\n>my face when Americans call a knittedy wittedy sheepity sleepity a “sweater”\n>my face when Americans call a rickity-pop a “gear shift”\n>my face when Americans call a choco chip bucky wicky a “cookie”\n>my face when Americans call peepee friction pleasure “sex”\n>my face when Americans call a pip pip gollywock a “screwdriver”\n>my face when Americans call a rooty tooty point-n-shooty a “gun” \n>my face when Americans call ceiling-bright a “lightbulb”\n>my face when Americans call blimpy bounce bounce a “ball”\n>my face when Americans call a slippery dippery long reppy a “snake”\n>my face when Americans call cobble-stone-clippity-clops “roads”","tags":"#4chan#british#mfw#americans","favourites":87,"__v":0,"created_on":"2015-03-18T06:55:24.746Z","score":0.0013762759182460015},{"_id":"55b5414089b52e986e2b40f1","id":1917,"pasta":"True memes come from the Black Speech, first spoken at the dawn of the world.\nIt was said that the ancient kings of the area between the Tigris and the Euphrates spoke it fluently, and exercised their will in the form of all-powerful memes that everyone down to the lowliest commoner obeyed.\n\nWhen Greek civilization dawned, it was said that Aristotle and Plato spent their final years contemplating these memes, and went mad from the effort. They did not realize the true nature of this.\n\nAlexander the Great was said to have carried an inscription of one of these memes with him at all times. He conquered the known world, but he died young and withered as a result. He spoke this infernal tongue, and it was said that even the smallest insects carried the memes as he commanded.\n\nIt was said that the Romans buried their memes wisely under the banks of the Tiber. They strode to master these under their grip, but it eventually caused their downfall, for no man may hope to contain the memes- information that only the most learned sages can hope to know, and even they can only grasp blindly at the edges.\n\nOver a thousand years passed with European civilization forksaking the memes entirely, burning them wherever they were found. They were heresy and an affront to their God, created in the fires of Hell. Eventually they were forgotten.\n\nIn the New world, the memes were rediscovered, buried among the Incan kings and the Aztecs- the latter of which sacrificed men to it as a god. The Mayans had hoped to exploit it, and they had completely vanished as a result.\n\nDuring the Great War, the existence of these memes became known again, but they were quickly buried and declared illegal weapons.\n\nThe first meme spoken in its entirety in over a thousand years- not enunciated, but Named and Spread, which is how they give power unto men- occurred at Trinity, 1945.\n\nRumors say that Konstantin Chernenko, the premier before Gorbachev, demanded to hear one presented. He died after only 13 months in office.\n\nIt is said that the end of the world shall occur when ten memes are released consecutively, running their way rampant throughout the interconnected network of man. Billions shall suffer an unexplainable illness, that shall rot their insides and make them have a languid pallor. Men and women shall become fallow and barren, and what children remain shall whisper memetic atrocities, which unleashes darkness unto the land. Monsters shall roam the world, strange gibbering beasts with tongues and hands, destroying anything in their path. The world shall be smothered in night, and victims shall disappear into unknowable shapes which release fountains of poison upon the world.\nIt shall be considered a sweet death to die of one's own volition.\nThe memes have been waiting patiently for two hundred thousand years, since the dawn of man. They will remake the Earth in their image, and then shall rest for two hundred thousand more.\n\nTHAT is how I meme.","tags":"#general#meme#lovecraft#lovecraftian#eldritch#dank","favourites":9,"__v":0,"created_on":"2015-07-19T21:33:39.506Z","score":0.0012815317046307377},{"_id":"55973605a28b796c71d39ef9","id":1835,"pasta":"There once was a woman who had 100 children.\n\nShe named each of them after numbers in the order they were born. There was a fire and all of them died except Ninety. Ninety went off to have kids of her own. They were very kind and loving. One day they found an injured dog. They took it home and nursed it back to health. They hid the dog and never told their mother afraid she would kick the dog out . In fact they never told anyone. To keep from arousing any suspicions they named the dog “This” so the name could be used in conversation. One day This ran away. They never saw This again. No one else knew about This. No one even knew a dog named This existed.\n\nOnly Ninety’s kids will remember This.","tags":"#general#only#90's#kids#remember#This","favourites":16,"__v":0,"created_on":"2015-06-30T13:29:35.747Z","score":0.0012379218457511608},{"_id":"55a849a24587967e7ca6a8a6","id":1891,"pasta":"To be fair, I did Nazi that coming. I came here to say this but boy, that escalated quickly so to the top with you! Lost it at 'This is why we can't have nice things' and then my faith in humanity was restored, my mind blown, and manly tears were shed. Well said. As a 'Merican, I can confirm this gem has just won the internet and is doing it right. Just sayin', I know that feel, bro, and while that was a risky click, this post was a 9/10, would read again. I see what you did there and it feels good man. You're doing God's work, son. Yes.\nI get this reference. I laughed way harder than I should have at your list that seems legit and totally nailed it. You must be a hit at parties. I like you. Doctors hate you! Instructions unclear. Dick caught in you magnificent bastard; you, sir, are so brave, a gentleman and a scholar, and seeing how you are a redditor for 4 years, this checks out, so I'll allow it. I regret that I only have one upvote to give for this cool story, bro. CTRL+F \"about tree fiddy\" was not disappointed. Wait, why do I have you tagged as \"NOPE NOPE NOPE\"? Nice try, you monster. What did I just read? Dafuq? I read that as \"YOU HAD ONE JOB\". I can't fap to this. No true scotsman could see that this relevant XKCD was bad, and you should feel bad. As a black man and as a gay man and as a woman, black people suck, gay people are gross and women are bitches. You must be new to Reddit, so I'll see your cakeday and raise you a karma train. One does not simply rustle my jimmies, not even once, and it's almost as if Reddit is composed of millions of individuals with different opinions and outlooks.\nThis stahp gave me cancer for science, so that's enough internet for me today. OP is a bundle of sticks, 2/10, would not bang, not with that attitude. What is this I don't even know how is this wtf? Circlejerk must be leaking. This will get buried but brace yourselves, some men want to watch the world burn right in the feels. When you see it, they'll KILL IT WITH FIRE! I really sympathize with pedophiles, but that has nothing to do with atheism. Lawyer up, delete facebook, hit the gym, and SHUT UP AND TAKE MY MONEY, said no one ever, so you wouldn't download a strawman. Damn onions, you scary like a BOSS. whoosh. Since rule #1 is 'be attractive', I'll just leave this here: This is my [f]irst post, be gentle. I have the weirdest boner right now. OP will surely deliver, unless he's a cop, in which case he'll just shoot your dog.","tags":"#reddit#overused#memes#nazi#that#coming","favourites":10,"__v":0,"created_on":"2015-07-15T20:39:58.208Z","score":0.0012302582150665532},{"_id":"55864e125690838c060c5cdc","id":1785,"pasta":"Hello M'lady *tips fedora*. I was just riding my classy powerchair through your steam page and noticed your beautiful anime features. Message me on reddit (u/IncredibleAtheistIntellectual) and we can talk about feminism or fundies! You could possibly be my next waifu :O if you are up to the challenge of serving my every need (because I am a nice guy).\n\nBest Wishes,\nu/IncredibleAthiestIntellectual\n\nP.S. sorry for any typos, my keyboard is slightly stiff from cheeto dust and neckbear hairs.","tags":"#gentlesir#tips#fedora#steam#reddit#neckbeard","favourites":20,"__v":0,"created_on":"2015-06-20T12:33:50.978Z","score":0.0012166171416546764},{"_id":"55242274f13e0576299e1638","id":1421,"pasta":"\n̴̛̤̙̮̜͉̮ͫ̔̆͘ͅ ̴͇͔̝͉̫̗͌̑̂̚͞ͅ ̴̛͍͈͉̙̬̘̠̱͈̯̝̥̬̠̜ͥͭ̔͋̂͗͌̂̽̃͂̊̚͡ͅ ̨̲͓͙͉̜̤̙̫̖͚̫͚̺͇̘̙͕̫ͪͣ̊̾͗̅̐̓ͥͯ̂ͬͭͥ̇͂̆̒ͪ ̴̢̧̥̬͇̼̝̮̮̠̦̪̹͈͖̟͉̙̐̓̏͐͛̓̈͡ͅͅ ̱̖̘̲̤͎͓͕̦̝̩̾́̅ͯ̍ͤ͆̉͑̾̾͊ͯ͐̊̑̌́̚͟ ̢̆̌̇̊̓ͦ͆͗́ͣ̌̊̂̌ͯ̐ͬ̚͘͟͏̭̪̰͇̝͓̞ ͭ͆̊͆̂͐͐ͥ̅̊ͯ̍̾͛̒̚̕͏̺͔͍͔͝͞ ̵̧̦̲͍͒̾̿͊̐̆̎̒̊̅̈́̋͌͗͘̕ ͖̠̥͓̳͙̻̼͉̞̥̮̈́̾̔̿̎́͡ ̧̢̰̬͇͚͉̖̝̠̞̥͖̆ͣ̏̌̅ͯ̑ͥ̽̕ ̴̵̷͙͍͖̤͇̥̘̰͚̲͕̜̿͑̑͑̔͒̚͢ͅ ̦͕̲͎̺̥̥̳̥͖̎ͪ͌͐̌̆ͤ͗̈́͑͆͊͒̋̐͡͝ ̧̨͙̯͍ͪ̋̀ͯͫ̐ͥ́ͭ̒͗̌ͮ̕͜͞ ̶̮̯̞͍͎͍̘̈́̐̿̽́̌̄͒̒ͮ̅̈̀ͨͨ̍̆̅̚ ̶̧̛̟̰̮̦̤͙̰̱̹̤̳̩̫͉ͨ̐ͥ̓ͨͨ̓ͮͮ̅ͧ́̇̑̒ͦ ̸̡̟͚̲̱̤͖̗̳̰̭̼̠̲͍͕͓͈̹͌ͨ̇̑̎ͧ̄̔ ̡͇̟̣̪͚͚̻͍̮͓̼͆ͮ͒͛ͩ͛̂͛ͯ̉̔̉͜ ̶̵̭̖̱͎͇̭͗ͪ̌̄ͬ̉̒̌̕̕͠ͅͅ ̐͛̇ͮ͗͛ͯ͗͒ͫ͏̳̩͕̭̫͢͝ͅ ̶̡̓ͥ̿̆͆ͩ̎͗̇ͦ̌ͩ͏̴͔͖̦͚͔̜̮̬̟͈̭̪̭̜̤͈̳ͅ ̵̛͉̹͈̳̱̄̏̃ͪ͌̓̓͐ͫ̍̆̚͘̕͝ ̶̸ͨͦ̏̍ͥ̔̄͗͠҉̙̻̱̻͚̮̳͍̟̫͎͚ͅͅ ̷͎͔̥̟̘̠͛ͭ͑͛̌̒͐̽͗̄̆͊́̚̚͠͠ ̶̸̧͓̻̝̦͙̲̠̙̗̟̜̆̉̔̇͘ ̢̘̦̹̘̪͈̯͉̹̈̀ͧͣ͛ͨ̍̄̅̏̐̀ͮͦͦ̅͌͢͞ ̢̨̰̮̠̣͖̯̠̹̫̮̹͙̹̯̮̟̲ͩͯͫ͆̄ͯͨͅͅ ̢̡̠̟͓͙̬͋ͦ̓̏͋͐̈́ͤ͘ ͈̜̖͇͔̣̤̬̺̭̦̟̟̘̦̥̗͔̇͋̓̾͘͟͞ͅ ̴̢̹̖̙̞̥̋̋͌ͩ̀ͮ̑̋͒ͩ͟͡ ͩͫ̊͊̑ͫͮ̈̎̄ͤͦ͂ͪ̇̀͐̂́͞҉̙̬̰̟̞̬͇̥̩̙̪̪̘ͅ ̲͓̙̖̼̼̟͖̙͗̈̔̍̐͗̂ͩͯ̔̃͂̓̅ͣ́͂͐̚͠ͅ ́̓ͤ͑ͨͨ̓͌̈̿̀̽ͮ̅̾҉̙̱͓̟̖͡ ̨̡̱̗̯̜͇̍ͦ͐̿ͤ̈̎́ ̓̓͛̾͐̀̌̎̾͗ͨͭ̽̅ͤ̇̋̾̀҉̵͎̫͉̙͚͉̱̙̟̞̬̭̖̫͔͍̥̮̗͠ ̶͚̺̘͖̣̙̬̠̳͇̙͔̙͕̳̹͛̆ͯͣ̒̍ͪ̇̎̽͋͌̑̍́͞͠ ̴̵̱̫͇̰̭̱͎͎͖͍̰̪͍̱̭̞̬͖̗͑̑ͯ̊ ̴̨̪͇͕̖͙̗͚͚͍̣͔͓͕̣̦͉̭̬̍̔̄̐̐̐̎́͘͡ͅ ̸̶̻̠̱̗͈̺̳̤͙͙͙̟͕̗͚͙ͦ͒̋̇̀̑ͤ̉͢͝ ̆̓̌ͪ̐̊̆̓̃́̐ͬ͞͏̸͙̯̮̜̠͓̘͍͇͟ ̆͆́̿͑̂ͪ̅̈̑͒̌̑̏̓̃̾̒̌͞҉̫̜̜̖ ̵̱̯̲͚̺͍̘̮̥̠ͥ̾͗͝ ͇̳͓̯͈̝̭̳̮̜̙̞̣̯̙ͨ̈̍ͧ̎̋̋̾ͬ̏͒̅̍̅́̚͟͝͝ͅ ̸̰̳̘͚̝̤͑̅͌̽̂̒̋̀̽͐̑͐̋̂͊ͯ͢͝ ̢̛̜͇̟̠̲͔̺͚̮͖̖̯̗̒̓̈ͬ̓͌ͣ̂̌ͪ̊̋͑̇͝͝ͅ ̶̶͙̼͍͕̩̪͖̖̝̞̪̱̠͕̜͙ͪͯ̏͟ͅ ̸̡͍͓͉̝̺̠̫̥͂ͯͨͪ̑̾͂̑̃ͮ͒̈̀͜ͅ ̦͍̮͉͙̣̜͔͔̖͖̤̻͓ͣ͛̅̿͒͌͒ͮ͛͛̄̑ͤ̆̕͡ͅ ̵̼̠̜͇͎̫͎͓̗̙͚ͯ̎̃͂̒͑̋̄ͣ̾́͝ ̸̺̦̰̦͗̍̓͑̔́͢\n̵̡̛͍͔̝̲̘̯͙̳̯̮͕̗͉͔̺̦̘̏͒̌͊ͮ̄̽̊͊ͫͧ̉̏̈͑͡͠ͅ ̶̧̲̟̜̩̼̪̱̦͓̪̘̘̱̭̻͍̹ͤ̊ͨ͊̑ͩ͂̚͞ ͮ̍̊̿̏͌́̕͏̳̺̫͔̞̪̝͓̳̬ͅͅ ̆̉͂̋̀̾̂̏͋͋̆ͣ̀͋ͥͧ͆҉̸̢̦̙͖̤͟͟ ̴̶̯̭͖̜͈̰̦̣̼̲̙̥̠̗̱̩͗̒̑̎̃̏ͬͪ̾ͭ̿͐͂ͬ̆̿́͢͠ͅ ̸̛̬̦͓̠̬̬͍̪͍̝̻̼͉̬̤͎͂́̈̑͆̔͂ͬͩ̉ͧ̑͢͞ ̢̛͓͔̪̱̝̝̲̘̙̼̩̙̮̤̬ͭ͛ͥ͗͒̔̒͗ͬ͘͟͢ ̶̏͆͆̍͋ͥ̋ͤ͑̏ͫͫ̔̾̔ͯ̚̚̚͏̨͍͇̰̫̣̣̟̱̟̲͖̬̤̫̟͇̕͜ ͩͭ̌̀̂̋̋̽̎̈́ͥ̄ͤͩͨ̈́̀̚҉͓̟͇̠̹̮͕̮̯̣ ̴̵͍̬̰̘̗̮͚̪̖̝̯̩̉͋ͮ͌̃̒̆͗̉͋͒ͨ͗̀ ̨̣̮̝̗̞͕̫̳̭̎̈̑ͮͨ̓́́͝ͅ ̶̴̧͕̖̰͕̮͇̭͚̰̘͖̥̖̻̺̞͔ͮ͑̽ͧ̅͢͞ͅ ̴̵̜̺̘̮̥̈̓͒͌͗̃̂̃͆̓͌̋ͫ͐̕͞͝ ̴̷̢̹̜̬̹̥̥͍̝̺̰̖̹̣̘͍͎̘̟͒ͪ͒́̑ͧ̆ͩͧͦͧͭ̓̇ͩͥ̊̚ ̛̼̬̠̖̲̖͔͚̟̟̖͉̭͍̆͛̏̃̅̉̽̉͟͢ͅ ̧̧͔̥̥̠̼̓ͪ́̚̕ ̴̶̜̲̺̝͉̜̳̬̟̘̣̱̳͇͚̗̳͚͂ͥͪ͊͑̆͊͌͛͗́͋͠ ̊̿̔ͮ̓̓͏̳͕̜̩͕̟̪͕̪̞͕̜̤̤̝̜͟ ̵̴̸̛͓̱̠͇͎̣̣̣̺͓̰͓͍͎̳̦̂ͭͥ̋̃͝ ̶̧̰͕̰̲̦̣͓̩͈̖̦̦̗̭̜̳̺͖̊͋̈̓̀̉̄̏ͥ̊̒̌̆͌ͦ̀͝͝ ̵̴̷̡̭̯̙̰̜̠̘̟̑ͨ̈͛ͯ̇ͥ̏͒ͅ ̴̷̻̘̬̜̱̹̘̲̻͉̯̳̺̭͐ͫ͌͊̀̕͠ ̸͙̰̘̻͖͙͕̰̝̭̳͈͖̖̪̘̮̦̓͒͑̂̒̍ͧ͆̄̏́͜͟͡ ̶̷̛̂͋ͨ͒̇̒̑͐̌͏̫͈̱̭͟ ̡̧̻͕̤̝̼ͯ͆̾͑ͮ̍̔̏͆̑̚̚ ̧̦̪̺͚͍̉̅͐́̐ͬ̒ͯ́̂̍̇̌̚͟͢ ̵̨̖̭͕̜̪ͯ́͌̍ͪ̆̓̇̍ͭ̀ ̸̘̼̣̼̭͇͎̜̤̙ͦͯ̅̒̑ͣ͐͂ͮ͠ ̵̹̰͍̝̮̝̫̺̞̤̼̦̺͋̊̏͂̉́͗̐̌ͬ̋͊ͦ̅̐̃́ ̭̜̺̯͖̼͓͇͇̤̭̪̯̺̫̆͒̆́ͫͬ̐̏̇̐ͯͣ̾ͧͫ͂̽̄͘͟͟͞ ͑̈́̄ͣ̈́ͣ͋̿͐̿͆̓ͬ͂͂ͧͯ̀ͣ҉̯̬͖͎͓̘̗̰̗̰̟̹̖̗̩́͢͜ ̸̬͈̠̼̯̩͍̪̙͔̼͔̜͕͔̇ͥ̓ͦͩ͛ͮͪ̅̏̍͂ͩ͒͗̌̒̒̂̀͢͝ͅ ̸̵̨̛̟̦̹͎̹̦̠̥̟̲̱̬̠̪̥͎̖ͫͩ̿̂͆͘ͅ ̴̓̍̍̐ͦͣ͐ͬ̅͑ͥ͋̔͏͏̞͎̬͖̣͔͚͘ ͥͣ̐̍͌̍̓ͣ̋ͮ͏̼͖̭̜̬̜̥̝̝̯͔̦̭́ ̶̧̺̦̻͔͉̗̣̭̖̟̮̙̯͕͖́̽̋̌̔̍̄ͪ̾̿ͫ̾͛ͪ͐̅̄ͫ͐́̕͡ͅͅͅ ̷̨̰̟͇̮̪̆ͤ͊̑ͨ̉́͆̉̐ͩ̐͒ ̴̶̯͇̜̬̘̺̟̼͙͚̮̺̬̹͙͚̣̦̖ͮ̂̿̽̏̈́̔͋͂ͦ̋̑ͧ̉̒̕͘͝ ̷̴͉̤͇͇̗͈̘̗̎ͨ͆̎ͯͤ̄ͮ̔̊̉ͨ́̚̕͢ͅ ͨͧ̌͛̅ͣ̅͐̅͏̳͚̱̫̣̟͇̬̖͎͚̫͈̖̗̲͎͟͟͝ͅ ̶̇ͨͣ̋̾̄̿̂̓͋̉͑̓̚̚͏̷̤̗͔͉̙̪̀ ͙̥̥͕̱͎͔̥̲͙̹͒͌ͧ͑̌̏̇̊̔͒͛͌ͨͪ͒́ͨ́́͝ ̗̦͈͔͉̦͙̭̰̳̤̭̑ͫ̿́ͭ̇͗̽̓̀͟ ̶̦̝̞͚̟̪͔̜̥̥̥̭͇̫ͦ͋̈́͌ͪ̊̽ͪ̌̋ͧ ̏̐͂̇ͬ҉̸̷͍͇͔̩̙̞̪̤̩͠ ̶̢̝̲̲̦͓͚͚̝̠̾͆ͬͭͧ̇̋ͦ̄ͤ͛ͬ̉͂̓̃̌̽͘͞ ̭̥̠̘̖̱̽ͪ̽̽̎̈́͆͐̔̏͂ͦ́̚͘͠͠ ̨͚͙̳͍̪̣̩̝̜͉̼̻̭̻̥̠͍̙̮̀̄ͫ̂ͤ͊͋ͥ͌̚͘͢͞͠ ̷̛̤̹̞̠͖ͬͭ̓̿͆́̕͠ ̛̛̛͎̻̲̲̭̲̹̘̙͖̲̬̥͉͎ͣ̈́̇ͫ̀̌̔̏͐̀̔̍̚̕ͅ ̵͚̗̗̙͇̪̮̬͈̯̝̟͍͙̞̤̺̆̂ͭ͗͂̆͂̓ͦ̓̀ͩͩ̆̆̉̕͞͡\ń̛͇̹̟̩̭̼̪̺̻̯̰̜͓͔̟͇ͩ̇ͤ͑ͣ̾́̌̑ͤ̋̈̀͡ ̸͉̻̤̠̬̳̺̲̝̣̼͈͉̩͍̈ͣ̃̒ͨ̃ͪ́̃͆͋͌̀̚͘ ̧̥̦͎͎̯̤̫̭͇̣̲͙͚͊̍̊̾͐̈̍͛̄ͪ̚͜͞ͅ ̸̧̨͚̜̪̙͈̞̥̹̽̀͐ͥ͋ͮ͆͒̓͋̂̋ͧ̌̍̇̿ͧ̚̕͟ ̵̑̒ͫ͂̎͛̔ͦͨͮ͏̡̛̟͙̞͚̣̣̮͕͖̥͈͕̱̕ ͭ͛͑̂͒̍ͨ̾͑̾ͨ̂͌̽҉̵̛̠̼̩̘̱̤̞̟͈͖͔̯̼̭̣̹̪͓̤͘ ̸̬͚̟̞͓̥̘͚͇̣̑͂͆̔͡ ͋̽̇̏̚͢͏͖̦̘̣͚͍͍̰̩͕̙͚͇̣̠ͅ ̡̛̼̟̺͇̯̯̞̻̞͍͇͚̓̎ͥ̏̅̃̉ͨͧ͒ͬͥ̍̀͟ ͣ͒ͮ̊ͬͬ͊̔̑̓̎͂̀҉͖̙͚̻̝̘̦̦̯͇͎͔̩͈̗̞͢͜ ̷͇̖̖̱ͦ͑ͤ̀̀̈ͩ̏͘͠ ̵̳͎̩̜͕͎̭͙̞̜̠̳̣̗͖̺͈̤̞ͧ̎͒̆͗͂͋͑͟͜ ̛͙̠̦̬̟͊ͧͩ̐͌͐͟͡ ͨ̓ͥ̉̉͆̚͏҉̦̗͎̹̘͉̞̺ ̸̧͉̦̹͔̼̰͕̥̙̔̌̇̊ͨ̈͆ͬͨͯ̃̋̄ͥ̍́ ̨̳͖̮̹̣̪͚͎͉̯̲̣̜̭̠͓ͦ̂̔̂̑̇ͭ͐͛ͪ̇ͭ̋͌̎͡͞ͅͅ ͌͂ͥ͌̀͏̢͔͚̦̥̻̞͜ ̡̪̮͎͚̠̻͚̪̙̉ͬ̾ͫ̑ͮ͑ͭ̈́ͪͬ̈́̚̕ ̱̜͚͔̙͈͎̗̯̘̫̞͙̮͇͗̏ͯ͛́̚͟ͅ ̈̃̈ͮ̽̐̈ͧ̀҉̺̳̪̮̼̥̩͍̼͍̼̤͍̦̙̙͈͈̦ ̨̢̠͔͙̤̱̞̱̉ͣ̔ͤ͆ͨ͛̊͒͗͂͗̍ͨ͊̔̍͝ ̷̻̯̙̱̯̖͕̼̺̬̦̺͙̟͇͖̳͓̽ͩ̍̄̋̈́͟͞ ̴͔̗̪̻̯̱͈̘̼̙̫̙̹̣̖̳̜͎̺ͧͫ̈̉͒̾̌̀̋ͦͭ̚͡ ͐̏͆ͥͯ̊ͭ͊̽̋͆̅ͪͪ̓̍ͧ̚͏̸̧̨̗̜͕̤̹͕̮̭̼̱͜ͅ ̞͓̭̻̳͈͓͚̙͚͕͚̺̯͙̱̤̘̎ͫͥͪ͋̈́ͩͥ͑ͫ̆͋̓ͨͯ̋̑͜͢ ̶̲̦̩̬̻̺̖͕͔̜̘̊̅̉ͩ ̟̲̙̺̩̲̪̠͖̟̬̩̐̈̔̔̊̋́͘̕͝ ̵̤̦͔͚͙̣͈̞̤̮͇̲̹̼̟ͣ͛̄͑͑̎͗̚̕͡͝ͅͅ ̵͕͍͚͖͇̯̼̟̱̬̪ͤͯ͋̓̈́̃͗̅ͬͣ̃̄͋̃ͣ̚ ̸͚̼̥͉̭̞͍͒͛̂̉̕͜ͅ ̵̟̭̭̠̣͇̟͖͔̬̜̫̰̫͕̳͊ͯ̂̆͐̓͂̐ͪ̋́̽̚͝͡͝ͅ ̴͈̠̙̰͓̦̘̠̬͎͍̼̘͕̹̭ͦ͆̽̉ͫ̒̓̄̂ͩͬ̔͛̍̍ͨͪ͘͡ ̧̮̤̞̥̎ͬͧ͌̀͐͛ͧͬ̾̏ͭͫ͗̈̾̋̚͢ͅ ̶̫̮͙̝̜̯͕̳̭̹̭͈̳̖̦̭̯̟̙ͤ̒̐ͦͬ̔͋̑͞ ̸̵̩̼͎͈͙͍̠͎̘̣͚͇̮͗̈͛ͪ̏̈́̇̏̀͟͝ ̡̨̟͕̻̼͛͆͂̓̈ͧ̉͊̄͗͒͒̿͟͢ ̧̺͙̫͙̹͍̯̞̠̣͎̝̟ͥ̇͆͐̇͗̐͋̃́̈́ͮ̇͛̕͞͠͡ ̠̗̘̫̰̜̈́ͮ͋̌͑̿̆̍ͩ̒̈͆͗͊̿̚̚͡ ̧̽̊̃̅̓͐̋͏̶̤̼͖͓̖͈͚͇͈̟͉͈͚̭̼̗͢ ̶̸̡̭̳̩̲̘̣͈̘͇͓̲͚̣̈̓́̊͞͠ ̵̨̔ͬ͂̓̌̌̓͜͝͏̳̟͎̦̣ ̪̞̼ͬ̈̽̿̽ͦ͒͊ͩ͌ͦͯ͌̊̚̚͘̕͘ͅ ̍ͣ́͏̛͏̢̝͙͔̝͔̦̳͇̻̰̣̜̪̥̞̞ ͩͬ͒͒͛̈́̀̋ͬ̓̒ͫ͏̕͏̴̭͔̲̼̲͝ͅ ̶̢̒̃͒̄͜͏̵̫̙̼̤̻̭̤̝̪̫̰ͅ ̶̷̳͎̮̙͇̬̹̹͕̬͍̰̰͊ͮͭͪ̅̏̿́͡ ̽ͨ̑ͮ̂̓ͥ͊̑͏̛̻̦̯̭̠̺̗̫͢ ̴̧̛͇̻͙̙̭̘̮̣͚̲̙̔̏̋̓̎͆̀̒ͨ̾̆͋̇̄ ̛͚͙̗͍̿ͮ́̀ͥ̍̃̊͗͗̀͟ ̲̱͖̹̻̖ͯ̑͂̉̍ͩͯ̔͛͌ͩͩ̊̂ͭ͂͝ ̷̶̳͕̠̠̟̥͉̳͚̝̜̯̰̋̆͑̆͗͊̅͗̚͟͞͝\n̡̨̳͕̣͔͖͉͉̠̠̼̟͖̞͑́ͯ̎̇͆̐̃ͬ͒ͫ̃ ̢̨͈̘̜̠̗͙̜̼̳̆ͯ̅̃̎̇͗̉ͨ̕ ̴̓͊̀̅͛̂̆̅̕͞͏̩͔̯̱́ ̵̡͍͉͉̙͉̼̺͓͚͕̬̉ͩ̽́̄̕ͅ ̨͉͔̭̟̰͙̮̰ͭͤ͒͑͗̉̍̐ͯ͑̈́̉͂ͯ̚͞͞ ͦ̃̽̋̑̌̚͞͏̨̤̼͙̭̘̹͖͍̳̠̥̼͡ ̸̡͇͓̲̣̳̳͈͙̲̭̝̤̪̔͐̓̄ͦ͝ ̴̡̝̝̖̼̮͔͖̤͙̫̗̩̳̝̦̯̞̗͗̈ͫ̔͑̃ͮ̓́́̚ͅ ̶̨̬̣͖͈̯̦͚͇̲̲̏ͬͣ̆̍ͥ̆͢͞ ̴̣̳̙̱̳̈̏̈͆̽ͭ̓̐̈̓ͩͧ̓͛̀̈́͘͜͝ ̒ͮ̈́̂̐̒̔͑ͮ̂̍̅ͯͥ̊̓͠҉̯͎̺̪̼̫͎͍͓͓̜̱̺̞̼̻̞̺͜͠ͅ ̶̢͈̫̟͓̯̖̪̱̳͗̑ͧ͞ ̴̵͚̙̲̻͚͇̝ͦ̅ͨ̉ͪ̀̊̏̽́͢ ̵͚̲̙̲̭̭̮ͪ̑̈́ͤ̾͆͐̓͛̇͐̿ͬ͌ͧ͜ ̴̨͔͚͎͈͈̯̖̱̞͓̃̽ͧ͂̅̅ͧ͗͆͂͗̀̏̐ͥͦ̽̔̀̚ ̢̞̠̼͚͔̅̊̃̿̈́ͩͥ͒͊̓͗̅̂ͥ̆̔̌́ ̱̲̙̘̗̙̫̭͔̠͖̫͎̙̜̩͉̻͌̑͆̏̉͋ͭ̅͋͆̏ͩ̊̓ͯ͂̊̀̀͘͟͟͟ ̸̡̨̯̘̘̘͖̺͉͕̼̗̞ͧ͛͒͢ ̡̢̧̨͙͎̫̤̝͓͍̖̙̺̘̗͍̮͉͐͂̔ͪ̇ͯ̽̕ͅ ̴̜̼̺͕̝̱̤͈̟̮͚̬̈ͨ̉ͭͩͮͬ̄ͯ͗̄̍̕͞ͅ ̄͑̈́̉ͦ̾̔̊̃̅͋҉̡̭̥̮̝̬͔͍̲͡ ̺̼͓̪̯̣̖̫̻͍͚̼͍̭͕̤̠̯ͯͥ́͐̌ͮͣͥ͆̀͠ ̸̢̢̢̺͔̼̘̟͙̱̳̮̱̯̖̻̻̙̊̃ͩ͒̇̀ͫ̇̍͆͂͆ͅͅ ̝̝̖̮̣̘̻́̏̃̓ͦ̕̕ͅ ̸̝̪̣͓͎̗ͫ͗̃͐ͪ̈́͋ͧ̑̾ͧ̄̽͒̒͐͜͜ ̷̵͙̥̳̖̳͂̓̋͛̆̆ͧ͗̈́͋̂ͭͥͨͣ̚͡ ̷͇͖̼̮͎̔̅̌̃̏̍͑̇̅͌̕͜ ̡̖̪̤̫̒́̽ͫ̏͗ͭ͗̕͠ ̧̨̪̼̲͚̪̻͕̦͇̝̖͓̤̥̫̣̖͈́͗̋͐ͭͩ̾̚͡ ̵̡̪̱̦̟͖̗͇͈̯̘̻̠ͫͣͣͣ̏̆͌͗̉̔ͧ ̢̹̮̬͕̗̝͎̟̜͗̅͑̏̒͑͂̀̕͠ͅ ̸̧̧̨̙̳̥͍͖͍̞̹̬̆ͬ̈́ͭͫ̀̋͒͂ͅ ͣ̑̊̍͘҉̦͍̣̥͉ͅ ̴̢̱̜̰̫̹͍̥͙͙͍ͫ̊ͯ̈́̑̎̅̚ͅ ͌̉ͩ̔̇͛̀̚͏̙̠͇̝ ̵̨̖͇̘̥͎̟̦͇͔̠͈͎̹͚̱̰́̆̉̃̍̿͗́ͧ̚ͅͅ ̢̙͖̳̞̯͈͉̘̭̭͕̥̤ͧ͛̈ͬ̀͜͞ ̷͖̰̘͚̄̐̈́ͪ̃ͪ̒͝͞ ͍̜̟̤̙̞̞̺̝͙̉̓ͧ̒̃̌ͩ͟͞͡͞ ̢̙̙̹̣̪͙̩̤͉̲̓ͪ̉ͯͣ̈́̑ͪ̃ͦͧ̿̑̎̑̀͌́̚̕ͅͅ ̸̮̜͇͚̜̙̀̂ͩ̅͊ͩ͜͜͞ ̴̨̛̮̦̥̘̗̖̭̝̩͂̾ͪ͊͋ͩͬ̀ͯ͗̓̈́͠ ̷̪̼̬͎̞͖̳͋̉͋̋ͨ̈́͜͟ ̶̸̵̜̖̖͕͖͓̜̫̤̫̭̩̖̤̬̘͎̟ͯ͊͋͌̽ͦ̈͋̉ͣ̏͌͆̓͗̚̚͝ ̶̧̟̳̲̲͖͕͈̤͈̙̪̫͎̟̥͈ͤͥ͊̚ ̵̨̖̳̻̪̹͙̮͖̟̣̩͚̖̖̄ͥ̅ͯ̂͛ͦͩ̇͗ͣͩͩͭ̎ͫ̐̃̚̕͢ ̴̧͖̳̪̮̟̐̅͂̈́̓ͫ̉̋̉ͭ̊ͤ̉͒͗ͧ̐ ̍̅̉͗̏͌̆̏̾ͧͮ͑͢͝҉̙̯̘̻̻̟͙̻̺̺̤̭͕̠̝̬̠̥͘ ̸͂͊ͤ̾ͨ̆̓̄ͩ̇ͭ͐̓̊̆͡͏̱͈̗̞͓̺́ ̸̢̛̘͙͚͓̖̥̹͍ͥ͗ͣ̿͗ͩ̆̑̉̒͐̇̆̓̃̾͋̈ͭ ̟̳̮̟͙̝̦͓̺̏̽̽ͧ̏̆ͧ̈́͑͐͊͆̚͞\n̸̯͇̠̥̭ͬͯ͛͒ͤ̃ͦͤ̐̉́̌͂͂̐̊ͯ̈͡ͅ ̽ͪ͐̔̌̋ͥ̈̍̍̓̈̈͛͗ͯ̈́̕͏̻̗͖͕̟̲̞͇͎̻̥͔͎̺͟ ̢͖̪̠͍̹͕͖̰ͮ̅̾̍̋͐̄̂ͯ̆̈́̏̉͒̇̉̓ͦ͘͘͢͞ ̸̼̹̤̟̤̩̠͎̪̬̱̯́ͤ̒̌̑ͯ̈́͂͋ͫ͠ ͎̼̜̱͖͖̖͍̱̖̠̺̦̣͂̂̃̿͛̎́̀͞ ̶̘̤͈͖̺͚͚̳̞̥̂̅̽̔̋̾̔ͮͥ̅̌̆̈́͐̆̇̃ͤ̅́ ̅̆͗̑͊͏̴̶͔̱̦̪͚̣̰̥̗̮͈͉̣̱́̀ ̞̰̫͎͖͕̦̭̬̰̖͔̫̘̙͈̍ͪͭ̇̆ͧͫ̎ͤ͘ ̧̢͔̞͍̙͕̗̟̺̠͔̮̦̏͌ͩ̓̄̎͊̏̋̐ͤͣͭ̾ͭ ̷̶̴̦͓̟̼̪̜̼̖̥̹̺̞̝̰̗̘̺̥͊ͬ̊ͧ̋͂ͦͬ̍ͦ̓́̀͗̀̚ ͖̼͔̭͎̠̻͎̰̯̥͖̜̟͉̬͙ͯ̾ͨ̑̃̇̂̎̇̈́̈̌͟͡ ̴̴̯̩̦̭̲͍͚͌ͦ̇ͧ̊͛̈́̚̚͜ ̨̤͇͉̣͙̪͙͙̙̙̬̓̈ͫ̌ͦ̀͒̇͑͋ͣ̇̄̂͋̃̾̚ͅ ̵̨͖̘̘̞̞̺͉̯͎̹̥͈̮̻̗̭͌ͩ̓͛̂̃̄͋͛̑ͧ̅͘͜͝ͅ ́̐̏̊͌͒͂̔ͭ́ͮ͆̐ͤ͏̧̠̞̹̝͎͍͕̼̮̀ ̵̨̢̫͍͇̱̦ͥ̃̋̊ͩ͊͗͂̑̓ͦ̓̅ͣ͆ͪ̀͟ ̡̡͚̪̼̣̯͍̤̳͉̈́̈́̏̈́ͭͧ̔ͭ̍̂͑͊̅́̂ͧ́͟ ͤ͛͛ͤͨͣͣ͏͏̬̞̞̞̫̰͉͍͉͖͎̞͕͖̝̥ ̇̋̓̉̅ͦ̈́͒ͦ͛̇̍̋ͤ̉ͭͬ̚̚҉̩̟͚̮̫͎́ ̶̡͎͓̙̲̼̰̍ͣͥͧͩͧ̾ͭ͘͜͞ ̶̶̗̙̹̟̝̣͕̙̜͇̮ͬͭͣͯͮ͛̐̅̒̉͂̍̀̅͌͒͢͝ ͎̫̣̞̺̼ͤͭ̊͐̅͛ͣͪ̇̐̐̊ͨ͋̓̓̿́ͭ́͜ ͂ͥ͆͐̆ͪ̒̓͗̊̌̌ͬ͏̸͍̤͓̲̹̻̩̫͟͠ ̴̸͈͕̜̩̭̦͍̰̫̩́͒̈́͗ͤ̓͗ͭͭ̾̿̆ͤ̽́͟͞ ̡̡̢͚̭̝͉̙̤̣͊ͭ̈́ͬ̿́̅̿ͮ̌ͯ̌̒̆ͦ́̏ ̨̖̥̼͙̣̼̻̻̣̂͛ͪ̊ͬ͌́ ̵̞̺̫̯͍̙̮̝̞̫͓̦̓ͣ̎ͮͫ̅ͫͨͤ͌́̎͐͆̀ ̍̌͗ͣ̓̈ͣ̽̆͗͌́̈ͫͧ̃̚̚͏͚̞̜͎̲̤̱̺͓͍̮͖͖̗̕ͅͅ ̢̛̻̥̹̓̎̐ͣ̔̐̃̔͆̑͆̓̄̔͌̐̽ ͒̓̾̏ͩͬ̂͐͛̒͑ͣͫͬ̇ͭ͟҉̸̯̹̠̘̲̘ ̸̷̡̻͎̗̬͙͖̺̰͔͇̐ͮ̇ͮ̚͟ ̶̧̨͚̟͚̼̣̟̟͔̜̤͇̭̦̜͖ͨͥ͋̉́ͣ̒͊̆ͫ̾̾̄͜ ̵̶̺͕̯̞̪ͩ̎ͭ͆͜͝ ̵̧̡͔̩͈͈̹ͭͧ̏̓ͦͥ͒̄ͩ͌͜ ̡͌ͯ̆̎̒ͣ̇̑̉ͥ͐̃ͮ̽̎͌̓̋̏҉̴̥͍̜̗͉̭̫͚͉̟͔͍͎ ͇̣̫̞̙͙͙̥͖̬͎̗̤̜͚͖͒ͩ̓̍́͟͟͡ ̵̷̶̨̬̹̤̻̘̬̭̫͓͙̼̝̺͋̆̍͛ͥͣͥ͗̂ͨ͛ͧ͌͡ ̷̛̦̪̞̩̥ͦ̈́ͨ̇͐̃̃͟ͅ ̧́̊̌̊͏̗͔̫̠̼͓̱͈̟̩̜̯͖̮̣̬͓͕ͅ ̷̰̞̮͎͕͙̝̰̱͍͌̓̄̐̇̓̏͒̉̾͛̿͑̍̀ ̵̧̧̺͖̝̞͉̼͕̭͔̥̙̠̂̄̏͛̐̓̄̐ͥͩ̄ͩ̓ͫ̓ͫ͡ ̴̪͇͕̝̩̣̥̻̳̪͕̜̋̅ͮͦ̽̃ͣ͂͑ ̧̫͇̱͓̻̺̣̤̪̉ͧ̑ͪ͑͐ͬ̉ͭ͛͆̀ ̶̡̜̝͈͚̯͍̪̭̪͇̭̲̓̒ͬ͋̏͒̓ͩ̕͡ ̶̢̢̘͓̪̝̣̣̝̖̤͚̟̤̣͈̲͓͙̔̍́͆͛͌ͣ̒ͮ͜ ̡͕͔̠̙ͣͫ͋̉ͬ̑͐̏͆̈́̀̊́ ̴͖̻̲͈̺̾̄͌ͩ̿ͫͨͬ̐ͫ̚͡ͅ ̴̷̠̥̠͉̱̳͕͇̌̑͗͂͆̂ͣ̉ͩ̈́́̑̔̂̓ͬ̾ͤͅ ̸̾̔͆̆ͤ͊ͥͤ́̀̚͏̞̩̪̝̪̞̳͇̳̪̤̳̩̜ ̍ͧ̔ͪ̅́͂͆ͥ̇҉̯̞̖̲̟̣̪ ̷̸̩͖̳̱͚̹̼͉͖̲̤̬͚̇̿̌͂͌̂̂ͪ͑ͯ̀͋̔͌̇̈́̀̆̉̕͘͠ͅ\n̷̩̗̩̝̯̤̱̻͖͉̮̺̱̫̝̗ͮ̂̆̏ͬ͒̆̅͐͑̉̈͗ͯ̊͡ ͍̲̙̯̳̟̙̝͕̳̜̪͎̦͎̻̮ͬ̏̆́̈̋̄̒͊̌͋̀͗̔̒͊͘͟ͅ ̷̺̺̯̘͖̻̝̙̩͔̳̖̰̪͉̯̣ͤ̈́̔̉̃̊̾̾ͬ͐͂̓͐̅̋ ͥ͊̅̿̾̒̑̈́̈̄ͭ̇ͮ̊͆̅͑ͭ̐͏̨̛̬͕̗̫͍̻̟͈̮̦̞͎͚͢ͅ ̴̼̱̠̤̫͓̮̟̞̋͗̽͑̊̊̑͠ ̨̊ͮ̑ͥ͡҉̝̭̥̘̙̱̯̲̞̕͢ ̡̭̭̟̜͉̮͕͕̪̠̞̬̍̋ͦ̌̒ͤ̆ͯ̓ͭ́ͨͅ ̣͇͕͓͖̞̫̟̒̈́ͩͬ̒͆̑͐ͭ́ͦ́́͘͟͞͡ ̛̯̹̙̘̰̬̪̼̻̙̓̍̇̃ͭ̿ͭ̇ͪ̎͒ͬ͐͗͆͘͢ ͌͋ͫ̐́͏̵̷͈͉̼̮̺͚͖͈͓̞̼̜̩̬̬̣͕ͅ ̵̖̮̞̳̣̩̟̗͓ͭ̉͑̓ͮͮ͗̚͞ ̛͒͊ͯͤ̐ͩ̈ͬ͢͠҉̤͇̤̗̜͓͎̟ ͓͉̥̠͎͕̖̒̍ͣ̍ͬͧ͂ͣͣ̏̌̋͒ͩͨ͛̇ͭͨ̀̀ͅ ̼̟̗͓͔̐ͦ̿̉̕ͅ ̴̬̱̟̹̪̼̪̗̻̫̬̜̿̂͛̍͐̔̽̊̅ͤ͜͝ ̷̧̨̨͛ͯ̽͂͏̯̝͚͉̖̳̩̞͖̝̳̹͓ ̸̴̸̜̙͉̟̙̼̝͈̪̗͓͙͕̖̿ͣ̽͆̋̀ͤͬͤͧ͛̍̿̊́ͭͥ̚̚͟ ̵̶̢͍̗͇̮̝̲̣̫͔̗͌ͦ̉̾̽͊ͭ̀̕ ̷̡͋̃ͣ̈̀͂̓͑̑͂̓҉̹̹͈̼͎̱̞̦͖̣̠̺͍̳̖̭͎̺̳͜ ͪ̓ͯ͋̒ͯ̊̽̆̿̽̚҉̜̥͈͓͎̥̲͉͖̘̼͚̣̰̠̮̤͜͠ ̵̢̭̰̪͔̯͍͈̮͕̞̞̜̭͎̤̹̘̊̇ͮ̊͘͡ ̧̛̛͎͚̞̪͉͕̼̱̠̰͈̫͙̬̲͐͐͊ͮͧͭ͆̎̏̀ ̸̜̲͈͙̣̺̭̪̓͗̽͛̿͞͝͞ͅ ̡̢̢̼̠̤̯̭͖̳̳̲̫͙̦̠͎̖̩̞͕̎́̄ͮ̂ͥ̇̓͢͠ͅ ͬͤ̽͋̊̆̐ͫ̽͘͜͏̡͇̺͎̬̠̞̦͞ ̷̧̞͈̫͍͈̗̼̼̫̦͕̜̺̮͓͍̠̌̉ͫͤ̋̿͌͋͊ͤͣ͡ ̴̛̥̥̟̙̙̘̻͙̻̰̙͓̲̠̝̬̺̱ͦ̏ͤ̓̂ͧ ̨̨̹̩͙͕͍̂ͫ͛͐̽̆̈́ͬ̈ͬ̈͂̇̀͟͞ ̟̯͎͖͉̻̫͓̺̈̒ͮ̽ͪ͒͑ͫ̅̒̓̌̕͝͞ͅ ̺̠̯͙͓̙̣̦̮̯̣̖̭͕͓͓̬̆̓̐ͫͨͫͧ͟͢ ̠̠̺̜̠̗̫̰̺ͣ̄̃̍ͯ̚̕̕͘͟ ̨̠͈̬̟̮̹̱̻̙̦̰̾ͤͭ̈̐̿ͭ̓̅̿̑͑̌ͤͮ̃͗́͝ ̵̛̳͇̩̗̊̿̾ͯ͢ ̴̡̺̰̹͍̝̜̣̪̹̗͖̟̬̣̏͂̏̐̕͞ ̯̻̰͍̳̠̟̟̟͖̝̤̱̓ͪ͗ͨͨ͞͞͝ ͭ̑̌͒̿̈́̾̃̌ͨ͐̈͏̨̝͕̗̤̟̳̮̩̰̞̥̳̭̮̟ͅ ̴̛͚͎͔̬̦̺̖͌͋̏͌̔ͭ̓̍̌ͤ́́ͅͅͅ ̢̨͍̠̙͍͈̖͖͚̲̙̙̮͎̞̼̑̄͂ͦ̃̿̉ͥ̊ͬ̀̚ ̶͓̖̙̗̪̠̹̬̝͍̭̱̪̫̦̲͓̏̅͒͐̄̓͝ͅ ̷̸̻͙̮͎̻͇̹̤͎̠̘͖̝̮̠̗̭̎ͭ̐̿̑ͨͮͮͧ̓̚̚͠ͅ ̨̧̫̰̤̯ͦ̽̄͂̈ͫ̄͗̎̀̕͢ ̨̦̥͓̗̰͈ͤ͗̂̀́͟ ̢̨͊̊͐ͬ̂͂̂ͯ̓ͦ̆̌̊̔̒̆̚̚̕͏͕̟̲̞̝͚̺͈̼͓̤͚̹̥̬̹̻̭͘ͅ ͕̜̙͖͕̜̲̰̟͉͙ͥ́ͬͬͤ̉͊͆ͭ́̀̚ ̷̢̤͚̩̜̽ͧ̾̓̔̓̈́ͧ̀̄̋ͪ͑̎̕͟͠ ̝̯̬̫̖̆ͮ̏ͮͯ̌ͪ͂̓ͦͪ͂ͧ͛ͪ̚͟͢ ̨̧̛̛̟̱̩̻̮̱̤͇̬̬͇̝͈̹͓ͮ̓͋͌́͋ͮ̋ͣͨ͆ͤ͒̋͑̊ͧ̈́͡ͅ ̢̲͎͍̜̤̜̼̰̯̟̣͊̍̈ͥ͊̌ͥͭͦ̆͂̓͗͊̀̑͑ͫ̀̀͜͜ ̷̶̓͊̑ͦͬ͊̽̓͊́̔͒̚͘͏͈̻̘͈̙̲̝̰̩̰ ̨̼̩͕͕͇͙̳͛̍͂͐̌ͦͪ̑̒̋͐͊͗͐͊̽ͪ̈͒̀͢͠ ̤̰̪̩̰͉̩̣̲̘͙̺̱̖̖̠͎̖̌̽͂̄̌͑̕̕͘͡\n̢̲͙̖̭̤͚̺̐̋̒ͩ̐ͤ̇ͣͣ̄ ̛̱͇̭͈̮̲͇̩̖̬̤̲̭̦̮̘̃ͪ̄̈̐ͫͧ͆͂̏͗̚͟ͅ ̴̛̻̤͓̻͍͍͓̥͈̜͈̼̮̻̬̐͐ͤͬͧͬͣ̉ͭ̍͐͢ ͈̺͍̖̹̫̣̗͖̒ͩ̊͑͆̒ͭͥ̇ͧ́͜ ̵̺͎̱͙ͪ̇̉ͣ̉ͬ̿̈́̅̋ͣ̀̚̚ ̑̄ͮͭ̀͐͆̓͊ͥͣ͘͜͝͏͙͍̻̜̣̪̠̦̖͈̭͍̹̩͙͠ͅ ̒̀̂̒ͦ̇͒̔ͫ̉̇̎͞҉̸̺͉͉͕̞͍̟̩̖̰̦̼̹̼̫ͅͅ ̨̹̼͈̙̭͇̣͇̭͇̗̺͓͍̲̯̬̲ͯ͂̈́̓̾̾ͥ͂ͮ̆̈̄̇̐ͩ̅̿͜ ̸̸̓̓̐̒̔ͩ̅̃ͥ̍̅̏̂҉͕̖̬͍̜̰̱̖ ̷̡̛̖͈̦̭̗̖̖͉̞͐̌̅̋ͭͫͬ̓͐̊͐̚͟ ̨͍̬̼̖̠͎̫͇̙̘̯͇̮̩͔̯͒̽͂̾͆͂ͣ̂͐ͩͣ͗͑̽̉ͯ̋ͩ̊́͟ ̨̓̓̑̓̂̇̒̔̽ͨ͊̊͂ͦ̿̀̚̕҉̷̝̝͕̖̲ ̸͓͙͔͓͔ͣͫͩ̇ͯͣ͆ͧ̿̾͊ͦ͘͘ ̷̨̢͉̟͕̺͖̫̹̯̻̿̎̓ͥ̏̓̊̕ ̛͆ͭ̒ͨ͢҉̷̙̬̲̯̲̗̙̜͖̮͇̤̲͜ ̸̸̡̣̭̞͓͆̉ͦͣ̊ͣͫ̊̈́͞ ̵̸̻̭̦̪̜͚̗̣̜͑ͦ̑͗͢ ̶̢̥̻͙͙̯̥̘̞̼̞͔̓ͩ̇̐̊͂ͬͯͫ̇̾ͮͥ̑ ̡̧̭̗̙̙̞̗̹͙͉͓̳͚̬͙͉͇̱͂͒ͮ͊ͨ̃̽̅͊ͪͮ ̶̳͇̜̯̝̞̺̰̭̼̍ͯ̅̂͋̆̉͟͢͜͞ ̶̸̧̜͖̬͙͍͕͎͚̃͗͌́̾ͮͥ̒̅̾̽ͧ͆̅̑̊ͥ̚͟͠ͅ ̴̰̞̰̞̣̀͛͒ͯ͑ͭͨͧͨ͐ͬ̄̾́̚̚̕͠͡ ̡̈́̑̾ͦ͏̴̛͉̞̤̗̮̮͉̦̰̱͙̲̰ ̫̝͖̰͇̯̣͍̣͚̘̤͙̼̭̒̏͋ͮ͒̅̐̅͗̍͑ͤ͒̈́̎̆ͧ̇͘͘ ̡̌̽ͨ̋̿ͥ̇̽͆̆̋ͯͣͬ̃ͪ̃̐ͤ͏̡̱̻̞͕̩̗̩̫͖̜̙͈͓̘͉̕ ̵̞̪̹̣̯̯̈͒͆ͨ͊́ͭͧ͑͑͢͠ ̸̧̛̻̟̠̥͍͕͓̳̬̰̰̖̼̘͎̙̈̎͐̿͋̓́͞ ͖͕̞̠̂ͦͤ̍̊͐͘ ̴̢̜͙̪̘ͧ̆͑ͯͭ̾͐͛̋̊ͨ͌̌͆͌́̕͢ͅ ̵̨̈̓ͯ͊̉̓ͭͭ̔̋̚͝҉̜̟̪̖̞̰̳̜̺̥̤͈͍͈ ̴̤͓̼͍̰͚̘̼̦̬̝̲̦̭͎̱̳ͥ̾̅̈́̽̎͛̾ͣͤ̑̀̚ ̵̒͐̈́͆̐͊ͨ̒̉ͧͫ͆͐ͩ̍̓̚҉̶̡̪̦̗̘͓͙̬̦ ̴̢͍̣̳̙͙̥̩̬͚̭̻̫͈̩̙̍̈́͒̌͑͑̐ͨ̒̄͗̍ͩ̉͟ ̯̭͈͕͎̠̑̃͛͂̅ͤ̒ͤͧͬ͐̃͐̚̚̚͟͟ ̧͎̺̟̜̙̳͔̫͍͕̻̝̼̼̝̱̭̓͆̉̅͌͐̏̈ͩ͋ͮ́ ̰̖̹͉ͨͫ̈̓ͯ͊̀̌ͧͪ͂ͬ̓ͥ̈́̚̚͢ ̵̨̧͎̤̪͎̝̻͛̌̋ͣͪ͋ͮ̌́͟ ̢̢̻͔͍̘̄̎̅̑ͥͮ̾̅ͥ̉̑̀ͮ̈ͧ̑͊̇̔́ ̷̸̢̥͔̖̲̰̯̺̘̘̩͉͇̦̀ͨͣ͞͝ ̍̉́̒̀ͨ̅̀͋͌҉̪̠̹̘͎͖͉̼͈̥̜͈̮̝͍̩̯ ̴̵̫͇̠͇͕͉̪͖̟̩̯̭̳̞̟̦̯͒̍ͮͭ̓̒͠ ̶̴͉̫͍̖̪̠͐ͧ̏ͤ̈́͂̅̆̇ͩ ̵̸̮͎̝ͮ͛̄̊̿ͦ̒̓́̀̓̋̾ ̴̝̯̝͓̥̟̰̙ͮ͋͛ͬͨͧ̀̑ͤ̽͐ͨͪͨ̏ͦ̂͘ ̸̲̯̗̭̠̅̃͂̇̓́̌͊̃͐̆́̄̂̽ͩ̇̒̀͘ ̢̙̳̲̳̗̪͍̤̯͙̺̜͓͓̣̮̖̈ͩ̏̌̎ͨ̉ͬͭ̉ͭ͑ͥ͛̚͝ ̈ͤͮͦ̉̓̆̀͐҉̯͕̳̙ ̸͐̽͊̉͑͏̜̺̬̰͝ͅ ̙̫͈̤͚̥̱̹̻̰̼͗̇͂̍̓̇̕͠ͅ ͩ̿ͯͤ̉͂̈́̔͛̾́͏̙͔̤̬̝͘ͅ ̵̸̡̛̮͍̹͚̟̩̳̜̥̜̞̙̝̪̤͎̱͋̑̃ͧ̇ͪ̃̒̑̑̊̐̒͟\n̵ͦ͗̿͗ͧ̀ͪ́̋̈̄͂ͭ͢҉̩͈̠̯͓͓̲̠̭̳̮̖͚͓͇̣̬͠ͅ ̅̔̃ͧͦ̀̂͑ͪͫ̑ͤͭ̎͐̐̚͏͙͉̙͈̲̰̰̺̬͕̻̺͎͖̟͖̺͍͉͡ ̸̵̶͖̘̩͙̰͙͙̥̻̯̻̘̬̪̗̉̾̓̌̐̽ͤ̎͑͌̓ͤ̍ͧ̐̚͡ ̬̹̠̭̠̜͙͚͖ͭ͛̌̆͌͌̇ͪ̉̎̊́́̚ͅ ̴̢̟͙̰̟̪͉̜̯̰̼ͬ̒̾̓ͨͯ̌ͬͫ̈̈́̋ͨ͋̔̅̆͝ͅ ̸̣͕̩̝̤̬͈͇̹̬̜͖͈̦̝̩ͮ̀ͭ̎̉͢ ͍̣̩̖̣̲̮͍̠̫̣̰̺͇̣̣̯̃̿̍̇̄̏͌̔̌ͩ͗͒̒̊ͮ̒̑͑́̕͜͝ ̿ͤ̃ͩ̂̓̽͛̆ͬͥ̎҉͍̯̖̘̪͙̦̫̥̻͙̯͉̮̗͔͡ ̵̵͍̱͍̣̳ͮͣͧ͌̀̓ͨ̈̇̎͜ ̴͉̗̥̤̱̣̤͚ͩ̔ͪ̅ͦͫ̄̿̄̏̓̾͡͡ ̲͈̞̩̪̫̹̻̼͖̹̳̘̩̜͖͔̲͓͂̿͗̀ͩ̂ͬ̆ͮͣ̆ͣ̋̀̌̚͠ ̸̨̲͖̭̤̙̺͊ͤ̍ͯ́̕ͅ ̴̵̬̣̟͓̥̃͌̓ͪ̏́̕͢ ̶̸͎̦͕̘̜̻͖̣̻̺̬̰͂ͤ̿͆̔ͦ̊̾̾̀͆ͨͤ̽ͣ͢ͅ ̈̃̽̓ͬ͐̏͐͌ͦ̿ͣͦ̏͘͜͏͉̥̘̬̠̹͙̘͚̙̠ ̷̢̢̞̥̙̙̦̟͉͙̰̗̰̘̰͙ͬ̑̒ͥͬ̆͗̀̿͊ͮ̚̚͞ ̡̢͔͈̖̭̳̻͎̙̱͓̤͚̗̘̗̟͔̞ͥ͆͑̃̋̎́̀́͠ ̰̫͎̼͙̱̞͕͚̜͍̣̝͙̫̦͓͔͙̐̈̆ͯ͛̈́̚͟͡ ͇̠̮͚͖̰͇̘̪̼̗̗̓ͯ͂̒ͬ̃̇́͟͢͠͝ ̷̧̜̫͖͕̮̺̫̻̹̹̠̥̄̀͂̿͆̑̄̈́͑ͭͤͨ̀̍ͥ̐͑́̀ͅͅͅͅͅ ̢̱̺̫̲͚̪͊͊̉̄ͣ͌̏͒͜ ̷̷̙̺͈͍̝̠͈͍̬̗̩̼̒̐̿̈̾ͫͦͩ̽̓ͫ̃̿̍͞ ̛͙̫͖̥̺̤ͯͫͭ͐̈́̄̄̈́͗ͨͬ̃̋͂̍͟ ̛̐̐̐̂̈ͯ̈́͏̼͓͚̼̭͈̩̬̱̩̥ ͩ̓͆ͥ̒̀̔ͮ̐̀̄̌͂͒ͨ̈͟҉̤̟̫̠̝̺͉͇͙̙͈͚̗̙̲̠̟ ̏̅͆͗͝͝͏͏̛͎̜̞̱̬̭͍ ̶̛͉̖̹̟͈͔̺̖̙̟͉̣̬͈̘̖̪̿̄͑ͣ͐̋̉ͮ͛̅̓ͣ̐̊̇̾̇ͪ̕͟͞ ͚̞̜̣ͣ̆̌̑̕̕ͅ ̨͎̝̹͈̟͇̰̖̟̟̰̯͆̓ͦͤ́̀̔ͮ͂͗ͫ̓͜͟͝ ̩̯͈͔̩̖̰ͩ̄̔͊̇̑́̾͜͝ ͩ̄ͬ̀͆̍͛ͨ͐̿ͫͯ̏͆͊͒̈́ͯ͘҉̢̫̗̠̣͉͚͇̩̱̭̤̤͓̯̟̯̀͘ ̱̝͚̼͕̣̣̬͎̅̏̾̽̎̀͑ͨ̊̑ͩͥͫͫ̕ ̶̧̯̬͙̗͖̙̦͈͙̜̱̲̞̜̉̅͒̅͆̓͒́̚̕ͅ ͕͕̞̮̹͎̙̜͎͓̗̪̙͎̦̤̯̑͂͆̀͂͆ͯͤ͊̇̍̍̓̑ͩ͞͡͡ͅ ̷̹̖̘͕̞̮̪͕̪̹̐̈́̇ͬ̂͒ͤ̒ͩ̍̋̏̊͡ ̧̡͔̙̜̖͓̯̟̪̘̘̓͑̆̿ͭ ̵̢͎͙̪͍̫͚̯̹͑̎͌̍͐ͦ̈́ͭͬ̈̍ͨ̚ ̘̮̻̦̼̘̻̬̦̺̤͖̦̫͋̽͒̇̕͜ ̨̞͙͙͙̲̺̤͈͚̠̺̺̯͆̿͊ͭ̃̄̌ͮͨ͌̔̈ͥ̉́̒̄̃͟͝ ̵̒̈̾ͪ͐̈͒̊ͫͭ̀̌̚̚͘͏̜̜̟̜͓͍͖̥̘͎͉̣͓͙̩̲̥͝͝ ̵̺̟͚̲̲͕̘͔̫͈͚̞̂̈́ͨ̄̇ͯ̽͋ͩ̽̾ͩ̚͞ ̍̃̾̇̔ͤ͏͏̷̜͔̣̮̗͎̘̣̫̹̮ ̢̢̡͎̦̫̳̻̭̱͎̼̗̠͔̞̯̠͎͍̼̾͑̔̈́̏̌͛̔͌ͣ͛͆̊̚͠͝ ̙̪̗͇̗̞̘̭͉̲̬͗ͧ̊̂ͥͯͦ̔ͨ͝͝ ̷͕̬͖̭̳̭̘̦̪̭͕̗̹͉͙̤̬̺ͯ͌ͫ͋͝͝ ̵̢͓̳̹̦͖͍̍̀̓̄̋̆̂̇̑̌̓̌̇͑͋́͘ ̵̴̸̴͓̻͎̭̗̲̣̱̖͓̓ͭͮ̉̎͂̒̓̀ͭͩ̐̂̀̚ ͇̬̪͖̖͌͂̄̓̌̈́͟ͅ ̈̍̆͂ͮ̃̿͛͑ͦ̍ͭ̚͘͜҉̥̯̥̟̯̯͉͎̟̠͍̩ ̶̛̞̗͕͎̙̼͇̺͕̠̼̼̐̎ͩ͛ ̴̢̨͍̫̱̹͊̾̓͒͐̎̔̀ͧͪ͒̃̏͢͠\ń̹̬̬͎̹̝͈̰͎̲̘̳̤͍̺ͭͤ́̃̒̀̔ͨ͆ͮ̀̚͟ ̷̧̞̣͕̟̥̰̦̭̥̺̖̞̹́͌͗͌́͊̍̌ͨ̆͘͢͡ ̉͑̏̎ͯ̄̇̎̋̀̋̐̅ͣͥ̎̚҉҉͠҉̳̭͚̻̝̩̖̗̥̲̪̦̮͖̬͘ ̧̣̩̘̯̠̭̫͕͚͖̞͇̪͈̥̖̜̫̓̍̃͒ͪͧ̽̿̽̀͟͞͠ ̧̆̆͂͛̏̈͊̓̽̑҉̶̦͖͔͜͠ ̄ͧ̀͂̔ͤ̀ͥ̏̅̀͏͍̹͔͈̬͖̝͍̼̙̹̦̣̠̗͈͖̀͢͡ ̵̡̛͔͔̰̖̙̣̊ͯ̓͗ͥ̔̉̊ͯ̃ͤ͜͠ ͬ͒̿̽̎̓̍̂ͭ̇̃͑̊̂ͯ̚͡͏̴̧̣̪̳͚̭̘̗̩͡ ̨̢̜̟͓̼̤͖͒̈́̔̋̚͡ ͚͍͙̬̥̬̱͈͑̇͐̾̎ͪ̓̉ͨ̂̚͘͝ ̷̭̰̖͉̭̰͎̲̮̟̟͊͆ͧ͌͒̑̄͞ ̡̞̙̫̝͂̇̿͛̐͆͋̂ͥ͋̄̓͘͡ ̵̸̨̩̗̤̬̘̲̥̤͕̗̼̔̂͌͋̈̊̑͗͜͡ ̢̨̫̬̹̠͔̝̰͎̖ͦ͋̐̃̀ͨ̽͌̐ͤͭ̌ͥ̀ͯ̇̌́ ̴̵̪̼̗͙̙̘͍̪͚̙̮̱̍̌̑ͧ͂̍̂ͨ̒ͩͧ̄̽ͥͣ͂̊́͢͜ͅ ͦ̀̈̏͂̓̓̉͋̆̎̃̀͂͊̋̀̚̚͘͟҉̡̻̤͉̻̳̗̘͍͖̯̼̦̫͎̥̟̘ͅ ̶̸̯̲̥̦͍̥̪̖͇ͤ̃͐͌̍̂̅̈́̉͒̄̄͊̚͘͠ ̸̛̦̟̠͇͚̭͎̺̰̹̞̭̝̹͔̯̙͈̒͗ͯͣͨ̽̂͆ͤͭ͘͘͢ ̷̸̸͔̠͚̟̥̱̱͖̦̦̊ͥͣ̇̓̇̔̐̊̆͒̍̈̾̂͑ͭ̈̀ ̘̥͉̝̯̠̼̝̲̼̫̥̞̋̐͆̿ͬ̎͌ͩͨ̇ͯ͠ ̸̨ͧ̓͌͐҉̰͙̩̗̲̳͈̱͕̙͔̼̹͙̜̭ͅ ̢͑̓ͧ̓ͫ̇̑̋̅͆̓͌͞҉͔͎̻̮̺͙̥̩̺ ̶̹̙̹͍̥̺͔̭̞͓͉̪̎ͨ͆͂̈̋̅̍̄͛̍͋̌̚͘ ̡͙̻͎̰̠̟͔̙͓̭̪̙͈̭̬̺̾̔ͤͮ̓̉ͫ͘͠͠ ̩̭͙̟̱̺̗͇͖̪̱͎̭̯̈ͦ̄͑̂̐̂͂͆͛̈́ͦ͠͞͝ ̃͒ͣ̏ͯ̏͑̽̈͊ͤ̎ͦ̒͊҉͘͞҉̘̯̞̫̟͔̪͕͝ ̸̷̛ͩͦͣͩ͛ͬ̓̇ͧ͑̂͏̶͉̥̰̪͈̹̰̗̘̣̝̪̮̻ ̜̖̺̣̳͎̘̱̣͍̭̪̜̜͉̤̟̓̈ͣ̂̿̀ͨ̃͠ͅ ̘̹̟͖͖̙̥̗͙̤͖̳͇̞̗ͮ͌͗ͪͥ̾ͣ̅̀͘͟ ̡̢̜̬͙͈̞͈̫̮̰͕̩̣͍ͯ́͋̏̀͜ ̡͎̻̹̖̣̇̀ͫ̾̎̄ͪͮ͋̊͢͡ ͋͛̋ͥ͊̓̆̇ͣ̊҉̨̲̰̬̮̦̱͚̲͚̤̝̳̘̙̜͓̘͍͍͜͝ ̱̱̖̭͔̯̤̮̫͎̥ͦ̂ͮ͗̎̉͛̄̎̕͞͞ ̶̖̫̭̥̹͈͆͛͗ͥ͂́̃̂͊ͮ̑ͣ̂ͬ̀́͞ ̴̧̖͈̩̼̮̲̗̳̙̣̤͚͙͓̯̠͔̗̍͋ͭͬ̀̚͡ͅ ̃ͮͩͮ̒͌̍̎͐͏̸͍̝̱̥ ̛̛̠̮̤̺̯̙̒ͬͯ̀̓͛͂̾̍̑͒͒̄ͯ̚͢ ̨̪͕̠͖̳͕̫̤͚̳̙͕̀ͥ̍ͤ̂͊́ͤ̐̾̇̅́͟͞ͅ ̷̨̣̗̦̺̳͇̹͔̭ͯ̂͛̓ͯͬͪ͠͝ ̘͔̠̭̿̀ͫ͆ͧ͒͒͒͂̋͜ͅ ̈̽ͨ̈̉̉͌ͮ̋̓ͨͣͪ̉̄͂̾͡͏̹̘͔͚̬̪͉̗͔ͅ ͌̈́̿ͬ͛͗́̓̈́ͬ̈̽͏̛͞͏̝̣͎̝̼̖̥̖̪̟̘̖̬̘̦̜̱ ̞͓̠̮̘͇̈́ͩ̇̒ͥ̿͗̓͘͜͞ ̶̺̤̟̲͖ͤ͑̓ͧ̌̒̿͒̌ͬͫ̃̔͑͗͗ͥ̊́͢ ̢̛͓̰̱͈̯̣̟̤͖̦͕̗̬̹̂̃̈ͤͩͫͪ͊̏͒ͧ̊́ ̵̶̥̣̯̗̦̬̖̘̭͔͋͑͂ͯ̓ͣ̌͌̽ͩ͗̎ͧ̈́͋̕͟͠ ̡̤̤̰͎̣͔̹̜̩̙̆̌̓ͬ̾͝ ̸̢̩̺̪͈̪̲̳̳̼̱̐̑̉́ͮ̾ͦ̈ͦ͗ͮ̚̕͢ ̘̯̩͈̖̹͈̜̦̜̤̖̠̞̭̔ͮͪ̽͌̋͐̆̅͘͜ͅ ͩ͂̎ͣ̄͗̍ͧͤ́͂͛ͬ͊̀̓͂͂̎҉̸̛̤̫̺̫ ̶̗͇̟̳̠̥̞͊ͩ͐͌̎̎͌ͨͥ͘͟͢͠ͅ\ń̡̳̙̪̣̜̝͚ͦ͑̂͐̐ͪ̓ͩͬͭ̉̀͡ ̨̢̥̥̼̝̖͈̦͕̗̫͎̺̯̖̻̺̮ͤ͆̇͗̀ ̸̷̡͍̱͉̲͕͔̻̙͙̠̫̺͛̈́̑͂ͬ̑̆̐̅̑͛̈́̀̓ͬͩ̔̀͡ ͔̣̝̲̣͓͓͓̩͖̹̟ͦ̽͑́͂͂͒ͬ̏ͣ̎͗̔̾ͪ̾͑̚͡ ͉̗̼̘̰͔̏̊ͪ͆̒̅͛̍̆̆̂̓ͫ̌̀́̕͝ ̸̧͉͔̗̬̥̪̲̱͉͆̌̊̃̋̏̀͂̓̂̒͟ͅ ̷͆͆̆͑̏̓ͭͧ͟҉̪͈̪̠̘̣̰ͅ ͔̦̯̙̹̲ͧ̽̏̇ͣ̑̀͟͟͡ͅ ̶̨̼͇̟̤̬̱̖͂͗̓ͫͯͯ̄ͬ̒̏̋̃̚͞ ̡̛̟̭͍̩͙̝͈̞̖̹̲̦̳̘̖̝̈́͆ͯ͌̉̈͋̔̿͆̑̇ͩ̇̈́̑̚͜ͅ ̧̛̩̫̹̪͙̞̞͉̠̘̯̺̮̳̪͎ͣ̋ͧ̉̆̽͑ͥ͒ͬ͆̊̏̀̎̂̒͌͡ ̠̱̺̰͕͒̂͋̂͗ͪͭ̉͋̉̈́͂̄̒͊̀̚̕̕ ̵̷̸̟̘͍̐͊ͤͣ̐͑͂̍̓͆̄́ͮ̅̀͠ ̴̞͍̻̗̖̓ͪ̇ͫ̓̄̓͌̐̂͌̃̅ͤͪ͑ͥ̀͢͟͞ ̵̢̛̼̭̞̖̙̟̯͔͎̮̩̘ͮͥ͌̽͊͗͘ͅ ̸̎ͣͦ̍͊̐̓ͪͪ̊ͥͫ̈́͊͑̈́̐͏̴͙̯͇̜͍͉͓̕͝ ̫̦̯̳͎̻̠̬̹̟̦͍̮̱͐ͮ͗̒̾̽͋̽̃͡ͅͅ ̷̭̦̝̪̗̟̫̟̩̜̝̥͚̼͇̮͓͈ͮͬ͒̒̆̀͡ ̷̸̨̛̝͍̯̻̳̦̰̭̼̼̬͎̫̳̺̆ͦ̽ͨ̈̐ͯͪ́ ̴̧̳̣̠͎̭͍̦͈̳͎̞̬̭̱͂ͤ̃̾ͥ̎ͩ͌̀͢͠ ̡̡̠̪̼̥͙̹͚̱̠͔͉̞̟̙͉̗̯̒ͥ̑ͬͣ͊̓̏̀͝ͅ ̧̱͖̩̫̮̮͉̻̬̝̩͇̿͗̂͛̾ͭ͒̽́͂̎́̉ͧ̓̃̉͜͡ͅͅͅ ͩͩ͋̄̊̉͛͘҉͕͈͖͉̰̟̘̱̕͜ ̸̷̼̣͇̣̝̭̲̩̹ͭͯ̇͊ͦ̍̂͒̂̄̾̊̾ͮ̀̚ ̓̉̋̽͆͛͊̍̇̿ͯͮ̆̉͌̾̆̂̚͏̛͈̪̟͉̖̞ ̵̵̵̉͋ͭ̂̉̎͌̑҉̛̙͖̝̥̥͇ ̸̢̛̩̹̣̳͔̪̞̘̭̟̺̺̻͕͎͉̥̮͌ͤ̑̒̀̊̀͝ ̵̷̮̩̩͚̟̝͔̦̱̱̭̬̊̽̀̒̈́̔̇ͤ̍͆̔ͨ̐ͣͣͥ̚̕̕͟ͅ ̛̅̍ͬͭ̒ͣͧ̅̑ͭ͋ͦ̃̆͋̔͢҉̙̲͉̹̬̕ ̡̤̳͇͍̹̤͍̏͐̂ͣ͐͘͢͟ ̧̤̯̻͍ͨ͑̐̂ͨͥ̈́̌̾ͤ̾ͮͪ͡ͅ ̴̨̢̬̗͓͕̙̙͇͖̯̫ͬ͒́͑̋̿ͥ̀ͬ̆̐̍̈́̒́͟ ̦͖͔̘̥͚̮̬̘̤̪̗͆ͨ̃̅̎ͧ̿ͩͧ̍̍͊̅̒̎̉͟͟ͅ ̸̶̙͚̙͇͎̱̯̫͙̂͒̒̔̅ͫ̓̈́ͬͤ̒ͥ̂ͫ͑͟͠ ̸̡̟̳̩͔̤̫̳̬͓͈ͨ̏̓͋͑͊̓̅̇̊̿̔ͫͥͨ́ ̈́̓̒̀̓ͣ̇͆́͌̃ͮͯ͌͛͛ͨ͊͏҉̙͈͍͎̥͓̤̮̗̦̤͔̕ ͂̽̍ͦ̊ͫ̔ͩ͒̍͆҉̫͕̟̜̀͟ͅ ̈̽̔͋ͫͣͬ̾ͬ͗ͨͩͩ̽ͮ̇̿͏̵̢̪͇̠̣̝͔͘͝ ̧͉͉̭͓̹̦̟̦̭͈͎͇̰̩͍̤̹͊͆̐̐͛̑̓͒̈̇̂̽̔͑̔̂̎ͥ̚͡ͅ ̨̨̛̙͎̭̯͇̥̲̣̥͎̬ͫ̈̾̃ͮ̀ͧ͌́̓̏͂̊͊ ̐̎̎ͮ̆̄̈̎̆̾ͤ̓̑ͩ̃̔̎̒҉̢̳͙̱̞͈͈̮̟̦̥̱̩̥͍͙͚̳͞͞ ̨͔̪̬̒̓̐̇̈́̇ͦͧ̑́̉ͣ͒̐ͬ͛̍ͮ͂͢͡͞͡ ̨̨̨̞̝̩̰̹ͮ͋͆̓͒ͤͪ͂ͯ̿͘͞ ͋̐̀͊ͯ͏̡̜͙͍̬̫̯̯̼̦̺͚͓͔̹͠ ̷̶̧͉͖̱̠̹͚̦̞̮̭̟̬̗̲̣̲̯̲̏ͨ͂̽ͮ̾̃ͭ̇̀ͥ̈́̚ ̴̡̝̲͙̦̺͙͇̯̩̝͂ͨ͒͊̑͒ͨͬ̓̊̀ͨ͐͜͞ͅ ̷̭̮̗͇̝͇̯̹̬͇̤̦̖͍̋ͬ̔ͪ̊͂ͭ͞͝ͅ ̵̡̠̳͓̠̬̲̥̰͓͎̘̪͕̘͎̞̟͇ͦ̃ͭ̇̓̃̾ͩ̒̒̆̓̋̽̆͂̋͘͢ ̵̹̪̭͇̬̙͈̲̪̞͗͆ͤ̓̑ͧ͊͑̊̄͒͊ͮͥͤ͛͋̕ͅ ̸̡̪̱͍̤̭̬̠̥̥̗̰̥̝̿͑͐̄̄̐͘͝ ̶̜̬̳̰͉̤̯̩͚̮̩̦̳̮͎ͬ͗̍ͥͩ͒̓̇̉͗͂̀\n̴̢̺̪̤̗̳̤̘̼̤̘͖͉͉̳̺͔̫ͩ̀̒͋ͥ͒̊ͨ ̸̸̤̥̩̫̹̤̖̭͎̪̐̾̉ͦͭ̿̈͆͘͘͡ͅ ̶̡̜̘͚̝̝͉ͤ̓ͦ̿̔̅̆̊̏̑͘͝͞ ̛̉̋̍̈́ͩ̽̀͢͏̦̪̤̖̮̙̤͖̭̖ͅ ̶̩̫̭̾ͪ̉ͯ͂ͧͯͭ͒̎͐͌ͪ̈͗̌̾͘͢͜͡ ̡̰̪̯͙͍̠̱̹̭̲̳̻̰͉͒̋̀͂̇ͭͫ̌̋́͆ͩ̈̈́̂ͨ͘ͅ ͬ͑͊ͬ͑̉̒͆̈̈ͦ̌̈́ͥ̚͡͏̡̠̗͙͉̳̙̥͚͇̟͔̝͎̭͇̻́ ̡͋̿̎̈ͭ̉ͭ̄ͪͩͯ̆̆ͯ̄̿҉̢͏͔͖͉̰̖̥͓̙̠͖̹͇̗̹̰͎͟ ̣̬̗̆͂̑ͥ̍ͦ̃̿̀͛͒͘͢ ͐ͥͫ̽̅ͫ̎͒͂̋̀̕͡҉̨̹̯̭̺̥̪̱͕ ̵̧̳̼͎̫̺̬͚̻ͧͫ̈ͪͪͧ̅̄̅̇̈̾̎ ̢͓̗̰̘̱̱̰̲͚̩͇̫̙͓͉̍ͬͯ̒ͬ͒́ͣͤͯͦͧ̑̚ ̵̵̙̦͓̹̬̫̰͔̤̼̭͆̂̔̾̋͋́̿̃͛͜ ͧ̃͆ͧ̎̎̇̌͌̈́̆ͪͨ̽̚҉̸̣͙̳̜̟̯̘̼̫̬̰̳̞͎͢͠ ͎̹̦̯̙̙̪͎̖̞̫̠̥̓̿͛ͪ̎͗͌̈́̀̚̚ ͤͬͧ̍̑ͥ҉̷̜̙̝͎̩̟͍̝͖̝ ̧̛͕͖̪̣̩̼͇͖ͨͤͩ̑̽ͪ͛̀̓ͤ͆̀ͅ ̶̡̧̡̗̥͉͖̲͇͖̺̲̣̹̼̥͎̖͂ͧͩ̎̄̔ͨ́ ͛̅̃̔ͥ̽̄ͭͦͣ͆ͬͨ̌̈́ͣ҉̡̛̙̲̝̦̮̫̼̘͈͉̰͓ ̵͓̠̱͙ͮ̓̽̚ ̷̴̫̯̥͇̻̺̟̖̺̰̳̻̩̖̪͈ͣ̋͛͑͑͛̉̾̓̂ͬ̒̉̀ ̸̧̩͎͎͍̺̓̌ͨ̈́͊ͦ̏̑̾͊ͣ̾̐͂ ̡̹̜̞̤̰̬͂ͤ̽ͨ̓͝͠ ͯ̈́ͭ̃̎̌̈́ͣ͒̒͆͐̔҉̶͎̲̘̳̯͓͇̥̪̱͎̰̫͔͍̮̟͠ ̡̨̢͔̙̥͎͕̹̥̤̩͈͎̼̫͖̝̳̓̿̄̓̓̑̚͞͠ ̽ͧ̑ͩ͊̐̎ͧͬ͑́̎̾͋͒̋̒̕͡͏̼͔̺̦ ̵̨̛͇̖͚͙̮͇͈̪̤̩̭̖͍͈ͬ̆ͤͧ̎͆ͣ̐͋̍̾̀ͤ͘͞ͅͅ ̸̷̧̛͍̱̦̰̠̜̦̣̞̙̻̮̹̬̇̒̆͌̈́̑͆̂̆ͤͩ̆ ̶̧͕̘͉͚̞̰̝̻͍͍̼̍̽̇̋̒ͨ̿̑ͯ̎͊̽́̚͟͟ ̵̢̛̮̰̲͈͚̘͓̯̟͇͓̤̱̼̉̑͌͛͂ͬͣ̐̃̆͋̔̏̚ͅ ͣ̏̓̌̈́ͭ̃͆̓ͭͦ̄͏͏̧̠͙̬̝͝͡ͅ ̵̒̑̊ͮ͒̉͂̽ͪͦ̋ͥ҉̯̞͎͙̫̦̮̬͍̳͚̻̼̗̲͇̝̖̗ ̢̗͇̙̠̩̥̻̮ͪͮͤ̿ͦ̑͟ ̷̨̠̺̦̬̺̝̮̗̔̅̌̾͛̐ͦ ̸͉̻͈̝̰͎͕̼͚̼̘̜͓̠͙̙̯̈̌̄̅͗̇̄͌̋̍̇ͫͣ̓͋͑̎̒̇ ̴̛̼̥̺̯͍̩̗̲̗̹̝̝͙̃͌͛͛ͦͫͣ́͢ͅ ̴͈͔͎͎̙̝̲͕̹͎͎͍̥̆̑̓͂̚͡ ̸̧̢̨̞͙̼̭͚̮̞͎͕̞̩̹̜̤͙̪̳̅͒͗ͮͯͤ́̋̚̕ ̸̡̫̤̜͔̫̉̾ͦͤ̌ͭͥ̄̓̽͟͠ ̛̛͙̦͔̝̱͎̹͒̈́̄͌ͬͧͦͤͥͨ̈͆̍̐͊̌̊̚ ̶̧͈̟̣̫̝͇̻̫͔̩̝͉͓̰̗͈͌̊ͣ̄́͜͟ ͌̔̃̃ͧ̓̅̽̂ͩ͂̓̈́̑̈́̋̒̏͡͡͏̳̣͇̫͕̩̠̤͔̹̟̬̻̣̯̱͡ ̓̈̍͆̔̒̏̑̚҉͚͇̟̘͎̮̯͠ ̢̭̲͔̮͌͑̀ͫ̊ͧ͛̃ͪ̑̃ͤ̃͟ ̡̢̡̳͎̬̺̘̭̝̰̙̯͙̦̫̓̇̅ͮ̌ͣ̑ͬ̎ͨ̽̈́́̾̚̚̕ͅͅ ̷̘̪͓̣͉̠̻̺̜̺̘͎͔̬̠̄̐̽ͦ͗̍́͘͡͡ ̢̙̫̖͉̱̹͓̬͉̹̲͎̞̥̲ͭ̔̊̋͜͟ͅ ͍̮̣͈̘̗̼̣͇̝͒͂ͪ̂́̅ͦͪ͐̂̽ͮ͒͘͠ ̸̨̍̊ͯ͆ͣ̎̒ͪͨ̿͒̀̚͘͏̻̟͇͖̹̰̺̰̖ ̀͒̍͊͂҉̧̼̩̗͕̞̪͉͖ ͍̩̟͔̘̮͓͕͖̙̯̺͍̼̹̃̈ͧͮ͊͊ͫ̄́̀̑͊̎̐͛͢͢͡͞","tags":"\n̴̴̛̤̙̮̜͉̮͇͔̝͉̫̗ͫ̔̆͌̑̂ͥͭ̔͋̂͗͌̂̽̃͂̊͘̚̚͞͡ͅͅ#general#fucked#up#text#zalgo","favourites":58,"__v":0,"created_on":"2015-04-07T17:42:14.613Z","score":0.0011617855920807408},{"_id":"5509039bb47c3d010fd965d6","id":1168,"pasta":"I sexually identify as a shitposter. Ever since I was a serious poster I dreamed of spamming ironic memes and posting copypastas. Moderators message me saying that shitposting is against the rules and they'll ban me, but I don't care, they're Nazis. I'm having the Chinese take ownership of my alt accounts, spam multiple threads for me, and hide my IP address behind several proxies. From now on I want you guys to call me \"#Swagefrog\" and respect my right to funpost above all and funpost needlessly. If you report me you're just mad cuz rekt and need to check to see if you've been posting memes lately.","tags":"#general#sexually#identify#shit#poster","favourites":68,"__v":0,"created_on":"2015-03-18T04:23:09.383Z","score":0.0011168353854850962},{"_id":"54f00fb287d1bc685b1e95a4","id":927,"pasta":"░░░░░░░░░░░░░░░░.░░░░░░░░░░░░░░ \n░░░░░░░░░░░░░█░░░░░░░░░░░░░░░░░░ \n░░░░░░░░░░░░░█░░░░░░░░░░░░░░░░░░ \n░░░░░░░░░░░░█░█░░░░░░░░░░░░░░░░░ \n░░▄░░░░░░░░░█░█░░░░░░░░░▄▄░░░░░░ \n░░█▀▄░░░░░░█░░░█░░░░░░▄▀█░░░░░░░ \n░░▀▄░▀▄░░░░█░░░█░░░░▄▀░▄▀░░░░░░░ \n░░░█░░░▀▄░░█░░░█░░▄▀░░░█░░░░░░░░ \n░░░░█░░░░█░█░░░█░█░░░░█░░░░░░░░░ \n░░░░░█░░░░█░█░█░█░░░░█░░░░░░░░░░ \n█▄▄▄▄░▀▄░░░██░██░░░▄▀░▄▄▄▄▄▄░░░░ \n▀▄░░░▀▀▄█▄░▀█░█▀░▄█▄▀▀░░░▄▀░░░░░ \n░░▀▀▀▄▄▄▄▄███████▄▄▄▄▄▀▀▀░░░░░░░ \n░░░░░░░░▄▀▀░███░▀▀▄░░░░░░░░░░░░░ \n░░░░░░▄█▄▄▄▀░█░▀▄▄▄█░░▄░░▄▄░▄▄▄░ \n░░░░░░░░░░░░░▀▄░░░░▀▄▀█░█░░██░░█ \n░░░░░░░░░░░░░░▀░░░░█▄▄█▄░▄▀░█░░█ \n░░░░░░░░░░░░░░░░░░░░░░█░█▄▄▄▀▄▄▀","tags":"#general#ASCII#420#blaze#it#pot#weed#marijuana","favourites":80,"__v":0,"created_on":"2015-02-27T06:33:17.582Z","score":0.001112409274742098},{"_id":"5508c0d0b47c3d010fd9650f","id":1084,"pasta":"Dude you need to quit fucking snap chatting mckenna. Stop. She doesn't respond with anything meaningful for a reason and she's not interested in you.\n\nWho am I?\n\nThe man whom she is in love with.\n\nShe already told me not to worry, she's not interested in you. Sorry I bothered you kid.\n\nI've dated her since 2 summers ago. If you aren't trying to get at my woman or being inappropriate I don't care if you snap her occasionally.\n\nJust don't try anything man. You'll embarrass yourself and anger me.\n\nWe are in love and we're making love tomorrow. So if you have any ill intentions with my woman you can forget it right now. I'm the biggest and best she's ever had, only man she's ever loved and the only man who could truly satisfy her physically. You will never have her. And she loves me.\n\nI don't have any problems with you if you are over my woman and realize you will never be with or touch her again.\n\nI apologize for coming off as a dick, just me and kenna are really deep in love and we've been through a lot and I just moved back home and it makes me a little jealous and angry to see a man she used to date before me is snap chatting her....\n\nWe don't need any extra bullshit or drama right now, so don't bring us any please is all I ask friend.\n\nIf you try to talk to her any way but as a brother, or you try to see her at all, if she tells me you do anything inappropriate or anything outside of what a strict brother like friend would do,we are going to have a huge problem.\n\nI will leave you alone now dude if you're not trying to get at the woman who I love and whom is in love with me.\n\nThat entire summer she was with me. She left kyle for me. She's been with me ever since, she even loved me and made love to me before she EVER let anything happen with you. You didn't please her. She didn't have strong feelings for you at all. And she immediately ended shit with you for me once she knew I loved her too. So get any ideas of the past out of your head.\n\nNone of this truth should bug you if you're over her but I'm just making sure. I hate when my baby's friends have ill intentions and she thinks they are just friends and have no alternative motive. But idk if I trust you at all.\n\nIf I can trust you to not stress me and my baby or fuck with our love tell me.\n\nI will leave you alone and apologize.\n\nBut if you aren't over her and you're tryna \"get some\" or you're tryna get back in her life, it's NOT HAPPENING. She said you were nothing to her, and the sex was bad anyway haha. You're small and weak and she said it all felt wrong after being with me. She's been with me ever since. We're in love. And tomorrow me and her will be together in my room making love alll day how we always have together. If you have a problem speak up like a man or tell me our love doesn't bug you and I'll apologize, it's simple.\n\nSo??? What is it? You are after my woman then huh?!\n\nTell me the fucking truth man. Don't you dare be disrespectful and gross enough to bring it up, but if if you ask her about anything she shared with me about your weak ass, she may be nice and lie to you, or she may not care and tell you the truth. Either way. I'm her soullmate and her boyfriend of the past two years almost. And she tells me everything and NEVER lies to me. I don't care haha. Just stay away from my kenna.\n\nI sincerely apologize if you have no ill intentions and aren't trying to make moves with my woman. And i respect you as a guy in the service. I'm sure you're an ok dude. But just as a friend. You're nothing to my kenna but a brother like friend.\n\nI just wanna be sure you know it and don't forget it.\n\nFind a nice classy woman where you are stationed, marry her.... But back off of mine. You will never even compare to me in her eyes. Not even close haha.I just don't need you interfering with me and kenna's love. It's our lives man. It's really not cool....\n\nGoodbye man, good luck. Respect to you being in the service. Sorry to bring your day down with my crazy bullshit but. Me and kenna are head over heels.... I can't help but be crazy about her. I love her with all of my heart and I will protect her from her untrustworthy fake friends. Not saying you are one. But you're dodging telling me what's going on in your head so I'm questioning a lot right now.\n\nJust know I'm never gonna hurt her, I'm always going to have her back, I'd give my life for her without hesitation, and I will protect her from anything, everything, and anyone.\n\nShe is the love of my life. I fully intend to marry and give kenna my children. And we've talked a lot about it. Just don't make shit harder than it already is.\n\nI just moved back and me and her miss eachother so badly and we are FINALLY go to see eachother tomorrow and make love for the first time since halloween....\n\nI hope you don't hate me man. I'm a good dude. Just protective of the woman who holds my heart. And who's heart I hold and must protect.\n\nI hope you can understand.\n\nShe promised me there's nothing at all to worry about with you and that she's not interested:\"/ I wish I knew before I embarrassingly went off on you. I'm so sorry man.\n\nI'm sorry.\n\nPlease don't mention this to my baby:/ I'm really embarrassed and while she will understand, I just feel like an ass for attacking you when you have nothing with my kenna and no intention to.\n\nGood bye brother. I hope you find your one true love someday. It'll make you crazy, trust me, but you'll find her one day. I found mine when I was really young. And it's my kenna :)","tags":"#reddit#cringe#snapchat#mckenna#stop","favourites":66,"__v":0,"created_on":"2015-03-17T23:57:55.520Z","score":0.0010873991636864467},{"_id":"54bfde0f3b0a330105ff5cb4","id":422,"pasta":" are you >implying every single joke on reddit hasn't been overdone 1000 times?\n\nclears throat\n\nTo be fair, I did nazi that coming. I came here to say this but boy, that escalated quickly so to the top with you! Lost it at 'This is why we can't have nice things' and then my faith in humanity was restored, my mind blown, and manly tears were shed. Well said. As a 'murican, I can confirm this gem has just won the internet and is doing it right. Just sayin', I know that feel, bro, and while that was a risky click, this post was a 9/10. 10/10 with rice xd, would read again. I see what you did there and it feels good man. You're doing God's work, son. I laughed way harder than I should have at your list that seems legit and totally nailed it. You - I like you. You magnificent bastard; you, sir, are so brave, a gentleman and a scholar, and seeing how you are a redditor for 4 years, this checks out, so I'll allow it. I regret that I only have one upvote to give for this cool story, bro. CTRL+F \"about tree fiddy\" was not disappointed. Wait, why do I have you tagged as \"NOPE NOPE NOPE\"? Nice try, you monster. What did I just read? Dafuq? I read that as \"YOU HAD ONE JOB\". I can't fap to this. No true scotsman could see that this relevant XKCD was bad, and you should feel bad. You must be new to reddit, so I'll see your cakeday and raise you a karma train. One does not simply rustle my jimmies, not even once. This stahp gave me cancer for science, so that's enough internet for me today. OP is a fag, 2/10, would not bang. What is this I don't even know how is this wtf? Circlejerk must be leaking. This will get buried but brace yourselves, some men want to watch the world burn right in the feels. When you see it, they'll KILL IT WITH FIRE! But this has nothing to do with atheism. Lawyer up, delete facebook, hit the gym, and SHUT UP AND TAKE MY MONEY, said no one ever, so you wouldn't download a strawman. Damn onions, you scary like a BOSS. whoosh. Since rule #1 is 'be attractive', I'll just leave this here: This is my [f]irst post, be gentle. I have the weirdest boner right now, so I'll be in my bunk with dat ass. Oh, you! ...now KISS!!! I know you should never stick your dick in crazy, but DM;HS. ...this kills the redditor.\n\nOP will surely deliver. op pls, pls op pls respond that link is staying blue.\n\nIn the meantime, I'll show myself out.\n\nDirected by M. Night Shamallama.\n\nAs long as the 'fad' for plagiarising other peoples' witty comments doesn't die out, I guess I'm cool.\n\n*edit: I accidentally a word\n\nthis community is fucking shit, every comment section of every top post has some variation of this garbage re-iterated as the top comment. and you unoriginal idiots upvote it like it's the punniest thing you have ever seen. low effort jokes all day long.\n\nedit: LOL THX FRONT PAGE POST OBLIGATORY XDDDDD\n\nactual edit: removed thanks for the gold.\n\nDank memes","tags":"#reddit#le#dank#memes#meta#implying#repost","favourites":99,"__v":0,"created_on":"2015-01-21T11:31:06.134Z","score":0.0010512694117255313}]