[{"_id":"54b59746e90c10d22e88b986","id":130,"pasta":" (_̅_̅_̅_̅_̲м̲a̲я̲i̲j­̲u̲a̲n̲a̲_̅_̅_̅()ด้็็็็็้็็็็็้็็็็็้็็็็็้็็็็็้็็็็็้็็็็็","tags":"#general#marijuana#weed#joint","favourites":96,"__v":0,"created_on":"2015-01-13T22:08:02.381Z","score":0.000980841465489192},{"_id":"54b6c77cf6a1885137f43d0a","id":202,"pasta":"( ͡° ͜ʖ ͡°)╯╲___卐卐卐卐 Don't mind me just taking the mods out for a walk﻿","tags":"#twitch#general#nazi#mods#walk#donger","favourites":94,"__v":0,"created_on":"2015-01-14T19:17:03.523Z","score":0.0009684213330836076},{"_id":"54b8557f5003512e438e7417","id":221,"pasta":"When a girl gets a vibrator, it's seen as a bit of naughty fun. BUT when a guy orders a 240 Volt ScrewMaster Pro 5000 blowup latex doll with 6 speed pulsating vagina, elasticized anus with non-drip semen collection pouch, together with optional built-in realistic orgasm scream surround sound system, he's called a pervert!","tags":"#general#vibrator#screwmaster#pervert#orgasm","favourites":93,"__v":0,"created_on":"2015-01-15T23:41:01.591Z","score":0.0009662152671265145},{"_id":"5508c7c2b47c3d010fd96534","id":1099,"pasta":"Hi! Few things to start off with =] 1. Yes I added you because you are a female gamer, 'tis a great thing to see! 2. I'm Brian 3. Don't be intimidated, but I'm not a stereotypical guy. If anything, I'll be the one in the kitchen =D.","tags":"#general#female#xbox#kitchen#gamer","favourites":56,"__v":0,"created_on":"2015-03-18T00:24:10.837Z","score":0.0009462211778258764},{"_id":"55922d73dd62532d34ee3732","id":1823,"pasta":"<:::::[]=¤༼ຈل͜ຈ༽ﾉ FOR THE WATCH","tags":"#twitch#general#ASCII#for#the#watch","favourites":12,"__v":0,"created_on":"2015-06-29T07:09:21.306Z","score":0.0009285510271376987},{"_id":"55c1b667e573e77679a4b17e","id":1970,"pasta":"Gotta catch em all! ....STD's!\nChancroid\nChlamydia\nCytomegalovirus (CMV)\nGenital Warts (HPV)\nGonorrhea (‘The Clap’)\nHepatitis (A, B, & C)\nHerpes (HSV1, HSV2, & HSV8)\nHIV & AIDS\nHuman Papillomavirus (HPV)\nIntestinal Parasites\nLymphogranuloma Venereum (LGV)\nMolluscum Contagiosum\nMononucleosis (‘Mono’)\nMycoplasma Genitalium\nNongonococcal Urethritis (NGU)\nPelvic Inflammatory Disease (PID)\nPubic Lice (‘Crabs’)\nScabies\nSyphilis\nTrichomoniasis (‘Trich’)\nVaginitis (BV, Yeast, Etc.)","tags":"#reddit#stds#pokemon#std","favourites":3,"__v":0,"created_on":"2015-08-05T07:08:23.446Z","score":0.0009091021723670993},{"_id":"5589fde82a7929bd7a8b1f82","id":1796,"pasta":"Nani the fuck did you just fucking iimasu about watashi, you chiisai bitch desuka? Watashi’ll have anata know that watashi graduated top of my class in Nihongo 3, and watashi’ve been involved in iroirona Nihongo tutoring sessions, and watashi have over sanbyaku perfect test scores. Watashi am trained in kanji, and watashi is the top letter writer in all of southern California. Anata are nothing to watashi but just another weaboo. Watashi will korosu anata the fuck out with vocabulary the likes of which has never been mimasu’d before on this continent, mark watashino fucking words. Anata thinks anata can get away with hanashimasing that kuso to watashi over the intaaneto? Omou again, fucker. As we hanashimasu, watashi am contacting watashino secret netto of otakus across the USA, and anatano IP is being traced right now so you better junbishimasu for the ame, ujimushi. The ame that korosu’s the pathetic chiisai thing anata calls anatano life. You’re fucking shinimashita’d, akachan.","tags":"#reddit#anime#weeaboo#navy#seal","favourites":14,"__v":0,"created_on":"2015-06-21T07:39:35.342Z","score":0.0009008138760697858},{"_id":"555d5508df71aa25492f2f8c","id":1662,"pasta":"Kiddo, dead fucking you're. It in drown will you and you over all fury shit will I. Idiot goddamn you, price the paying you're now and, didn't you, couldn't you but. Tongue fucking your held have would you maybe, you upon down bring to about was comment \"clever\" little your retribution unholy what known have could you only if. Shit little you, continent the of face the off ass miserable your wipe to extent full its to it use will I and Corps Marine States United the of arsenal entire the to access have I but, combat unarmed in trained extensively I am only not. Hands bare my with just that's and, ways hundred seven over in you kill can I and, anytime, anywhere be can I. Kid, dead fucking you're. Life your call you thing little pathetic the out wipes that storm the. Maggot, storm the for prepare better you so now right traced being is IP your and USA the across spies of network secret my contacting am I speak we as. Fucker, again think. Internet the over me to shit that saying with away get can you think you? Words fucking my mark, Earth this on before seen been never has which of likes the precision with out fuck the you wipe will I. Target another just but me to nothing are you. Forces armed US entire the in sniper top the I'm and warfare gorilla in trained am I. Kills confirmed 300 over have I and, Al-Quaeda on raids secret numerous in involved been I've and, Seals Navy the in class my of top graduated I know you have I'll. Bitch little you, me about say fucking just you did fuck the what?","tags":"#general#navy#seal#backwards","favourites":25,"__v":0,"created_on":"2015-05-20T11:46:12.308Z","score":0.0009000380085964406},{"_id":"5578be8b7d2300ce44f0cef9","id":1754,"pasta":"FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF  \nFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF  \nFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF  \nFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF  \nFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF  \nFFFFFFFFFFFF  \nFFFFFFFFFFFF  \nFFFFFFFFFFFF  \nFFFFFFFFFFFF  \nFFFFFFFFFFFF  \nFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF  \nFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF  \nFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF  \nFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF  \nFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF  \nFFFFFFFFFFFF  \nFFFFFFFFFFFF  \nFFFFFFFFFFFF  \nFFFFFFFFFFFF  \nFFFFFFFFFFFF  \nFFFFFFFFFFFF  \nFFFFFFFFFFFF  \nFFFFFFFFFFFF  \nFFFFFFFFFFFF  \nFFFFFFFFFFFF  ","tags":"#general#F#to#pay#respects","favourites":17,"__v":0,"created_on":"2015-06-10T22:47:28.449Z","score":0.0008850173439122315},{"_id":"55399b9f304552df598f565a","id":1514,"pasta":"What the fuck is this? HISTORY is being made and you're posting fucking 'dank memes'? Are you fucking kidding me? THIS IS WHY REDDIT FUCKING SUCKS. Dumb fucks like you just posting stupid fucking shit for karma. Why not contribute to the discussion? Why not be a useful fucking community member instead of posting your dumbass fucking frogs and low effort copypasta? We are witnessing a monumental moment and this is what you're doing with it.\n\nGo fuck yourself.","tags":"#reddit#memes#history#made#fuck#yourself","favourites":35,"__v":0,"created_on":"2015-04-24T01:25:48.047Z","score":0.0008845714913257927},{"_id":"55097effb47c3d010fd9660d","id":1190,"pasta":"Just held the door for an Asian guy and he said \"sank you\"... So I punched him in the face. I can't believe somebody brought up Pearl Harbor like that.","tags":"#general#asian#pearl#harbor#sank","favourites":51,"__v":0,"created_on":"2015-03-18T13:30:17.613Z","score":0.0008777587804020683},{"_id":"55a848c74587967e7ca6a897","id":1876,"pasta":" ☑ “This guy's insult is CRAZY!” ☑ “My memes can't win against a comment like that” ☑ \"He NEEDED precisely those two words to meme\" ☑ “He said the only phrase that could beat me” ☑ \"He had the perfect comeback\" ☑ “There was nothing I could do” ☑ “I did that perfectly\"","tags":"#general#checkboxes#meme","favourites":7,"__v":0,"created_on":"2015-07-15T06:02:26.521Z","score":0.0008603966199011203},{"_id":"5508e2adb47c3d010fd96580","id":1130,"pasta":"nicememe\nOHHohhihoHhee! You tickled my MEME bone! One uUPSWAGpswag for le fine gentleruser ͡ʘ ͜ʖ ͡ʘ)ง (ง ͡ʘ ͜ʖ ͡ʘ)ง (ง ͡ʘ ͜ʖ ͡ʘ)ง (ง ͡ʘ\n͜ʖ ͡ʘ)ง\nit seems >>>(you)have contracted DUBS-ITIS!!(ง ͡ʘ* ͜ʖ ͡ʘ)ง(ง ͡ʘ ͜ʖ ͡ʘ)ง(ง ͡ʘ ͜ʖ ͡ʘ)งvv(ง ͡ʘ ͜ʖ ͡ʘ)ง! LR*L CZECH 'EM OHOOGOOGOREE XDDdd >if (you) BROWS this MEME past the front page (you) must comment FOR YOU ,and\nWHATA ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) v( ͡° ͜ʖ ͡°) vv ( ͡° ͜ʖ ͡°) v( ͡° ͜ʖ ͡°) vv( ͡° ͜ʖ ͡°) (ง ͡ʘ ͜ʖ ͡ʘ)ง(ง ͡ʘ ͜ʖ ͡ʘ)งv(ง ͡ʘ ͜ʖ ͡ʘ)ง( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) v ( ͡° ͜ʖ ͡°) v( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°)(ง ͡ʘ ͜ʖ ͡ʘ)งv(ง ͡ʘ ͜ʖ ͡ʘ)ง(*ง ͡ʘ ͜ʖ ͡ʘ)ง v( ͡° ͜ʖ ͡°) v (ง ͡ʘ ͜ʖ ͡ʘ)ง (ง ͡ʘ ͜ʖ ͡ʘ)ง *\nFUCK MAN xD i just fall of my chair cuz i couldnt and i CANT stop laugh xDXDXDXDXDDDDDXXXXXXDDDDDD OMGOSH DDDDDXXXX(ง ͡ʘ ͜ʖ ͡ʘ)งXDDDDD DDDDDD LOOOOOOOLLLLL ( ͡° ͜ʖ ͡°) ( ͡°(ง ͡ʘ ͜ʖ ͡ʘ)ง ͜ʖ ͡°) ( ͡° ͜ʖ ͡°(ง ͡ʘ ͜ʖ ͡ʘ)ง(ง ͡ʘ ͜ʖ ͡ʘ)งv) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) le nyan cat? hahahaha le mayonaise. fucking epic ass meme i love that fucking meme so much man wait let me just gets crack pipe out smoke some of ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) that good 420 shit :) rips a bong AHHHHHHHHH YES!!!!!!!!!!!!!!! FUCKI(ง ͡ʘ ͜ʖ ͡ʘ)ง(ง ͡ʘ ͜ʖ ͡ʘ)งN HOLY SHITTTT I CANT JUST STOP LAUGHIN(ง ͡ʘ ͜ʖ ͡ʘ)ง(ง ͡ʘ ͜ʖ ͡ʘ)งG CAUSE HE HE HE HE HE JUST TO FUNNY MAN!!!1\nEPIC MEMEING /b/ro (ง ͡ʘ ͜ʖ ͡ʘ)งBAZINGA BAZINGA BAZINGAAAAAAAAAAAAAAAAA ZIMBABWE is this a le new epic meme? screen kappeD!!1011!!(ง ͡ʘ ͜ʖ ͡ʘ)ง ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) vvvvvv( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) vvv( ͡° ͜ʖ ͡°) vv\nCLICK THE \"\"\"\"SHARE\"\"\"\" BUTTON TO ENSURE PROPER BREADING OF YOUR TENDIES ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡+ ͜ʖ ͡+) ( ͡+ ͜ʖ ͡+)( ͡+ ͜ʖ ͡+) ( ͡° ͜ʖ ͡°)","tags":"#general#nice#meme#memed#shit#post","favourites":50,"__v":0,"created_on":"2015-03-18T02:27:53.446Z","score":0.0008599674591290467},{"_id":"5508d9dbb47c3d010fd96568","id":1119,"pasta":"geraffes are so dumb.\nEDIT: sorry, the only reason i say this is that this geraffe in this picture is trying to eat a painting. i should say that this one particular geraffe is dumb.\nEDIT: hey asshats quit downvoting me i am not the one who tried to eat the wall.\nEDIT: hey before you hit that down arrow why don't you ask yourself why you can't take a joke you losers. jesus the pc crap has extended to long horses? because that is all those things are, and no one was bawling when that chimp got shot for eating that lady's face. so are you racist for long horses over gorillas? hippocrites.\nEDIT: is it a bunch of peta lamebrains doing this? did my one little joke hit some kind of tree-hugger blog or some shit? i have never so much as even spit on a geraffe! wtf? i ate lion one time, it was in a burger; i had alligator, and something they told me was eagle but i'm positive it was just chicken. whatever anyone is saying about me and geraffes is not even true. but go on farteaters, downvote away. it shows how stupid you are.\nEDIT: spelling.\nEDIT: this is such shit. i have never received as much as one single downvote in my life and you peckers are jumping on this stupid geraffe-loving bandwagon. that is a dumb goddamn wall-licking geraffe and that is all. i'm not going to apologize to you idiots any more.\nEDIT: you know, now my feelings are hurt. the amount of downvotes piled on me is just excessive. god for-fucking-bid i had commented on a post about an antteater, i would be at -1000 by now. you people are horrible","tags":"#reddit#giraffes#geraffes#long#horses","favourites":49,"__v":0,"created_on":"2015-03-18T01:48:59.267Z","score":0.0008451365942605566},{"_id":"55087f8a9c40b758059984a4","id":1051,"pasta":"Look who it is again, ID Heaven. I'm fed up with your shit faggot. The other day when you called me a newfag, yeah, haven't forgotten about that yet.\nFuck you I've been on here for months and probably get on here more than you anyways. Don't you know that you make yourself look like a newfag when you call others newfag?\nJust because you learned how to hack your name and change it to \"Heaven\" does not give you the right to disrespect anyone at any time.","tags":"#4chan#heaven#newfag#shit","favourites":49,"__v":0,"created_on":"2015-03-17T19:20:14.776Z","score":0.0008433367812807882}]