[{"_id":"5508fba4b47c3d010fd965be","id":1157,"pasta":"i am a heron i ahev a long neck and i pick fish out of the water w/ my beak if you dont repost this comment on 10 other pages i will fly into your kitchen tonight and make a mess of your pots and pans","tags":"#4chan#heron#long#neck#repost","favourites":16,"__v":0,"created_on":"2015-03-18T04:10:22.108Z","score":0.00031299191365668377},{"_id":"550894e865f4abef0cfbe501","id":1060,"pasta":"Let me preface this by saying that I've been a memer since they first appeared on 4chan circa 2006 (ages ago in internet time). I remember refreshing /b/ all afternoon with the hope that someone would make a new meme. I was a memer back when Advice Dog was the only one and I still upvote every Advice Dog meme I see becasue of the fond rush of nostalgia it brings me. Nowadays, there are many thousand on quickmeme and other meme websites. I was a memer back before memegenerator was created (the first meme website) and I had to make them with MS Powerpoint or Paint. Speaking of meme websites, I was one of the first submitters to memebase.com and still have one of the top accounts there despite having migrated to reddit nearly 2 years ago. It was on 4chan and memebase where I cut my teeth creating memes, way before I had a reddit account and way before /r/adviceanimals was created in late 2010. Back before I could get any sort of points or even username recognition, I was creating memes as a clever and easily digestible way to reflect on society, relate some story to my audience, or just be funny. Do you remember rich raven? No? I do. You probably don't remember depression dog, crazy girlfriend praying mantis, introspective pug, or friendzone Johnny either. I remember all of them. In fact, you have only submitted two posts to adviceanimals garnering a total of just 4 points and have not commented there any time recently. So please, respect my judgement regarding the direction of the subreddit and the integrity of posts I have held dear to my heart for nearly 7 years but you have no strong feelings for. Thanks.","tags":"#reddit#4chan#long#time#internet","favourites":15,"__v":0,"created_on":"2015-03-17T20:45:21.337Z","score":0.0002947977515197541},{"_id":"5525e21c7ca4658f518f3fe1","id":1430,"pasta":"Ｈｉ Ｄａｒｕｄｅ. Ｍｙ ｄａｄ ａｌｗａｙｓ ｔｏｌｄ ｍｅ ｔｈｉｓ ｓｔｏｒｙ ｗｈｅｒｅ ｈｅ ｓａｉｄ ｈｅ ｗａｓ ｂａｃｋｓｔａｇｅ ａｔ ａ ｃｌｕｂ ａｎｄ ｗａｌｋｅｄ ｕｐ ｔｏ ａ ＤＪ ｐｅｒｆｏｒｍｉｎｇ Ｓａｎｄｓｔｏｒｍ. Ｍｙ ｄａｄ ｈａｔｅｄ ｔｈｅ ｓｏｎｇ ａｎｄ ｔｏｌｄ ｔｈｅ ＤＪ ｔｈａｔ ｉｔ ｗａｓ ｒｅｐｅｔｉｔｉｖｅ ａｎｄ ｃｏｕｌｄｎ＇ｔ ｕｎｄｅｒｓｔａｎｄ ｗｈｙ ｐｅｏｐｌｅ ｌｉｋｅｄ ｉｔ. Ｇｅｔｔｉｎｇ ａ ｗｅｉｒｄ ｌｏｏｋ ｆｒｏｍ ｔｈｅ ＤＪ ｍｙ ｄａｄ ｒｅｔｕｒｎｅｄ ｂａｃｋｓｔａｇｅ ａｎｄ ｔａｌｋｅｄ ｔｏ ｔｈｅ ｍａｎａｇｅｒ ｗｈｏ ｔｈｅｎ ｉｎｆｏｒｍｅｄ ｈｉｍ ｔｈａｔ ｔｈｅ ＤＪ ｈｅ ｉｎｓｕｌｔｅｄ ｗａｓ ｉｎ ｆａｃｔ ｙｏｕ. Ｄｏ ｙｏｕ ｒｅｍｅｍｂｅｒ ｔｈｉｓ ｂｙ ａｎｙ ｃｈａｎｃｅ？ Ｍｙ ｄａｄ ｆｅｌｔ ｐｒｅｔｔｙ ｂａｄ ａｎｄ ｗｏｕｌｄ ａｐｏｌｏｇｉｚｅ ｉｆ ｇｉｖｅｎ ｔｈｅ ｃｈａｎｃｅ ｓｏ Ｉ＇ｍ ｄｏｉｎｇ ｉｔ ｏｎ ｂｅｈａｌｆ ｏｆ ｈｉｍ. Ｉ ｏｎ ｔｈｅ ｏｔｈｅｒ ｈａｎｄ ｈａｐｐｅｎ ｔｏ ｌｉｋｅ Ｓａｎｄｓｔｏｒｍ ａｎｄ ａｐｐｒｅｃｉａｔｅ ｉｔｓ ｍａｓｔｅｒｙ ｏｆ ｔｈｅ ｄａｎｃｅ ｓｃｅｎｅ. Ｔｈａｎｋ ｙｏｕ！","tags":"#darude#sandstorm#dota2#lol#general","favourites":12,"__v":0,"created_on":"2015-04-09T01:52:32.033Z","score":0.0002901061798613561},{"_id":"54ed4077c200ce525fb25dbb","id":913,"pasta":"/╲/\\╭⁞ ͡° ͜ʖ ͡° ⁞╮/\\╱﻿\\","tags":"#general#spider#donger","favourites":17,"__v":0,"created_on":"2015-02-25T03:24:25.422Z","score":0.00028335086201314167},{"_id":"550b4d8f2ab05ce134dd326f","id":1230,"pasta":"I sexually Identify as a  ( ͡° ͜ʖ ͡°). Ever since I was a  ( ͡° ͜ʖ ͡°) I dreamed of soaring over the  ( ͡° ͜ʖ ͡°) dropping hot sticky  ( ͡° ͜ʖ ͡°) on disgusting  ( ͡° ͜ʖ ͡°).  ( ͡° ͜ʖ ͡°) say to me that a  ( ͡° ͜ʖ ͡°) being a  ( ͡° ͜ʖ ͡°) is Impossible and I'm fucking retarded but I don't care, I'm  ( ͡° ͜ʖ ͡°). I'm having a  ( ͡° ͜ʖ ͡°) surgeon install  ( ͡° ͜ʖ ͡°), 30 mm  ( ͡° ͜ʖ ͡°)s and  ( ͡° ͜ʖ ͡°) missiles on my  ( ͡° ͜ʖ ͡°). From now on I want you guys to call me \"( ͡° ͜ʖ ͡°)\" and respect my right to  ( ͡° ͜ʖ ͡°) from above and  ( ͡° ͜ʖ ͡°) needlessly. If you can't accept me you're a  ( ͡° ͜ʖ ͡°)phobe and need to check your  ( ͡° ͜ʖ ͡°) privilege. Thank you for being so understanding.","tags":"#general#sexually#identify#lenny#face","favourites":14,"__v":0,"created_on":"2015-03-19T21:27:32.547Z","score":0.00028155731136468527},{"_id":"55097941b47c3d010fd96605","id":1186,"pasta":"***\n\n**Your comment has been shit on!** **ヽ༼ຈل͜ຈ༽ﾉ**\n#\nAnother user hated your comment so much that they shat on it, giving you **Reddit Shit**.\n\nReddit Shit is reddit's premium shit program. Here are the benefits:\n\n* Extra shit\n\n* Free YouTube comments (*[congratulations!](https://www.youtube.com/watch?v=MoI8Z8Dq1yY)*)\n\n* Discuss and get absolutely no help on the annoyances at /r/shitbenefits \n\n* Grab a drink and join us in /r/shitlounge, the super-secret-shit-only community that may or may not exist.\n\n***\n\n**Did you know:** Most Reddit Shit—78 percent of the yearly shit supply—is made into fedoras. Other industries, mostly electronics, medical, and dental, require about 12 percent. The remaining 10 percent of the yearly shit supply is used in financial transactions.\n\n***","tags":"#reddit#shit#on#hated#comment#post","favourites":14,"__v":0,"created_on":"2015-03-18T13:06:31.639Z","score":0.00027861107107157967},{"_id":"5508cdbab47c3d010fd9654a","id":1108,"pasta":"What the swag did you just fucking yolo about me, you little wayne? I’ll have you know I graduated top of my class in the SwagFags, and I’ve been involved in numerous Obey Records , and I have over 300 confirmed Swaggers. I am trained in wearing snapbacks and I’m the top poser in the entire Swagfag Army. You are nothing to me but just another No swag. I will swag you the fuck out with swagger the likes of which has never been seen before on this Earth, mark my fucking hashtags. You think you can get away with not taking pictures in the mirror over the Internet? Think again, fucker. As we speak I am contacting my mom, she has alot of swag, and your ratchet ass is being traced right now so you better prepare for the yolo, nikka. The yolo that wipes out the pathetic little thing you call your swag. You’re fucking dead, nikka. I can swag anywhere, anytime, and I can swag in over seven hundred ways, and that’s just with my baggy skinny jeans. Not only am I extensively trained in having plugs and snake bites, but I have access to the entire Hollister store. and I will use it to its full swaggness to wipe your miserable swag off the face of tumblr, you little Non trend follower. I will swag yolo all over you and you will swag in it. You’re fucking dead, nikka.","tags":"#general#navy#seal#swag#fags#yolo","favourites":14,"__v":0,"created_on":"2015-03-18T00:53:12.874Z","score":0.0002775123894221738},{"_id":"552853a28e9442086a748b4c","id":1448,"pasta":"I sexually Identify as a black male. Ever since I was a boy I dreamed of being pulled over by the police due to a broken tail light, and getting shot in the back while running away. People say to me that being a black male sucks, but I don't care, I'm beautiful. I'm having a surgeon graft black skin on to me, and I'm buying Jordans as we speak. From now on I want you guys to call me \"Walter Scott\" and respect my rights as a human being. If you can't accept me dats racist and you need to check your privilege. Thank you for being so understanding.","tags":"#general#sexually#identify#black#male#shot#cop","favourites":11,"__v":0,"created_on":"2015-04-10T22:49:56.297Z","score":0.00027252839071184283},{"_id":"54b337285035a56315428ec2","id":54,"pasta":"I want to say something before this whole thing gets out of control. In 1967, in the hot desert sun, a woman gave birth to a boy in the back of old pick up. She was a whore. She left the boy at a local church. The father at the church didn't like children, but he knew that being a disciple of the bible he couldn't possibly not take the small kid. Instead he ended up taking out his frustration on the boy. At the age of three, the boy was forced to use the toilet. Let me tell you the little fell into his own pile of poop more than once. By the age of 5, the boy the boy was reading the bible and chopping wood for the fire. Despite the father's harsh character, the boy loved him and thought of him as his true father. By the age of seven the father raped him three times. The boy ran away. He survived four days in the desert by eating cactus and scorpions. He was finally found by a drug cartel boss, who took the boy in. Mr. Sanchez was his name, and he was immediately impressed by the boys intelligence and grown up attitude. Mr. Sanchez provided the boy with an education at a private prep school and a nice house. The boy had sex for the first time when he was 12, the next year he graduated high school. He was the school's star running back. The boy was lost, although he liked Mr. Sanchez, he never thought of him as his father. The boy went to India, were he became a spiritual leader of a large tribe of farmers. With his power he turned the several plots that each tribe member had into a large corporate farm and became a millionaire. His assets grew as he bought into other successful start ups. He often got ahead in business with his great leadership abilities, but once in a while he used violence. This was India after all. By the time he was 22, the boy had all the money he would ever need. So he bought a yacht and traveled the world for 10 years. For 10 years he visited every major port, slept with girls from every country imaginable, and tried every drug ever made (by nature and by man). When he was 33, he was walking on a beach in French Guiana when he met a girl of Irish - Native American decent. She bared his seed. It was boy, perfect health. He moved them to Argentina, then London, and eventually Vermont. The man was 45 now, he has seen everything, accomplished everything, tried everything. He skied down the Swiss Alps, been at the North Pole, swam with hammerheads, everything! Yet he has never done one simple thing that we all take for granted every day, he met his father. He never played catch with his father, he never talked about women with his father. He never would. He died at the age of 63 when his parachute didn't open when he was base jumping from Dagger Mountain in Washington, USA. Over three thousand people attended his funeral.\nI know what you are thinking. How does this story relate to me? Well I want you to go all the way back to the beginning of the story and remember the woman who gave birth to this incredible boy. You are like this woman. You are like this women because you are a whore.","tags":"#whore#reddit#church#kid#mr.sanchez","favourites":22,"__v":0,"created_on":"2015-01-12T02:53:17.414Z","score":0.0002711998526609214},{"_id":"55090bcdb47c3d010fd965e0","id":1173,"pasta":"Long ago in the 1980s, a man told me a story how he had once killed someone. He was a nice enough fellow, a plumber by trade. He said it was a sunny day, the kind of clear sky which makes you feel a foot taller and invincible; when the clouds almost have smiling faces. He told me he had been sitting upon a brick wall when a short bald man began advancing towards him semi-quickly without warning, he said the man ran right into the wall and then back away; no explanation. He then told me that he jumped down and called out to him, offering him help as he was obviously mentally ill but yet after running to another wall across the way, the short man began towards him again. He said that the short bastard knocked him down so hard he felt as though a helpless child. He then told me he tried to tackle the man by jumping on top of him, but yet he squashed him into nothing. The man was crying as he told me this part, and then as he took a pull on his whiskey, he said there were countless others just like him. \"Can't save everyone kid,\" he said. He told me his wife and brother were long dead as he couldn't save them either. He left after that never to be seen again. My only real memory of this man now besides this story, is his hat that was left upon the bar. It's red and has a single 'M' stitched on the front.","tags":"#general#mario#manslaughter#anguish#confessions","favourites":12,"__v":0,"created_on":"2015-03-18T05:11:48.284Z","score":0.00024178423713550206},{"_id":"5508cff0b47c3d010fd96553","id":1112,"pasta":"GREETINGS BATTLE BROTHERS I AM NEW. *HOLDS UP BOLTER* MY NAME IS SERGEANT ARGUS BUT YOU CAN CALL ME BATTLE BROTHER. AS YOU CAN SEE I AM VERY LOYAL TO THE EMPEROR. THAT IS WHY I HAVE COME HERE, TO MEET OTHER BATTLE BROTHERS WHO ARE LOYAL TO THE EMPEROR LIKE MYSELF. I AM 127 YEARS OF AGE ( PRAISE THE EMPEROR) I LIKE TO PURGE HERETICS AND XENO SCUM WITH MY BATTLE BROTHERS ( I LOVE MY BATTLE BROTHERS, IF YOU DO NOT LIKE THAT THE DEAL WITH IT) IT IS OUR FAVORITE ACTIVITY BECAUSE THEY ARE NOT LOYAL TO THE EMPEROR. ALL MY BATTLE BROTHERS ARE LOYAL TO THE EMPEROR TOO OF COURSE, BUT I WANT TO MEET MORE LOYAL SERVANTS OF THE EMPEROR. LIKE THE EMPEROR ONCE SAID, THE MORE THE MERRIER. I HOPE TO BOND WITH A LARGE AMOUNT OF LOYAL SERVANTS OF THE EMPEROR SO JOIN ME IN PRAISE OF THE EMPEROR. FAREWELL.\n\nPRAISE THE EMPEROR\n\n- BATTLE BROTHER - ","tags":"#general#battlebrother#katy#wh40k#emperor","favourites":12,"__v":0,"created_on":"2015-03-18T01:07:17.074Z","score":0.00024146620751016123},{"_id":"551f350e1726c1da61e62bdd","id":1402,"pasta":"Greetings, faggots:\nMy name is xXSwaGGy-Quarlax [FaZe], Interplanetary Diplomat for the Andromeda Galaxy. I would like to begin this message by assuring you that I am not a camping faggot, nor will my people attempt to quick scope you. Although we have amassed many 360 no scopes throughout our collective lives, we come with a message of peace. I hope to make clear that this is a knife-only match and we will not be attempting any faggotry, nor will we feed mid. We wish only to share our swag amongst your people, you fucking aim botting hackers.\nMy clan and I have traveled many millions of light years in search of sentient life, visiting thousands of planets in an attempt to make contact and find the dankest kush. While we have been forced to pwn many noobs and fuck countless mothers on several of those worlds, reking their shit harder than a Haitian Earthquake, we only did so out of self-preservation. None of those planets held any life beyond the hostile and untamable, nor any blunts to blaze upon. It was truly us against them; however, we wish to make it clear that we do have blood on our hands. We, as an intergalactic species, understand that trust is founded upon honesty, and thus tell you retard hackers of our former faggotry. That said, we assure you that your obese, apartment dwelling neckbeards will stand safely beside us and shall never be shrekt.\nWe first located your planet nearly six Earth years ago and have been monitoring your communication devices, which you call “X-Box,” to learn your jargon and construct our message of peace. We hope that you understand our dialect and not see us as pay 2 win feeders. In order to further express our good faith, we have amassed a large collection of Code Red Mountain Dew and Cool Ranch Doritos, which we would like to share with your MLG pros. We hope you accept our offering in peace, and that you not fuck our mothers. We wish only to become allies with you, the faggot tryhards of Earth.\nPlease find us waiting for you at your trailer park tomorrow at sunrise. We will be in the large flying aircraft, which should be just a few pounds lighter than that of your mother's left tit.\nAyy lmao,\nxXSwaGGy-Quarlax [FaZe]","tags":"#reddit#faze#gaming#ambassador#xbox#alien","favourites":10,"__v":0,"created_on":"2015-04-03T22:45:59.772Z","score":0.00023458653717490523},{"_id":"551cab734fc8d40a57a6e374","id":1391,"pasta":"　　　　　　　　　　　 　 ∧__∧   \n　　　　　　　　　　　 　( ͡° ͜ʖ ͡°)   \n　　　　　　　　　　　  ☜　　   ☞   \n　　　　　　　　　　　　　(つ ﾉ   \n　　　　　　　　　　　　　 (ノ   \n　　　　　＼　　　　　　☆   \n　　　　　　　　　　　　　|　　　　　☆    \n　　　　　　　　　　(⌒ ⌒ヽ　　　/   \n　　　　＼　　（´⌒　　⌒　　⌒ヾ　　　／   \n　　　　　 （’⌒　;　⌒　　　::⌒　　）    \n　　　　　（´　　　　　）　　　　　:::　）　／   \n　　☆─　（´⌒;:　　　　::⌒`）　:;　　）    \n　　　　　（⌒::　　　::　　　　　::⌒　）   \n　　 　／　（　　　　ゝ　　ヾ　丶　　ソ　─","tags":"#reddit#ASCII#glitter#bomb#fairy","favourites":9,"__v":0,"created_on":"2015-04-02T02:37:35.006Z","score":0.0002093184568006287},{"_id":"550c47382ab05ce134dd3292","id":1244,"pasta":"I used to masturbate onto birds at a local park. Not a thing that I'm particularly proud of but I became quite good at it. I was taking zinc supplements so I was shooting massive loads and it became something of a sport to me.\n\nFor anyone interested here is your best strategy. first, you need to find an isolated spot so you don't become a sex offender. I found a short kind of channel area where I saw the pigeons would congregate. Next, you arouse yourself. I was usually content with envisioning the occasional jogging lady coming over and taking a shit on my chest and that was enough to fuel the fire but if you're not as sexually charged as me just take some porn on the go. After you're good an horny, you get some bread. My pigeons preferred white bread but healthier birds might have a taste for honey wheat or maybe even multigrain. Fat, unhealthy birds are slower and easier to hit so remember that. Once you are seated on the bench and ready to do the deed, whip your roosevelt out and scatter bread out within a few feet of you. use your judgement based on how far you know you can cum. I was a lonely and depraved soul who could hit targets the size of a thimble at distances up to 4 feet. You wait for the pigeons to begin eating and to get comfortable with your presence. At this point, you want to coo gently and talk sensually to them to gain their trust.\n\nNow you're finally ready to cum on your bird. This is a tough part because the rapid motion of masturbation is very frightening to the birds, so you have to be subtle. Once you master a technique, you simply wind it up and let it go, aiming depending on your past cumming experiences. I always came high so I would aim for the neck of the bird and catch it right in the face. It's an extremely satisfying and erotic feeling, seeing those birds reel around covered in cum and maybe even transporting it to other places in the city. Either way I haven't done it in years but every now and then I catch myself gazing wistfully at a flock of birds, cock throbbing and waiting for them to land close to me.1.","tags":"#general#cum#on#bird#masturbation#pigeons","favourites":10,"__v":0,"created_on":"2015-03-20T15:30:59.906Z","score":0.0002084729211085798},{"_id":"550a1df02ab05ce134dd3232","id":1205,"pasta":"I sexually identify as a Nazi Mod. Ever since I was a boy I dreamed of soaring over the Twitch chat dropping hot sticky bans on disgusting copy pasters. People say to me that a person being a Nazi mod is impossible and I'm *** retarded but I don't care, I'm beautiful. I'm having a plastic surgeon install swastikas, 30 mm bancannons and Banhammers on my body. From now on I want you guys to call me \"Hitler\" and respect my right to ban from above and ban needlessly. If you can't accept me you're a Naziphobe and need to check your privilege. Thank you for being so understanding.","tags":"#twitch#general#sexually#identify#nazi#mod","favourites":10,"__v":0,"created_on":"2015-03-19T00:03:20.394Z","score":0.00020580500442463664}]