[{"_id":"55088335da039e130c5dc5ba","id":1053,"pasta":"Ever since I got the kinky idea to jam my Longshot up my girlfriend's pussy, she won't have my cock anymore. Sometimes I come home from work and I hear her moaning upstairs. She tries to hide it, she even pretended to be having an affair to throw me off the track, and justify her not wanting to have sex with me. But I know that she's been fucking that Longshot every day while I'm not there. It smells like her pussy whenever I use it, too. Sometimes while I'm out nerfing with my buddies, and I'm camped out in a sniper position, I get the urge to lick her dried pussy juices off my Longshot. One time I actually spent the entire game hidden in the bushes licking my Longshot all over. In some sick way my Longshot has become the sexual link between my girlfriend and I.","tags":"#general#longshot","favourites":47,"__v":0,"created_on":"2015-03-17T19:36:50.633Z","score":0.0008140249236529266},{"_id":"54f51a3c87d1bc685b1e95e1","id":954,"pasta":"What the fuck are you doing in my fucking swamp you little Farquaad? I'll have you know I graduated top of my class in the brogres, and I've been involved in numerous secret raids on your anus, and have ogre 300 confirmed layers. I am trained in making early 2000's pop cultural references, and am the top ogre in the entire far far away armed forces. You are nothing to me but another Drek. I will wipe you out with precision the likes of which have never been seen in Dreamworks, mark my fucking words. You think you can get away with saying that dreck to me over the swamp? Think again, fucker. As we speak I am contacting my secret network of fairy tale creatures across Far Far Away and your IP is being traced right now so you better prepare for the storm, Farquaad. The storm that will end your fucking life. It's fucking ogre, Donkey. I can be anywhere, anytime, and I can kill you in over seven hundred ways, and that's just with my bare asscheeks. Not only am I shrextensively trained in onionade combat, but I have access to the entire arsenal of the Fairy Godmothers Factory and I will use it to its full shrextent to wipe your miserable little ass of of the face of mah swamp, you little shit. If only you could have known what unholy retribution your little clever comment was about to bring down upon you, maybe you would have held your fucking tongue. But you couldn't, you didn't, and now you're paying the price, you goddamn Rumpelstiltskin. I will shrek fury all ogre you and you will drown in it. You're fucking dead, Pinocchio.","tags":"#general#shrek#navy#seal#farquaad","favourites":53,"__v":0,"created_on":"2015-03-03T02:19:36.439Z","score":0.0008068094433486114},{"_id":"55087de59c40b7580599849e","id":1047,"pasta":"My name is nick and I dream of becoming a dragon. People tell me I'm a dragonkin and I like the ring of that. I'm saving up money to have wings made out of my ribs and skin attached to my back. I've recently began drinking pure ethanol and swallowing matches. Nothing has happened yet, except I've had to have my stomach pumped 4 times; and the doctors are telling me to stop ingesting ethanol. Can you believe those cis white males in the STEM field? They're telling me to give up on my dream? This is why I need feminism, so I can't be discriminated against for drinking ethanol so I can be a dragon. I thought this was 2015? Social justice should be all over this. Anyways, I told those doctors they were scum, and to check their privilege. I then went on Tumblr and posted about it, inciting a response from other rational, like-minded people; who then emailed the hospital, informing them of the oppression and getting those monster “doctors” fired. Being thankful to the awesome tumblr community, I bravely volunteered to spy on an internet cesspit known as 4chan. I was promptly triggered and asked them to stop, to which they proceeded to call me offensive words and posted even more triggering material. I then self-diagnosed myself with PTSD and told Tumblr about it. I was amazed with the outcome! They started a hashtag called #stop4Chan. That's when I decided to use the pronouns xe/xim/xer to describe my self. As well, I've started to wear some classier clothes, so now I wear a fedora. With great class comes great privilege, so I tell 4chan I'll hack them. That's how I decided I'm a dragonkin.","tags":"#general#dragonkin#dream#dragon","favourites":45,"__v":0,"created_on":"2015-03-17T18:43:00.099Z","score":0.0007841911776156364},{"_id":"55bd5faef300bfdf5990c0dc","id":1945,"pasta":"i want to be marissa's little baby tampon boy. i want to turn into a little crying baby and then suck on her breasts. her magic breast milk would turn me into a little baby tampon boy. she would stick her hoo-hoo and i would wait with anticipation spouting little baby goo-goo ga-gas waiting for her to bleed all over me. i want to feel her marissa blood inside my little goo-goo ga-ga baby tampon body. i want to absorb her hoo-hoo juies inside my little baby tampon boy body and goo-goo ga-ga like a little rolly-polly baby boy. it would be orgasmic to know i am one with her hoo-hoo marissa blood and i would giggle and goo-goo ga-ga and yelp with little baby boy excitement as i roll around in her marissa hoo-hoo and revel in her red juices, slurping them into my soft little baby tampon boy goo-goo ga-ga body. then i want her to pull me out and squeeze and wring my little baby tampon boy body so that her marissa hoo-hoo blood and juices spill all over her marissa face. it would hurt and i would scream in pained goo-goo ga-gas as pain envelops my little baby tampon boy body until i reach full climax and turn back into grown human man.","tags":"#wtf#reddit#baby#fetish#diaper","favourites":3,"__v":0,"created_on":"2015-08-02T00:09:18.611Z","score":0.0007364291901016021},{"_id":"558e468e63aff1a558465efc","id":1814,"pasta":"You're joking right? Cuz you MUST be fucking joking..Those are GREEN ONIONS you FUCKING IDIOT! That may have been the single stupidest thing I've ever seen written in my entire life. I'm a chef, 16 years, I have 675 restaurants in and around the greater portland area, yea.. thats right.. all the restaurants, they're all mine...and I have to wake up and see this garbage sully my masterpiece post. I'm debating whether or not to delete this thing just so other people don't have to read that and squirm with discomfort knowing that there are people like you who eat food. You think you know food? You would't last 19 days in my kitchen. I'm so upset with you, seriously. CHIVES are Herbs, GREEN ONIONS are ONIONS. Don't you know that? Don't you? Well now you do, you shit! Unbelievable.","tags":"#reddit#food#onion#onions","favourites":10,"__v":0,"created_on":"2015-06-25T11:42:25.538Z","score":0.0007223896310723675},{"_id":"55738f897d2300ce44f0ced5","id":1738,"pasta":"The year is 2077. I stand at a window of my mansion and revel at my prized possessions - the vast acres of suburban real estate that my father and grandfather endlessly toiled to build up, and now, I have inherited it all. My grandson stands next to me and asks, \"grandpa, can I be a big businessman like you when I grow up?\"\n\"Of course,\" I said, \"this will all be yours someday.\"\nI walk over to my computer and sit on my gold-plated, diamond crusted seat. I open Reddit, a leading and most-trusted source for world news. The top headline reads, \"Immortal III treasure released.\"\n\"Marvelous!\" I chuckle to myself. This is just in time to boost the TI67 prize pool. I purchase several chests as a present for my grandson's compendium. As I click \"checkout\" on the website, I can't help but take a peek in one of the chests.\n\"Why, it's a shiny Zeus hammer!\"\nI cannot resist but open the chest. I receive a Crystal Maiden staff.\n\"This is no Zeus hammer,\" I thought. Let me just open another.\nTo my dismay, I still have not found the elusive Zeus treasure. I continue to buy more and more chests, determined that my wealth would eventually overpower Valve's determination to hide the chest from me. This quickly escalated to precisely 90,663,887,774 chests purchased, and not a single Zeus hammer lay between my wrinkly hands.\nSlowly, a cloud of darkness consumed my mind. I began dreaming of Valve's logo being carved and stamped on every piece of real estate I owned. I have thrown all my wealth away in search of this treasure. My grandson's future--no longer secured.\nI only have a few pennies left at this point, and I decided to spend them on internet bandwidth to search reddit for guidance. I went back to the Dota 2 subreddit to make sense of this all. I see a post on the front page titled, \"I opened one treasure with my level 1 compendium and look what I got :D!!!\" I clicked the post, only to see Zeus with all his might, holding a shiny, golden hammer, engulfed by lightening. Merlini himself would be blinded by such beauty.\nAt this point, my grandson came to me and climbed on my lap. \"whoa,\" he said, \"I want one of those!\" He asked if he can have just one Zeus hammer when he's a \"rich business man\" like me. I slowly carried him off my lap, with tears running down my eyes I told him,\n\"Of course, Kappa.\"","tags":"#dota2#zeus#hammer#chest#compendium#reddit","favourites":15,"__v":0,"created_on":"2015-06-05T07:58:56.590Z","score":0.0007219882143303244},{"_id":"5584be60e9db9a1f6c8f8281","id":1779,"pasta":"         ☝\n           ＼＼  \n             ＼＼  \n               ＼(ಠ益ಠ)\n                /     \\\n               /     へ＼\n             /     /   ＼＼\n            /    ノ      ヽ_つ   ayy  lmao\n           /   / \\\n          /   / \\  \\\n         (   /   \\  \\\n         |  |      \\ ＼\n         | 丿       ＼⌒)\n         | |         ) /\n         /  )        Lﾉ﻿\n        |  /\n        Lﾉ﻿               ","tags":"#general#ASCII#ayy#lmao","favourites":11,"__v":0,"created_on":"2015-06-19T12:44:33.524Z","score":0.0006989822613994696},{"_id":"5505d5a987d1bc685b1e9690","id":1033,"pasta":"Don't be racist \nBe like Mario \nHe's Italian\nMade by japenese\nLooks Mexican\nJumps like a black man\nAnd grabs coins like Jews﻿\nAnd Speaks English","tags":"#general#racist#mario","favourites":39,"__v":0,"created_on":"2015-03-15T17:57:44.031Z","score":0.0006830438634479063},{"_id":"555d5531df71aa25492f2f8f","id":1665,"pasta":"The air was warm, the sun was shining, and everypony in Ponyville was having a glorious day. The town square was bustling and crowded and busy ponies filled the streets. All the pony folk seemed to have somewhere specific to be. All except Rainbow Dash; her place was in the sky. She tore freely through the air, speeding one way and the next, buzzing the tree tops and racing the wind. The blue pegasus swooped over a schoolyard, much to the delight of the children, then climbed several hundred feet and dove, streaking downward as fast as she could. Seconds before hitting the ground, her wings flew open and she pulled up back into the clear blue. Rainbow felt alive.\nSuddenly, Dash remembered that she had somewhere to be; she was supposed to meet with Pinkie Pie in five minutes. Dash had gotten so caught up in her exercises that she’d nearly forgotten that Pinkie had asked to meet her at Sugercube Corner at three. Pinkie hadn’t said why or what they’d be doing, but Dash knew that with Pinkie, it could be anything. Dash wasn’t sure if she really wanted to go, though. She was so engaged with her stunts that she thought about blowing Pinkie off to continue flying. But, Dash’s conscience got the better of her. She knew that it would hurt Pinkie’s feelings; after all, Pinkie had said it was going to be something special just for the two of them. Dash considered it and thought “why not?” What did she have to lose? Heck, it might be more pranking. Pinkie might have found a bunch more fun stuff to pull on folks, and they’d had so much fun the last time. Dash kicked into overdrive to make up for lost time, and sped to her appointment.\nWhen Dash walked into the store, she was immediately greeted by her host, who was bouncing in excitement.  “Yay, you’re here! I’ve been waiting aaall day,” said the jumping pony.\n“Sorry if I’m a little late, Pinkie.  I was doing my afternoon exercises and lost track of time,” Dash apologized.\nPinkie giggled and responded in a gleefully reassuring tone, “Oh that’s ok, you’re here now. What‘s a few more minutes? I’ve been sooo excited thinking about all fun stuff we’re gonna do, I haven’t stopped bouncing since I woke up. I mean, I almost forgot to breathe I’ve been so happy.”\nDash gave a slightly uncomfortable laugh. She had always appreciated Pinkie Pie’s friendly, outgoing way of life, but Pinkie’s overabundant enthusiasm almost creeped her out.  Dash maintained a polite expression, however. If Pinkie was this worked up, whatever she had planned must be good.\n“So, you ready to get started, Rainbow Dash? I’ve got everything all ready,” the pink pony said.\nDash psyched herself up. “You betcha, Pinkie. So what do ya got planed? We gonna prank somebody? I got a couple of good ones I’ve been thinking about. Or maybe you’ve got some stunts you think I should try? Or perhaps…”\n“MAKING CUPCAKES!” Pinkie happily announced.\n“Baking?” Dash was disappointed. “Pinkie, you know I’m not good at baking. Remember last time?”\n“Oh that’s not a problem at all. I only need your help making them. I’ll be doing most of the work,” Pinkie explained.\nDash thought for about it for a second. “Well, alright, I guess that’s ok. What exactly do you need me to do?”\n“That’s the spirit. Here you go.” Pinkie handed Dash a cupcake.\nDash was puzzled “I thought I was helping you bake.”\n“You will be. I made this one just for you before you got here.\n“So, is this like taste testing or something?”\n“Sorta,” Pinkie said.\nDash shrugged and popped the pastry in her mouth. She chewed a bit and swallowed. Not bad.\n“Ok, now what?” Dash asked.\n“Now,” Pinkie informed her, “You take a nap.”\nPuzzled, Dash opened her mouth but felt instantly lightheaded. A wave of dizziness washed over her, the world spun, and seconds later she collapsed to the floor.\n\nWhen Dash regained consciousness, she found herself in a dark room. She tried to shake her head but found that a taut leather strap held it firmly in place. She struggled to move, but braces around her chest and limbs glued her to a rack formed from a series of sturdy planks, which spread her legs wide apart. Dash’s wings were the only part of her not tied down, and they fluttered frantically while she struggled to escape.  As she writhed, Pinkie jumped suddenly into her line of sight.\n“Goodie, you’re awake. Now we can get started,” Pinkie stated gleefully. She bounded into the darkness, and quickly reappeared pushing a small cart covered with a cloth.\n“Pinkie, what’s going on? I can’t move!” Dash said urgently.\n“Well duh, that’s because you’re tied down,” chided Pinkie.  “That’s why you can’t move. I didn’t think you’d need to be told that.”\n“But why? What’s happening? I thought you said I was going to help make cupcakes.”\n“You are helping. You see, I ran out of the special ingredient and I need you to get more.”\n“Special ingredient?” Dash was now breathing heavily and starting to panic. “What special ingredient?”\nPinkie giggled and responded “You, silly!”\nDash’s eyes widened, and her face contorted in fear. Then she started to laugh and said, in a voice bordering on hysteria, “Woo, you really got me there, Pinkie pie. I mean, tricking me in to thinking I’m gonna get made into a cupcake? I gotta tell you, this the best prank yet. You win, you’re the best.”\nPinkie only giggled even more. “Aw, thanks Dash. But I haven’t done any pranks today, so I can’t accept your praise.”\nDash was struggling again. “Pinkie, come on, this isn’t funny.”\n“Then why were you laughing?” Before Dash could answer, Pinkie grabbed the cloth and whipped it off the cart. On the cart was a tray containing various sharp medical tools and knives, carefully organized and wickedly sharp, as well as a large medical bag.\nDash was now in full panic mode. She was starting to hyperventilate. Her mind raced as she tried to reason with the pink pony. “You can’t do this Pinkie! I’m your friend!”\n“I know you are and that’s why I’m so happy that I’ve got you here. We get to share your last moments together, just you and me.” Pinkie was skipping again.\n“But, the other ponies will wonder where I am. When the clouds pile up, they’ll come looking for me and then you’ll get found out,” Dash cried in desperation.\n“Oh, Dash,” said Pinkie. “Don‘t worry, there are plenty of pegasus ponies to take care of a few clouds. And besides, no one will find out. I mean, how long do you think I’ve been doing this?” And with that ominous statement, the lights suddenly came to life and revealed the rest the room.\n“Oh no.” Dash reeled in horror at the image presented to her. The room was decorated with a typical but twisted Pinkie Pie flair. Colorful streamers of dried entrails fluttered around on the ceiling, brightly painted skulls of all sizes were attached to the walls, and organs done up in pastels filled with helium were tied to the backs of chairs. The tables and chairs were made of bones and the preserved flesh of past ponies. Dash cringed upon seeing the center piece of the table nearest to her. The heads of four foals, their eyes closed as if they were sleeping, were wearing party hats made from their own skin. With a thrill of terror, Dash recognized one of them as Apple Bloom’s classmate Twist. Dash’s eyes darted back and forth and then fell upon a patchwork banner hanging from the rafters.  Made from several tanned pony hides, the words “Life is a party” were scrawled on it in blood red.\nDash’s attention was brought back by a party horn unfurling and tickling her nose. She gaped at Pinkie Pie, who was standing right in front of her. The party pony was wearing a dress quilted from dried skin, emblazoned with cutie marks. On her back fluttered six pegasus wings, all of different colors. As the earth pony skipped in excitement, her necklace of severed unicorn horns clacked together loudly.\n“Like it?” Pinkie asked. “I made it myself.”\nDesperately, Dash pleaded with the smiling pony before her. “Pinkie please, I’m sorry if I did anything to you. I didn’t mean it. Please let me go. I promise I won’t tell anybody.”\n“Oh Dash, you didn’t do anything. It’s just that your number came up and, well, I don’t make rules. We can’t turn back now.”\nDash was tearing up. How could this be happening?\n“Aww, don’t be sad Dash,” said Pinkie.  “Look, this’ll cheer you up. I brought you a friend.”\nSeemingly out of nowhere, Pinkie produced a brightly painted blue and yellow skull. It was about pony sized, but it had a very defining feature: a beak.\nDash gaped in shock. “Is…is that….is…that?”\n“Hey, Dash lets hang together. These ponies are lame-os. Dweebs dweebs dweebs,” Pinkie mimicked. “I caught her right before she left town. Remember when I left the party for about twenty minutes? That wasn’t enough time to play with her of course; I had to wait till after the party to do that. But boy am I glad I did. It was worth it for the flavor alone. Griffons taste like two animals at once, it’s amazing. I know she didn’t have a number like everyone else in Ponyville, but when was I gonna get another chance to try griffon? I probably should have asked where she came from so I could have gotten more, but I forgot. I’ll tell you what though, she was quite the fighter. She lasted a long time, which was a lot of fun for me. I got the chance to play with somebody other than a pony and try new things. It’s too bad she had such a meanie mouth. She said so much bad stuff I just had to take her tongue out. You know, bad language makes for bad feelings, Rainbow Dash.”\nDash didn’t have anything to say. She just sobbed and writhed in her tight bonds.\n“Well” said Pinkie with an air of finality, “that’s enough reminiscing. It’s time to begin.”\nPutting down Gilda’s skull, the pink pony gripped a scalpel in the cleft of her hoof and walked over to Dash’s right flank. Without any flair, Pinkie placed the blade an inch above Dash’s cutie mark and began a circular cut around it. Dash shouted in pain and tried desperately to pull away, but the braces held her still. Finishing the incision, Pinkie grabbed a curved skinning knife from the tray. Screwing up her face in concentration, she worked it under Dash’s skin and sliced the hide away from the muscle. Dash ground her teeth as she tearfully watched her flesh peel off. Pinkie then moved to the other side and repeated the process on Dash’s left flank. Once she had finished, Pinkie held up both cutie marks in front of her friend and started waving them like pompoms. Dash just whimpered. Her thighs burned like nothing she had felt before.\nPlacing the ragged patches of skin down, Pinkie selected a large butcher knife and walked behind the blue pegasus. “Hope you don’t mind, I think I’m gonna wing it now,” Pinkie laughed. She grabbed Dash’s left wing in her mouth and played with it for a few seconds, yanking it back so the sharp pain reignited the fire in Dash’s flanks. Then, stretching the wing out, Pinkie brought the blade down hard at the base. Instantly, Dash screamed and thrashed her appendage. The movement threw off Pinkie’s aim. She tried to hit the mark again but missed, and carved a huge slice into Dash’s back.\n“Dash, you gotta stay still or I’ll keep missing,” scolded Pinkie as her friend howled.\nPinkie took another whack and hit her target. She swung again and again. Blood sprayed into the air, but Pinkie realized she wasn’t getting anywhere. The blade just wasn’t going through the bone.\n“Hmm, I guess I forgot to sharpen it. I’ll try something else,” stated Pinkie matter-of-factly as she tossed the knife over her shoulder, embedding the blade in the table.  Through the haze of pain and tears, Dash heard the sound of a metal box opening and closing.\n“Got it! Say Dash, why do they call it a hack saw? It doesn’t hack; hacking is what I was doing with the knife. This is a saw. I don’t get it.”\nPinkie placed the tool over the mangled flesh of the last attempt. Standing on her hind legs, she worked the saw back and forth with her front hooves.  It sliced effortlessly through the bone and skin. The feeling of the jagged teeth grinding into her made Dash want to vomit. She watched numbly as her wing flew over her head and landed with a fluff on the table.  Pinkie moved to the next wing and started sawing. Dash didn’t struggle this time; she’d given up trying to fight and focused on choking back screams of agony. Abruptly, the sawing paused. Pinkie was only half way done, the wing hanging off by a sliver.\n“Hey Dash,” Pinkie piped up. “Think fast!”\nSuddenly, Pinkie yanked the wing as hard as she could. The bone snapped but the blue pony’s skin held, then tore away. The pull ripped away a long strip of flesh all the way down Dash’s back to her rump. Her body seized at the unexpected trauma. As her pelvis tensed up, Dash felt a warm release between her legs, and her loud, unending melody of pain filled the room. Unable to catch her breath, she blacked out.\n\nDash awoke with a gasp. The stench of her urine filled her mucus caked nostrils. As her vision swam into focus, she saw a very pouty Pinkie Pie removing a large adrenaline needle from her chest. Stomping her hooves, the frustrated Pinkie lashed out at her helpless victim.\n“Didn’t anybody teach you any manners? It’s very rude to fall asleep when somebody invites you over to spend time with them. How would you like it if I came over to your house and went to sleep? ‘Oh I’m sorry Dash, you’re so boring I think I’ll take a nap.’ You think I like always doing this by myself? I told you how excited I got when I found you were next. I was excited to have a friend be here with me while I worked. But NOOOOO! You’ve got to be inconsiderate. You know, I thought you were tough. I thought you could handle anything. I’ve had foals stand up better than you!  Do I have to baby you? Huh? Is that how you want me to remember you, as a baby?”\nAs Pinkie stopped to catch her breath, Dash blinked and sobbed softly. Her back was in agony, her sides were on fire, and there was an intense pain in one of her legs. As she blinked again, she saw Pinkie pop something red into her mouth and began to chew. Noticing Dash’s stare, Pinkie quickly gulped the morsel down.\n“What?” Pinkie asked. “Oh, this?” She held up another piece. “Well, while YOU were asleep, I got a little impatient and helped myself to a small sample. I got it from your leg; you’re not bad. Wanna try some?”\nWithout waiting for a response, Pinkie shoved the strip of meat into the revolted pegasus pony’s mouth. Dash gagged, and immediately spit it out. Pinkie frowned, and picked up the chunk of flesh. “If you didn’t want it, you could have said no.” She contemplated the discarded snotty morsel, then gulped it up. “It’s not like you haven’t had my cupcakes before.”\nSwallowing, Pinkie turned her attention to a small can on the tray. She removed the lid, revealing that it was filled with red-hot coals. Lying on top of the coals were several large nails. As the adrenalin filled her veins, Dash began to panic again. Picking up the can, Pinkie walked over to Dash’s left. Holding some tongs with her mouth, Pinkie carefully picked up a nail and positioned it at the seam between her victim’s front left leg and hoof. She then grabbed a hammer and took careful aim. \n“No Pinkie!” Dash screamed. “NO! NO!”\nThe hammer came down and the nail punctured Dash’s skin. The white hot burning was too much.  Dash screamed as she pulled and thrashed at the braces, causing her raw skin to rub and tear. Pinkie tried to line up another nail, but couldn’t find her aim, and let out a frustrated grunt. When Pinkie brought the hammer back to take a wild swing, Dash burst out crying and begging.\n“PLEASE STOP! PLEASE, PLEASE STOP!”\nPinkie rolled her eyes.  Putting down the hammer and tongs, she walked back in front of her friend and stared pensively at the broken pegasus. Gilda didn’t even cry this much when she had a live parasprite stuffed down her throat. Pinkie thought for a minute about what to do next, then had a sudden spark of inspiration.\nRotating a wheel on the rack, Pinkie laid Dash on her back, then moved to Dash’s hind legs, bringing the can with her. Picking up her tools, Pinkie drove a searing hot spike of metal directly into the bottom of Dash’s hoof. As Dash yelled in pain, Pinkie moved around and drove a second nail into the other hoof. Next, Pinkie went back to her cart and located an enormous battery and controller, which she dragged over to where she was working. She tied copper wires between the terminals and the nails driven into Dash’s hooves, then gave Dash a wink and flipped the switch.\nElectricity rocketed through Dash’s body. The blue pony reacted immediately; her body seized, and her muscles snapped taut. Dash’s hips thrust skyward, her eyes rolled back, and she let out a deep, throat shredding cry. Pinkie giggled and danced in place, then reached down and turned up the juice. Dash convulsed uncontrollably, and her bladder emptied once more.\n\nAfter about five minutes, Pinkie shut off the power. Wisps of steam rose from the singed fur around Dash’s hooves, and the area reeked of cooked flesh and burnt enamel.  Pinkie rotated Dash upright again and tried snap the drooling, delirious pony back to attention.\n“Dash? Dash! Rainbow Dash, wake up!” Dash moaned and managed to give a modicum of weak acknowledgment.  Pinkie studied her handiwork, then reached into the medicine bag and produced a large syringe. “Alright, time for the last round.”\nDash focused blearily on the needle, which Pinkie took as a question as to what it was.\n“This is a little something to take the pain away,” Pinkie informed Dash as she walked around to her victim’s ruined back. Dash flinched as Pinkie jabbed the needle into the lower part of the blue pony’s spine. Moving in front of her friend again, Pinkie leaned down and elaborated.\n“In a few minutes, you won’t be able to feel anything below your ribcage. Then you’ll be able to stay awake to watch the harvest.”\nDash started to cry again. “Pinkie?” she choked out.\n“Yeah?”\n“I want to go home,” Dash sobbed.\n“Yeah, I can see wanting to do that,” replied the party pony. “Sometimes, I just wanna give up, just say ‘I’m done with this mess’ and go to bed. But you know what? You can’t shrug off your responsibilities. You got to pull yourself up and meet the challenges head on. That’s the only way you’re gonna get ahead in life.”\nDash hung her head and cried.\nMinutes passed as the drug took effect. Eventually, Dash was completely numb from her chest to her flanks. At this point, Pinkie approached with a scalpel. Glancing at Dash and smiling, Pinkie made a long horizontal cut across the pegasus pony’s pelvis, just above her crotch. Moving up Dash’s body, Pinkie made a similar incision under her ribs. Finally, Pinkie made a long vertical cut down Dash’s stomach, connecting the first two.\n“Looks like I got my ‘I’ on you, Dash,” Pinkie giggled.\nWith a moist, gooey sound, the flaps of skin opened. The sight of her own organs and the lack of feeling caused Dash’s breathing to intensify. Pinkie carefully sliced open Dash’s abdominal sac and grabbed her large intestines. As she separated the organ from the rest of the digestive tract and pulled it out of the new cavity, Pinkie grew jovial. Laughing as she gutted her friend, Pinkie began to make jokes. Dash, growing weaker from this new source of blood loss, tried desperately to shut out the macabre comedy act.\n“Look at me, I’m Rarity!” Pinkie laughed, slinging the intestinal tube around her neck and spraying blood in all directions. “Isn’t my new scarf soooo pretty?”\nReaching back inside, she sliced the smaller intestine off from the bowls. Squeezing out the excess excrement, Pinkie filed the slimy organ through her teeth and dragged it back and forth. “Dentists say you gotta floss every day, Dash.”\nDash was barely aware of what was going on anymore. The shock was causing her to fade. Disappointed, Pinkie dived back into the blue pony’s guts, ramping up her routine.\n“Aw, don’t go yet Dash.” Pinkie started pulling out the rest of ","tags":"#general#cupcakes#story#mlp#mylittlepony","favourites":18,"__v":0,"created_on":"2015-05-20T03:45:07.257Z","score":0.0006722764329418506},{"_id":"5548d677d51fb1666ee0bbf3","id":1588,"pasta":"I sexually Identify as a Packet of Pringles. Ever since I was a young chip I dreamed of trapping people’s hands and morbidly deforming them beyond recognition as they tried to go for my delicious core. People say to me that a person being a packet of pringles is Impossible and I'm fucking retarded but I don't care, I'm beautiful. I'm having a plastic surgeon install long tubular cannisters, a plastic cap and crunchy goodness in me. From now on I want you guys to call me \"Xtra Kickin’\" and respect my right to taste delicious and cause addiction. If you can't accept me you're a pringophobe and need to check your snack privilege. Thank you for being so understanding.","tags":"#general#sexually#identify#packet#pringles","favourites":22,"__v":0,"created_on":"2015-05-05T12:45:27.647Z","score":0.000670418873674496},{"_id":"5508bacbb47c3d010fd964f9","id":1075,"pasta":"I'd just like to interject for a moment. What you're referring to as Linux, is in fact, GNU/Linux, or as I've recently taken to calling it, GNU plus Linux. Linux is not an operating system unto itself, but rather another free component of a fully functioning GNU system made useful by the GNU corelibs, shell utilities and vital system components comprising a full OS as defined by POSIX.\n\nMany computer users run a modified version of the GNU system every day, without realizing it. Through a peculiar turn of events, the version of GNU which is widely used today is often called \"Linux\", and many of its users are not aware that it is basically the GNU system, developed by the GNU Project.\n\nThere really is a Linux, and these people are using it, but it is just a part of the system they use. Linux is the kernel: the program in the system that allocates the machine's resources to the other programs that you run. The kernel is an essential part of an operating system, but useless by itself; it can only function in the context of a complete operating system. Linux is normally used in combination with the GNU operating system: the whole system is basically GNU with Linux added, or GNU/Linux. All the so-called \"Linux\" distributions are really distributions of GNU/Linux. ","tags":"#general#Richard#Stallman#linux#GNU#InstallGentoo","favourites":36,"__v":0,"created_on":"2015-03-17T23:32:30.252Z","score":0.0006490687052599016},{"_id":"54f811f887d1bc685b1e960b","id":974,"pasta":"This is bullshit - you're oversimplifying a complex situation to the point of no longer adding anything useful to the discussion","tags":"#reddit#bullshit#oversimplifying#complex","favourites":38,"__v":0,"created_on":"2015-03-05T05:55:44.998Z","score":0.0006171447116053811},{"_id":"559ef1f1975fee4a2be08435","id":1870,"pasta":"Will you fucktards stop leaking out of your containment board?\n\nIt's like I can't browse 4chan for FIVE FUCKING MINUTES without someone posting a \"LE EBIN S4S IRONIC MAYMAY XD\". Your dipshits are like a fucking EBOLA epidemic, as soon as one shitposter posts anything even remotely related to /s4s/ another 500 crawl out of the woodwork as start spamming, checking dubs and posting unfunny pictures of shit \"memes\" that don't even make any fucking sense. And can we talk about /s4s/'s memes for a second here? It's amazing how the board most obsessed with memes has failed to produce even one meme that isn't complete and utter garbage. The closest thing you cocksuckers had to an actual successful meme was topkek, and even that was ripped off ylilauta. And when was that? Two years ago? What actual real memes did /s4s/ produce since then? Just a whole bunch of frankly quite boring pictures with zero humor or exploitability. It's no wonder that nothing from this self-declared \"OC factory\" ever actually spreads to other boards. This is painfully pathetic to watch. Most of you aren't even being ironic anymore. Some of you actually actually come here and in full sincerity participate in this circlejerk. You excuse your actions by saying mindbogglingly idiotic shit like \"this is like old /b/! lel so random\", but guess what retards: I've been on 4chan since 2006 and this place is nothing, NOTHING like old /b/. Fucking STOP SAYING THAT YOU PIECES OF SHIT. That's outright OFFENSIVE to anyone who's seen what pre-2007 /b/ looked like. You nuggets of cancer perfectly embody everything that KILLED old /b/. It's like someone took the 2008-era cancer, took THE VERY WORST PARTS of it, concentrated it to 200% levels and then wrapped it in a painfully thin veil of \"irony\".\n\nYou know? I ain't even mad. Let this be a containment board for you newfags and ledditors. I honestly don't have the energy to care about anything that happens on this website anymore. Just wanted to say fuck.","tags":"#4chan#maymay#angry","favourites":6,"__v":0,"created_on":"2015-07-09T01:25:28.420Z","score":0.0006147071451591333},{"_id":"54ff6f1787d1bc685b1e9665","id":1014,"pasta":"Hello President Obama, for years the MLG community has been ostracized and persecuted. This is the 21st century, and discrimination should no longer be allowed. This is why I urgently ask you to begin the legalization of gay weed. Thank you.","tags":"#general#obama#legalize#gay#weed","favourites":36,"__v":0,"created_on":"2015-03-10T21:51:27.520Z","score":0.000614557527322673},{"_id":"5589fe272a7929bd7a8b1f84","id":1798,"pasta":"    Gomenasai, my name is Adolf-Sama.\n\n    I’m a 43 year old German Otaku (Anime fan for you gaijins). I draw Anime and Manga on my tablet, and spend my days perfecting my art and playing superior Japanese games. (Disgaea, Final Fantasy, Persona series)\n\n    I train with my Katana every day, this superior weapon can cut clean through steel because it is folded over a thousand times, and is vastly superior to any other weapon on earth. I earned my sword license two years ago, and I have been getting better every day.\n\n    I speak Japanese fluently, both Kanji and the Osaka dialect, and I write fluently as well. I know everything about Japanese history and their bushido code, which I follow 100%\n\n    When I get my Japanese visa, I am moving to Tokyo to attend a prestigious High School to learn more about their magnificent culture. I hope I can become an animator for Studio Ghibli or a game designer!\n\n    I own several kimonos, which I wear around town. I want to get used to wearing them before I move to Japan, so I can fit in easier. I bow to my elders and seniors and speak Japanese as often as I can, but rarely does anyone manage to respond.\n\n    Wish me luck in Japan!","tags":"#general#Hitler#Hitlersama#Otaku","favourites":9,"__v":0,"created_on":"2015-06-21T23:14:20.627Z","score":0.0006089122790926592}]