[{"_id":"55098d642ab05ce134dd320d","id":1193,"pasta":"I abide by the code of honor and chivalry, so to all those who repeatedly insult me on forums hiding behind their computer screen: I am available at anytime of the day for a fistfight or any type of sword or crossbow duel. I just purchased an automatic pistol crossbow. It's a mix between a gun and a crossbow, it's like a pistol but it fires arrows. I killed a goat with a shot in the stomach at point-blank range by alluring it with grass; the beast died three hours later. I will do the same with you. I know that you like grass, like all sheep do.","tags":"#general#sheep#crossbow#honor#chivalry#tough#guy","favourites":10,"__v":0,"created_on":"2015-03-18T14:15:51.034Z","score":0.00020864460955763193},{"_id":"54f961db87d1bc685b1e9623","id":985,"pasta":"** YOU HAVE BEEN VISITED BY LE PELICAN! *** post this in 3\nseconds or you will be fukken killed\n\n░░░░░░░░▄▄▄▀▀▀▄▄███▄    \n░░░░░▄▀▀░░░░░░░▐░▀██▌    \n░░░▄▀░░░░▄▄███░▌▀▀░▀█    \n░░▄█░░▄▀▀▒▒▒▒▒▄▐░░░░█▌    \n░▐█▀▄▀▄▄▄▄▀▀▀▀▌░░░░░▐█▄    \n░▌▄▄▀▀░░░░░░░░▌░░░░▄███████▄    \n░░░░░░░░░░░░░▐░░░░▐███████████▄    \n░░░░░░░░░░░░░▐░░░░▐█████████████▄    \n░░░░░░░░░░░░░░▀▄░░░▐██████████████▄     \n░░░░░░░░░░░░░░░░▀▄▄████████████████▄     \n░░░░░░░░░░░░░░░░░░░░░   ","tags":"#general#le#pelican","favourites":11,"__v":0,"created_on":"2015-03-06T08:13:32.793Z","score":0.00020756516428443683},{"_id":"5505d55f87d1bc685b1e968d","id":1030,"pasta":"I was offered sex today, with a 21 year old girl. In exchange for that, I was supposed to advertise some kind of bathroom cleaner to my friends. Of course I declined because I am a person of high moral standards with a strong willpower. Just as strong as Ajax, the super strong bathroom cleaner. Now available scented with lemon or vanilla.","tags":"#general#bathroom#cleaner#ajax#sellout","favourites":10,"__v":0,"created_on":"2015-03-15T10:35:44.570Z","score":0.00020357487294445474},{"_id":"54ee8e8487d1bc685b1e9599","id":922,"pasta":"I sexually Identify as a Racecar. Ever since I was a boy I dreamed of drifting around corners and running quarter miles in under ten seconds. People say to me that a person being a Racecar is Impossible and I'm fucking retarded but I don't care, I'm beautiful. I'm having a shop mechanic install 100-shot of nitrous, adjustable coilovers, and twin scroll turbos on my chassis. From now on I want you guys to call me \"Drift King\" and respect my right to burn rubber below and shoot flames needlessly. If you can't accept me you're a ricer and need to check your modifying privilege. Thank you for being so understanding.","tags":"#reddit#sexually#identify#race#car","favourites":11,"__v":0,"created_on":"2015-02-26T03:09:52.094Z","score":0.00019573972679005062},{"_id":"54bfde0f3b0a330105ff5cb4","id":422,"pasta":" are you >implying every single joke on reddit hasn't been overdone 1000 times?\n\nclears throat\n\nTo be fair, I did nazi that coming. I came here to say this but boy, that escalated quickly so to the top with you! Lost it at 'This is why we can't have nice things' and then my faith in humanity was restored, my mind blown, and manly tears were shed. Well said. As a 'murican, I can confirm this gem has just won the internet and is doing it right. Just sayin', I know that feel, bro, and while that was a risky click, this post was a 9/10. 10/10 with rice xd, would read again. I see what you did there and it feels good man. You're doing God's work, son. I laughed way harder than I should have at your list that seems legit and totally nailed it. You - I like you. You magnificent bastard; you, sir, are so brave, a gentleman and a scholar, and seeing how you are a redditor for 4 years, this checks out, so I'll allow it. I regret that I only have one upvote to give for this cool story, bro. CTRL+F \"about tree fiddy\" was not disappointed. Wait, why do I have you tagged as \"NOPE NOPE NOPE\"? Nice try, you monster. What did I just read? Dafuq? I read that as \"YOU HAD ONE JOB\". I can't fap to this. No true scotsman could see that this relevant XKCD was bad, and you should feel bad. You must be new to reddit, so I'll see your cakeday and raise you a karma train. One does not simply rustle my jimmies, not even once. This stahp gave me cancer for science, so that's enough internet for me today. OP is a fag, 2/10, would not bang. What is this I don't even know how is this wtf? Circlejerk must be leaking. This will get buried but brace yourselves, some men want to watch the world burn right in the feels. When you see it, they'll KILL IT WITH FIRE! But this has nothing to do with atheism. Lawyer up, delete facebook, hit the gym, and SHUT UP AND TAKE MY MONEY, said no one ever, so you wouldn't download a strawman. Damn onions, you scary like a BOSS. whoosh. Since rule #1 is 'be attractive', I'll just leave this here: This is my [f]irst post, be gentle. I have the weirdest boner right now, so I'll be in my bunk with dat ass. Oh, you! ...now KISS!!! I know you should never stick your dick in crazy, but DM;HS. ...this kills the redditor.\n\nOP will surely deliver. op pls, pls op pls respond that link is staying blue.\n\nIn the meantime, I'll show myself out.\n\nDirected by M. Night Shamallama.\n\nAs long as the 'fad' for plagiarising other peoples' witty comments doesn't die out, I guess I'm cool.\n\n*edit: I accidentally a word\n\nthis community is fucking shit, every comment section of every top post has some variation of this garbage re-iterated as the top comment. and you unoriginal idiots upvote it like it's the punniest thing you have ever seen. low effort jokes all day long.\n\nedit: LOL THX FRONT PAGE POST OBLIGATORY XDDDDD\n\nactual edit: removed thanks for the gold.\n\nDank memes","tags":"#reddit#le#dank#memes#meta#implying#repost","favourites":14,"__v":0,"created_on":"2015-01-21T11:31:06.134Z","score":0.00019412585831762082},{"_id":"550b9f022ab05ce134dd3282","id":1238,"pasta":"░░░░░░░░░░░░░░░░░░▒▓▓▓▓▓▒░░░░░░░░░░░░░░░░░░░░░░░░░░░░▒▓▓▓▓▓▒░░░░░░░ ░░░░░█▒░░░░░░░░▓██▓▓██▒▒▓▓█▓░░░░░░░█▓░░░░░░░░░░░░░▓███▓██▒▒▓██▓░░░░ ░░░░██░░░░░░▒██▒█░░░░█▒░░░░▒██░░░░▒██░░░░░░░░░░░██▒█▒░░░▓▓░░░████░░ ░░░██░░░░░░░▒▒░░█▒░░░█▒░░░░░░▒░░░░░██░░░░░░░░░░░▒░░█▒░░░█▓░░░░██░░░ ░░██░░░░░░░░░░░░░██▓█▒░░░░░░░░░░░░▒████▒░░░░░░░░░░░░▓▓██▓░░░░░░█▓░░ ░▒█▓░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░▒██▓░░░░░░░░░░░░░░░░░░░░░░██░░ ░▓█▒░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░██▒░░░░░░░░░░░░░░░░░░░░░▒█▓░ ░██░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░▒██░░░░░░░░░░░░░░░░░░░░░▒██░ ░██░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░▒█▓░░░░░░░░░░░░░░░░░░░░░▒██░ ░▓█▒░░░░░░░░░░░░░░░░░░░░░░░░░░░▓█▒░░░░░██▒░░░░░░░░░░░░░░░░░░░░░▓█▒░ ░░██░░░░░░░░░░░░░░░░░░░░░░░░░░░░███▒▓▓██▒░░░░░░░░░░░░░░░░░░░░░░██░░ ░░▒█▒░░░░░░░░░░░░░░░░░░░░░░░░▒░░░▒▓██▓▒░░░░░░░░░░░░░░░░░░░░░░░▓█▒░░ ░░░▓█░░░░░░░░░░░░░░░░░░░░░░░░██▒░░░░░░░░░░░░▓█▒░░░░░░░░░░░░░░▒█▒░░░ ░░░░▓█▒░░░░░░░░░░░░░░░░░░░░░░░▒███▓▓▒▒▒▓▓███▓░░░░░░░░░░░░░░░▒█▒░░░░ ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░▒▒▒▓▓▒▒░░░░░░░░░░░░░░░░░░░▒░░░░░░","tags":"#general#ASCII#lenny","favourites":9,"__v":0,"created_on":"2015-03-20T04:01:31.129Z","score":0.0001915097649404415},{"_id":"54d4eb9701ae2be31cb3df93","id":717,"pasta":"IceFrog doesn't exist (srs). Valve made it up; they always planned to take over DotA but needed to create a persona that the average gamer could relate to - a programming wizard kid who builds the game from his bedroom at night listening to the wishes of his followers as he balances the game. They build up the trust of the community until suddenly they release Dota 2 to the world under the guidance of this so-called \"IceFrog\". Pls no coperino pasterino","tags":"#dota2#reddit#TeDeumLaudamus#IceFrog#valve","favourites":12,"__v":0,"created_on":"2015-02-06T12:10:30.483Z","score":0.0001860929850108398},{"_id":"5521cf2f05bc3c2d7b4c6b7d","id":1414,"pasta":"There's this chick I follow on Facebook. I accidentally started following her because she has the same name of this girl I met and thought I was sending a friend request to her. She was only 14 when I started following her. As soon as I realized she wasn't the person I was meaning to follow I went to unfollow her. But then I realized this 14 year old girl was hilariously stupid. She didn't know why America would send a separate team from Georgia to the Olympics, she couldn't figure out why elevators had buttons for the floor she was already on, and many other things I just saw and laughed. Anyway I never stopped following her because she was such a big source of my morning laughs.\n\nShe got pregnant at 15 because she thought you couldn't get pregnant on the first time. She was sure that the 15 year old boy that got her pregnant was going to be a great daddy. Well the kid is 1 now and she always complains about him never being around and how he would rather stay at home bored than see his son and all the other crap any of us could have warned her about when she was certain she was going to be the one teenage mom whose baby daddy would actually hang around.\n\nAnyway the reason I bring all that up is that through these 2 years I've followed this complete moron she has never written there when she meant their. So if this person can get it right, then everyone can.","tags":"#reddit#idiot#moron#girl#their#there","favourites":7,"__v":0,"created_on":"2015-04-06T00:11:23.796Z","score":0.0001736365018928691},{"_id":"54b334269b268c8a13613af1","id":48,"pasta":"What the fuck did you just fucking say about crows, you little bitch? I’ll have you know I graduated top of my class in environmental science, and I’ve been involved in numerous secret studies on crow behavior, and I have over 300 confirmed alt accounts. I am trained in vote brigading and I have the top comment karma on this entire website. You are nothing to me but just another target. I will downvote you with precision the likes of which has never been seen before on this Earth, mark my fucking words. You think you can get away with saying that about crows over the Internet? Think again, fucker. As we speak I am contacting my secret network of taxonomists across the USA and your IP is being traced right now so you better prepare for the storm, jackdaw. The storm that wipes out the pathetic little thing you call your life. You’re fucking dead, kid. I can be anywhere, anytime, and I can downvote you in over seven hundred ways, and that’s just with alt accounts. Not only am I extensively trained in taxonomy, but I have access to the entire Latin names of the Corvidae family and I will use it to its full extent to prove you wrong and downvote your miserable ass off the face of the internet, you little shit. If only you could have known what unholy retribution your little “clever” comment was about to bring down upon you, maybe you would have held your fucking tongue. But you couldn’t, you didn’t, and now you’re paying the price, you goddamn idiot. I will shit downvotes all over you and you will drown in it. You’re fucking dead, jackdaw.","tags":"#reddit#unidan#navy#seal#jackdaw#crow","favourites":13,"__v":0,"created_on":"2015-01-12T02:40:35.753Z","score":0.00017216126790661916},{"_id":"550c4f6b2ab05ce134dd3296","id":1246,"pasta":"A liberal muslim homosexual ACLU lawyer professor and abortion doctor was teaching a class on Karl Marx, known atheist.\n”Before the class begins, you must get on your knees and worship Marx and accept that he was the most highly-evolved being the world has ever known, even greater than Jesus Christ!”\nAt this moment, a brave, patriotic, pro-life Navy SEAL champion who had served 1500 tours of duty and understood the necessity of war and fully supported all military decisions made by the United States stood up and held up a rock.\n”How old is this rock, pinhead?”\nThe arrogant professor smirked quite Jewishly and smugly replied “4.6 billion years, you stupid Christian.”\n”Wrong. It’s been 5,000 years since God created it. If it was 4.6 billion years old and evolution, as you say, is real… then it should be an animal now.”\nThe professor was visibly shaken, and dropped his chalk and copy of The Origin of Species. He stormed out of the room crying those liberal crocodile tears. The same tears liberals cry for the “poor” (who today live in such luxury that most own refrigerators) when they jealously try to claw justly earned wealth from the deserving job creators. There is no doubt that at this point our professor wished he had pulled himself up by his bootstraps and become more than a sophist liberal professor. He wished so much that he had a gun to shoot himself from embarrassment, but he himself had petitioned against them!\nThe students applauded and all registered Republican that day and accepted Jesus as their lord and savior. An eagle named “Small Government” flew into the room and perched atop the American Flag and shed a tear on the chalk. The pledge of allegiance was read several times, and God himself showed up and enacted a flat tax rate across the country.\nThe professor lost his tenure and was fired the next day. He died of the gay plague AIDS and was tossed into the lake of fire for all eternity.\nSemper Fi.","tags":"#general#aclu#professor#karl#marx#marine","favourites":8,"__v":0,"created_on":"2015-03-20T16:38:51.216Z","score":0.00017206203579204924},{"_id":"550a47d12ab05ce134dd3240","id":1213,"pasta":"Yo yo yo\nI smoke weed\nYes indeed\nI am weed\nit is me\nI love weeds\nout in the yard\nits hard\nto cut them, with my knife\nbut I do it.\ncause I like weed.\nanal bead.","tags":"#general#weed#poem","favourites":8,"__v":0,"created_on":"2015-03-19T03:35:25.568Z","score":0.0001699639573638209},{"_id":"5509c7dc2ab05ce134dd3223","id":1202,"pasta":"Fucking lol'd\n\n10/10 if troll\n7/10 if copy pasta\n10/10 if troll\n7/10 if copy pasta>>491290000 → →\nFucking lol'd\n>>491290000 → → Fucking lol'd 10/10 if troll 7/10 if copy pasta >>491290000 → → Fucking lol'd 10/10 if troll 7/10 if copy pasta >>491290000 → → Fucking lol'd 10/10 if troll 7/10 if copy pasta >>491290000 → → Fucking lol'd 10/10 if troll 7/10 if copy pasta >>491290000 → →\nFucking lol'd>Fuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypastaFuckinglold100/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypas\n>>>491285937 (You) # (You) #\n>>>>491285773 (You) # (You) # (You) #\n>>>>491285773 (You) # (You) 10/10 if troll\n7/10 if copy pasta>>491290000 → →\nFucking lol'd\n>>491290000 → → Fucking lol'd 10/10 if troll 7/10 if copy pasta >>491290000 → → Fucking lol'd 10/10 if troll 7/10 if copy pasta >>491290000 → → Fucking lol'd 10/10 if troll 7/10 if co# (You) #\n>>>>>491285484 # # # #>>>>>491285280 # # # # #\n>>>>>Fucking lol'd>>>Fucking lol'd\n>>>troll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10id10/10ipypastaFuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypasta>>49128\n>10/10 if troll\n>7/aFuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/\n>>>>>10/10 if troll>>>>>7/10 if copy pasta>>>>>>491285420 # # # # #>>>>Fucking lol'd\n>>>>10/10 if troll\n>>>>7/10 if copy pastᎦ\n>>>Fucking lol'd>>>Fucking lol'd\n>>>\n>>>10/10 if troll\n>>>7/10 if copypasat\n>Fucking lol'd\n>10/10 if troll\n>7/aFuckinglold10/10iftroll7/10ifcopypasta\n>>>10/10 if troll\n>>7/10 if copypasta\n","tags":"#4chan#copypasta#10/10#troll#fucking#lol'd","favourites":8,"__v":0,"created_on":"2015-03-18T18:44:06.207Z","score":0.0001694693941816085},{"_id":"5508b613b47c3d010fd964f0","id":1071,"pasta":"Are you saying that this emacs can edit text without vim underneath it, at all ? As in, without keybinds, functions and modes?\nThat sounds preposterous to me.\nIf it were true (and I doubt it), then companies would be editing text without a vim. This clearly is not happening, so there must be some error in your calculations. I hope you realise that vim is more than just editing ? Its a whole system that shapes the text from start to finish, and that is a very difficult thing to acheive. A lot of people dont realise this.\nGoogle just spent $9 billion and many years to finally have the creator of vim work for them, so it does not sound reasonable that some new alternative could just snap into existence overnight like that. It would take billions of dollars and a massive effort to achieve. MacroMates tried, and spent a huge amount of money developing TextMate but could never keep up with vim.\nIts just not possible that a gnu indention style using program could be extended to the point where it shapes the entire text from start to finish, without using some of the more critical parts of vim. Not possible.\nI think you need to re-examine your assumptions. Why else would there be vintage mode in ST or viper in Emacs? You cannot edit text without vim, and that's a fact!","tags":"#general#vim#emacs#google#sublime","favourites":8,"__v":0,"created_on":"2015-03-17T23:13:01.844Z","score":0.0001683884397313598},{"_id":"54b470cf7622b32a1cea7b6b","id":80,"pasta":"Here's the thing. You said a \"ASCII is a copypasta.\"\nIs it in the same family? Yes. No one's arguing that.\nAs someone who is an autist who studies copypastas, I am telling you, specifically, in autism, no one calls ASCIIs copypastas. If you want to be \"specific\" like you said, then you should too. They're not the same thing.\nIf you're saying \"copypasta family\" you're referring to the autistic grouping of /r/copypasta, which includes things from neckbearded autists to highly intelligent apes like myself.\nSo your reasoning for calling ASCII a copypasta is because random people \"say that only autists use ASCII?\" Let's get dongers and creepypastas in there, then, too.","tags":"#reddit#ascii#unidan#copypasta#family","favourites":12,"__v":0,"created_on":"2015-01-13T01:11:34.270Z","score":0.00016096155308447003},{"_id":"55120622b95692707d28e8fe","id":1318,"pasta":"[ ] Not Told\n[X] Told\n[X] Fucking Told\n[X] Really Told\n[X] TOLDASAURUS REX\n[X] Cash4Told.com\n[X] No Country for Told Men\n[X] Knights of the Told Republic\n[X] Tolderone\n[X] ToldSpice\n[x] The Elder Tolds IV: Oblivious\n[x] Command & Conquer: Toldberian Sun\n[x] GuiTold Hero: World Told\n[X] Told King of Boletaria\n[x] Countold Strike\n[x] Unreal Toldament\n[x] Stone-told Steve Austin\n[X] Half Life 2: Episode Told\n[X] Stone Told Steve Austin\n[X] Roller Coaster Toldcoon\n[x] Assassin’s Creed: Tolderhood\n[x] Battletolds\n[x] S.T.A.L.K.E.R.: Shatold of Chernobyl\n[X] Toldasauraus Rex 2: Electric Toldaloo\n[x] Told of Duty 4: Modern Toldfare\n[X] Pokemon Told and Silver\n[x] Cure for the Common Told\n[x] The Legend of Eldorado : The Lost City of Told\n[X] Rampage: Toldal Destruction\n[x] Told Fortress Classic\n[x] Toldman: Arkham Told\n[X] The Good, The Bad, and The Told\n[x] Super Mario SunTold\n[x] Legend of Zelda: Toldacarnia of Time\n[X] Toldstone Creamery\n[x] Ben Tolds\n[x] Mario Golf: Toldstool Tour\n[X] Super Told Boy\n[X] Sir Barristan the Told\n[X] Left 4 Told\n[X] Battoldfield: Bad Company 2\n[X] Toldman Sachs\n[X] Conker’s Bad Fur Day: Live and Retolded\n[X] Lead and Told: Gangs of the Wild West\n[X] Portold 2\n[X] Avatold: The Last Airbender\n[X] Dragon Ball Z Toldkaichi Budokai\n[X] Toldcraft II: Tolds of Toldberty\n[X] Leo Toldstoy\n[X] Metal Gear Toldid 3: Snake Eater\n[X] 3D Dot Told Heroes\n[X] J.R.R Toldkien’s Lord of the Told\n[X] Told you that PS3 has no games\n[X] LitTOLD Big Planet\n[X] Rome: Toldal War\n[X] Gran Toldrismo 5\n[X] Told Calibur 4\n[X] Told Fortress 2\n[X] Castlevania: RonTold of Blood\n[X] Guilty Gear XX Accent Told\n[X] Cyndaquil, Chicorita, and Toldodile\n[X] Was foretold\n[X] Demon’s Told\n[x] The 40 Year Told Virgin\n[X] http://www.youtold.com\n[X] Tolden Sun: Dark Dawn\n[X] Tic-Tac-Told\n[X] Biotold 2\n[X] Toldbound\n[X] Icetold\n[X] Told of the Rings\n[X] Hisoutentoldu\n[X] Told dish of revenge served\n[X] Apply told water to burnt area\n[X] The Tolden Rule\n[X] Dark Tolds\n[X] Told Story\n[X] Tolden Axe\n[X] Gary Toldman\n[X] Told MacDonald Had a Farm\n[X] Super Told XLVIII\n[X] Told Finger\n[X] Toldeneye\n[X] Told and Tolder\n[X] Told and Tolder Told\n[X] Lord Toldermort\n[X] Told Bond: Medicated Powder\n[X] The Tolder Scrolls\n[X] House Toldgaryan\n[X] Toldèmon O/P\n[X] Told Testament\n[X] World of Toldcraft: The Burning Told\n[X] All Told Everything\n[X] JRR Toldkien\n[X] Reddit Told\n[X] Told's spaghetti\n[X] The Toldman Show\n[X] Mementold\n[X] Toldega Nights: The Ballad of Ricky Toldy Battold Royale\n[X] I'll have the toldalini Alfredo, please\n[X] The Big Letoldski\n[X] Tolddock Saints\n[X] Legend of Total Toldage\n[X] carved into a toldem pole\n[X] DIS NIGGA GOT TOLD\n[X] Told-finger death punch\n[X] Told alexandra\n[X] 007: Told 'Em\n[x] Texas Told 'Em\n[x] Pteradactold\n[x] Toldtino's Pizza Rolls\n[x] Going Once....Going Twice....Told!\n[x] Told Spice\n[x] Told Stone Cemetery\n[x] Baby Its Told Outside\n[x] Told Yeller\n[x] Toldplay\n[x] The Told and the Beautiful\n[x] I Ain't Saying She's a Told Digger\n[x] Stay Tolden Ponyboy\n[x] J.R.R Toldien\n[x] The Elder Tolds 4: Oblivious\n[X] Bring me the told\n[X] toldboy and the tolden army\n[X] Followed the tolden brick road\n[X] Fear and Loathing in Told Vegas\n[X] Told Mountain\n[X] Snoop told\n[X] Toldclub\n[X] The Told and the Textless\n[X] Tolden Caulfield\n[X] http://i.imgur.com/VQLGJOL.gif\n[X] J.R.R Toldkien's Told of the Told\n[X] Land Before Told\n[X] The Elder Tolds III: Toldwind\n[X] Nightmare on Told Street\n[X] Bennie and the Tolds\n[X] David Coppertold\n[X] A Tale of Two Tolds\n[X] Colgate Toldal\n[X] Halftold 3\n[X] Egg, I dreamed I was told.\n[X] Gladness men of told.\n[X] Toldtanic\n[X] Dwarf Toldtress\n[X] www.facetold.com\n[X] /r/asktoldit\n[X] Of Tolds and men\n[X] The Tolder Express\n[X] Toldlet\n[X] Toldaria\n[X] Toldbox 360","tags":"#reddit#told#list#long","favourites":7,"__v":0,"created_on":"2015-03-25T00:42:08.918Z","score":0.00015672680993846974}]