[{"_id":"54c42f7ced70401f791aa71e","id":546,"pasta":"( ͡° ͜ʖ ͡°) Eᴠᴇʀʏ 60 sᴇᴄᴏɴᴅs ɪɴ Mᴜʀɪᴄᴀ, 60,000 ʙᴜʀɢᴇʀs ᴀʀᴇ ᴅɪɢᴇsᴛᴇᴅ. Tᴏɢᴇᴛʜᴇʀ ᴡᴇ ᴄᴀɴ sᴛᴏᴘ ᴛʜɪs. Pʟᴇᴀsᴇ sᴘʀᴇᴀᴅ ᴛʜᴇ ᴡᴏʀᴅ. ( ͡° ͜ʖ ͡°)","tags":"#twitch#general#america#MURICA#burgers#digested","favourites":10,"__v":0,"created_on":"2015-01-24T23:49:07.850Z","score":0.00010727880663055908},{"_id":"5521cf2f05bc3c2d7b4c6b7d","id":1414,"pasta":"There's this chick I follow on Facebook. I accidentally started following her because she has the same name of this girl I met and thought I was sending a friend request to her. She was only 14 when I started following her. As soon as I realized she wasn't the person I was meaning to follow I went to unfollow her. But then I realized this 14 year old girl was hilariously stupid. She didn't know why America would send a separate team from Georgia to the Olympics, she couldn't figure out why elevators had buttons for the floor she was already on, and many other things I just saw and laughed. Anyway I never stopped following her because she was such a big source of my morning laughs.\n\nShe got pregnant at 15 because she thought you couldn't get pregnant on the first time. She was sure that the 15 year old boy that got her pregnant was going to be a great daddy. Well the kid is 1 now and she always complains about him never being around and how he would rather stay at home bored than see his son and all the other crap any of us could have warned her about when she was certain she was going to be the one teenage mom whose baby daddy would actually hang around.\n\nAnyway the reason I bring all that up is that through these 2 years I've followed this complete moron she has never written there when she meant their. So if this person can get it right, then everyone can.","tags":"#reddit#idiot#moron#girl#their#there","favourites":7,"__v":0,"created_on":"2015-04-06T00:11:23.796Z","score":0.00010581074350563556},{"_id":"54f529dd87d1bc685b1e95e3","id":955,"pasta":"It should be noted that I've upvoted every single person who's disagreed with me here, as far as I know.\nThat said.\nIn 7th grade, I took an SAT test without preparing for it at all, it was spur-of-the-moment, I knew about it about an hour ahead of time and didn't do any research or anything. I scored higher on it than the average person using it to apply for college in my area.\nAn IQ test has shown me to be in the 99.9th percentile for IQ. This is the highest result the test I was given reaches; anything further and they'd consider it to be within the margin of error for that test.\nMy mother's boyfriend of 8 years is an aerospace engineer who graduated Virginia Tech. At the age of 15, I understand physics better than him, and I owe very little of it to him, as he would rarely give me a decent explanation of anything, just tell me that my ideas were wrong and become aggravated with me for not quite understanding thermodynamics. He's not particularly successful as an engineer, but I've met lots of other engineers who aren't as good as me at physics, so I'm guessing that's not just a result of him being bad at it.\nI'm also pretty good at engineering. I don't have a degree, and other than physics I don't have a better understanding of any aspect of engineering than any actual engineer, but I have lots of ingenuity for inventing new things. For example, I independently invented regenerative brakes before finding out what they were, and I was only seven or eight years old when I started inventing wireless electricity solutions (my first idea being to use a powerful infrared laser to transmit energy; admittedly not the best plan).\nI have independently thought of basically every branch of philosophy I've come across. Every question of existentialism which I've seen discussed in SMBC or xkcd or Reddit or anywhere else, the thoughts haven't been new to me. Philosophy has pretty much gotten trivial for me; I've considered taking a philosophy course just to see how easy it is.\nPsychology, I actually understand better than people with degrees. Unlike engineering, there's no aspect of psychology which I don't have a very good understanding of. I can debunk many of even Sigmund Freud's theories.\nI'm a good enough writer that I'm writing a book and so far everybody who's read any of it has said it was really good and plausible to expect to have published. And that's not just, like, me and family members, that counts strangers on the Internet. I've heard zero negative appraisal of it so far; people have critiqued it, but not insulted it.\nI don't know if that will suffice as evidence that I'm intelligent. I'm done with it, though, because I'd rather defend my maturity, since it's what you've spent the most time attacking. The following are some examples of my morals and ethical code.\nI believe firmly that everybody deserves a future. If we were to capture Hitler at the end of WWII, I would be against executing him. In fact, if we had any way of rehabilitating him and knowing that he wasn't just faking it, I'd even support the concept of letting him go free. This is essentially because I think that whoever you are in the present is a separate entity from who you were in the past and who you are in the future, and while your present self should take responsibility for your past self's actions, it shouldn't be punished for them simply for the sake of punishment, especially if the present self regrets the actions of the past self and feels genuine guilt about them.\nI don't believe in judgement of people based on their personal choices as long as those personal choices aren't harming others. I don't have any issue with any type of sexuality whatsoever (short of physically acting out necrophilia, pedophilia, or other acts which have a harmful affect on others - but I don't care what a person's fantasies consist of, as long as they recognize the difference between reality and fiction and can separate them). I don't have any issue with anybody over what type of music they listen to, or clothes they wear, etc. I know that's not really an impressive moral, but it's unfortunately rare; a great many people, especially those my age, are judgmental about these things.\nI love everyone, even people I hate. I wish my worst enemies good fortune and happiness. Rick Perry is a vile, piece of **** human being, deserving of zero respect, but I wish for him to change for the better and live the best life possible. I wish this for everyone.\nI'm pretty much a pacifist. I've taken a broken nose without fighting back or seeking retribution, because the guy stopped punching after that. The only time I'll fight back is if 1) the person attacking me shows no signs of stopping and 2) if I don't attack, I'll come out worse than the other person will if I do. In other words, if fighting someone is going to end up being more harmful to them than just letting them go will be to me, I don't fight back. I've therefore never had a reason to fight back against anyone in anything serious, because my ability to take pain has so far made it so that I'm never in a situation where I'll be worse off after a fight. If I'm not going to get any hospitalizing injuries, I really don't care.\nThe only exception is if someone is going after my life. Even then, I'll do the minimum amount of harm to them that I possibly can in protecting myself. If someone points a gun at me and I can get out of it without harming them, I'd prefer to do that over killing them.\nI consider myself a feminist. I don't believe in enforced or uniform gender roles; they may happen naturally, but they should never be coerced into happening unnaturally. As in, the societal pressure for gender roles should really go, even if it'll turn out that the majority of relationships continue operating the same way of their own accord. I treat women with the same outlook I treat men, and never participate in the old Reddit \"women are crazy\" circlejerk, because there are multiple women out there and each have different personalities just like there are multiple men out there and each with different personalities. I don't think you do much of anything except scare off the awesome women out there by going on and on about the ones who aren't awesome.\nThat doesn't mean I look for places to victimize women, I just don't believe it's fair to make generalizations such as the one about women acting like everything's OK when it's really not (and that's a particularly harsh example, because all humans do that).\nI'm kind of tired of citing these examples and I'm guessing you're getting tired of reading them, if you've even made it this far. In closing, the people who know me in real life all respect me, as do a great many people in the Reddit brony community, where I spend most of my time and where I'm pretty known for being helpful around the community. A lot of people in my segment of the community are depressed or going through hard times, and I spend a lot of time giving advice and support to people there. Yesterday someone quoted a case of me doing this in a post asking everyone what their favorite motivational/inspirational quote was, and that comment was second to the top, so I guess other people agreed (though, granted, it was a pretty low-traffic post, only about a dozen competing comments).\nAnd, uh, I'm a pretty good moderator.\nAll that, and I think your behavior in this thread was totally assholish. So what do you think, now that you at least slightly know me?","tags":"#reddit#neckbeard#SAT#aerospace#engineer#IQ","favourites":8,"__v":0,"created_on":"2015-03-03T03:26:17.836Z","score":0.0001046854931611673},{"_id":"55120622b95692707d28e8fe","id":1318,"pasta":"[ ] Not Told\n[X] Told\n[X] Fucking Told\n[X] Really Told\n[X] TOLDASAURUS REX\n[X] Cash4Told.com\n[X] No Country for Told Men\n[X] Knights of the Told Republic\n[X] Tolderone\n[X] ToldSpice\n[x] The Elder Tolds IV: Oblivious\n[x] Command & Conquer: Toldberian Sun\n[x] GuiTold Hero: World Told\n[X] Told King of Boletaria\n[x] Countold Strike\n[x] Unreal Toldament\n[x] Stone-told Steve Austin\n[X] Half Life 2: Episode Told\n[X] Stone Told Steve Austin\n[X] Roller Coaster Toldcoon\n[x] Assassin’s Creed: Tolderhood\n[x] Battletolds\n[x] S.T.A.L.K.E.R.: Shatold of Chernobyl\n[X] Toldasauraus Rex 2: Electric Toldaloo\n[x] Told of Duty 4: Modern Toldfare\n[X] Pokemon Told and Silver\n[x] Cure for the Common Told\n[x] The Legend of Eldorado : The Lost City of Told\n[X] Rampage: Toldal Destruction\n[x] Told Fortress Classic\n[x] Toldman: Arkham Told\n[X] The Good, The Bad, and The Told\n[x] Super Mario SunTold\n[x] Legend of Zelda: Toldacarnia of Time\n[X] Toldstone Creamery\n[x] Ben Tolds\n[x] Mario Golf: Toldstool Tour\n[X] Super Told Boy\n[X] Sir Barristan the Told\n[X] Left 4 Told\n[X] Battoldfield: Bad Company 2\n[X] Toldman Sachs\n[X] Conker’s Bad Fur Day: Live and Retolded\n[X] Lead and Told: Gangs of the Wild West\n[X] Portold 2\n[X] Avatold: The Last Airbender\n[X] Dragon Ball Z Toldkaichi Budokai\n[X] Toldcraft II: Tolds of Toldberty\n[X] Leo Toldstoy\n[X] Metal Gear Toldid 3: Snake Eater\n[X] 3D Dot Told Heroes\n[X] J.R.R Toldkien’s Lord of the Told\n[X] Told you that PS3 has no games\n[X] LitTOLD Big Planet\n[X] Rome: Toldal War\n[X] Gran Toldrismo 5\n[X] Told Calibur 4\n[X] Told Fortress 2\n[X] Castlevania: RonTold of Blood\n[X] Guilty Gear XX Accent Told\n[X] Cyndaquil, Chicorita, and Toldodile\n[X] Was foretold\n[X] Demon’s Told\n[x] The 40 Year Told Virgin\n[X] http://www.youtold.com\n[X] Tolden Sun: Dark Dawn\n[X] Tic-Tac-Told\n[X] Biotold 2\n[X] Toldbound\n[X] Icetold\n[X] Told of the Rings\n[X] Hisoutentoldu\n[X] Told dish of revenge served\n[X] Apply told water to burnt area\n[X] The Tolden Rule\n[X] Dark Tolds\n[X] Told Story\n[X] Tolden Axe\n[X] Gary Toldman\n[X] Told MacDonald Had a Farm\n[X] Super Told XLVIII\n[X] Told Finger\n[X] Toldeneye\n[X] Told and Tolder\n[X] Told and Tolder Told\n[X] Lord Toldermort\n[X] Told Bond: Medicated Powder\n[X] The Tolder Scrolls\n[X] House Toldgaryan\n[X] Toldèmon O/P\n[X] Told Testament\n[X] World of Toldcraft: The Burning Told\n[X] All Told Everything\n[X] JRR Toldkien\n[X] Reddit Told\n[X] Told's spaghetti\n[X] The Toldman Show\n[X] Mementold\n[X] Toldega Nights: The Ballad of Ricky Toldy Battold Royale\n[X] I'll have the toldalini Alfredo, please\n[X] The Big Letoldski\n[X] Tolddock Saints\n[X] Legend of Total Toldage\n[X] carved into a toldem pole\n[X] DIS NIGGA GOT TOLD\n[X] Told-finger death punch\n[X] Told alexandra\n[X] 007: Told 'Em\n[x] Texas Told 'Em\n[x] Pteradactold\n[x] Toldtino's Pizza Rolls\n[x] Going Once....Going Twice....Told!\n[x] Told Spice\n[x] Told Stone Cemetery\n[x] Baby Its Told Outside\n[x] Told Yeller\n[x] Toldplay\n[x] The Told and the Beautiful\n[x] I Ain't Saying She's a Told Digger\n[x] Stay Tolden Ponyboy\n[x] J.R.R Toldien\n[x] The Elder Tolds 4: Oblivious\n[X] Bring me the told\n[X] toldboy and the tolden army\n[X] Followed the tolden brick road\n[X] Fear and Loathing in Told Vegas\n[X] Told Mountain\n[X] Snoop told\n[X] Toldclub\n[X] The Told and the Textless\n[X] Tolden Caulfield\n[X] http://i.imgur.com/VQLGJOL.gif\n[X] J.R.R Toldkien's Told of the Told\n[X] Land Before Told\n[X] The Elder Tolds III: Toldwind\n[X] Nightmare on Told Street\n[X] Bennie and the Tolds\n[X] David Coppertold\n[X] A Tale of Two Tolds\n[X] Colgate Toldal\n[X] Halftold 3\n[X] Egg, I dreamed I was told.\n[X] Gladness men of told.\n[X] Toldtanic\n[X] Dwarf Toldtress\n[X] www.facetold.com\n[X] /r/asktoldit\n[X] Of Tolds and men\n[X] The Tolder Express\n[X] Toldlet\n[X] Toldaria\n[X] Toldbox 360","tags":"#reddit#told#list#long","favourites":7,"__v":0,"created_on":"2015-03-25T00:42:08.918Z","score":0.00010414926435028633},{"_id":"5510e7af32d34a8e3c3ec412","id":1303,"pasta":"People often ask me what it means to be an American. I tell 'em it's triumph. Triumph. Triumph when we nuke our enemies. Triumph when when peer down from the moon and laugh heartily at Russia. Triumph when we depose one dictator after another. Triumph when we break into the homes of terrorist kingpins on the other side of Earth and shoot them in the face. Triumph when we use flying robots to bomb other terrorists in Afghanistan, and other nuclear robots to explore Mars. Triumph when we free Europe from Nazis. Triumph. Triumph. Triumph. But it's not just the the big things, see? It's the way I can set up lawn chairs at my friends house on the Texas Rio Grande and share a toast to freedom while watching Mexicans charge into gunfire to enter my country. It's the way an Italian cabbie sits up straight and floors the gas when he hears my accent. It's seeing the wide eyes and bead of sweat running down the forehead of a German customs agent when he opens my passport. It's the way a French waiter hangs his head when I refuse the wine and ask for Coke instead, in English knowing full well he understands me (and that they have it). The way an Aussie blushes and leans into the urinal next to me in the bathroom, or the scowl that meets my smirk when I tip an English waiter in US dollars covered with Washington's face. The way small mobs of Canadian school children follow me from a distance to see what a free man looks like, or how heads timidly rise and women gather when my accent stops the music in the clubs of Amsterdam. Triumph. Every bit of it, triumph. That's what it means to be an American.","tags":"#general#american#murica#triumph","favourites":7,"__v":0,"created_on":"2015-03-24T04:27:23.948Z","score":0.00010363128727051059},{"_id":"5508fca7b47c3d010fd965c5","id":1161,"pasta":"I sexually identify as a Navy Seal. Ever since I was a child I dreamed of being the top sniper in the entire US armed forces. People say to me that having over 300 confirmed kills is impossible and I'm fucking retarded but I don't care, I'm beautiful. I'm having a secret network of spies trace your IP right now so you better prepare for the storm, maggot. From now on, you're fucking dead, kiddo. If you can't accept me you need to check your gorilla privilege. Thank you for being so understanding.","tags":"#general#sexually#identify#navy#seal","favourites":7,"__v":0,"created_on":"2015-03-18T04:18:44.300Z","score":0.00010007352314950072},{"_id":"5508d9f3b47c3d010fd9656a","id":1120,"pasta":"(ง ͡ʘ* ͜ʖ ͡ʘ)ง(ง ͡ʘ ͜ʖ ͡ʘ)ง(ง ͡ʘ ͜ʖ ͡ʘ)งvv(ง ͡ʘ ͜ʖ ͡ʘ)ง! LRL FLUFEDCZECH 'EM˙ ͜ʟ˙ OHOOGOOGOREE LE OHHohhihoHhee! You have tickled my MEME bone!˙ ͜ʟ˙ XDDdd >if (you) BROWS this MEME past the frontLE pageLLLLLLLOOOOOOOOOLLLL ˙ ͜ʟ˙ ͡° ͜ʖ ͡°)v( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)v ( ͡° ͜ʖ ͡°)v( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)v˙ ͜ʟ˙ (ง ͡ʘ ͜ʖ ͡ʘ)ง ( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)LE( ͡° ͜ʖ ͡°)v v ( ͡° ͜ʖ ͡°v) ( ͡° ͜ʖ ͡°) ˙ ͜ʟ˙ XDXDXDXDXD ʖ ͡°) ( ͡° ͜ʖ ͡°) v ( ͡° ͜ʖ ͡°) v( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°)(ง ͡ʘ ͜ʖ ͡ʘ)งv(ง ͡ʘ ͜ʖ ͡ʘ)ง(ง meme i love that fuckinod 420 shit :) rips a bong˙ ͜ʟ˙ AHHHHHHHHH YES!One uUPSWAGpswag for le fine gentleruser TENDIES REEEEEEEEEEEEEEE( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡+ ͜ʖ ͡+) ( ͡+ ͜ʖ ͡+)( ͡+ ͜ʖ ͡ ͜ʖ ͡ʘ)ง (ง ͡ʘ ͜ʖ ͡ʘ)ง (ง ͡ʘ ͜ʖ ͡ʘ)ง (ง ͡ʘ. Le(ง ͡ʘ ͜ʖ ͡ʘ)ง FLUFE get SHRECKED MATEY XXDDDDDDDDDDDDLEDDDDDD ͜ʖ ͡ʘ)ง( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)v( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)v FUCK MAN xD i just fall of my chair cuz i couldnt and i CANT stop˙ ͜ʟ˙ laugh MUH TENDIEs LE HE!1!!!!!!11!!!!!!!!!!!!!!!!!!1111111111!!11 KEK!! KEK!! KEK!! WHATA FUCK MAN xD i just fall of my chair cuz i couldnt and i CANT stop laugh xDXDXDXDXDDDDDXXXXXXDDDDDD OMGOSH DDDDDXXXXXDDDDD(ง ͡ʘ ͜ʖ ͡ʘ)ง DDDDDD LOOOOOOOLLLLL(ง ͡ʘ ͜ʖ(ง ͡ʘ ͜ʖ ͡ʘ)ง ͡(ง ͡ʘ ͜ʖ ͡ʘ)ง )(ง ͡ʘ ͜ʖ ͡ʘ)ง FUCKIN HOLY SHITTTT I CANT JUST STOP LAUGHING CAUSE (ง ͡ʘ ͜ʖ ͡ʘ)ง HE HE HE HE JUST TO FUNNY MAN!!!1!1 HOOOOOOOOLLLLLLYYYYY SHIT i just fall of chair!!!! simply le epic so ebin(ง ͡ʘ ͜ʖ ͡ʘ)ง (ง ͡ʘ ͜ʖ ͡ʘ)(ง ͡ʘ ͜ʖ ͡ʘ)ง dae le epin win xD pwn’d ftw le xP good sir i tip my fedora to you! tips fedora, le any1 athiest? LOL\nGOOD MEME XDDDDDDDD DDDDD HAHAHOMG CANTF STOP LAUFHGING XDXDXD (you) mustthank˙ ͜ʟ˙ Mr skeltal and comment FOR YOU ,and >>>>WHATA ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) v( ͡° ͜ʖ ͡°) vv ( ͡° ͜ʖ ͡°) v( ͡° ͜ʖ ͡°g meme so much man LE waOHHHHHHH OOOOOOOOHH BABYit let me just gets wipe out smoke some of ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) that 420 vง ͡ʘ ͜ʖ ͡ʘ)ง(ง ͡ʘ ͜ʖ ͡ʘ)งv(ง ͡ʘ ͜ʖ ͡ʘ ͜ʖ ͡ʘ)ง v( ͡° ͜ʖ ͡°) v (ง ͡ʘ ͜ʖ ͡ʘ)ง (ง ͡ʘ ͜ʖ ͡ʘ)ง LELE\n(ง ͡ʘ ͜ʖ ͡ʘ)ง I MEAN(ง ͡ʘ ͜ʖ ͡ʘ)ง\nGREAT MEME GR88888 FUCKING MEME BRO I WISH I COULD STOP LAUGHING BUT I CANT MAN!!!! NICE MEME IMMA REPOST TO REDDIT LELELELELE TY XDDDDDDDDDDDDDDDD LE UPBOAT XD WAIT TIL LE DERPINA HEARS ABOUT THIS XDDDDDDDDDDDDDDDDDDDDDD EPIC MEMEING /b/(ง ͡ʘ ͜ʖ ͡ʘ)ง BAZINGA BAZINGA BAZINGAAAAAAAAAAAAAAAAA ZIMBABWE is this a le new epic meme? screen kapped for dat sweet karma xD. FUS ROH DAH!!!!!1 i used to be a christmas but then i took an arrow 2 da knee : BAZINGA BAZINGA ZIMBABWE. top kek, toppest of keks. AHHHHHHHHH YES!!!!!!!!!!!!!!!that sure hit the spot ok now repeat that fucking epic ass M E M E xDXDXDXDXDDDDLE FLUFE CONFIRMEDDXXXXXXDDDDDD˙ ͜ʟ˙ OMGOSH DDDDDXXXX(ง ͡ʘ ͜͡ʘงXDDDDD DDDDDDYOUR TENDIES ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡+ ͜ʖ ͡+) ( ͡+ ͜ʖ ͡+)( ͡+ ͜ʖ ͡ LOOOOOOOLLLLL ( ͡° ͜ʖ ͡°) ( ͡°(ง ͡ʘ ͜ʖ ͡ʘ)ง ͜ʖ˙ ͜ʟ˙ ͡°) ( ͡° ͜ʖ ͡°(ง ͡ʘ ͜ʖ ͡ʘ)ง(ง ͡ʘ ͜ʖ ͡ʘ)งv) ( ͡° ͜zvvvʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°v) (˙ ͜ʟ˙ ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°) ( ͡° ͜ʖ ͡°)le nyan cat? hahahaha le mayonaise. fucking epic ass ͡ʘ)ง( ͡° ͜ (v","tags":"#reddit#4chan#meme#memed#shit#post","favourites":7,"__v":0,"created_on":"2015-03-18T01:50:39.646Z","score":0.00010001452687593261},{"_id":"5508cd89b47c3d010fd96547","id":1105,"pasta":"You just bullied another human being until he left the stream. Do you realize this? Do you realize what scum you are? I've been quiet for too long, it ends today. You're getting a 4chan thread made about you kid.","tags":"#twitch#4chan#bully#left#stream","favourites":7,"__v":0,"created_on":"2015-03-18T00:43:32.753Z","score":0.00009998780793613935},{"_id":"54e137618c7aeb193319938b","id":811,"pasta":"Nice FUCKING meme you fucking SPERGLORD FAGSHIT. Holy FUCK it pisses me off when some unoriginal, retarded assholish dickweed decides it would just be FUCKING HILARIOUS to post the SAME. OVERUSED. JOKE. What do you even fucking hope to gain out of this? Karma? Well you're certainly getting that, cause it seems like a lot of other inbred shitface fucking retarded autistic fuckshits are thinking you're just FUCKING HILARIOUS and that this joke HASN'T BEEN MADE A BILLION FUCKING TIMES. FUCK you.","tags":"#reddit#nice#fucking#meme#overused#autist","favourites":8,"__v":0,"created_on":"2015-02-16T00:18:14.860Z","score":0.00009676651455817884},{"_id":"54b60568f6a1885137f43cf7","id":197,"pasta":"Copypasta is internet slang for any block of text that gets copied and pasted over and over again, typically disseminated by individuals through online discussion forums and social networking sites. Although it shares some characteristics with spam in the sense they’re both unsolicited (and often considered a nuisance), copypastas are mainly spread through human operators whereas the latter is automatically generated by electronic messaging systems.","tags":"#general#copypasta#definition","favourites":9,"__v":0,"created_on":"2015-01-14T05:55:11.270Z","score":0.00009262076426711311},{"_id":"54d4ebbf01ae2be31cb3df94","id":718,"pasta":"Kanye West goes to his Kanye Nest to take his Kanye Rest. He wakes up feeling his Kanye Best. Then he’ll get Kanye Dressed on his Kanye Vest to go on a Kanye Quest. He goes to church and becomes Kanye Blessed, then to a hotel room to be a Kanye Guest. Then to school to take his Kanye Test. He forgot to brush his teeth. Did he run out of Kanye Crest? His neighbor stole it, what a Kanye Pest. Then Kanye realizes he isn't the Kanye best. This made Kanye depressed.","tags":"#general#twitch#kanye","favourites":8,"__v":0,"created_on":"2015-02-06T16:18:26.832Z","score":0.00009240106822688502},{"_id":"550e74112ab05ce134dd32e3","id":1280,"pasta":"I cringed so hard my skin slithered off my body, slapped me in the face and then ran away... but you have to admit, those were some dank memes.","tags":"#general#cringe#dank#memes","favourites":6,"__v":0,"created_on":"2015-03-22T07:33:04.970Z","score":0.00008805103250074064},{"_id":"550e138c2ab05ce134dd32cd","id":1270,"pasta":"I sexually Identify as a Dank Meme. Ever since I was a boy I dreamed of dropping dank memes on disgusting foreigners. People say to me that a person being a meme is undank and I'm fucking retarded but I don't care, I'm dank. I'm having a plastic surgeon install troll faces, gnomes and dank kush 420 on my body. From now on I want you guys to call me maymay and respect my right to make dank maymays. If you can't accept me you're a memephobe and need to check your gnome privilege. Thank you for being so understanding.","tags":"#general#sexually#identify#dank#meme","favourites":6,"__v":0,"created_on":"2015-03-21T22:48:47.775Z","score":0.00008786394783924787},{"_id":"550d1a962ab05ce134dd32bc","id":1262,"pasta":"Dear Senpai, you still ain't noticed me, I hope I have a chansu... I ain't mad - I just think it's FUCKED UP you ignore my romansu...\nIf you didn't wanna talk to me inside the comments, you didn't have to... but you coulda liked my picture comment showing my pantsu!\nThey're blue and stripy man, at the front they got a little bow.\nI linked it in Private messages for you, for hours and you just said \"lolno.\"\nThat's pretty shitty man - you're like my fucking crush!\nI want you to be inside me senpai, I want to make you gush!","tags":"#general#anime#senpai#pantsu","favourites":6,"__v":0,"created_on":"2015-03-21T06:50:04.746Z","score":0.00008752368694481529},{"_id":"550cd6d12ab05ce134dd32b7","id":1259,"pasta":"Imagine you have never heard a joke before. Now tell me this. Why did the chicken cross the road?\nThe answer, as you would know from the joke, is to get to the other side. But is this not a joke at all, but a serious statement? This is an anti-joke. It is a lead-up of a joke that ends up being a huge let down of seriousness in the end.\nJust like your birth.﻿","tags":"#general#youtube#joke#antijoke","favourites":6,"__v":0,"created_on":"2015-03-21T01:30:45.308Z","score":0.00008741088092474541}]