[{"_id":"54d4ebbf01ae2be31cb3df94","id":718,"pasta":"Kanye West goes to his Kanye Nest to take his Kanye Rest. He wakes up feeling his Kanye Best. Then he’ll get Kanye Dressed on his Kanye Vest to go on a Kanye Quest. He goes to church and becomes Kanye Blessed, then to a hotel room to be a Kanye Guest. Then to school to take his Kanye Test. He forgot to brush his teeth. Did he run out of Kanye Crest? His neighbor stole it, what a Kanye Pest. Then Kanye realizes he isn't the Kanye best. This made Kanye depressed.","tags":"#general#twitch#kanye","favourites":46,"__v":0,"created_on":"2015-02-06T16:18:26.832Z","score":0.0006064871960990252},{"_id":"5538a2f0cc088ce3288b2999","id":1512,"pasta":"wot the fok did ye just say 2 me m8? i dropped out of newcastle primary skool im the sickest bloke ull ever meet & ive nicked 300 candy bars from tha corner store. im trained in street fitin’ & im the strongest foker in tha entire newcastle gym. yer nothin to me but a cheeky lil dickhead w/ a hot mum & fake bling. ill waste u and smash a fokin bottle oer yer head bruv, i swer 2 christ. ya think u can fokin run ya gabber at me whilst sittin on yer arse behind a lil screen? think again wanka. im callin me homeboys rite now preparin for a proper rumble. tha rumble thatll make ur nan sore jus hearin about it. yer a waste bruv. my homeboys be all over tha place & ill beat ya to a proper fokin pulp with me fists wanka. if i aint satisfied w/ that ill borrow me m8s cricket paddle & see if that gets u the fok out o’ newcastle ya daft kunt. if ye had seen this bloody fokin mess commin ye might a’ kept ya gabber from runnin. but it seems yer a stewpid lil twat, innit? ima shite fury & ull drown in it m8. ur in proper mess ya knobhead.","tags":"#general#newcastle#navy#seal#english#m8","favourites":22,"__v":0,"created_on":"2015-04-23T07:44:45.941Z","score":0.0005875687723620391},{"_id":"5508d42ab47c3d010fd9655c","id":1115,"pasta":"Awesome pics. Great size. Look thick. Solid. Tight. Keep us all posted on your continued progress with any new progress pics or vid clips. Show us what you got man. Wanna see how freakin' huge, solid, thick and tight you can get. Thanks for the motivation. ","tags":"#general#bodybuilding#fitness#thick#solid#tight","favourites":32,"__v":0,"created_on":"2015-03-18T01:20:50.037Z","score":0.0005869847888098267},{"_id":"55adc85928ac1ddd7c0f4a08","id":1899,"pasta":"Guys... I have a question. Can someone answer it to me?Here it goes.\nBut if I? am kill. Then who was fone?\nThanks in advance.","tags":"#shrekt#general#whowasphone","favourites":4,"__v":0,"created_on":"2015-07-20T19:38:10.687Z","score":0.0005854626604242123},{"_id":"552853a28e9442086a748b4c","id":1448,"pasta":"I sexually Identify as a black male. Ever since I was a boy I dreamed of being pulled over by the police due to a broken tail light, and getting shot in the back while running away. People say to me that being a black male sucks, but I don't care, I'm beautiful. I'm having a surgeon graft black skin on to me, and I'm buying Jordans as we speak. From now on I want you guys to call me \"Walter Scott\" and respect my rights as a human being. If you can't accept me dats racist and you need to check your privilege. Thank you for being so understanding.","tags":"#general#sexually#identify#black#male#shot#cop","favourites":25,"__v":0,"created_on":"2015-04-10T22:49:56.297Z","score":0.0005819860316905495},{"_id":"54b337285035a56315428ec2","id":54,"pasta":"I want to say something before this whole thing gets out of control. In 1967, in the hot desert sun, a woman gave birth to a boy in the back of old pick up. She was a whore. She left the boy at a local church. The father at the church didn't like children, but he knew that being a disciple of the bible he couldn't possibly not take the small kid. Instead he ended up taking out his frustration on the boy. At the age of three, the boy was forced to use the toilet. Let me tell you the little fell into his own pile of poop more than once. By the age of 5, the boy the boy was reading the bible and chopping wood for the fire. Despite the father's harsh character, the boy loved him and thought of him as his true father. By the age of seven the father raped him three times. The boy ran away. He survived four days in the desert by eating cactus and scorpions. He was finally found by a drug cartel boss, who took the boy in. Mr. Sanchez was his name, and he was immediately impressed by the boys intelligence and grown up attitude. Mr. Sanchez provided the boy with an education at a private prep school and a nice house. The boy had sex for the first time when he was 12, the next year he graduated high school. He was the school's star running back. The boy was lost, although he liked Mr. Sanchez, he never thought of him as his father. The boy went to India, were he became a spiritual leader of a large tribe of farmers. With his power he turned the several plots that each tribe member had into a large corporate farm and became a millionaire. His assets grew as he bought into other successful start ups. He often got ahead in business with his great leadership abilities, but once in a while he used violence. This was India after all. By the time he was 22, the boy had all the money he would ever need. So he bought a yacht and traveled the world for 10 years. For 10 years he visited every major port, slept with girls from every country imaginable, and tried every drug ever made (by nature and by man). When he was 33, he was walking on a beach in French Guiana when he met a girl of Irish - Native American decent. She bared his seed. It was boy, perfect health. He moved them to Argentina, then London, and eventually Vermont. The man was 45 now, he has seen everything, accomplished everything, tried everything. He skied down the Swiss Alps, been at the North Pole, swam with hammerheads, everything! Yet he has never done one simple thing that we all take for granted every day, he met his father. He never played catch with his father, he never talked about women with his father. He never would. He died at the age of 63 when his parachute didn't open when he was base jumping from Dagger Mountain in Washington, USA. Over three thousand people attended his funeral.\nI know what you are thinking. How does this story relate to me? Well I want you to go all the way back to the beginning of the story and remember the woman who gave birth to this incredible boy. You are like this woman. You are like this women because you are a whore.","tags":"#whore#reddit#church#kid#mr.sanchez","favourites":52,"__v":0,"created_on":"2015-01-12T02:53:17.414Z","score":0.0005781875374557281},{"_id":"558232bf2120570651f0ae31","id":1773,"pasta":"lmao. you're such a faggot dude. go fuck myself? wow really got me there dude, really hurt my feelings. I'm glad you think you're protecting and serving the internet. Jesus christ you should be a comedian. The neck beard virgin one made you cry too? must really hit at home for that one. since you're such a good person you should invite all the local hoodlums and criminals to your (mom's) house for the holidays, see how that goes. Im sure your good faith and beliefs in people would keep you and your poor mother safe. have fun being a faggot your whole life, good thing I subscribe to the sub on my mobile account I'm sure we will talk again soon","tags":"#reddit#buttmad#banned","favourites":9,"__v":0,"created_on":"2015-06-17T19:14:38.886Z","score":0.0005615513222243705},{"_id":"5531386b63708c44098ca65f","id":1479,"pasta":"THAT'S NOT HOW THE MEME GOES YOU FUCKING CUNT!\nIT'S AYY LMAO THERE'S NO ROOM FOR VARIATION.\nWho the fuck do you think you are, going around and ruining our memes? Hundreds of thousands of years of human development has lead us to the fucking miracle that allows one person to browse memes made by someone who lives halfway across the globe, and you shit on our very culture by so much as thinking you can get away with soiling a sacred meme like that. Shame on you. Shame on all of us for allowing a bastard like you get away with something like that. The internet is a privilege, not a right; You seem to forget that. Our society is lenient enough on the freedom of internet use to allow ISIS to continue recruiting and growing, and you take that freedom for granted by saying lmao before ayy? What is your malfunction, you fucking carcass mouthed snot guzzler? You're the reason people are hesitant to say capital punishment is wrong.\nStay away from the internet. You don't belong here.","tags":"#meme#4chan#reddit#dank#memes#ayy#lmao","favourites":22,"__v":0,"created_on":"2015-04-17T16:35:52.768Z","score":0.0005553207178200569},{"_id":"550894a065f4abef0cfbe4fc","id":1056,"pasta":"|̧̯͖͖͓̼̝̰̻̞̘̪̣̟͖ͧͨ̔̈͒͆̌ͨͤͭͩ͌͂̀͢͞͞ͅ|͚͓̣ͣ͑̐̒̐̇̃͊ͧ̅ͭ̉̑͐ͯ͑̏̽͟͝ͅ|̷̖̠̺̻̦̫͈͎̗̖̟͖̖̩̞͓ͪ͑͗͐̋̾ͤͥ͑̒́̈́̎̒̎́͒̀̚͠͠|̵̵̟̦͔͔̓̉̆͋̚͝|̵̵̛͈̩̼̜̥̹̺̝̖̬̠͓͙̖̃̽̇̂̚͘͠|̛̰̗̱͈͎̘͕͍̞͙̳̳̩͈̦͇ͬ͗̂̊͂͌̉̄̊͊̔͊͊ͪ̀̕͟|̒̃̅͋̎̾͛̽ͤ͐̿̄̅ͯ͆̐ͭ̇̚͘҉͓̩̖̯ͅ|̡̟̣͚̥̗̙͉͇̲̼̩͖̗͙͛̔̓ͦ̓̾̿ͪ͠ͅ|̭̟̟̯̪͐̓̈̔̽̑ͥͯ̉̑̍͠͡|̋͌͆̊ͮ͛͒́͋̃̆͛̚͜͏̪̫̥̤͕̮͈̞̰͞ͅͅ|̛̳͙̟͕͈̟͖̮́́͐ͫ̓ͧ̔͊̏̿ͪ͘͢|̛̙̺̺̜͕̤͇̝͓͍͙̠̺͉̲̥̊ͪͪ̊̍ͬ̅͋͘͞ͅ|̢̡̼̼̙͚̟̼̺̮͍̲̩̬͗̈ͣͥ̍͑͊ͪ̚̚͘͞|̋̂̇̅̒͌̏̈́̓̔̄̈́̋ͤ̑̏̈̈́͢҉҉̤̖̳̭̟̥̥̻̲͍͍̣̺͚̹̗|̵̧̝̲̪̙̘̫̗̪͍̪̝̙͙̣̼͚̫̬ͪ̇͂̋͐̉͗̋̈́ͪ͟͞|̧̯̗̱̺̝͈͉̖̝̘̼̻͈̲̉̓ͨ̎ͬ́|̡͉̗̣͍̲̙̓ͪ̒͒͛ͪ̒ͬ̾ͥͣ͌͟|͛͒̅ͮͭͮ̉̿̑̊̇̒ͩ̓̐̋ͫ̀͏҉̶̖̪̥͕̝͕̩̝̭͇̳͎̩̼̝̘̠̱|̶̸̤̰̯̳̭̥̬̪̘͈̼͎̪̗͙̐̈́͌̆̂̏̾ͫ́͘͝|̛̠̰̖̬̘̝͙̻͉̜̘̙̫̤̬̙̼͆ͨ̎̀̄ͯ̈ͫ͐ͫ͜͡͞ͅͅ|͍̳͍̹͍̙̬ͪͭ̄ͪ̈ͧ̽͐͛̓̇̄̇̄̄ͯ̾̀͜|͔͉͎͓͍̘̠̼̒̒̓̇͆ͤͨ̐̅̑́ͥ͌̕ͅͅ|̢̀̊͐̂ͣ͂̾ͫ͗͆̒͑͟҉̲̦̝͉̮̹̺̰ͅ|̵̹̻̯̝͇͍̼ͧ͒̾̚͠|̛ͯ̓ͮͪ̋͋ͣͭ͛̀͆ͦ͂̎ͮ͒҉̷̪͉̜̜͍̜̦͕̗̻̦͙͜","tags":"#general#broken#text","favourites":30,"__v":0,"created_on":"2015-03-17T19:54:16.632Z","score":0.0005542588855532304},{"_id":"55b55fb4f12af4492558ab00","id":1924,"pasta":"You're less. All you are is lust, confusion, and the near-fungal idiot rage of a bigot squalling in self-denial. Relentlessness makes you smaller and weaker as you spend more and more of your life in her service, uplifting her, acting the ape-faced villain to craft her merest stoicism into heroics. Your snuffling frustration is the shadow against which all your betters are cast, bright and shining, when by themselves they might only have gleamed. You're a withering verse in an unpopular song, out of key, out of touch, and sooner every day out of time. I like thinking about that. It's thrilling, exciting, and I enjoy it. Please respond.","tags":"#reddit#circlebroke","favourites":3,"__v":0,"created_on":"2015-07-26T22:31:16.916Z","score":0.0005377787136412572},{"_id":"5570bf217e8e4e5c6734aeb6","id":1724,"pasta":"You beat me up in school. You taunted me because I was different, because I was not a part of your conformist world.\nYou called me a nerd because I valued my intelligence above fleeting sporting ability that age will soon dissipate.\nYou passed me over for the douchebag, whose weapon of choice was the steroid and the fake tan bottle, then complained and acted surprised when he struck you.\nYou people... you people made me SICK for the best part of my youth and now you DARE to come to my home territory... The Internet and act as if you are safe? As if you are welcome here? As if I and the others like myself that have wronged would simply tolerate your presence in our domain?\nHow foolish of you.","tags":"#reddit#neckbeard#bully","favourites":11,"__v":0,"created_on":"2015-06-03T17:11:59.306Z","score":0.000531802020094556},{"_id":"54e137608c7aeb193319938a","id":810,"pasta":"What the darn-diddily-doodily did you just say about me, you little witcharooney? I’ll have you know I graduated top of my class at Springfield Bible College, and I’ve been involved in numerous secret mission trips in Capital City, and I have over 300 confirmed baptisms. I am trained in the Old Testament and I’m the top converter in the entire church mission group. You are nothing to me but just another heathen. I will cast your sins out with precision the likes of which has never been seen before in Heaven, mark my diddily-iddilly words. You think you can get away with saying that blasphemy to me over the Internet? Think again, friendarino. As we speak I am contacting my secret network of evangelists across Springfield and your IP is being traced by God right now so you better prepare for the storm, maggorino. The storm that wipes out the diddily little thing you call your life of sin. You’re going to Church, kiddily-widdily. Jesus can be anywhere, anytime, and he can turn you to the Gospel in over infinity ways, and that’s just with his bare hands. Not only am I extensively trained in preaching to nonbelievers, but I have access to the entire dang- diddily Bible collection of the Springfield Bible College and I will use it to its full extent to wipe your sins away off the face of the continent, you diddily-doo satan-worshipper. If only you could have known what holy retribution your little “clever” comment was about to bring down upon you from the Heavens, maybe you would have held your darn-diddily-fundgearoo tongue. But you couldn’t, you didn’t, and now you’re clean of all your sins, you widdillo-skiddily neighborino. I will sing hymns of praise all over you and you will drown in the love of Christ. You’re farn-foodily- flank-fiddily reborn, kiddo-diddily.","tags":"#reddit#navy#seal#ned#flanders#300","favourites":35,"__v":0,"created_on":"2015-02-16T00:17:50.007Z","score":0.0005100933726424629},{"_id":"55096174b47c3d010fd965fd","id":1183,"pasta":"I sexually Identify as a sexual identification classification. Ever since I was younger I dreamed of being a classification of sexual identifications. People say to me that a person being a sexual identification classification is Impossible and I’m fucking retarded but I don’t care, I’m beautiful. I’m having a plastic surgeon install specific classifications of sexual identifications all over my body, and my picture put next to sexual identifications in the dictionary. If you can't accept me you're a Sexual-Identification-phobe and need to check your classification privilege. Thank you for being so understanding.","tags":"#sexually#identify#sexual#classification#4chan#reddit","favourites":27,"__v":0,"created_on":"2015-03-18T07:48:48.774Z","score":0.000508037070959696},{"_id":"559ef1e6975fee4a2be08434","id":1869,"pasta":"ｐｌｅａｓｅ  ａｍｅｒｉｃａｎｓ，  ｄｏ  ｎｏｔ  ｔａｌｋ  ｌｉｋｅ  ａｎｉｍｅ  ｃｈａｒａｃｔｅｒ．\nｔｈｉｓ  ｉｓ  ｎｏｔ  ｈｏｗ  ｎｏｒｍａｌ  ｐｅｏｐｌｅ  ｔａｌｋ．\nｉｔ  ｉｓ  ａ  ｌｉｔｔｌｅ  ｅｍｂａｒｒａｓｓｉｎｇ  ｔｏｏ  ｗａｔｃｈ\nｂｅｃａｕｓｅ  ｓｈｅ  ｄｏｅｓｎ＇ｔ  ｕｎｄｅｒｓｔａｎｄ  ｓｈｅ  ｉｓ  ｆｏｏｌ．\nｂｕｔ  ｉ  ｗｏｕｌｄ  ａｌｓｏ  ｌｉｋｅ  ｔｏ  ｆｕｃｋ  ｔｈｉｓ  ｇｉｒｌ，\nａｔ  ｆｕｌｌ  ｆｏｒｃｅ  ｉｎ  ｈｅｒ  ｖａｇｉｎａ，  ｍｏｕｔｈ，  ａｎｄ  ａｓｓ．","tags":"#general#americans#anime","favourites":5,"__v":0,"created_on":"2015-07-08T20:13:29.926Z","score":0.0005073553959343238},{"_id":"559ef1db975fee4a2be08432","id":1867,"pasta":"I am probably wrong about why you reason the way you do, but I am not misunderstanding your intentions or implications. That's quite clear. So, when someone speaks in generalities that imply a lack of character on my part, and then only commits to an idea in a half-assed sort of way, yeah, time to eradicate that shit. I'm not all that submissive to just lay down and take it. Besides, your behavior isn't that complicated to understand or explain, HEH. Hopefully that doesn't disappoint you.\n\nIf it holds true that one can derive a sequence, or trend from your comments, my conclusion is thus! Either you're really lazy, or you're incapable of making a counter argument to illustrate you fully understand your position, or mine for that matter, to disprove my claims in favor of your own. A) You replied again, so you wanted to engage; B) You did it fairly quickly, so it held some value to you; C) You tried to make a point, but made the same error in reasoning! Doh!; D) You're feigning control of the argument yet you never really proved your points one way or the other. \n\nSo, how are you fed up unless you're blindly cock-sure of your own internal evidence. Due to premise A, I doubt I will hear from you again. So, good luck to you as well, may your reasoning guide you eternally.\n\nP.S. I normally ignore stuff like this and I would much rather have had a conversation with you, but, you asked for it. And, I guess, sorry for the length of my posts? Academia did this to me.","tags":"#reddit#neckbeard#angry#euphoric","favourites":5,"__v":0,"created_on":"2015-07-08T14:57:23.380Z","score":0.0005043045007645813}]