[{"_id":"54de26baa43a9c0e1c527fe9","id":780,"pasta":"Ｐｈ’ｎｇｌｕｉ ｍｇｌｗ’ｎａｆｈ Ｃｔｈｕｌｈｕ Ｒ’ｌｙｅｈ ｗｇａｈ’ｎａｇｌ ｆｈｔａｇｎ．","tags":"#general#cthulhu#chant","favourites":0,"__v":0,"created_on":"2015-02-13T16:11:02.848Z","score":0},{"_id":"54dd051fa43a9c0e1c527fdb","id":773,"pasta":"Here's the thing. You said a \"wyvern is a dragon.\" Is it in the same family? Yes. No one's arguing that. As someone who is a 1k MMR feeder who studies dragons, I am telling you, specifically, in dota, no one calls wyverns dragons. If you want to be \"specific\" like you said, then you shouldn't either. They're not the same thing. If you're saying \"dragon family\" you're referring to the taxonomic grouping of Varanidae, which includes things from wyverns to eldwurms to drakes. So your reasoning for calling a wyvern a dragon is because random people \"call the flying lizards dragons?\" Let's get gyarados and charizards in there, then, too. Also, calling someone a noob or a feeder? It's not one or the other, that's not how taxonomy works. They're both. A wyvern is a wyvern and a member of the dragon family. But that's not what you said. You said a wyvern is a dragon, which is not true unless you're okay with calling all members of the dragon family dragons, which means you'd call eldwurms, drakes, and other flying lizards dragons, too. Which you said you don't. It's okay to just admit you're wrong, you know?","tags":"#dota2#reddit#unidan#winter#wyvern#dragon","favourites":1,"__v":0,"created_on":"2015-02-12T11:24:44.577Z","score":0},{"_id":"54dc2a4fa43a9c0e1c527fd4","id":770,"pasta":"To be fair, I did Nazi that coming. I came here to say this but boy, that escalated quickly so to the top with you! Lost it at 'This is why we can't have nice things' and then my faith in humanity was restored, my mind blown, and manly tears were shed. Well said. As a 'Merican, I can confirm this gem has just won the internet and is doing it right. Just sayin', I know that feel, bro, and while that was a risky click, this post was a 9/10, would read again. I see what you did there and it feels good man. You're doing God's work, son. Yes. I get this reference. I laughed way harder than I should have at your list that seems legit and totally nailed it. You must be a hit at parties. I like you. Doctors hate you! Instructions unclear. Dick caught in you magnificent bastard; you, sir, are so brave, a gentleman and a scholar, and seeing how you are a redditor for 4 years, this checks out, so I'll allow it. I regret that I only have one upvote to give for this cool story, bro. CTRL+F \"about tree fiddy\" was not disappointed. Wait, why do I have you tagged as \"NOPE NOPE NOPE\"? Nice try, you monster. What did I just read? Dafuq? I read that as \"YOU HAD ONE JOB\". I can't fap to this. No true scotsman could see that this relevant XKCD was bad, and you should feel bad. As a black man and as a gay man and as a woman, black people suck, gay people are gross and women are bitches. You must be new to Reddit, so I'll see your cakeday and raise you a karma train. One does not simply rustle my jimmies, not even once, and it's almost as if Reddit is composed of millions of individuals with different opinions and outlooks. This stahp gave me cancer for science, so that's enough internet for me today. OP is a bundle of sticks, 2/10, would not bang, not with that attitude. What is this I don't even know how is this wtf? Circlejerk must be leaking. This will get buried but brace yourselves, some men want to watch the world burn right in the feels. When you see it, they'll KILL IT WITH FIRE! I really sympathize with pedophiles, but that has nothing to do with atheism. Lawyer up, delete facebook, hit the gym, and SHUT UP AND TAKE MY MONEY, said no one ever, so you wouldn't download a strawman. Damn onions, you scary like a BOSS. whoosh. Since rule #1 is 'be attractive', I'll just leave this here: This is my [f]irst post, be gentle. I have the weirdest boner right now. OP will surely deliver, unless he's a cop, in which case he'll just shoot your dog.","tags":"#reddit#satire#circlejerk#every#meme#nazi#coming","favourites":1,"__v":0,"created_on":"2015-02-12T04:21:31.630Z","score":0},{"_id":"54daf46bace6a4147ec598d3","id":766,"pasta":"Your comment has been dongered! ヽ༼ຈل͜ຈ༽ﾉ\nAnother user liked your comment so much that they dongered it, giving you reddit dongers.\nreddit dongers is reddit's premium dongership program. Here are the benefits:\nExtra site dongers\nExtra dongers\nDiscuss and get help on the features and perks at /r/dongerbenefits[1]\nGrab a drink and join us in /r/dongerlounge[2] , the super-secret dongers-only community that may or may not exist.\nDid you know: Most dongers—78 percent of the yearly dongers supply—is made into fedoras. Other industries, mostly electronics, medical, and dental, require about 12 percent. The remaining 10 percent of the yearly dongers supply is used in financial transactions.","tags":"#reddit#dongered#gold#circlejerk","favourites":1,"__v":0,"created_on":"2015-02-11T06:19:19.345Z","score":0},{"_id":"54dae1bffcaa94b67a3e9cfe","id":764,"pasta":"Hahaha\nEDIT: uhm i mean \"epic lel\" for the downvoters\nEDIT2: Wow, reddit gold! Thanks, kind stranger!\nEDIT3: Wow. Inbox blowing up. Amazing day. Thank you guys, responding as fast as I can!!!\nEDIT4: Got an agent to help me with all of this. Should reply much faster now. Also, front page. Thanks guys!\nEDIT5: Just fucked Oprah\nEDIT6: Just reached Mars\nEDIT7: Just ate a taco\nEDIT8: Just bought taco bell with all the money from your comments/gold, thank you guys!!! I'll turn it around :) xD\nEDIT9: Corporate treasuries, and buying Wendy's now. Let's see how this turns out. 2X GOLD??? :o It is my lucky day. Truly blessed. Thank you guys.\nEDIT10: Just reached mars\nEDIT11: Wow, what an amazing day. Heading in for the night. Thanks guys! I'll be sure to reply to all the messages later. RIP my inbox. Asking for a friend. Street lamp LeMap. Macklemore. Vaccines!!! #freeleinternet. Games! Ha!!! Am I right?????","tags":"#reddit#satire#circlejerk#hahaha","favourites":2,"__v":0,"created_on":"2015-02-11T04:59:38.984Z","score":0.00012534960281474107},{"_id":"54da82790f0039b56e3fef17","id":759,"pasta":"✈ ▌▌ ¦҉▌▌ ▄ ▌ ▄✈▌ ▄ ¦҉▌ ▄ ▄ merry 9/11 everyone!","tags":"#general#ASCII#911#merry","favourites":3,"__v":0,"created_on":"2015-02-10T21:46:15.717Z","score":0.0002218324538190878},{"_id":"54d92b12c96a20695f2fb683","id":749,"pasta":"I see a lot of people use this kawaii word. Please stop using this word. Hawaii is with an H, and kawaii, from what i've gathered from google, is that you are a jap cartoon fanatic who wants to engage in intercourse with sea life, you want to rape japanese children, or you think it means cute, there are various other stages of what this word could mean. Either way i really hate its usage for some unexplainable reason. I don't know what it is about your face.......","tags":"#general#kawaii#japan#anime","favourites":0,"__v":0,"created_on":"2015-02-09T21:24:32.487Z","score":0},{"_id":"54d690c88cf1074258038bcd","id":730,"pasta":"( ͡° ͜ʖ ͡°) ╯╲___✡✡✡✡✡ Don't mind me just taking /r/worldnews mods for a walk","tags":"#reddit#worldnews#mods#jews","favourites":1,"__v":0,"created_on":"2015-02-07T22:25:06.447Z","score":0},{"_id":"54d593d16648499132dd7a0e","id":722,"pasta":"if you don't already know you've already outed yourself as an uneducated retard who has no legitimate opinion on the matter. i've already wasted 10 seconds of my life typing to you in the first place.","tags":"#reddit#uneducated#retard#wasted#life","favourites":2,"__v":0,"created_on":"2015-02-07T00:20:26.359Z","score":0.00011437003250569325},{"_id":"54d51df001ae2be31cb3df98","id":720,"pasta":"I feel so honored to be the first comment. All of my hardwork and dedication has paid off. Getting the top comment has been a dream of mine for many years, and i would like to thank those who have helped me along the way. First and foremost i would like to thank god for giving me this opportunity. Next i would like to thank my parents. I want to thank my cat Belle, for being really fat and always there for me. I would also like to thank my pet tadpole for surviving against all odds for over a week. Next i would like to thank the squirrel that lives in my backyard for climbing trees because that gives me inspiration that i need to get through the day. I also want to think Max Rainer for giving me someone to beat in Mario Party. This is a special moment in my life and i would like to thank any of my unmentioned friends and family that have helped me along the way. This moment will be a moment that i will never forget. I just remembered a few other people i would like to thank; notjustok.com, the fish i caught in the third grade, my light in my room bc i wouldn’t be able to see the keyboard without it, the internet for letting me go on notjustok.com, my house because without it i would be homeless, and last but not least i would like to thank all the people out there that actually took time out of their day to read this. I cannot stress how much of a big deal to me this is. I have been trying to be the first comment on a post for years, but that has not been possible until this amazing day. Hopefully my good luck will continue, but this is undoubtedly a rare occasion. If you asked me how i did this, i would say, you can achieve anything u set your mind on. To all the kids out there reading this, i would like to tell them to follow their dreams. Being the top comment is amazing, thank you everyone","tags":"#general#top#comment#first","favourites":1,"__v":0,"created_on":"2015-02-06T18:15:59.216Z","score":0},{"_id":"54d4ebbf01ae2be31cb3df94","id":718,"pasta":"Kanye West goes to his Kanye Nest to take his Kanye Rest. He wakes up feeling his Kanye Best. Then he’ll get Kanye Dressed on his Kanye Vest to go on a Kanye Quest. He goes to church and becomes Kanye Blessed, then to a hotel room to be a Kanye Guest. Then to school to take his Kanye Test. He forgot to brush his teeth. Did he run out of Kanye Crest? His neighbor stole it, what a Kanye Pest. Then Kanye realizes he isn't the Kanye best. This made Kanye depressed.","tags":"#general#twitch#kanye","favourites":8,"__v":0,"created_on":"2015-02-06T16:18:26.832Z","score":0.000574785254327939},{"_id":"54d4eb9701ae2be31cb3df93","id":717,"pasta":"IceFrog doesn't exist (srs). Valve made it up; they always planned to take over DotA but needed to create a persona that the average gamer could relate to - a programming wizard kid who builds the game from his bedroom at night listening to the wishes of his followers as he balances the game. They build up the trust of the community until suddenly they release Dota 2 to the world under the guidance of this so-called \"IceFrog\". Pls no coperino pasterino","tags":"#dota2#reddit#TeDeumLaudamus#IceFrog#valve","favourites":12,"__v":0,"created_on":"2015-02-06T12:10:30.483Z","score":0.0008346793254856395},{"_id":"54d44b6301ae2be31cb3df89","id":713,"pasta":" I have a morning ritual that I need to share. I call it \"the terminator\". First I crouch down in the shower in the classic \"naked terminator traveling through time\" pose.  With my eyes closed I crouch there for a minute, visualizing either Arnold or the guy from the second movie (not the chick in the third one because that one sucked) and I start to hum the terminator theme. Then I slowly rise to a standing position and open my eyes. It helps me to proceed through my day as an emotionless, cyborg badass. The only problem is if the shower curtain sticks to my terminator leg. It ruins the fantasy. I found tonight that it is more successful to progressively humm it louder as you perform the ritual.","tags":"#4chan#reddit#morning#ritual#terminator#arnold","favourites":1,"__v":0,"created_on":"2015-02-06T03:19:05.521Z","score":0},{"_id":"54d44b4a01ae2be31cb3df88","id":712,"pasta":"Well, I'd be pretty excited to get a text like that if I was into ugly chicks with unaesthetic tits. But since I actually have standards, I'd probably cut all contact with said bitch if she sent me something as disgraceful as that.\n\nThose are some of the thickest, tighest, most solid veins I have ever seen in all 19 years of my life. No, that's not a good thing. Veins are sometimes good because it actually denotes that her tits are natty. Small veins are nice. Tiny, unnoticeable veins are the best. Big big hulking blue streaks of veiny **** that take up over half the surface area of her tits are just disgusting.\n\nSeriously, I could go on for hours about how ugly those tits are. I'm actually glad this website doesn't allow nudity. If you hadn't blocked out her nipples, my eyes probably would have withered and died. Chicks with nasty veins tend to have nasty nips. There are no exceptions to this rule, and this slut definitely has some gross misshapen salami nipples.","tags":"#4chan#ugly#tits#veins#nasty","favourites":1,"__v":0,"created_on":"2015-02-06T03:18:48.142Z","score":0},{"_id":"54d2e2dc01ae2be31cb3df64","id":697,"pasta":"Nothing wrong with incestuous roleplay, especially in public it can really get your jollies on, I've got quite a brother sister kink given the fact that I had a beautiful promiscuous older sister who had many hot friends and was just close enough in age to me that we experimented sexually together throughout our early teens. I have many fond memories of sitting at my playstation and her coming up to me and saying \"goddammit phatwaj you left your shit all over the bathroom and I have to shave my pussy\" and you stammer and sweat because you know what she does in the shower and you might have peeped at her naked a few times and even \"massaged\" her in a subtle and non erotic manner after her long lacrosse practice and even when she catches you with your eye at the crack in the door she winks and twirls pretending like you're not there, talking to herself in a sexy way like \"wow my pussy looks good, I think my tits are getting bigger too were my nipples always this perky?\" even when she's on the toilet trumpeting a turbulent bowel creation and you're close enough to even smell the burning odorous treasure and she draws out the moans and grunts just for you because she knows you're there and you're standing at the door about to blow up and you immediately run back to your room and masturbate while listening to Kenny Loggins on the stereo to cover up the sound of you furiously and passionately stroking your cock imagining her coming into your room and saying \"hey, I couldn't sleep, I know we're older now but maybe we could share a bed just for comfort's sake like we used to?\" and damned if she isn't on top of you, murmuring about the family vacation from 2002 when you first saw her naked and she's slowly stroking your cock as you lay wide-eyed and eventually she shits on your chest with a giggle and tosses you a paper towel as she saunters out of the room back to her bed.","tags":"#reddit#incestuous#roleplay#incest#sister","favourites":2,"__v":0,"created_on":"2015-02-05T02:53:04.784Z","score":0.00010996331430425564}]