[{"_id":"5522b78bd7aaddd319c2df9b","id":1416,"pasta":"      Pwnd                Cringeworthy   Moist Fedora  Bacon                EDIT THANKS FOR LE GOLD XDDDDD Lelelele                                        3internet5me                    Trolololol\n    Le          Upvotes To The Left           XDDDDD            M'lady                420\n    Epic       We R Anonymous          We R Lele Legion Expact Us Le\n    Neckbeard        Epic Cringe          Lol                       420                              LE BITCOIN              3P1C Troll                        \n        Le Reddit Army Xddddd                            HITLER DID NOTHING WRONG                  Le Moist Narwhal        \n           Narwhals  Moist          Le             DAE Le Epic Meme                                           Bacons  At Midnight                                                                    \n            EDIT: MOM'S SPAGHETTI                                                I'M GOING TO GET DOWNVOTED FOR THIS BUT     \n                              Moist.                  Iama AMA  Ask Me Anything                     I Think Marijuana Is  Good 420 XDDDD                         I Can Haz Karma          Le Reddit Army\n          TROLOLOLOLOLOLOL       Cringe                          Le   Reddit                                     Moist      So Gayyyyyy\n            Redditors                        Le                     Epic                    1337      \n             Le  Internet Cringey Meme 420 Moist Fedora Narwhal Bacons            Le     Moist                                             Op Is A Faggot          WAKE UP SHEEPLE\n                      M'lady                                    Fedoras\n    Le Epic Rage                                                             Faith In Humanity Restored Lol\n                                  DAE                            9/11 Was A Conspiracy                                  ","tags":"#reddit#overused#memes#circlejerk#satire","favourites":1,"__v":0,"created_on":"2015-04-06T16:42:39.900Z","score":0},{"_id":"5521cf2f05bc3c2d7b4c6b7d","id":1414,"pasta":"There's this chick I follow on Facebook. I accidentally started following her because she has the same name of this girl I met and thought I was sending a friend request to her. She was only 14 when I started following her. As soon as I realized she wasn't the person I was meaning to follow I went to unfollow her. But then I realized this 14 year old girl was hilariously stupid. She didn't know why America would send a separate team from Georgia to the Olympics, she couldn't figure out why elevators had buttons for the floor she was already on, and many other things I just saw and laughed. Anyway I never stopped following her because she was such a big source of my morning laughs.\n\nShe got pregnant at 15 because she thought you couldn't get pregnant on the first time. She was sure that the 15 year old boy that got her pregnant was going to be a great daddy. Well the kid is 1 now and she always complains about him never being around and how he would rather stay at home bored than see his son and all the other crap any of us could have warned her about when she was certain she was going to be the one teenage mom whose baby daddy would actually hang around.\n\nAnyway the reason I bring all that up is that through these 2 years I've followed this complete moron she has never written there when she meant their. So if this person can get it right, then everyone can.","tags":"#reddit#idiot#moron#girl#their#there","favourites":7,"__v":0,"created_on":"2015-04-06T00:11:23.796Z","score":0.00012344052891257668},{"_id":"551f350e1726c1da61e62bdd","id":1402,"pasta":"Greetings, faggots:\nMy name is xXSwaGGy-Quarlax [FaZe], Interplanetary Diplomat for the Andromeda Galaxy. I would like to begin this message by assuring you that I am not a camping faggot, nor will my people attempt to quick scope you. Although we have amassed many 360 no scopes throughout our collective lives, we come with a message of peace. I hope to make clear that this is a knife-only match and we will not be attempting any faggotry, nor will we feed mid. We wish only to share our swag amongst your people, you fucking aim botting hackers.\nMy clan and I have traveled many millions of light years in search of sentient life, visiting thousands of planets in an attempt to make contact and find the dankest kush. While we have been forced to pwn many noobs and fuck countless mothers on several of those worlds, reking their shit harder than a Haitian Earthquake, we only did so out of self-preservation. None of those planets held any life beyond the hostile and untamable, nor any blunts to blaze upon. It was truly us against them; however, we wish to make it clear that we do have blood on our hands. We, as an intergalactic species, understand that trust is founded upon honesty, and thus tell you retard hackers of our former faggotry. That said, we assure you that your obese, apartment dwelling neckbeards will stand safely beside us and shall never be shrekt.\nWe first located your planet nearly six Earth years ago and have been monitoring your communication devices, which you call “X-Box,” to learn your jargon and construct our message of peace. We hope that you understand our dialect and not see us as pay 2 win feeders. In order to further express our good faith, we have amassed a large collection of Code Red Mountain Dew and Cool Ranch Doritos, which we would like to share with your MLG pros. We hope you accept our offering in peace, and that you not fuck our mothers. We wish only to become allies with you, the faggot tryhards of Earth.\nPlease find us waiting for you at your trailer park tomorrow at sunrise. We will be in the large flying aircraft, which should be just a few pounds lighter than that of your mother's left tit.\nAyy lmao,\nxXSwaGGy-Quarlax [FaZe]","tags":"#reddit#faze#gaming#ambassador#xbox#alien","favourites":10,"__v":0,"created_on":"2015-04-03T22:45:59.772Z","score":0.00017067363360088824},{"_id":"551e0f7b7e4986a85d9bdb7c","id":1400,"pasta":"Here's The Thing. You Said \"Lactulose Is Not A Stool Softener.\" Is It In The Same Family? Yes. No One's Arguing That. As Someone Who Is A Scientist Who Studies Anal Fissures, I Am Telling You, Specifically, In Science, No One Says Lactulose is Not A Stool Softener. If You Want To Be \"Specific\" Like You Said, Then You Shouldn't Either. They're The Same Thing. If You're Saying \"Stool Softener\" You're Referring To The Osmotic Laxative Family, Which Includes Things From Miralax to Lactulose. So Your Reasoning For Calling Lactulose Not A Stool Softener Is Because Random People \"Call Lactulose Not Stool Softeners?\" Let's Get Magnesium Citrate Saline Laxative Oral Solutions In There, Then, Too. Also, Calling A Laxative not a Stool Softener? It's Not One Or The Other, That's Not How Poop Works. They're Both. A Laxative Is A Laxative And A Member Of The Stool Softening Family. But That's Not What You Said. You Said A Laxative Is Not A Stool Softener, Which Is Not True Unless You're Okay With Calling All Members Of The Poop Modification Family Laxatives, Which Means You'd Call Colon Blow, Fiber Supplements, And Other Medicines Laxatives, Too. Which You Said You Don't. It's Okay To Just Admit You're Wrong, You Know?","tags":"#general#laxatives#stool#softener#poop#unidan#jackdaw","favourites":1,"__v":0,"created_on":"2015-04-03T00:30:50.786Z","score":0},{"_id":"551ce4fd4b5cdc9958b339d7","id":1393,"pasta":"Beer Can Dan\nDanny Diapers\n\"Ass Man\" Dan\nDanny Daycare\nSpread 'em Dan\nCandy Man Dan\nFamily Man Dan\n\"Big Daddy\" Dan\n\"Deepthroat\" Dan\nThe Big Dick @ Nick\n“Dirty” Dan Schneider\nOpen Wider Schneider\nSchneider The Butcher\n\"Bend Over\" Schneider\n\"Foot Soldier\" Schneider\nDan “The Man” Schneider\nDan \"The Biter\" Schneider\nDan \"The Spider\" Schneider\nDan \"The Defiler\" Schneider\nDan \"The Initiator\" Schneider\n\"Down South\" Dan Schneider\nDan \"The Plunger\" Schneider\nDan \"The Bladder\" Schneider\nDan \"The Seducer\" Schneider\nDan \"Teen Bedder\" Schneider\nDan “Rough Ryder” Schneider\nDan “The Collector” Schneider\n\"No Lube Required\" Schneider\nDan \"The Despoiler\" Schneider\nDan \"Deep Pounder\" Schneider\nDan “She’s a Fighter” Schneider\nDan \"Get in The Van\" Schneider\nDan \"Cunny Hoarder\" Schneider\nDan \"I've Had Tighter\" Schneider\nDan \"The Fart Inhaler\" Schneider\nDan “Deep Inside Her” Schneider\nDan \"The Overnighter\" Schneider\nDan \"Came Inside Her\" Schneider\n\"Please Mister, Slower\" Schneider\nDan “Likes ‘Em Tighter” Schneider\nDan \"The Rough Rider\" Schneider\nDan \"The Meat Grinder\" Schneider\nDan \"The Diaper Slider\" Schneider\nDan “The Cheek Divider” Schneider\nDan \"The Hymen Divider\" Schneider\nDan “The Hymen Collider” Schneider\nDan \"The Demolition Man\" Schneider\nDan \"The Cervix Wrecker\" Schneider\nDan \"This One's a Bleeder\" Schneider\nDan \"The Pussy Annihilator\" Schneider\nDan \"The Starlet Sodomizer\" Schneider","tags":"#DanSchneider#4chan#Nickelodeon","favourites":1,"__v":0,"created_on":"2015-04-02T06:36:51.331Z","score":0},{"_id":"551cab734fc8d40a57a6e374","id":1391,"pasta":"　　　　　　　　　　　 　 ∧__∧   \n　　　　　　　　　　　 　( ͡° ͜ʖ ͡°)   \n　　　　　　　　　　　  ☜　　   ☞   \n　　　　　　　　　　　　　(つ ﾉ   \n　　　　　　　　　　　　　 (ノ   \n　　　　　＼　　　　　　☆   \n　　　　　　　　　　　　　|　　　　　☆    \n　　　　　　　　　　(⌒ ⌒ヽ　　　/   \n　　　　＼　　（´⌒　　⌒　　⌒ヾ　　　／   \n　　　　　 （’⌒　;　⌒　　　::⌒　　）    \n　　　　　（´　　　　　）　　　　　:::　）　／   \n　　☆─　（´⌒;:　　　　::⌒`）　:;　　）    \n　　　　　（⌒::　　　::　　　　　::⌒　）   \n　　 　／　（　　　　ゝ　　ヾ　丶　　ソ　─","tags":"#reddit#ASCII#glitter#bomb#fairy","favourites":9,"__v":0,"created_on":"2015-04-02T02:37:35.006Z","score":0.00015282922459851583},{"_id":"551bb2f95a714a1e53683b97","id":1389,"pasta":"Interstellar has, so fucking THOROUGHLY, driven me to an entirely new dimension of emotion. The characters and story are easily the absolute best, I've EVER seen. The special effects are jaw-dropping. The scientific accuracy is perfect. Literally perfect. The film drives you through intense emotion like no other film, dare I say it, ever will. There's one scene, which I will NOT spoil, that literally had me shaking in my seat, overwhelmed by a sense of pure intensity. My heart was ready to go out of my chest. I was sweating and breathing harshly. And when it ended, I was crying at the newfound realization of what a single scene can do. But that was ONE MOMENT, in a three-hour masterpiece. The music...oh my god, the music. The music is so brilliantly intense and emotional. It's the same three notes, played upon with different instruments and tempos and styles. A single theme which keeps coming back. But at several points, it begins with a simply synthesizer, and over the course of minutes, picks up, and up, and up, in what is EASILY the greatest musical crescendo I've ever encountered. Unlike almost any song, this melody NEVER silences as it plays. It never slows or whittles down. It only gets higher, and higher, and higher. The result is music that feels justifying of a grand realization of the nature of the entire Universe. Pure euphoria, in the most genuine sense. By the credits roll, I was frozen. And I remained until I was forced out. I went home without saying a word. Without doing anything except contemplating the unbelievable experience. When I settled in my room, for the first time in a decade- no, the first time in my ENTIRE LIFE, I cried myself to sleep. Even now as I type these thoughts I am at a complete loss for what to say. Nothing can possibly do the movie justice.","tags":"#general#interstellar#satire","favourites":2,"__v":0,"created_on":"2015-04-01T08:56:29.520Z","score":0.00002688495961842911},{"_id":"551b33a0972b3991479554de","id":1381,"pasta":"YOOOO SO LOOK DA FIRST TIME I EVER GOT ON DIS RIDE I WAS WITH A WHITE FAMILY AND U KNOW WHITE FOLKS CRAZY SO DEY DONT FEAR ROLLER COASTERS OR DEATH IN GENERAL. AFTER ABOUT 10 MINUTES OF TELLIN DEM DAT I DIDNT WANNA GET ON I FINALLY SAID YES CUZ I AINT NEVER BEEN NO BITCH AND I DIDNT PLAN ON STARTING THAT DAY. WHEN DA ENGINEER SAID “PLS LEAN BACK AND KEEP THE BACK OF UR HEAD PRESSED AGAINST YOUR SEAT” AND I SAW EVERYBODY STICK DA BACK OF THEIR HEADS TO THE CHAIR I KNEW DAT I MADE DA WORST DECISION OF MY LIFE CUZ I EVEN SAW SOME BLACK FOLKS LISTEN AND U KNOW DAT WHEN BLACK PEOPLE LISTEN A WHITE LADY’S ADVICE , ITS DA REAL DEAL. SO MY FIRST MISTAKE WAS REFUSING TO PRESS MY HEAD AGAINST THE SEAT… THE RIDE TAKES OFF AND MY DOME SLAMS AGAINST THE CHAIR WHILE MY NECK SNAPPED… UNCONSCIOUS INSTANTLY.. WHEN I AWOKE FROM MY 3 SECOND SLUMBER WE HAD REACHED DA VERY TOP OF THE RIDE WHERE THE RIDE MAKES A QUICK PAUSE… WHEN THE RIDE MADE THAT PAUSE I OPENED MY EYES CAUSE I THOUGHT THE RIDE WAS OVER AND WE ALL MADE IT SAFELY. BOY WAS I WRONG… I OPENED MY EYES AND DA ONLY THING I SAW WAS A 300 FOOT DROP STRAIGHT TO DA GROUND SO I SAID “GOD YOU CANT LET ME DIE LIKE DIS”. I THINK I SUFFERED A HEART CONTUSION CUZ MY HEART JUST COMPLETELY STOPPED BEATING… AND THAN THE RIDE TAKES OFF AGAIN… WE MAKE THE 300 FOOT DROP AND I SCREAM MY LUNGS OUT AS IM SCARED TO DEATH BECAUSE DA ONLY TIME A HUMAN SHOULD BE DAT HIGH IN DA AIR IS WHEN THEIR SPIRIT IS BEING SUCKED INTO HEAVEN BY DA GRACE OF GOD.. SO WE SAFELY MAKE IT TO DA END OF DA RIDE AND WHEN WE GET OFF I STUMBLE OUT OF THE SEAT CUZ MY LEGS WENT NUMB AND ALL THE AIR WAS SUCKED OUT OF MY BODY SO I COULDNT TALK EITHER.. DA FIRST THING THESE CRAZY MOTHERFUCKERS TELL ME IS “HEY MAN LETS DO THAT AGAIN THAT WAS WICKED”. I LOOKED AT DEM AND I REALIZED DAT DIS WHITE KID DAT I BEFRIENDED WAS ACTUALLY SATAN. I NO LONGER HAVE ANY WHITE FRIENDS.","tags":"#general#white#friends#satan","favourites":1,"__v":0,"created_on":"2015-03-31T23:42:25.810Z","score":0},{"_id":"551b2bc7972b3991479554d9","id":1378,"pasta":"I believe that Hank Hill is one the most complex and realistic characters in Animation. Although on the surface he appears to be nothing more than a redneck, if you actually watch the show and read between the lines, he's a lot more. Hank Hill, and by extension King of The Hill as a whole, is at its core about showing that one group is not always right, and one group is not always wrong. It's not just blind Liberal bashing by some angry Texans, or angsty Liberal bawwing like Family Guy, it's somewhere in the middle. Hank is a man who represents traditional family values. He works a just-above blue collar job, has an ugly wife, and a kid he fails to understand. He enjoys working on his lawn, grilling, and selling propane (and propane accessories). because he represents traditional values, he often butts heads with newer, more liberal ideas. Now about half the time, he will have a hard time adjusting, but ultimately realize that it isn't that bad, or is even correct. But the other half of the time, he exposes it for the bullshit it is and tries to save those who have been brainwashed. And that's the thing, Hank isn't a racist or Homophobe, or even a devout Republican. If that was the point of the show, he would have voted for Bush in that one episode. No, Hank is a good man who just has a hard time adjusting. Hank stands by his family, his friends, and his family values, and this is why he is a good character. He has a hard time understanding his son, like a lot of parents, but ultimately loves him and accepts him for what he is. When you really get down to it, Hank is so much more than your average sitcom father. Unlike the bumbling Homer, he is a very real man who many people can relate to THEIR fathers. he is the next progression in mature cartoons and sitcoms, a complex character, not a 1 dimensional caricature. In short, he is the Average Joe the typical person represents, and that's a good thing","tags":"#general#hank#hill#america","favourites":2,"__v":0,"created_on":"2015-03-31T22:07:00.553Z","score":0.000026804924968505428},{"_id":"5518427d693253a057a924fd","id":1358,"pasta":"Anyways, ask him \"what would you do if he woke up one night the night after his dad died in a car accident. However, he woke up with no nipples. Then he learns that his dad had been putting on lipstick and sucking the spot where his nipples should be. Not for a sexual reason, but to make it seem like you had nipples like everyone else, so you could fit in. He did it every day. Since he died, he now has no nipples.\" What would he do if that happened?","tags":"#reddit#ama#wtf","favourites":2,"__v":0,"created_on":"2015-03-29T18:15:01.843Z","score":0.000026427320078058394},{"_id":"55171607d926d7b83d0f3afa","id":1347,"pasta":" ☑ “This co pilot is CRAZY!” ☑ “My plane can't win against a mountain like that” ☑ \"He NEEDED precisely those suicidal thoughts to win\" ☑ “He closed the only door that could beat me” ☑ \"He had the perfect plan\" ☑ “There was nothing I could do”","tags":"#general#pilot#suicide#crash#hearthstone","favourites":17,"__v":0,"created_on":"2015-03-28T13:17:07.820Z","score":0.00026428695575889317},{"_id":"5515e2b44e521d0b278cb5c0","id":1346,"pasta":"Hi, i am from America. The land of cheeseburgers and bacon. I'm getting sick of all the eurofags saying our country is bad. How could it be bad? God blessed america not Europe. If you copy pasterino cappucino this message, i will call someone to get me out of my chair and make sure we nuke your country down. God bless america.﻿","tags":"#twitch#general#MURICA#bacon#nukes","favourites":2,"__v":0,"created_on":"2015-03-27T23:07:28.394Z","score":0.000026120571976323168},{"_id":"5515d98d4e521d0b278cb5be","id":1345,"pasta":"You know what I notice about scientists? There seem to be two types; the real variety and the pseudointellectual variety. The real variety will take any question or opinion seriously and discuss it with a kind of passion and love of discovery. Even if, for example, the topic is \"how might homeopathy work?\" You know, the kind of thing that the pseudointellectual variety might deride vehemently. You, for example, have written off my assertion that fluoride might have an effect on atherosclerotic plaques without (clearly) looking it up, because you would discover that this has been investigated and the results published (check pubmed). Also, before you write me off, not only do I have a 4-year degree in organic chem, and worked in chem labs for years, I have also ghost written about 2,500 published medical research articles. I was the one reviewing and telling authors to improve the rigor of their message. I very, very clearly understand the science, the scientific method and many aspects of its communication. I can smell scientific bullshit a mile away and within the body of pro-fluoride research, which is extremely limited to begin with, lurks a great deal of ambiguity and linguistic sleight of hand. On my review of the available research, there really is almost no question that fluoride is quite bad for you. The question is really if it's just a bit bad or extremely bad.","tags":"#science#reddit#conspiracy","favourites":0,"__v":0,"created_on":"2015-03-27T22:09:11.108Z","score":0},{"_id":"551577ab4dc0fa63188e3e9f","id":1340,"pasta":"I sexually identify as a Torpedo Cruiser. Ever since I was a girl I dreamed of plowing through the oceans launching high-explosive loads at disgusting foreigners. People say to me that a person being a warship is impossible and I'm fucking retarded but I don't care, I'm beautiful. I'm having a plastic surgeon install Oxygen Torpedoes and Hyoteki midget Subs. From now on I want you guys to call me “Kitakami\" and respect my right to kill from afar and kill needlessly. If you can't accept me you're a Marinephobe and need to check your ship privileges. Thank you for being so understanding.","tags":"#general#sexually#identify#torpedo#cruiser","favourites":0,"__v":0,"created_on":"2015-03-27T09:27:20.293Z","score":0},{"_id":"5514e585b79c00ce446ab077","id":1339,"pasta":"I'm an Alpha male /b/.\n\nAnd girls want to fuck alpha males. Let it piss you off as much as you want, but you know it's completely true. That girl you like who is kinda cute in a weird way, but is totally sweet and you have the biggest crush on? The one who keeps going back to guys who treat her wrong for reasons you don't understand? The one who calls you up at 1 am to cry about how her boyfriend hasn't called her in 3 days, and no matter how long you listen to her, she'll never think of you as anything other than asexual? The one who will curl up next to you on the couch, hug you close, kiss you on the cheek, and never let you fucking touch her beyond that?\n\nYeah, I'm fucking her.\n\nThe hot girl who won't even look at you when you nod at them and smile? The one who laughs when you trip in the hallway and drop your stuff? The one who comes up and coyly asks for your help with her homework, and then pretends you don't exist once you finish?\n\nYeah, I'm fucking her too, even harder.\n\nThe geeky girl you think might be enough like you that you have a chance with her? She plays warcraft on your server, and watches anime, and reads comics? She's so incredible and you just love her so much but you still haven't worked up the courage to tell her how you feel about her?\n\nGuess who just sucked me off and told me they'll always love me? ","tags":"#4chan#alpha#male#lies","favourites":0,"__v":0,"created_on":"2015-03-27T05:03:57.799Z","score":0}]