[{"_id":"54d265a08ca5dfa2172a2691","id":694,"pasta":"I first realized I was a Delphinic Zoophile when I was 12 years old, which is when I had my first sexual encounter with a dolphin. This is not that particular occasion, since my first lover was brutally killed in an act of sensless violence that I will never forgive, or forget. She continues to live in my memories, though...\n\nI volunteer with dolphins whenever I get the opportunity. They are special to me, highly intelligent, empathic creatures that are dear to my heart, and are a healing aspect in my life. So it was that I met this particular dolphin, a female bottle nose dolphin, 7 years old, who is residing at my home cities coastal harbour/aquarium.\n\nShe is a beautiful dolphin, inquisitive and playful, and more used to human contact than her other, older pod mates. I answer any questions the general public have about dolphins, and spend most of my free time with them, studying and talking with them. I learned through continued contact that each dolphin has a very particular personality and habits, traits useful for differentiating between the fins who are sometimes hard to distinguish on visual markings alone.\n\nIn order to avoid the bustle tourists, I usually visit the dolphins at night, illegally I must add, since I am considered to be trespassing. But it is the only time I do not have to be distracted by tourists or the staff. I do not expect to have sex with the dolphins every time I visit them; I am not that sort of person. I spend time with them because they are a relaxing and stabilizing source of peace in an otherwise hectic and unbalanced lifestyle. So it came as a pleasant surprise when this 7-year-old dolphin began to engage in sex-play with me.\n\nI was quite happily swimming around with the dolphins when she suddenly decided to grab my foot with her genital slit. Dolphins have very muscular vaginal orifices, and can use these muscles to manipulate objects and carry them. I stayed still for a while, to see if she was just playing, but she continued to masturbate against my foot, and in the light of the torch I sometimes carry, I could see that her slit had become very pink and had swelled as well. She was aroused!\n\nSo, I started to back-paddle with my hands towards a small beached area, partially submerged in the water. A couple of times she pulled me forward into the deeper water, but eventually I got my self to the shallows. I dislodged my foot (Being careful not to pull too hard), and took her gently by a pectoral fin and rubbed her belly just to aclimatize her, I guess. She immediately rolled belly up and started doing pelvic thrusts against the palm of my hand. It was unmistakebly erotic, and by now I was fully aroused.\n\nI stripped off my shorts, and gently pulled her into the shallows until she was lying on her side, her belly facing towards me, half submerged in the water. I nestled myself belly to belly against her, and pressed my member against her genital slit. She immediately arched her body against mine, and took me inside her body, initiating a quick series of muscular contractions with her vaginal muscles. I wrapped my left arm around her body and just held her close while she manipulated me inside her body, until I climaxed barely 2 minutes later. Surprisingly, her body also shuddered against mine, and we spent the next 5 or so minutes just lying together in the shallows, holding each other, enjoying our company and revelling in the fact that we had shared something special together, something very few people can claim to have done.\n\nI do not brag about this though. It is not something you can brag about, since it not only is demeaning to the act, but it destroys the purpose of the act as well; to express affection, and trust. I only consent to those dolphins who ask. As a result, I have mated only three times. Each time was memorable and special, because each time it was something we both wanted to share with each other. Sex, for me, is just another, albeit powerful, expression of affection and trust. I wouldn't engage any other animal, though; it is not my attraction. But there is little I wouldn't do for a dolphin.\n\nI am aware there are people who would look at this and turn away in disgust. I can not force my beliefs or my feelings upon them, neither do I wish to. The only thing I ask of those people is that they try to understand that love, and trust, and respect are not limited to within a single species. Human kind has created religions and laws and barbed-wire fences that have been created, written and erected out of the former belief that we are the best, the smartest, the most powerful creature on the planet. Now we are realising that we have been extremely short sighted; many of us are realising this, but there are others who are bound by their former beliefs. One word is the key to improving our civilization. One word which could improve many lives.\n\nUnderstanding.\nMy life is now dedicated to understanding dolphin kind. The way they act, the way they communicate, the reasons why a completely wild animal would take any interest what so ever in humans, a very dangerous wild animal. These may be answers that I may not answer in my lifetime, but this is a path that has been layed by a special dolphin who taught me more about love and trust in one week than any human taught me in my entire life. A path that I hope others will choose to also tread with me, towards a pool of knowlegde where dolphins and humans can interact with one another, and learn a great many secrets.﻿","tags":"#general#dolphin#fucking#zoophile","favourites":4,"__v":0,"created_on":"2015-02-04T15:40:49.386Z","score":0.0002720970624134182},{"_id":"54d142393ff769ac11c000dd","id":690,"pasta":" ▂▂▂▂ ▂▂▂▂▂▂╭━╮▂▂▂▂▂▂▂ ▂▂▂▂▂▂┣━┫▂▂▂▂▂▂▂ ▂▂▂▂▂▂┃╭┃▂▂▂▂▂▂▂ ▂▂▂▂╭━┫┈┣━╮▂▂▂▂▂ ▂▂╭━┃╭┃╭┃╭┃━╮▂▂▂ ▂▂╲╭┃╯┃╯┃╯┃╭┃▂▂▂ ▂▂▂▏┃Fuck youuuuuu ┃▂▂▂ ▂▂▂╰╮▂▂▂▂▂▂","tags":"#general#ASCII#finger#bird","favourites":3,"__v":0,"created_on":"2015-02-03T21:41:13.520Z","score":0.0001911707946327281},{"_id":"54d071c0f82953000ef73f9a","id":683,"pasta":" Hello, I am currently 15 years old and I want to become a walrus. I know there’s a million people out there just like me, but I promise you I’m different. On December 14th, I’m moving to Antartica; home of the greatest walruses. I’ve already cut off my arms, and now slide on my stomach everywhere I go as training. I may not be a walrus yet, but I promise you if you give me a chance and the support I need, I will become the greatest walrus ever.","tags":"#general#walrus#antartica\n","favourites":4,"__v":0,"created_on":"2015-02-03T05:25:47.462Z","score":0.0002644264897636162},{"_id":"54ce92d0574e442b035d5fca","id":656,"pasta":" ( ͡° ͜ʖ ͡°) Every 60 seconds in Brazil, Germany scores a goal. Together we can stop this. Please spread the word ( ͡° ͜ʖ ͡°)","tags":"#general#twitch#brazil#germany#60#seconds#goal","favourites":5,"__v":0,"created_on":"2015-02-01T18:10:59.696Z","score":0.0003265354850082863},{"_id":"54cd9fdbd86d663c01197c5e","id":647,"pasta":"gr8 m8 no d-b8 i r8 it an 8 i h8 2 b in an ir8 st8 but its my f8 hey m8 i apreci8 that u r8 it gr8 u wanna d8 and mayb masturb8 i can ask n8 and we can meet at the g8 dont b l8 gr8 b8 m8 i r8 it an 8/8 plz don't h8 gr8 b8 m8 cant even h8 so I r8 8 outta 8 Gr8 b8 m8. I rel8, str8 appreci8, and congratul8. I r8 this b8 an 8/8. Plz no h8., I'm str8 ir8. Cre8 more, can't w8. We should convers8, I won't ber8.","tags":"#general#twitch#8#gr8#b8#m8","favourites":3,"__v":0,"created_on":"2015-02-01T03:39:04.291Z","score":0.00018113605356284655},{"_id":"54cd723ae79ec4797cbee2ac","id":644,"pasta":"ヽ༼ຈل͜ຈ༽ﾉ ✈ ▌ ▌ يتكوّن ء ثلاثة هي حي العمال ـ وهو ة والمحمدية. وفي عاهـ بدأ وق التنمية ال عقارية بصرف قروض مدينة ع [̲$̲(̲ ͡° ͜ʖ ͡°̲)̲$̲] 322 ʕ•͡ᴥ•ʔ للمواطنين الذين جاءوا من البادية توطتوط وا والعز يزية وحي المساعدية ثم الصالحية والمنصورية.ومن الأحكية وبدنة والجوه ▌ ▌ ✈ YOLOرة والربوة والضاحي ة.,","tags":"#twitch#general#911#9/11#terrorists#muslim#arabic","favourites":4,"__v":0,"created_on":"2015-01-31T23:51:19.799Z","score":0.0002531814360840564},{"_id":"54cb3312d4e8b1e26424006b","id":620,"pasta":"└(-_-)┐♪└(-_-)┘♪┌(-_-)┘♪┌(-_-)┐♪└(-_-)┐♪└(-_-)┘♪","tags":"#twitch#general#dance#music","favourites":3,"__v":0,"created_on":"2015-01-30T05:50:28.643Z","score":0.00017471662435205164},{"_id":"54c9aa8ef63c027608a74622","id":603,"pasta":"Hey do you want some Dongers? ༼ຈل͜├┬┴┬┴","tags":"#general#twitch#dealer#want#some#dongers","favourites":4,"__v":0,"created_on":"2015-01-29T03:23:29.345Z","score":0.00024001080690527656},{"_id":"54c97289f63c027608a74615","id":600,"pasta":"Sometimes when I poop, I use the shaping attachment from my old Play Doh fun set. I place it on my anus, and make poops in different shapes. There's nothing strange about that at all. I'm an American, living in America, and if I want to have poops shaped like stars, I have every right to. The founding fathers would have wanted it that way.","tags":"#general#poop#play#doh#anus#america","favourites":0,"__v":0,"created_on":"2015-01-28T22:54:07.140Z","score":0},{"_id":"54c82721f63c027608a745f7","id":588,"pasta":"[Enter Name] was born on the slopes of the Eastern ancient Himalayas, where he lived the life of a sherpa for 11 years before Angelina Jolie adopted him as one of her own.","tags":"#general#twitch#sherpa#himalayas#angelina#jolie\n","favourites":1,"__v":0,"created_on":"2015-01-27T23:51:36.133Z","score":0},{"_id":"54c6a221f63c027608a745dd","id":579,"pasta":"But for seriouses. MMLP2 seems to me like the moment Neo flies off the building from the original Matrix, stretched out over however many tracks. He's probably going to win the first posthumous Nobel Prize Lifetime Achievement Award of rap. To stretch the Matrix metaphor, Recovery was where he could stop bullets, Relapse was the scene where he could finally match the power of the agents, Encore was where he could dodge bullets, TES was arguably the scene where the metal detector beeps and then he's running on walls, MMLP was where he's helping everyone escape that building, Slim Shady LP was the amazing theatrics of Morpheus's Matrix explanation and training seminar, Slim Shady EP was taking the red pill and getting sucked through into Zion, Infinite was Morpheus's sales pitch, and all the guest appearances were The Animatrix.","tags":"#general#matrix#eminem#music","favourites":2,"__v":0,"created_on":"2015-01-26T19:40:09.538Z","score":0.00009214085181549109},{"_id":"54c67eb6f63c027608a745d5","id":577,"pasta":"↓ ᶠᵘᶜᵏ ᵗʰᶦˢ ᵍᵘʸ ↓","tags":"#twitch#general#fuck#this#guy","favourites":6,"__v":0,"created_on":"2015-01-26T17:33:15.032Z","score":0.00035176212739710636},{"_id":"54c43ba5ed70401f791aa727","id":550,"pasta":"I probably shouldn't but just one more text fa- no. ̤Nͪo̓ ̹m̽oͅr͘e̊ THE DONGERS ma̎y͑b̊e ̧̎on̈́e̍ͩ̊ ̾m̳͉͒o̝̎r̠̀e͊̀ ̑I ̫̝͢c̝͌a̸̛̠͗n̢̼ͩ'̝͙t̀҉ ̠̣͐̎s͓̒ͥ͞to̝͉ͬ̃p̠ ̹M̆̌Ȗ͛S̥̖̼͗ͅT̛͔̪̯ͤ̓ ̈R̥̍̄̓͝A̭̼͔I̶͕S̨̝͕̹̅̈́̈́͘E̷̠̖͙̗̾̄ͣ͡ ̠̣̓̅ͧ̆ͥ͡͝Ḑ̰ͪͣͥ͊͞Ò̟͕̈́͢N̫̞̖͍͎ͫͯ̕Ğ̷̭͛̍̉Ę̤͕̂R̸̯̣̟̔S̫̭̽͛̈̇ ̣̙̆͑ͩ͢A̡̚y̤̣̦̓͆̏ͩY̗̻̗̣ͦ͘͡ ̜͇̿L̹̯͐͝m͚̲͖a͙̒̆͂̒͋Ỏ̫̲͏̨̡A̡̼̹̙̣͋ͤ͂̈̔Y̶̺͖̞̲͐́y̏y̛̗͇ͨy̧͍̮̙̓̿͐ͭY͕̙ͩ̊ͮ̄͗̂̅͘Y̛͎̲ͤy̢̗ͅ҉Y͍̪͍̐̎ͧYy̷̡̭̜y̲̗̬̤ͪ͋̽̎Ỷy͓̲̱͛͡Y̻Y̭Y̻͔̓͋ ͈͙̹͈̟̽̀ͫ̽l͙ͨ̀m̛͚͆͋͋ȧ̲͓͈̊o̹̮͌͗","tags":"#general#twitch#dongers#can't#stop#ayy#lmao","favourites":10,"__v":0,"created_on":"2015-01-25T00:38:17.767Z","score":0.0005572138118104325},{"_id":"54c42f7ced70401f791aa71e","id":546,"pasta":"( ͡° ͜ʖ ͡°) Eᴠᴇʀʏ 60 sᴇᴄᴏɴᴅs ɪɴ Mᴜʀɪᴄᴀ, 60,000 ʙᴜʀɢᴇʀs ᴀʀᴇ ᴅɪɢᴇsᴛᴇᴅ. Tᴏɢᴇᴛʜᴇʀ ᴡᴇ ᴄᴀɴ sᴛᴏᴘ ᴛʜɪs. Pʟᴇᴀsᴇ sᴘʀᴇᴀᴅ ᴛʜᴇ ᴡᴏʀᴅ. ( ͡° ͜ʖ ͡°)","tags":"#twitch#general#america#MURICA#burgers#digested","favourites":10,"__v":0,"created_on":"2015-01-24T23:49:07.850Z","score":0.0005568850628894819},{"_id":"54c42e44ed70401f791aa719","id":543,"pasta":"░░░░░░░░░░░░▄▐░░░░░░  \n░░░░░░▄▄▄░░▄██▄░░░░░  \n░░░░░▐▀█▀▌░░░░▀█▄░░░  \n░░░░░▐█▄█▌░░░░░░▀█▄░  \n░░░░░░▀▄▀░░░▄▄▄▄▄▀▀░  \n░░░░▄▄▄██▀▀▀▀░░░░░░░  \n░░░█▀▄▄▄█░▀▀░░░░░░░░  \n░░░▌░▄▄▄▐▌▀▀▀░░░░░░░  \n▄░▐░░░▄▄░█░▀▀░░░░░░░ U HAVE BEEN SPOOKED BY THE  \n▀█▌░░░▄░▀█▀░▀░░░░░░░  \n░░░░░░░▄▄▐▌▄▄░░░░░░░  \n░░░░░░░▀███▀█░▄░░░░░  \n░░░░░░▐▌▀▄▀▄▀▐▄░░░░░ SPOOKY SKILENTON  \n░░░░░▐▀░░░░░░▐▌░░░░░  \n░░░░░░█░░░░░░░░█░░░░  \n░░░░░▐▌░░░░░░░░░█░░░  \n░░░░░█░░░░░░░░░░▐▌░░ SEND THIS TO 4 PPL OR SKELINTONS WILL EAT YOU","tags":"#reddit#ascii#spooky#skeleton","favourites":3,"__v":0,"created_on":"2015-01-24T23:43:23.499Z","score":0.00015899808607898567}]