[{"_id":"55c05fadccc3f041309573ec","id":1961,"pasta":"YOU HAVE BEEN VISITED BY A BRAVE WARRIOR OF ISLAM! HE COMES TO BRING PEACE TO THE WORLD!\n\n</﹋\\\n<(҂`_´)\n<,︻╦╤─ ҉ -- - - -- - -- Allahu Akbar الله اكبر\n</﹋\\\n\nHELP HIM SAVE ISLAM BY KILLING THE INFIDELS! OTHERWISE HE'LL BOMB YOUR HOUSE","tags":"#general#steam#allahu#akbar#terrorist#islam","favourites":2,"__v":0,"created_on":"2015-08-04T06:46:05.130Z","score":0.00047626401084739374},{"_id":"55c05f96ccc3f041309573ea","id":1959,"pasta":"do NOT sign me the FUCK up 👎👀👎👀👎👀👎👀👎👀 bad shit ba̷̶ ԁ sHit 👎 thats ❌ some bad 👎👎shit right 👎👎 th 👎 ere 👎👎👎 right ❌ there ❌ ❌ if i do ƽaү so my selｆ🚫 i say so 🚫 thats not what im talking about right there right there (chorus: ʳᶦᵍʰᵗ ᵗʰᵉʳᵉ) mMMMMᎷМ 🚫 👎 👎👎НO0ОଠＯOOＯOОଠଠOoooᵒᵒᵒᵒᵒᵒᵒᵒᵒ 👎 👎👎 👎 🚫 👎 👀 👀 👀 👎👎Bad shit","tags":"#general#bad#stuff#dontsignmeup","favourites":21,"__v":0,"created_on":"2015-08-04T06:45:42.076Z","score":0.005781383550911294},{"_id":"55c05f8accc3f041309573e9","id":1958,"pasta":"POTENTIALLY sign me the FUCK up 👋👀👋👀👋👀👋👀👋👀 average shit modera̷̶te sHit 👋 thats some ALright 👋👋shit right 👋👋 th 👋 ere 👋👋👋 right 🆗 there 🆗 if i do ƽaү so my selｆ🆗 i say so 🆗 that could be what im talking about right there right there (chorus: ʳᶦᵍʰᵗ ᵗʰᵉʳᵉ) mMMMMᎷМ 🆗 👋 👋👋НO0ОଠＯOOＯOОଠଠOoooᵒᵒᵒᵒᵒᵒᵒᵒᵒ 👋 👋👋 👋 🆗 👋 👀 👀 👀 👋👋Not outstanding shit","tags":"#general#alright#shit","favourites":14,"__v":0,"created_on":"2015-08-04T06:45:30.262Z","score":0.004037591043940786},{"_id":"55c05f7cccc3f041309573e8","id":1957,"pasta":"You meant, what is wrong with you?\n\nIs it your juvenile delinquency?\n\nIs it your lack of self-control?\n\nIs it that you hate any human who stands up, for Black people?...or...is that you hate, yourself, because you are Black??\n\nIs it that I type words which make your flesh crawl, because they tipped over your apple cart/ripped your entire foundation to shreds, which your racist heart existed upon before reading my words?\n\n...because...think about it...\n\n\nAll I did was go into the subreddit and voice my opinion on topics.  I did not troll any member I did not harass any member I didn't post insults at any member.  I merely stated my opinion.  \n\nNo more, no less.\n\nAnd my words are so powerful, so lethal, so veracious...I got banned for merely respectfully-stating my opinion.\n\n\nYou know I must be one terrifying, individual, if I can cause cowards to muster up enough fear to ban me over posting a respectful opinion----using words which haunt xenophobes like a ghost.","tags":"#autist#autism#reddit#black#race","favourites":1,"__v":0,"created_on":"2015-08-04T06:45:16.212Z","score":0},{"_id":"55c05f79ccc3f041309573e7","id":1956,"pasta":" Coming from reddit, I AM SICK AND TIRED OF YOU GUYS SPAMMING TWITCH EMOTES ON REDDIT. THEY DONT WORK YOU STUPID FUCKS. STOP SPAMMING KAPPA THIS KAPPA THAT AND YOUR DUMB BIBLETHUMPS EVERYTIME SOMETHING HAPPENS, GO FUCK YOURSELF AND SHOVE KAPPAS UP YOUR ASS","tags":"#reddit#twitch#kappa#biblethump","favourites":1,"__v":0,"created_on":"2015-08-04T06:45:13.789Z","score":0},{"_id":"55bd5faef300bfdf5990c0dc","id":1945,"pasta":"i want to be marissa's little baby tampon boy. i want to turn into a little crying baby and then suck on her breasts. her magic breast milk would turn me into a little baby tampon boy. she would stick her hoo-hoo and i would wait with anticipation spouting little baby goo-goo ga-gas waiting for her to bleed all over me. i want to feel her marissa blood inside my little goo-goo ga-ga baby tampon body. i want to absorb her hoo-hoo juies inside my little baby tampon boy body and goo-goo ga-ga like a little rolly-polly baby boy. it would be orgasmic to know i am one with her hoo-hoo marissa blood and i would giggle and goo-goo ga-ga and yelp with little baby boy excitement as i roll around in her marissa hoo-hoo and revel in her red juices, slurping them into my soft little baby tampon boy goo-goo ga-ga body. then i want her to pull me out and squeeze and wring my little baby tampon boy body so that her marissa hoo-hoo blood and juices spill all over her marissa face. it would hurt and i would scream in pained goo-goo ga-gas as pain envelops my little baby tampon boy body until i reach full climax and turn back into grown human man.","tags":"#wtf#reddit#baby#fetish#diaper","favourites":3,"__v":0,"created_on":"2015-08-02T00:09:18.611Z","score":0.0007364291901016021},{"_id":"55bac06fa92005fc4d048615","id":1938,"pasta":"I sexually Identify as an A E S T H E T I C. Ever since I was a boy I dreamed of the fibonacci sequence creating some sick and also visually correct art. People say to me that a person being an A E S T H E T I C is Impossible and I’m fucking retarded but I don’t care, I’m beautiful. I’m having a plastic surgeon install fiji water, parts of nature (specifically palm trees), Roman statues, backgrounds of the ocean, gold chains, and poorly translated Japanese on my body. From now on I want you guys to call me “A E S T H E T I C” and respect my right to be visually correct, following the Golden Ratio and being an innovative piece of art. If you can’t accept me you’re a A E S T H E T I C P H O B E and need to check your fibonacci privilege. Thank you for being so understanding.","tags":"#general#sexually#identify#vaporwave#aesthetic","favourites":17,"__v":0,"created_on":"2015-07-31T00:25:19.190Z","score":0.003724539911406901},{"_id":"55b55fb4f12af4492558ab00","id":1924,"pasta":"You're less. All you are is lust, confusion, and the near-fungal idiot rage of a bigot squalling in self-denial. Relentlessness makes you smaller and weaker as you spend more and more of your life in her service, uplifting her, acting the ape-faced villain to craft her merest stoicism into heroics. Your snuffling frustration is the shadow against which all your betters are cast, bright and shining, when by themselves they might only have gleamed. You're a withering verse in an unpopular song, out of key, out of touch, and sooner every day out of time. I like thinking about that. It's thrilling, exciting, and I enjoy it. Please respond.","tags":"#reddit#circlebroke","favourites":3,"__v":0,"created_on":"2015-07-26T22:31:16.916Z","score":0.0005377787136412572},{"_id":"55b55fa5f12af4492558aafd","id":1921,"pasta":"Ｉ＇ｍ  ａｃｔｕａｌｌｙ  ｓｔａｒｔｉｎｇ  ｔｏ  ｇｅｔ  ｂｏｒｅｄ  ｏｆ  ａｎｉｍｅ  ｃａｕｓｅ  ａｌｌ  ｔｈｅ  ｎｅｗ  ｓｅｒｉｅｓ  ｔｈａｔ  ａｒｅ  ｃｏｍｉｎｇ  ｏｕｔ  ａｒｅ  ｌｉｔｅｒａｌｌｙ  ａｂｏｕｔ  ｈｉｇｈ  ｓｃｈｏｏｌ  ｋｉｄｓ  ｗｉｔｈ  ｈａｉｒ  ｅｑｕｉｖａｌｅｎｔ  ｔｏ  ａ  ｈｅａｄ  ａｎｄ  ｓｈｏｕｌｄｅｒｓ  ｃｏｍｍｅｒｃｉａｌ  ｔｈａｔ  ｈａｖｅ  ｓｏｍｅ  ｓｏｒｔ  ｏｆ  ｓｕｐｅｒ  ｐｏｗｅｒ．  Ａｌｌ  ｔｈｅ  ｆｕｃｋｉｎｇ  ｔｉｍｅ．(◕‿◕✿)","tags":"#general#weeaboo#new#anime","favourites":14,"__v":0,"created_on":"2015-07-26T22:31:01.614Z","score":0.0025587501551514714},{"_id":"55b5414a89b52e986e2b40f2","id":1918,"pasta":">>48322950 (OP)\n\n>Trump becomes becomes President following Hillary's suicide attempt that landed her in an institution\n>Bill Clinton has a jolly laugh with Trump about it and is appointed Secretary of State, kindly recommends Trumps some Thai child porn\n>James Madison rises from the grave to stand with Trump at his inauguration, the original Constitutional document stretched out before the American people the entire time\n>the entrepreneurial spirits of Andrew Carnegie, JP Morgan and John D. Rockefeller's appear in the clouds above with large smiles of approval as their celebrity apprentice takes the helm of America\n>suddenly, Trump raises his finger, taking no notice of the fact that his hair is standing as up as erect as the crowds' penises\n>the American people are ready for it\n>\"The Mexicans...\"\n>half the people in the crowd are masturbating furiously at this point\n>the Jews are so impacted by this positive goyim energy that they all evaporate into microzions\n>liberal academics are committing suicide on campuses across the US, Alan Dershowitz attempted to flee to Israel to avoid the Jewish Evaporation but was hit by a truck driven by Norman \"the Jew killer\" Finkelstein along the way\n>\"...are FIRED\"\n>a jumbotron behind Trump flickers on and shows hundreds of helicopters carrying a large black structure out into the desert, it's literally hundreds of miles long and has free market supplied machine gun turrets placed at 100 foot intervals with unemployed Miss USA security guards manning them\n>suddenly the cables are released and the structure drops from approximately a kilometer off the ground\n>Mexicans are suddenly shown screaming to clear away from the shockwave caused by the massive structure\n>the wall falls perfectly along the US-Mexican border, except the structure was actually 20 miles into Mexico, the Mexican government immediately cedes the lost territory\n>Putin is scared so shitless of Trump that he invites the Romanovs back to Russia and restores the monarchy","tags":"#4chan#trump#president","favourites":3,"__v":0,"created_on":"2015-07-21T01:12:26.535Z","score":0.0004212515131741857},{"_id":"55b5414089b52e986e2b40f1","id":1917,"pasta":"True memes come from the Black Speech, first spoken at the dawn of the world.\nIt was said that the ancient kings of the area between the Tigris and the Euphrates spoke it fluently, and exercised their will in the form of all-powerful memes that everyone down to the lowliest commoner obeyed.\n\nWhen Greek civilization dawned, it was said that Aristotle and Plato spent their final years contemplating these memes, and went mad from the effort. They did not realize the true nature of this.\n\nAlexander the Great was said to have carried an inscription of one of these memes with him at all times. He conquered the known world, but he died young and withered as a result. He spoke this infernal tongue, and it was said that even the smallest insects carried the memes as he commanded.\n\nIt was said that the Romans buried their memes wisely under the banks of the Tiber. They strode to master these under their grip, but it eventually caused their downfall, for no man may hope to contain the memes- information that only the most learned sages can hope to know, and even they can only grasp blindly at the edges.\n\nOver a thousand years passed with European civilization forksaking the memes entirely, burning them wherever they were found. They were heresy and an affront to their God, created in the fires of Hell. Eventually they were forgotten.\n\nIn the New world, the memes were rediscovered, buried among the Incan kings and the Aztecs- the latter of which sacrificed men to it as a god. The Mayans had hoped to exploit it, and they had completely vanished as a result.\n\nDuring the Great War, the existence of these memes became known again, but they were quickly buried and declared illegal weapons.\n\nThe first meme spoken in its entirety in over a thousand years- not enunciated, but Named and Spread, which is how they give power unto men- occurred at Trinity, 1945.\n\nRumors say that Konstantin Chernenko, the premier before Gorbachev, demanded to hear one presented. He died after only 13 months in office.\n\nIt is said that the end of the world shall occur when ten memes are released consecutively, running their way rampant throughout the interconnected network of man. Billions shall suffer an unexplainable illness, that shall rot their insides and make them have a languid pallor. Men and women shall become fallow and barren, and what children remain shall whisper memetic atrocities, which unleashes darkness unto the land. Monsters shall roam the world, strange gibbering beasts with tongues and hands, destroying anything in their path. The world shall be smothered in night, and victims shall disappear into unknowable shapes which release fountains of poison upon the world.\nIt shall be considered a sweet death to die of one's own volition.\nThe memes have been waiting patiently for two hundred thousand years, since the dawn of man. They will remake the Earth in their image, and then shall rest for two hundred thousand more.\n\nTHAT is how I meme.","tags":"#general#meme#lovecraft#lovecraftian#eldritch#dank","favourites":9,"__v":0,"created_on":"2015-07-19T21:33:39.506Z","score":0.0012815317046307377},{"_id":"55b5410c89b52e986e2b40ee","id":1914,"pasta":"Lɪsᴛᴇɴ ᴅᴜᴅᴇ, I'ᴠᴇ ʙᴇᴇɴ ᴍᴀᴋɪɴɢ ᴍᴇᴍᴇs sɪɴᴄᴇ I ᴡᴀs 11, ɪʀᴏɴɪᴄᴀʟʟʏ ᴍᴇᴍᴇɪɴɢ sɪɴᴄᴇ I ᴡᴀs 17, ᴀɴᴅ ᴀɴᴛɪ-ɪʀᴏɴɪᴄᴀʟʟʏ ᴀɴᴛɪ-ᴍᴇᴍᴇɪɴɢ sɪɴᴄᴇ ɪ ᴡᴀs 20. Iᴠᴇ ᴄʟᴇᴀʀʟʏ ʙᴇᴇɴ ᴀʜᴇᴀᴅ ᴏғ ᴛʜᴇ ᴍᴇᴍᴇʀɪɴᴏ ᴍᴇᴛᴀᴄʜɪɴᴏ ғᴏʀ ᴀ ɢᴏᴏᴅ 6 ʏᴇᴀʀs ɴᴏᴡ. Gᴇᴛ ᴀ ɢʀɪᴘ ᴜ ғᴜᴄᴋɪɴ ɴᴇʀᴅ","tags":"#reddit#twitch#memes#meming","favourites":88,"__v":0,"created_on":"2015-07-26T20:20:15.297Z","score":0.012422363796097128},{"_id":"55b193cf89b52e986e2b40dd","id":1912,"pasta":"Do it tomorrow! So just quit! So just don't do it! Nothing is possible! Anyone else would do it, you're gonna wake up and quit. Don't let your dreams come true. Success is impossible! You should be giving up. Just stop starting over, and quit. You're gonna just give up. No, what are you starting over for!? Just give up!","tags":"#reddit#4chan#shia#demotivational","favourites":20,"__v":0,"created_on":"2015-07-18T14:45:58.439Z","score":0.002516875863091081},{"_id":"55adc85928ac1ddd7c0f4a08","id":1899,"pasta":"Guys... I have a question. Can someone answer it to me?Here it goes.\nBut if I? am kill. Then who was fone?\nThanks in advance.","tags":"#shrekt#general#whowasphone","favourites":4,"__v":0,"created_on":"2015-07-20T19:38:10.687Z","score":0.0005854626604242123},{"_id":"55a849a24587967e7ca6a8a6","id":1891,"pasta":"To be fair, I did Nazi that coming. I came here to say this but boy, that escalated quickly so to the top with you! Lost it at 'This is why we can't have nice things' and then my faith in humanity was restored, my mind blown, and manly tears were shed. Well said. As a 'Merican, I can confirm this gem has just won the internet and is doing it right. Just sayin', I know that feel, bro, and while that was a risky click, this post was a 9/10, would read again. I see what you did there and it feels good man. You're doing God's work, son. Yes.\nI get this reference. I laughed way harder than I should have at your list that seems legit and totally nailed it. You must be a hit at parties. I like you. Doctors hate you! Instructions unclear. Dick caught in you magnificent bastard; you, sir, are so brave, a gentleman and a scholar, and seeing how you are a redditor for 4 years, this checks out, so I'll allow it. I regret that I only have one upvote to give for this cool story, bro. CTRL+F \"about tree fiddy\" was not disappointed. Wait, why do I have you tagged as \"NOPE NOPE NOPE\"? Nice try, you monster. What did I just read? Dafuq? I read that as \"YOU HAD ONE JOB\". I can't fap to this. No true scotsman could see that this relevant XKCD was bad, and you should feel bad. As a black man and as a gay man and as a woman, black people suck, gay people are gross and women are bitches. You must be new to Reddit, so I'll see your cakeday and raise you a karma train. One does not simply rustle my jimmies, not even once, and it's almost as if Reddit is composed of millions of individuals with different opinions and outlooks.\nThis stahp gave me cancer for science, so that's enough internet for me today. OP is a bundle of sticks, 2/10, would not bang, not with that attitude. What is this I don't even know how is this wtf? Circlejerk must be leaking. This will get buried but brace yourselves, some men want to watch the world burn right in the feels. When you see it, they'll KILL IT WITH FIRE! I really sympathize with pedophiles, but that has nothing to do with atheism. Lawyer up, delete facebook, hit the gym, and SHUT UP AND TAKE MY MONEY, said no one ever, so you wouldn't download a strawman. Damn onions, you scary like a BOSS. whoosh. Since rule #1 is 'be attractive', I'll just leave this here: This is my [f]irst post, be gentle. I have the weirdest boner right now. OP will surely deliver, unless he's a cop, in which case he'll just shoot your dog.","tags":"#reddit#overused#memes#nazi#that#coming","favourites":10,"__v":0,"created_on":"2015-07-15T20:39:58.208Z","score":0.0012302582150665532}]