[{"_id":"5514e4b0b79c00ce446ab075","id":1338,"pasta":"This is NOT copypasta. I repeat NOT copypasta.\n\nI know coming to /b/ for advice is a top notch bad idea, but I honestly have no where else to turn because this situation directly involves my family, and friends.\n\nLet me start from the beginning, I am 18 and my sister is 21. I just finished high school and my sister is home from college. I guess this year her grades started slipping or something, because I walked past her room and she was crying. I walked inside her room to ask her what's up and she hands me a letter - apparently she's up for review by her college for dismissal. I feel kinda sorry for her so I gave her a hug and one thing led to another and we started making out. This is really weird because I've made out with girls before, but my sister blows them all out of the water. In the back of my mind lies the fact that she's my sister and what we are doing is sick and wrong, but I guess my sister has more experience and it felt so fucking good.\n\nHere's the dilemma - after making out, Karen started taking her clothes off and she started pulling my pants down. I'm like, hey, what are you doing? She's like, oh come on Jordan, aren't you even a LITTLE curious? I felt bad because its true, my sister is a hottie and I always wished that she wasn't my sister. I've even gone as far as to fap to thoughts of doing her. She then said \"For tonight, let's not be brother and sister. I really need this because I feel like shit right now and our parents won't be back till late and we aren't going to tell anyone.\n\nI pretty much just fucked my sister. No, to be more honest, I just lost my virginity to my sister. My question, /b/, is WHAT THE FUCK DO I DO NOW?? What do people usually do after they fuck their sisters?\n\nPic very related; that's Karen. ","tags":"#4chan#not#copypasta#karen","favourites":3,"__v":0,"created_on":"2015-03-27T05:03:21.969Z","score":0.00005497304204533988},{"_id":"55146de2b79c00ce446ab070","id":1336,"pasta":"I know I'm preaching to the wrong generation, but seeing old school photos like this definitely makes me a little upset when I read all the hype about these luxury driverless cars. The relationship between Americans and their vehicles has diminished over the years, and it's become more about luxury and convenience rather than fostering a deeper connection between you and something that becomes a major part of your everyday life. A nice car to someone in the 60's was their entire world. I view my car as an extension of myself. I grow closer to it the more I drive it, the more I get to know its strengths and weaknesses, the more life experiences I have in my car. I'm just glad that I won't be living in an age where I can't even drive my own fucking car on my own anymore.","tags":"#reddit#le#wrong#generation#cars#drivers","favourites":0,"__v":0,"created_on":"2015-03-26T20:28:44.007Z","score":0},{"_id":"551469bcb79c00ce446ab06e","id":1335,"pasta":"██╗████████╗███████╗          ███╗   ███╗  ███████╗\n    ██║╚══██╔══╝██╔════╝         ████╗ ████   ██╔════╝\n    ██║       ██║       ███████╗        ██╔████╔██  █████╗  \n    ██║       ██║       ╚════██║        ██║╚██╔╝██║██╔══╝  \n    ██║       ██║       ███████║        ██║ ╚═╝    ██║███████╗\n   ╚═╝       ╚═╝        ╚══════╝        ╚═╝           ╚═╝ ╚══════╝﻿","tags":"#general#ASCII#it's#its#me","favourites":1,"__v":0,"created_on":"2015-03-26T18:27:41.614Z","score":0},{"_id":"55139e600489a24c09a597dd","id":1330,"pasta":"If it's not for everyone then perhaps you should learn proper English and add an addendum which states that people shouldn't be assholes to strangers and that not everyone is a mentally unstable manchild. You won't do that though because I \"offended\" you, which further espouses my assertion that you are an emotionally unstable, narcissistic asshole with a huge ego.","tags":"#general#manchild#proper#english","favourites":0,"__v":0,"created_on":"2015-03-26T05:05:42.543Z","score":0},{"_id":"551340aa0489a24c09a597d0","id":1325,"pasta":"So you like child molesters is what you are trying to rationalize right now? Because she is \"demented\"? Fuck you, you piece of shit. Your comment doesn't offend me. Your comment is exactly the way this happened between those two. Some \"innocent\" conversation about how maybe paedophilia turns one of them on and the other one saying.. really? Me too. Sure molesting children isn't a normal person thing, but you thinking that child molesters are hot because they aren't \"normal\" and carelessly defending it because, \"aww shucks guys, I'm not a normal dude.\" What makes you not normal? You have tattoos and piercings? You like hot wax poured on you or women stomping on your balls? Or you like to take advantage of helpless beings for your pleasure? See how that's not even close to being not normal - it's not demented - it's not alternative - I can't even begin to describe what being a rapist, molester, abuser is as a person, but \"not normal\" is not even fucking close.","tags":"#child#children#molest#molester#le#reddit","favourites":0,"__v":0,"created_on":"2015-03-25T23:04:47.856Z","score":0},{"_id":"5513160c0489a24c09a597ce","id":1324,"pasta":">tl;dr is sex truly the ultimate plane of existence as it is said to be or is it over rated and over hyped \n\nLook guys, as much as I hate to say this, I despise the word and the meaning and I feel like the scum of the Earth, I am determined to deal with it head on as soon as I can, and I will not stop until I have, so don't take me as some NEET, everyone is this for some amount of time\n\nI'm a fucking kissless virgin\n\n18, don't graduate highschool till June, dont start university till August, am planning on being able to finally fuck in the fall, because of drunk / high girls that are very easy to have sex with, plus even sober ones in college are supposedly somewhat easy to exploit\nI have built it up in my mind that sex is like a religious experience, so amazing that there are no humans words that can describe it, that its incomprehensible unless you have done it yourself, that its like trying to explain calculus to a squirrel\nI should mention that I am uncut, 6.5 inches\n\nSo far in my life I have experienced classic fapping, fapping with astroglide, a short like 10 second handjob that ended because we had to stop because someone was gonna walk in on us, never happened again never went any further, and using a mini-lotus fleshlight, STU, swallow, forbidden, and destroya with astroglide\nClassic fapping feels like shit and is almost kinda uncomfortable, fapping with lube is pretty good, the fleshlight with astroglide, warmed up, feels really fucking good, the handjob is really hard to explain it felt almost better than the fleshlight but at the same time not as good\nI came up with this sort of \"scale of physical feels\", this is my feeble attempt at comprehending the incomprehensible\n\nOriginal fapping < Modern fapping < Minilotus w/ homemade lube < Handjob < Minilotus w/astroglide < STU w/ homemade lube < STU w/ astroglide < Sex w/ no condom\n\n**Never experienced a blowjob w/condom, blowjob w/out condom, anal sex w/ condom, anal sex w/out condom, sex w/ condom, sex w/out condom, and as for the non minilotus and non STU fleshlights it is just too complicated for me to explain\n\nIt is obvious that vaginal sex with no condom is the ultimate state of existance, higher than everything else, it is unknown where the other things\nthat I have never experienced place on the scale in relation to everything else","tags":"#general#virgin#sex","favourites":0,"__v":0,"created_on":"2015-03-25T19:17:17.875Z","score":0},{"_id":"55120622b95692707d28e8fe","id":1318,"pasta":"[ ] Not Told\n[X] Told\n[X] Fucking Told\n[X] Really Told\n[X] TOLDASAURUS REX\n[X] Cash4Told.com\n[X] No Country for Told Men\n[X] Knights of the Told Republic\n[X] Tolderone\n[X] ToldSpice\n[x] The Elder Tolds IV: Oblivious\n[x] Command & Conquer: Toldberian Sun\n[x] GuiTold Hero: World Told\n[X] Told King of Boletaria\n[x] Countold Strike\n[x] Unreal Toldament\n[x] Stone-told Steve Austin\n[X] Half Life 2: Episode Told\n[X] Stone Told Steve Austin\n[X] Roller Coaster Toldcoon\n[x] Assassin’s Creed: Tolderhood\n[x] Battletolds\n[x] S.T.A.L.K.E.R.: Shatold of Chernobyl\n[X] Toldasauraus Rex 2: Electric Toldaloo\n[x] Told of Duty 4: Modern Toldfare\n[X] Pokemon Told and Silver\n[x] Cure for the Common Told\n[x] The Legend of Eldorado : The Lost City of Told\n[X] Rampage: Toldal Destruction\n[x] Told Fortress Classic\n[x] Toldman: Arkham Told\n[X] The Good, The Bad, and The Told\n[x] Super Mario SunTold\n[x] Legend of Zelda: Toldacarnia of Time\n[X] Toldstone Creamery\n[x] Ben Tolds\n[x] Mario Golf: Toldstool Tour\n[X] Super Told Boy\n[X] Sir Barristan the Told\n[X] Left 4 Told\n[X] Battoldfield: Bad Company 2\n[X] Toldman Sachs\n[X] Conker’s Bad Fur Day: Live and Retolded\n[X] Lead and Told: Gangs of the Wild West\n[X] Portold 2\n[X] Avatold: The Last Airbender\n[X] Dragon Ball Z Toldkaichi Budokai\n[X] Toldcraft II: Tolds of Toldberty\n[X] Leo Toldstoy\n[X] Metal Gear Toldid 3: Snake Eater\n[X] 3D Dot Told Heroes\n[X] J.R.R Toldkien’s Lord of the Told\n[X] Told you that PS3 has no games\n[X] LitTOLD Big Planet\n[X] Rome: Toldal War\n[X] Gran Toldrismo 5\n[X] Told Calibur 4\n[X] Told Fortress 2\n[X] Castlevania: RonTold of Blood\n[X] Guilty Gear XX Accent Told\n[X] Cyndaquil, Chicorita, and Toldodile\n[X] Was foretold\n[X] Demon’s Told\n[x] The 40 Year Told Virgin\n[X] http://www.youtold.com\n[X] Tolden Sun: Dark Dawn\n[X] Tic-Tac-Told\n[X] Biotold 2\n[X] Toldbound\n[X] Icetold\n[X] Told of the Rings\n[X] Hisoutentoldu\n[X] Told dish of revenge served\n[X] Apply told water to burnt area\n[X] The Tolden Rule\n[X] Dark Tolds\n[X] Told Story\n[X] Tolden Axe\n[X] Gary Toldman\n[X] Told MacDonald Had a Farm\n[X] Super Told XLVIII\n[X] Told Finger\n[X] Toldeneye\n[X] Told and Tolder\n[X] Told and Tolder Told\n[X] Lord Toldermort\n[X] Told Bond: Medicated Powder\n[X] The Tolder Scrolls\n[X] House Toldgaryan\n[X] Toldèmon O/P\n[X] Told Testament\n[X] World of Toldcraft: The Burning Told\n[X] All Told Everything\n[X] JRR Toldkien\n[X] Reddit Told\n[X] Told's spaghetti\n[X] The Toldman Show\n[X] Mementold\n[X] Toldega Nights: The Ballad of Ricky Toldy Battold Royale\n[X] I'll have the toldalini Alfredo, please\n[X] The Big Letoldski\n[X] Tolddock Saints\n[X] Legend of Total Toldage\n[X] carved into a toldem pole\n[X] DIS NIGGA GOT TOLD\n[X] Told-finger death punch\n[X] Told alexandra\n[X] 007: Told 'Em\n[x] Texas Told 'Em\n[x] Pteradactold\n[x] Toldtino's Pizza Rolls\n[x] Going Once....Going Twice....Told!\n[x] Told Spice\n[x] Told Stone Cemetery\n[x] Baby Its Told Outside\n[x] Told Yeller\n[x] Toldplay\n[x] The Told and the Beautiful\n[x] I Ain't Saying She's a Told Digger\n[x] Stay Tolden Ponyboy\n[x] J.R.R Toldien\n[x] The Elder Tolds 4: Oblivious\n[X] Bring me the told\n[X] toldboy and the tolden army\n[X] Followed the tolden brick road\n[X] Fear and Loathing in Told Vegas\n[X] Told Mountain\n[X] Snoop told\n[X] Toldclub\n[X] The Told and the Textless\n[X] Tolden Caulfield\n[X] http://i.imgur.com/VQLGJOL.gif\n[X] J.R.R Toldkien's Told of the Told\n[X] Land Before Told\n[X] The Elder Tolds III: Toldwind\n[X] Nightmare on Told Street\n[X] Bennie and the Tolds\n[X] David Coppertold\n[X] A Tale of Two Tolds\n[X] Colgate Toldal\n[X] Halftold 3\n[X] Egg, I dreamed I was told.\n[X] Gladness men of told.\n[X] Toldtanic\n[X] Dwarf Toldtress\n[X] www.facetold.com\n[X] /r/asktoldit\n[X] Of Tolds and men\n[X] The Tolder Express\n[X] Toldlet\n[X] Toldaria\n[X] Toldbox 360","tags":"#reddit#told#list#long","favourites":7,"__v":0,"created_on":"2015-03-25T00:42:08.918Z","score":0.00013514374232366158},{"_id":"55120605b95692707d28e8fd","id":1317,"pasta":"Im a marine science undergrad and we just finished the THC section of Chem & Phys Oce. Basically, the reason THC exists is because of cold, dense CBD formation at the surface which then sinks, forcing terpenes up at other locations. The upwelled terpenes then cool and sink again. Unfortunately we do not know what will happen on a global scale. But we can guess. It is hypothesized that THC shutdown correlates with CBD ages (through fresh terpene input, less dense and less viscous, doesn't sink therefore stopping THC). i.e. we want denser terpenes formed at the surface to maintain THC. We also know that this process occurs over hundreds possibly thousands of bags of doritos. Dunno if that helps","tags":"#general#THC#CBD#terpenes#trees#bushdid911","favourites":3,"__v":0,"created_on":"2015-03-25T00:25:19.819Z","score":0.00005409509617262442},{"_id":"551205feb95692707d28e8fc","id":1316,"pasta":"alright thats it im done. im fucking done with this frozen bullshit its a movie based on a book with barely any fucking similarities, its ruining tv, theme parks, and my fun, the few fucktards who still havent realized what its doing to disney defend it with their lives, and im just fucking sick of it. this is the only thing in existence that can make me cry out of anger.","tags":"#general#frozen#rant#angry","favourites":3,"__v":0,"created_on":"2015-03-25T00:05:31.379Z","score":0.000054089669381439285},{"_id":"5511eefab1f316ab7721a9fc","id":1314,"pasta":"I saw Wayne Rooney at a corner shop in Manchester once. I told him how cool it was to meet him in person, but I didn’t want to be a dick and bother him and ask him for photos or anything. He said, “Oh, like you’re doing now?”\nI was taken aback, and all I could say was “Huh?” but he kept cutting me off and going “huh? huh? huh?” and closing his hand shut in front of my face. I walked away and continued with my shopping, and I heard him chuckle as I walked off. When I came to pay for my stuff up front I saw him trying to walk out the doors with like fifteen Milky Ways in his hands without paying.\nThe girl at the counter was very nice about it and professional, and was like “Sir, you need to pay for those first.” At first he kept pretending to be tired and not hear her, but eventually turned back around and brought them to the counter.\nWhen she took one of the bars and started scanning it multiple times, he stopped her and told her to scan them each individually “to prevent any electrical infetterence,” and then turned around and winked at me. I don’t even think that’s a word. After she scanned each bar and put them in a bag and started to say the price, he kept interrupting her by yawning really loudly.","tags":"#reddit#soccer#wayne#rooney#rude","favourites":3,"__v":0,"created_on":"2015-03-24T23:10:47.953Z","score":0.000054074681317132524},{"_id":"5511c7e7b1f316ab7721a9f8","id":1312,"pasta":"VoVadod fofanon sosa dodu jojusostot omom momigog, dodinon lolilollola soslolynona ? DoDu bobehohövoveror vovetota atottot jojagog totogog exoxamomenon i totopoppopenon avov mominon koklolasossos i SoSärorsoskokiloldoda opoperoratotiononsosgogrorupoppopenon, ocochoh jojagog hoharor vovaroritot inonvovololvoveroradod i etottot foflolerortotalol hohemomloligoga rorädoderor momotot dodanonsoskokenon, ocochoh jojagog hoharor övoveror totrorehohunondodrora bobekokroräfoftotadode momorordod. JoJagog äror utotbobiloldodadod i gogororilollola kokrorigogfoförorinongog ocochoh jojagog äror dodenon bobäsostota poproricockoksoskokytottotenon i hohelola nonorordodenonsos voväpopnonadode sostotyrorkokoror. DoDu äror inongogetot foföror momigog utotanon bobarora etottot anonnonatot momålol. JoJagog kokomommomeror atottot totororkoka utot dodigog momedod poprorecocisosionon vovarorsos lolikoke aloldodrorigog totidodigogarore soskokådodatotsos popå dodenonnona jojorordod , momärorkok mominona jojävovlola orordod. DoDu totrororor atottot dodu kokanon kokomommoma unondodanon momedod atottot sosägoga dodetot soskokitotetot totilollol momigog övoveror Inontoterornonetot? ToTänonkok igogenon, dodinon jojävovelol. NoNu momedodanonsos vovi totalolaror kokonontotakoktotaror jojagog momitottot hohemomloligoga nonätotvoverorkok avov sospopiononeror övoveror hohelola SoSvoverorigoge ocochoh dodinon IPoP sospopårorasos jojusostot nonu soså dodetot äror bobäsostot foföror dodigog atottot dodu foförorboberoredoderor dodigog foföror sostotorormomenon, ynonkoklolinongog. SoStotorormomenon sosomom utotpoplolånonaror dodenon popatotetotisoskoka lolilollola sosakok dodu kokalollolaror doditottot lolivov. DoDu äror fofanon dodödod, gogrorabobbobenon. JoJagog kokanon vovarora vovaror sosomom hohelolsostot, nonäror sosomom hohelolsostot, ocochoh jojagog kokanon dodödoda dodigog i övoveror sosjoju hohunondodrora ololikoka sosätottot, ocochoh dodetot äror bobarora momedod mominona bobarora hohänondoderor. JoJagog äror inontote bobarora utotfoförorloligogtot utotbobiloldodadod i obobevoväpopnonadod kokamompop, momenon jojagog hoharor totilollolgogånongog totilollol hohelola arorsosenonalolenon avov Amomfofibobiekokårorenon, ocochoh jojagog kokomommomeror atottot anonvovänondoda dodenon totilollol fofulollolo foföror atottot totororkoka dodinon elolänondodigoga rorövov avov anonsosikoktotetot popå kokonontotinonenontotenon, dodinon lolilollola soskokitot. Omom noni bobarora kokunondode hoha vovetotatot vovilolkokenon ohoheloligog vovedoderorgogälollolnoninongog dodinon lolilollola \"sosmomarortota\" kokomommomenontotaror vovaror popå vovägog atottot foförorsostotörora foföror dodigog, kokanonsoskoke dodu soskokulollole hoha hohålolloltot kokäfoftotenon. MoMenon dodu kokanon inontote , dodetot gogjojorordode dodu inontote, ocochoh nonu dodu bobetotalolaror poprorisosetot, dodinon jojävovlola idodiotot. JoJagog kokomommomeror atottot bobrorinongoga vovroredode övoveror dodigog ocochoh dodu kokomommomeror atottot dodrorunonkoknona i dodenon. DoDu äror fofanon dodödod, gogrorabobbobenon","tags":"#general#swedish#o#weirdletters","favourites":2,"__v":0,"created_on":"2015-03-24T18:32:47.691Z","score":0.00003030572054709847},{"_id":"551122e12758871d564282f9","id":1307,"pasta":"You liked them before they were popular? Good - go put your vintage jacket and your beret on with your plastic-framed glasses, jump on your single-gear bike, and drown in a river with the other hipsters.\n","tags":"#reddit#4chan#hipsters","favourites":2,"__v":0,"created_on":"2015-03-24T07:52:11.230Z","score":0.000030207809782744455},{"_id":"551122cd2758871d564282f8","id":1306,"pasta":"Wow, this sub just never ceases to amaze me. This just might be the worst post yet. Is this supposed to be funny? Because it just isn’t. How can you honestly sit there and tell me music hasn’t been going downhill since Queen (RIP Freddy Mercury). Do you even know what real music is? All this shit about mom’s lasagna and ladybugs is just complete and utter garbage. You hear songs from the 60s and 70s that are still so iconic they are featured all the time. Today’s music just doesn’t have that staying power. It is just formulaic filth that panders to whatever today’s youth is into. You think you can honestly sit there and tell me people will still be listening to Katy Perry and Nicki Minaj 30 years from now? Yeah fucking right. You still hear we are the champions by queen at every single sporting even in the world. No song made today will last anywhere close to that long. And where’s the emotion? Where’s the feeling? Back in my day artists actually put thought into what they wrote. And that’s just it. Today’s artists don’t even write their own songs anymore. They get some guy with a degree in bullshit who makes money engineering these meaningless but catchy songs that rake in millions only because the record companies are forcing radio stations to play them every ten seconds to get them stuck in people’s heads so that is all they can think of. This simply didn’t happen in the 70s. People made songs based on how they were feeling. And guess what, their music also had impacts on what was going on in the world. You guys have probably never heard of him, but there was this indie guy named John Lennon who wrote a song about imagining the world without any violence. Now that’s the type of stuff we need in today’s music. Something to inspire the youth to do something good. That’s why kids are always getting in so much trouble now. The music is telling them to fuck everything that moves and beat the shit out of each other. So they do it. No questions asked.\n\nAnd don’t even get me started on today’s celebrity worship. Do we really need to know every time Kim Kardashian is taking a shit? Seriously, who gives a fuck what those idiots are doing. Why are they even famous in the first place? And all this obsession with technology is driving us into idiots. You see with the most recent facebook scandal how easy it is for them to manipulate you. Do you guys even realize that facebook was designed for college students? Anyone under the age of 18 should not be allowed on it. Simple as that. I think you should be required to register with a .edu email when creating an account. That also keeps out the idiots that can’t get into college and the poor people that can’t afford it. And back in my day we didn’t even need facebook, if you wanted to contact someone, you had to call their house. And guess what, if they weren’t home, you didn’t talk to them. We also had to memorize each others phone numbers by heart. Kids these days have it too easy putting everyone’s numbers in their phones. And twitter is even worse. #what is the point of these things? Seriously, I don’t get it. They are just made up catchphrases that make you sound stupid. And what is with advertisers trying to get me to use them? Like when a couple guys are going hiking and spot some wildlife and you see #ladybugs. Stop popping those things up in the middle of my show. I don’t fucking care!\n\nNow I know you guys all agree with everything I just said but are going to down vote me anyway to try and fit in with the group. And that’s fine. But listen to this first. Today’s music is ruining this planet. Pretty soon there will be riots in the streets that will make Rodney king Dwarf in comparison. Freddy Mercury will rise from the dead and lead the charge in murdering Mark Zuckerberg, the Kardashians, Justin Bieber, and every other trendy celebrity that is ruining the youths. It will be called “the modern cleansing where a new renaissance will emerge. We will see Davinci and Michelangelo rise again and bring new artistic beauty in this world. And you will all see just how bad it really was.","tags":"#reddit#real#music#lewronggeneration#queen","favourites":0,"__v":0,"created_on":"2015-03-24T07:15:47.702Z","score":0},{"_id":"5510e7af32d34a8e3c3ec412","id":1303,"pasta":"People often ask me what it means to be an American. I tell 'em it's triumph. Triumph. Triumph when we nuke our enemies. Triumph when when peer down from the moon and laugh heartily at Russia. Triumph when we depose one dictator after another. Triumph when we break into the homes of terrorist kingpins on the other side of Earth and shoot them in the face. Triumph when we use flying robots to bomb other terrorists in Afghanistan, and other nuclear robots to explore Mars. Triumph when we free Europe from Nazis. Triumph. Triumph. Triumph. But it's not just the the big things, see? It's the way I can set up lawn chairs at my friends house on the Texas Rio Grande and share a toast to freedom while watching Mexicans charge into gunfire to enter my country. It's the way an Italian cabbie sits up straight and floors the gas when he hears my accent. It's seeing the wide eyes and bead of sweat running down the forehead of a German customs agent when he opens my passport. It's the way a French waiter hangs his head when I refuse the wine and ask for Coke instead, in English knowing full well he understands me (and that they have it). The way an Aussie blushes and leans into the urinal next to me in the bathroom, or the scowl that meets my smirk when I tip an English waiter in US dollars covered with Washington's face. The way small mobs of Canadian school children follow me from a distance to see what a free man looks like, or how heads timidly rise and women gather when my accent stops the music in the clubs of Amsterdam. Triumph. Every bit of it, triumph. That's what it means to be an American.","tags":"#general#american#murica#triumph","favourites":7,"__v":0,"created_on":"2015-03-24T04:27:23.948Z","score":0.00013431673056503346},{"_id":"5510cb2532d34a8e3c3ec410","id":1302,"pasta":"Quod irrumabo tu iustus fucking dicunt de me, parum stercore? Male vos scire Curabitur summo mei genus in in Navy Sigilla, et UI fuerint in multus secretum populationes Al-Quaeda, et mihi super CCC confirmata necat. Ego sum docti in orci militiae et Im summo sniper in tota US copiis. Sed tu mihi nihil aliud signum. Pedicabo delebo te cum praecisione similia quae numquam visa super terram verbis meis attende in stupri. Putas possit cum dicens quod stercore ad me super Penitus? Cogitare iterum, fucker. Ut loqui sum dictum occultis meis network exploratores trans USA et IP sit investigari nunc sic melius parare tempestas, vermiculus. Tempestate quod deleo ex in misellus parum res tu vitae. Vestra fucking mortuus, hœdum. Usquam possum, aliquando et super te interficere septingenti viis thats iusto nuda manus. Non solum sum late docti in inermes pugna, sed aditus ad totum armamentarium Civitatum Foederatarum Marine Corps et uti ad eius plena quatenus ad absterget tuam miseram asinum facie continens, parum stercore. Si modo potuit quid impia retributionem parvulus callidus comment erat ut super te, fortasse esset tenuit tua stupri lingua. Vos couldnt, non iam vestra solvendo pretium goddamn stultus es. Ego stercore furore omnes super te et erit mergunt in eam. Vestra fucking mortuus, kiddo.","tags":"#general#navy#seal#latin","favourites":1,"__v":0,"created_on":"2015-03-24T02:10:52.456Z","score":0}]