[{"_id":"54c42d35ed70401f791aa716","id":542,"pasta":"░░░░░░░░▄▄▄▄▄ ░░░░░░░░▀▀▀██████▄▄▄ ░░░░░░▄▄▄▄▄░░█████████▄ U HAVE BEEN ░░░░░▀▀▀▀█████▌░▀▐▄░▀▐█ SPOOKED BY ░░░▀▀█████▄▄░▀██████▄██ THE SPOOKY ░░░▀▄▄▄▄▄░░▀▀█▄▀█════█▀ SANIC ░░░░░░░░▀▀▀▄░░▀▀███░▀░░░░░░▄▄ ░░░░░▄███▀▀██▄████████▄░▄▀▀▀██▌ ░░░██▀▄▄▄██▀▄███▀░▀▀████░░░░░▀█▄ ▄▀▀▀▄██▄▀▀▌████▒▒▒▒▒▒███░░░░▌▄▄▀ ▌░░░░▐▀████▐███▒▒▒▒▒▐██▌ ▀▄░░▄▀░░░▀▀████▒▒▒▒▄██▀ ░░▀▀░░░░░░▀▀█████████▀ ░░░░░░░░▄▄██▀██████▀█ ░░░░░░▄██▀░░░░░▀▀▀░░█ ░░░░░▄█░░░░░░░░░░░░░▐▌ ░▄▄▄▄█▌░░░░░░░░░░░░░░▀█▄▄▄▄▀▀▄ ▌░░░░░▐░░░░░░░░░░░░░░░░▀▀▄▄▄▀ ░▀▀▄▄▀SEND THIS TO 7 OTHER PEOPLE OR UR TOO SLOW﻿","tags":"#twitch#general#spooked#spooky#sanic#sonic#send","favourites":4,"__v":0,"created_on":"2015-01-24T23:29:12.693Z","score":0.00022287467181332735},{"_id":"54c332849f0237fc62377a2a","id":536,"pasta":"( ͡° ͜ʖ ͡°)","tags":"#twitch#general#le#lenny#face","favourites":5,"__v":0,"created_on":"2015-01-24T05:49:49.257Z","score":0.0002796944544235592},{"_id":"54c2e4c59f0237fc62377a1c","id":528,"pasta":"Calvin lay there in bed, next to his tiger. His fourteenth birthday was tomorrow. He was getting older, puberty striking at his mind, voice, and body. He kissed Hobbes on the cheek, puling him closer and thanking him for being his friend.\nThen it happened. It had been happening often since he was thirteen and he had no control over it. His erection tented his boxers, pressing against his friend's rump.\n\"Stop..\" Hobbes mumbled with a growl, pushing him away.\nCalvin turned onto his back, pulling his under shorts down and revealing his standing pillar, about five inches. Average, he figured.\nHe shook Hobbes awake. He didn't wake easily and grumbled and growled, but eventually sat up. \"What, Calvin?\" He asked angrily, wanting very much to go back to sleep.\n\"I love you.\"\n\"I love you too..\" Hobbes said awkwardly. 'What is this about?' He wondered.\n\"Do you really love me?\"\n\"Yeah, why?\" Hobbes sat up further, sleep forgotten.\n\"I want to mate with you..\" Calvin blushed.\n\"Wait! What? You're movin' with your auntie and uncle in Bel Air.\nI whistled for a cab and when it came near the liscence plate said \"fresh\" and had dice in the mirror. If anything, I could say that this cab was rare, but I though \"nah, forget it, yo home to Bel Air\"!\nI pulled up to the house at about seven or eight, yelled to the cabbie, yo homes, smell you later. Looked at my kingdom, and I was finally there, to sit on my throne, as the Prince of Bel Air.","tags":"#general#calvin#hobbes#prince#of#bel#air","favourites":0,"__v":0,"created_on":"2015-01-24T00:18:09.826Z","score":0},{"_id":"54c2c8e59f0237fc62377a14","id":526,"pasta":"EU was originally discovered when Walker texas ranger rode a horse across the atlantic and found himself there. he named it Eastern USA, or \"EU\" for short","tags":"#twitch#general#EU#USA#horse#east#walker#texas","favourites":5,"__v":0,"created_on":"2015-01-23T21:38:38.556Z","score":0.00027807122172663094},{"_id":"54c1da9415b4d6835b3394ec","id":515,"pasta":"if you’re reading this, you’ve been in coma for almost 20 years now. We’re trying a new technique. We don’t know where this message will end up in your dream, but we hope it works. Please wake up, we miss you.","tags":"#general#coma#20#years#dream#wake#up","favourites":6,"__v":0,"created_on":"2015-01-23T05:19:16.887Z","score":0.000331061780865326},{"_id":"54c1da7215b4d6835b3394ea","id":513,"pasta":"☆ ☆ ☆ ☆ ☆ ☆ AMERICA☆ ☆ ☆ ☆ ☆ ☆ ☆ ☆ ☆ Land of the Free and the Fat☆ ☆ ☆ Home of the Burger☆ ☆ ☆ ☆ RACISM, CRIME, AND EQUALITY FOR ALL (but black people)☆ ☆ ☆ ☆ The Strongest Rascals in the World ☆ ☆ ☆ Copy and paste this if your a fat, proud American 9/11","tags":"#general#twitch#MURICA#fat#burger#racism#crime","favourites":5,"__v":0,"created_on":"2015-01-23T04:39:52.784Z","score":0.0002747579643057488},{"_id":"54c1b6bb5764903a32880243","id":511,"pasta":"Have any of you guys ever watched Jeopardy, when they have the tournaments with the little kids? They're like 10-12 or some shit. Well, you know how all the non-age-specific questions (so not stuff like children's books/television) are so easy it's laughable? You know how there's not even a point in watching it because it's just boring?\nThe entire world is like that for me. I've never been officially IQ tested since I was a little kid, but that doesn't matter. I taught myself how to read when I was 18 months old, taught myself how to solve a Rubik's Cube when I was 5 or 6, and surpassed a college reading level by third grade. \"Gifted\" was thrown around a lot by my teachers. My mother once tested at IQ 160, and I am far above her. In my senior year, I took on my entire Genetics class in a Jeopardy-style tournament (9 buzzers against 1) and demolished them. I could continue to blather on about the myriad of ways I've proven myself to be of remarkably high intelligence, but there isn't any point.\nThe point is: the world just bores me. I routinely find myself encountering people who have problems, and it just amazes me how these ordinary people can be so unbelievably stupid. These people in my family, at my job, or wherever. I really feel like I'm working with small children, here. What do you MEAN you can't solve this minor engineering/craftsmanship/organization problem? I could have solved this when I was in kindergarten! How can you drive a car and pay your taxes and prepare food and other such tasks while being so ridiculously stupid?! Shouldn't your mind have collapsed in on itself because there is nothing in there?\nI just don't get it. The universe isn't filled with wonder or mystery or magic or any of that shit. It's all just boring. If I even give a half-ass attempt at something, I excel at it, and it's gotten to the point of total apathy. I hear or men who spend their entire lives trying to crack the secret of pleasuring women; well, I'm gay (more of a functional asexual these days, though) and one day in high school I got bored and figured that all out with a lesbian who had fallen in love with me. Everything is like that for me. That old adage about 10,000 hours to master something? Probably would only take me 100, though I've always gotten bored after reaching a position of reasonable skill after less than half that, so I quit and move onto something else.\nThe entire world is so boring that I've tired of it. The problems of the world are really quite simple, even matters like hunger, disease, war, poverty, etc. Solving them is so simple a child could do it, modified of course by the fact that all of it is prevented merely by human stupidity. I've long since moved on to solving problems in fictional universes because there are more variables. I'm the kind of guy you might see writing long-winded proofs that pick apart mindfuck plots and find the reasoning that nobody else can. Nonetheless, I am even starting to tire of that.\nI won't even pretend to claim that I've accomplished anything of note. Oh sure, I got bored one year and wrote a full-length novel that I consider technically better than anything ever written… but then people don't read books because they're well-written; they read them because they're filled with their teenage fantasies about sparkling sex vampires and magic schools and other such insipid nonsense. Well-written books aren't popular and they don't make the writer money; they're what your teacher makes you read in high school. Beyond that, however? I just don't care. I care about as much at excelling in this boring, boring world as you would care about a fat, steaming dog turd on the sidewalk. It's there, it's ugly, it fucking stinks, but it's not very interesting. You do your best to avoid it because it's not your problem. It's just a pile of shit that isn't worth your time.\nI am tired of living among babies who can barely figure out how to wipe their own ass. I am tired of being surrounded by fools. I am tired of being treated like a fool by people who assume my own intelligence is as pitifully limited as their own. I am tired of being able to see how the entire universe works, how every problem can be solved, and yet comprehending how deeply my own apathy toward it all is. I am tired of not mattering in a universe that does not matter.\nThe only thing that remains is wondering how much longer I can stand this exhausting boredom before I just pack up and leave.","tags":"#reddit#smartest#neckbeard#jeopardy#intelligence","favourites":0,"__v":0,"created_on":"2015-01-23T02:49:26.065Z","score":0},{"_id":"54c0876ae93bb9213040a1ef","id":479,"pasta":"I sexually Identify as a meme. Ever since I was a boy I dreamed of being uploaded onto the imgur website and linked into the reddit threads. People say to me that a person being a meme is Impossible and I'm fucking retarded but I don't care, I'm beautiful. I'm having a computer scientist put my brain into my computer like johnny depp in transendence, equipping me with the dankest of pictures from the internet. From now on I want you guys to call me \"Sir Danks-a-lot\" and respect my right to meme from above and meme needlessly. If you can't accept me you're a memephobe and need to check your internet privilege. Thank you for being so understanding.","tags":"#reddit#sexually#identify#meme#sir#danksalot#privilege","favourites":11,"__v":0,"created_on":"2015-01-22T03:38:22.690Z","score":0.0005794078110578344},{"_id":"54c0077c3b0a330105ff5cf1","id":453,"pasta":"( ͡° ͜ʖ ͡°) Every 60 seconds in Africa, a minute passes. Together we can stop this. Please spread the word ( ͡° ͜ʖ ͡°) ","tags":"#twitch#general#africa#60#seconds#stop#this","favourites":25,"__v":0,"created_on":"2015-01-21T18:35:06.240Z","score":0.0011942888707204842},{"_id":"54bfde0f3b0a330105ff5cb4","id":422,"pasta":" are you >implying every single joke on reddit hasn't been overdone 1000 times?\n\nclears throat\n\nTo be fair, I did nazi that coming. I came here to say this but boy, that escalated quickly so to the top with you! Lost it at 'This is why we can't have nice things' and then my faith in humanity was restored, my mind blown, and manly tears were shed. Well said. As a 'murican, I can confirm this gem has just won the internet and is doing it right. Just sayin', I know that feel, bro, and while that was a risky click, this post was a 9/10. 10/10 with rice xd, would read again. I see what you did there and it feels good man. You're doing God's work, son. I laughed way harder than I should have at your list that seems legit and totally nailed it. You - I like you. You magnificent bastard; you, sir, are so brave, a gentleman and a scholar, and seeing how you are a redditor for 4 years, this checks out, so I'll allow it. I regret that I only have one upvote to give for this cool story, bro. CTRL+F \"about tree fiddy\" was not disappointed. Wait, why do I have you tagged as \"NOPE NOPE NOPE\"? Nice try, you monster. What did I just read? Dafuq? I read that as \"YOU HAD ONE JOB\". I can't fap to this. No true scotsman could see that this relevant XKCD was bad, and you should feel bad. You must be new to reddit, so I'll see your cakeday and raise you a karma train. One does not simply rustle my jimmies, not even once. This stahp gave me cancer for science, so that's enough internet for me today. OP is a fag, 2/10, would not bang. What is this I don't even know how is this wtf? Circlejerk must be leaking. This will get buried but brace yourselves, some men want to watch the world burn right in the feels. When you see it, they'll KILL IT WITH FIRE! But this has nothing to do with atheism. Lawyer up, delete facebook, hit the gym, and SHUT UP AND TAKE MY MONEY, said no one ever, so you wouldn't download a strawman. Damn onions, you scary like a BOSS. whoosh. Since rule #1 is 'be attractive', I'll just leave this here: This is my [f]irst post, be gentle. I have the weirdest boner right now, so I'll be in my bunk with dat ass. Oh, you! ...now KISS!!! I know you should never stick your dick in crazy, but DM;HS. ...this kills the redditor.\n\nOP will surely deliver. op pls, pls op pls respond that link is staying blue.\n\nIn the meantime, I'll show myself out.\n\nDirected by M. Night Shamallama.\n\nAs long as the 'fad' for plagiarising other peoples' witty comments doesn't die out, I guess I'm cool.\n\n*edit: I accidentally a word\n\nthis community is fucking shit, every comment section of every top post has some variation of this garbage re-iterated as the top comment. and you unoriginal idiots upvote it like it's the punniest thing you have ever seen. low effort jokes all day long.\n\nedit: LOL THX FRONT PAGE POST OBLIGATORY XDDDDD\n\nactual edit: removed thanks for the gold.\n\nDank memes","tags":"#reddit#le#dank#memes#meta#implying#repost","favourites":14,"__v":0,"created_on":"2015-01-21T11:31:06.134Z","score":0.0007130301158052049},{"_id":"54bfd5893b0a330105ff5c9d","id":407,"pasta":"░░░░░░░░░░░░░░░░░░░░ ░░░░░░░░░░░░▄▀▀▌░░░░ ░░░░░░░▄▀█░░█▄▀░░░░░ ░░░▄▄▀▐▌░▐▌░█░░░▄▄▀▀▌ ░▀▀█░░█▄▄▀░░▄▄▀▀▌▄█▌▌ ░░░█░░░░░▄▀▀▄▄▐▒▌███▐ ░░░▀░░░▐▀▄█▀▀▒▒▒▌███▐ ░░▄▀▀▌░▐▐██▌▒▄▐▒▌███▐▀▐ ▐▀▄█▌▌░▐▐█████▐▒▌███▄█▐ ▐▐██▌▌░▐▐███▀▒▒▒▌████▀▐ ▐▐██▌▌░▐▐███▒▄▐▒▌█▀▄▄▀▀ ▐▐██▌▌▀▐▐█████▐▒▄▄▀░ ▐▐██▌▄█▐▐█▀▀▄▄▀▀░░░░ ▐▐████▀▐▄▄▀▀░░░░░░░░ ▐▐█▀▀▄▀▀░░░░░░░░░░░░ ▐▄▄▀░░░░░░░░░░░░░░░░ ","tags":"#general#ASCII#twitxh#top#lel","favourites":3,"__v":0,"created_on":"2015-01-21T09:09:05.570Z","score":0.00014961484128100597},{"_id":"54bfd5623b0a330105ff5c9c","id":406,"pasta":"ʷʰᵉᶰ ˢᵖᵃᵐ, ᵐʸ ᵗᵉˣᵗ ᵃᵘᵗᵒᵐᵃᵗᶦᶜᵃᶫᶫʸ ᵍᵒ ᵗᵒ ᵗʰᵉ ˢᵐᵃᶫᶫᵉˢᵗ ˢᶦᶻᵉ⋅ ᶦ ᶜᵃᶰ ᵐᵃˣᶦᵐᶦᶻᵉ ˢᵖᵃᵐ ᵖᵉʳ ᵖᶦˣᵉᶫ ᵃᶰᵈ ᶦᶰᶜʳᵉᵃˢᵉ ᵗʰᵉ ᵈᶦᶠᶠᶦᶜᵘᶫᵗʸ ᵗᵒ ʳᵉᵃᵈ ˢᵃᶦᵈ ˢᵖᵃᵐ ᶜᵃᵘˢᶦᶰᵍ ᶠʳᵘˢᵗʳᵃᵗᶦᵒᶰ ᵒᶠ ᵗʰᵉ ᵛᶦᵉʷᵉʳ⋅ ᵃᶫᶫ ᵇᵉᶜᵒᵐᶦᶰᵍ ᵐᵃˣᶦᵐᵘᵐ ᵉᶠᶠᶦᶜᶦᵉᶰᶜʸ⋅","tags":"#twitch#general#when#spam#text#smallest#size","favourites":0,"__v":0,"created_on":"2015-01-21T09:08:40.591Z","score":0},{"_id":"54bf52cc3b0a330105ff5c04","id":376,"pasta":"░░░░░░░░░░░░░░░░░░ ░░░░░░░░░▄░░░░░░░░░░░░░░▄ ░░░░░░░░▌▒█░░░░░░░░░░░▄▀▒▌ ░░░░░░░░▌▒▒█░░░░░░░░▄▀▒▒▒▐ ░░░░░░░▐▄▀▒▒▀▀▀▀▄▄▄▀▒▒▒▒▒▐ ░░░░░▄▄▀▒░░█░█▀▀▒▒▒█▒▒▄█▒▐ ░░░▄▀▒▒▒░░░▀▀█▀█░▒▒▒▀██▀▒▌ ░░▐▒▒▒▄▄▒▒▒▀▀▀░▀▒▒▒▒▒▒▀▄▒▒▌ ░░▌░░▌█▀▒▒▒▒▒████▀▀▀▀▀▀▀█▒▐ ░▐░░░▒▒▒▒▒▒▒▒████▒▒░░░▒▒▒▀▄▌ ░▌░▒▄██▄▒▒▒▒▒▒▒▒▒░░░░░░▒▒▒▒▌ ▀▒▀▐▄█▄█▌▄░▀▒▒░░░░░░░░░░▒▒▒","tags":"#twitch#general#nazi#doge","favourites":1,"__v":0,"created_on":"2015-01-21T07:04:47.118Z","score":0},{"_id":"54bf41e03b0a330105ff5be9","id":368,"pasta":"☑ “This guy's rig is CRAZY!” ☑ “My video card can't survive against a ubisoft game like that” ☑ \"He NEEDED precisely those dimm sticks to win\" ☑ “He built the only PC that could hold my framerate” ☑ \"He had the perfect gpu temp\" ☑ “There was nothing I could do” ☑ “TotalBiscuit hid his fov slider in the graphics menu perfectly\" ☑ \"What a peasant!\"","tags":"#general#twitch#pcmasterrace#peasants#checkboxes","favourites":0,"__v":0,"created_on":"2015-01-21T06:04:11.822Z","score":0},{"_id":"54bf40913b0a330105ff5be2","id":364,"pasta":"A liberal muslim homosexual ACLU lawyer professor and abortion doctor was teaching a class on Karl Marx, known atheist\n\n\"Before the class begins, you must get on your knees and worship Marx and accept that he was the most highly-evolved being the world has ever known, even greater than Jesus Christ!\"\n\nAt this moment, a brave, patriotic, pro-life Navy SEAL champion who had served 1500 tours of duty and understood the necessity of war and fully supported all military decisions made by the United States stood up and held up a rock.\n\n\"How old is this rock, pinhead?\"\n\nThe arrogant professor smirked quite Jewishly and smugly replied “4.6 billion years, you stupid Christian\"\n\n\"Wrong. It’s been 5,000 years since God created it. If it was 4.6 billion years old and evolution, as you say, is real… then it should be an animal now.\"\n\nThe professor was visibly shaken, and dropped his chalk and copy of Origin of the Species. He stormed out of the room crying those liberal crocodile tears. The same tears liberals cry for the “poor\" (who today live in such luxury that most own refrigerators) when they jealously try to claw justly earned wealth from the deserving job creators. There is no doubt that at this point our professor, DeShawn Washington, wished he had pulled himself up by his bootstraps and become more than a sophist liberal professor. He wished so much that he had a gun to shoot himself from embarrassment, but he himself had petitioned against them!\n\nThe students applauded and all registered Republican that day and accepted Jesus as their lord and savior. An eagle named “Small Government\" flew into the room and perched atop the American Flag and shed a tear on the chalk. \n\nThe pledge of allegiance was read several times, and God himself showed up and enacted a flat tax rate across the country.\n\nThe professor lost his tenure and was fired the next day. He died of the gay plague AIDS and was tossed into the lake of fire for all eternity.\n\nThe young soldier's name? Albert Einstein","tags":"#reddit#MURICA#republican#albert#einstein#evolution","favourites":5,"__v":0,"created_on":"2015-01-21T05:58:41.805Z","score":0.0002660043213717094}]