[{"_id":"551056d6e176d8400420cf51","id":1292,"pasta":"Nothing tops the Jolly Rancher story.\n\nSteve and his girlfriend Samantha went off to college in August. She went to Florida State, he went to Penn. So, she decides to fly to PA to visit him. He was really happy to see her so he decided to give her some oral action.\n\nHe had done this numerous times before and he always enjoyed doing it...but for some reason, this time, she smelled really horrible, and she tasted even worse. He didn't want to offend her though because he hadn't seen her in months...so he put a Jolly Rancher in his mouth to cover it up, even though it didn't do much to help.\n\nIn the course of eating her out, he accidentally pushed the candy inside of her... and stuck a finger in to grab it out. He took it out, and put it back into his mouth and bit it. Only...it wasn't the Jolly Rancher.\n\nIt was a nodule of gonorrhea.\n\nAs in, the blister-like structure that gonorrhea makes filled with diseased pus was the size of a fucking Jolly Rancher and the poor guy BIT it. I guess it was really dark in the room. He freaked out and started vomiting all over the place when it exploded in his mouth...\n\nHe demanded to know what was going on, turns out she had cheated on him at a club like, the first week of college, and fucked some random guy and the stupid bitch had no clue what was wrong with her. She noticed a strange smell though.\n\nSo now, Steve is freaking out that he now has gonorrhea of the mouth and God knows what else. ","tags":"#reddit#jolly#rancher","favourites":3,"__v":0,"created_on":"2015-03-23T17:19:14.612Z","score":0.00006099724166346868},{"_id":"551056b8e176d8400420cf4f","id":1290,"pasta":"☑ This guy's art is CRAZY!” ☑ “My autistic scribbles can't win against a da vinci like that” ☑ \"He NEEDED that color to win\" ☑ “He drew the only picture that could beat me” ☑ \"He had the perfect pencils ☑ “There was nothing I could paint” ☑","tags":"#general#hearthstone#kripp#checkboxes","favourites":1,"__v":0,"created_on":"2015-03-23T17:08:09.514Z","score":0},{"_id":"550f23ae2ab05ce134dd32f3","id":1286,"pasta":"I heard tap water has, like, 3 times more gluten than bottled water! My yoga instructor says gluten is really bad for your core. I talked to my astrologer about it and she said the only thing I can do about it is give her some hairs from my pet liger, an egg from my ostrich and a thousand bucks and she will take care of it. Phew, that was close. Like, don't even get me started! The beach traffic was so bad today I was late to my tanning appointment and they gave my spot to that bitch Chrystal. I actually had to go home and lay out by my pool and I totally couldn't relax because all those little seed pods kept falling off the palm trees into the jacuzzi. Totes suckage, ya know?\n","tags":"#general#bitch#tapwater#richpeople#lagirl","favourites":4,"__v":0,"created_on":"2015-03-22T19:32:54.572Z","score":0.00008489823460856},{"_id":"550f0af32ab05ce134dd32ef","id":1283,"pasta":"Domestically it's all about agenda 21..it's not fiction it's not a conspiracy..it's a very scary future..I believe you guys understand that this 2 party system is bringing us there willingly...the democrats want it..the republicans say they don't but that's bullshit..homeland security and the u.n. are warning about right wing constitutional extremist groups but there not saying anything about left wing extremist because it's all about complimenting a world government and that view point of there's fulfills there agenda..I don't understand all you guys are very intelligent and tech savvy, don't see it..that you actually go along with there brain washing and mind control techniques and tow the n.w.o status quo..I don't know everything or I'm always right but this really is self evident and you guys are just carrying the water for them..it's a shame, a fucken shame","tags":"#general#conspiracy#agenda#21","favourites":0,"__v":0,"created_on":"2015-03-22T14:13:26.370Z","score":0},{"_id":"550e74112ab05ce134dd32e3","id":1280,"pasta":"I cringed so hard my skin slithered off my body, slapped me in the face and then ran away... but you have to admit, those were some dank memes.","tags":"#general#cringe#dank#memes","favourites":6,"__v":0,"created_on":"2015-03-22T07:33:04.970Z","score":0.00012943220081761378},{"_id":"550e58f22ab05ce134dd32de","id":1278,"pasta":"This one is my favourite modified version though: What the fuck did you just fucking say about my gear, you little n00b? I’ll have you know I am a lvl 90 Undead Arcane Mage, and I’ve won so many PVP matches, and I have done raids on every 10 man heroic dungeon. I also have a fuckton of macros and I have a GS of 10K. You are nothing to me but just a lvl 12 gnome hunter. I will pwn the fuck out of you with Arcane Missiles the likes of which has never been seen before on Azeroth AND Outland, mark my fucking words. You think you can get away with saying that shit to me over raid? Think again, fucker. As we speak I am contacting my guild of mages and shamans across The Eastern Kingdoms and your character is being targeted right now so you better prepare for the ownage, n00b. The Arcane Barrage that wipes out the pathetic little thing you call your character. You’re fucking pwn’d, n00b. I can be anywhere, anytime, and I can kill you in over seven hundred ways, and that’s just with my secondary talent tree. Not only am I extensively trained in Arcane magic, but I have access to the entire arsenal of Fire magic and I will use it to its full extent to wipe your miserable neckbeard off the face of Azeroth, you little faggot. If only you could have known what unholy retribution your little “clever” comment was about to bring down upon you, maybe you would have held your fucking tongue. But you couldn’t, you didn’t, and now you’re getting debuffed, you goddamnn00b. I will shit Dragon’s Breath all over you and you will burn in it. You’re fucking pwn’d, faggot.","tags":"#general#navy#seal#wow#arcane#mage","favourites":0,"__v":0,"created_on":"2015-03-22T05:53:51.094Z","score":0},{"_id":"550e138c2ab05ce134dd32cd","id":1270,"pasta":"I sexually Identify as a Dank Meme. Ever since I was a boy I dreamed of dropping dank memes on disgusting foreigners. People say to me that a person being a meme is undank and I'm fucking retarded but I don't care, I'm dank. I'm having a plastic surgeon install troll faces, gnomes and dank kush 420 on my body. From now on I want you guys to call me maymay and respect my right to make dank maymays. If you can't accept me you're a memephobe and need to check your gnome privilege. Thank you for being so understanding.","tags":"#general#sexually#identify#dank#meme","favourites":6,"__v":0,"created_on":"2015-03-21T22:48:47.775Z","score":0.00012905818269023334},{"_id":"550dcf942ab05ce134dd32cb","id":1269,"pasta":"You will know the light from the dark when you are calm, at peace. Passive. A Jedi uses the Force for knowledge and defense, never for attack.\n\nLuminous beings are we… not this crude matter.\n\nTrain yourself you must, to let go of everything you fear to lose. Do. Or do not. There is no try.\n\nDoubles. Triples. A Jedi craves not these things.\n\nYet, a Jedi’s strength flows from the Force. But beware of the dark side. Anger, fear, aggression; the dark side of the Force are they. Easily they flow, quick to join you in a fight. If once you start down the dark path, forever will it dominate your destiny, consume you it will, as it did Darth Bateman.\n\nOn many long journeys have I gone. And waited, too, for others to return from journeys of their own. Some return; some are broken; some come back so different only their gets remain.\n\nBlind we are, if creation of this get we could not see. \n\nSo check them you must.","tags":"#4chan#dubs#get","favourites":0,"__v":0,"created_on":"2015-03-21T19:30:39.909Z","score":0},{"_id":"550dcf542ab05ce134dd32c7","id":1265,"pasta":"Recently I started to like covering myself in stale feces and masturbating. Almost every morning I walk around my neighborhood with a large black garbage bag and collect all the crap I see. It takes a whole day to get two bags full of shit. But it all pays off when I come home after a hard day, go to the bathroom, turn on the hot water and…mmm, pour all the crap into the bathtub. And then I masturbate, imagining that I’m being devoured by all the feces. All in all, I think, that poo has its own mind, each pile of shit has its own family, place, feelings, we shouldn’t just flush them down the toilet, we should take care of them, talk to them, pet them… And you know what, I had a wonderful dream while lying in the bathtub yesterday, I dived into the sea and it turned into shit, fish, seaweed, jellyfish, everything turned into poo, even the sky, Allah himself. ","tags":"#general#stale#feces#shit#crap#masturbating","favourites":1,"__v":0,"created_on":"2015-03-21T12:59:04.944Z","score":0},{"_id":"550dcf282ab05ce134dd32c6","id":1264,"pasta":"your mother makes 76 an hour being f ucked by me, she has been unemployed for twelve moths, last month her revenue was 6969,69 only working on my dick for 3 minutes an hour. check out\nʏᴏᴜ ᴄᴀɴ ᴛʀʏ ᴛʜɪs ᴏᴜᴛ\n\n\n►►►►►► IFXCKEDYOURMUM.COM","tags":"#general#mother#fucked#revenue","favourites":1,"__v":0,"created_on":"2015-03-21T12:34:07.230Z","score":0},{"_id":"550dcf022ab05ce134dd32c5","id":1263,"pasta":">my face when Brits call urban bayzil \"salad\"\n>my face when Brits call double triple chocolate nipple \"biscuits\" \n>my face when Brits call jabroni macaroni \"pasta\"\n>my face when Brits call hangout houses \"pubs\"\n>my face when Brits call flippity-faucets \"taps\"\n>my face when Brits call say \"Hello\" instead of \"Howdydoody shooty shooty\"","tags":"#4chan#mfw#brits","favourites":0,"__v":0,"created_on":"2015-03-21T19:14:33.770Z","score":0},{"_id":"550d1a962ab05ce134dd32bc","id":1262,"pasta":"Dear Senpai, you still ain't noticed me, I hope I have a chansu... I ain't mad - I just think it's FUCKED UP you ignore my romansu...\nIf you didn't wanna talk to me inside the comments, you didn't have to... but you coulda liked my picture comment showing my pantsu!\nThey're blue and stripy man, at the front they got a little bow.\nI linked it in Private messages for you, for hours and you just said \"lolno.\"\nThat's pretty shitty man - you're like my fucking crush!\nI want you to be inside me senpai, I want to make you gush!","tags":"#general#anime#senpai#pantsu","favourites":6,"__v":0,"created_on":"2015-03-21T06:50:04.746Z","score":0.00012837925768816212},{"_id":"550cd6e52ab05ce134dd32b8","id":1260,"pasta":"▉▉▉▉▉▉◤┳◥▉▉▉▉▉▉ You have been visited by the Loominati.\n▉▉▉▉▉◤┳┻┳◥▉▉▉▉▉\n▉▉▉▉◤┳┻┳┻┳◥▉▉▉▉ Copy and paste this on the walls of the 5\n▉▉▉◤┳━┳━┳━┳◥▉▉▉ \n▉▉◤┳┃┈╰━╯┈┃┳◥▉▉most MLG m80s you know or you \n▉◤┳┻╰━━━━━╯┻┳◥▉ \n◤┳┻┳┻┳┻┳┻┳┻┳┻┳◥﻿ will be qu1cksc0p3d by #FaZe Clan","tags":"#general#illuminati#cod#noscope#faze","favourites":4,"__v":0,"created_on":"2015-03-21T02:15:34.942Z","score":0.00008374652912323823},{"_id":"550cd6d12ab05ce134dd32b7","id":1259,"pasta":"Imagine you have never heard a joke before. Now tell me this. Why did the chicken cross the road?\nThe answer, as you would know from the joke, is to get to the other side. But is this not a joke at all, but a serious statement? This is an anti-joke. It is a lead-up of a joke that ends up being a huge let down of seriousness in the end.\nJust like your birth.﻿","tags":"#general#youtube#joke#antijoke","favourites":6,"__v":0,"created_on":"2015-03-21T01:30:45.308Z","score":0.00012815455084478047},{"_id":"550cc5d32ab05ce134dd32b4","id":1258,"pasta":"It is a scientific fact that jet fuel burns from anywhere around 400°C to 800°C. This is sufficient to burn or otherwise melt most physical objects. However, dank memes are simply an abstract idea. It is impossible to destroy dank memes (unless you are a nazi mod) and so therefore we can conclude that no, jet fuel can't melt dank memes.","tags":"#general#jet#fuel#melt#dank#memes","favourites":4,"__v":0,"created_on":"2015-03-21T01:13:41.664Z","score":0.00008371811777873957}]