[{"_id":"55922d8fdd62532d34ee3733","id":1824,"pasta":"DO IT, just DO IT! Don't let your dreams be dreams. Yesterday, you said tomorrow. So just. DO IT! Make. your dreams. COME TRUE! Just... do it! Some people dream of success, while you're gonna wake up and work HARD at it! NOTHING IS IMPOSSIBLE!You should get to the point where anyone else would quit, and you're not gonna stop there. NO! What are you waiting for? ... DO IT! Just... DO IT! Yes you can! Just do it! If you're tired of starting over, stop. giving. up.","tags":"#general#shia#leboeuf#motivational#just#do#it","favourites":50,"__v":0,"created_on":"2015-06-30T03:38:01.367Z","score":0.003288319647545154},{"_id":"55922d73dd62532d34ee3732","id":1823,"pasta":"<:::::[]=¤༼ຈل͜ຈ༽ﾉ FOR THE WATCH","tags":"#twitch#general#ASCII#for#the#watch","favourites":12,"__v":0,"created_on":"2015-06-29T07:09:21.306Z","score":0.0009285510271376987},{"_id":"558f794e7bc415727ec982f3","id":1821,"pasta":"─────────────────────────▄▀▄  \n─────────────────────────█─█  \n─────────────────────────█─█  \n─────────────────────────█─█  \n─────────────────────────█─█  \n─────────────────────────█─█  \n─────────────────────────█─▀█▀█▄  \n─────────────────────────█──█──█  \n─────────────────────────█▄▄█──▀█  \n────────────────────────▄█──▄█▄─▀█  \n────────────────────────█─▄█─█─█─█  \n────────────────────────█──█─█─█─█  \n────────────────────────█──█─█─█─█  \n────▄█▄──▄█▄────────────█──▀▀█─█─█  \n──▄█████████────────────▀█───█─█▄▀  \n─▄███████████────────────██──▀▀─█  \n▄█████████████────────────█─────█  \n██████████───▀▀█▄─────────▀█────█  \n████████───▀▀▀──█──────────█────█  \n██████───────██─▀█─────────█────█  \n████──▄──────────▀█────────█────█ Look son!  \n███──█──────▀▀█───▀█───────█────█ A Retard!  \n███─▀─██──────█────▀█──────█────█  \n███─────────────────▀█─────█────█  \n███──────────────────█─────█────█  \n███─────────────▄▀───█─────█────█  \n████─────────▄▄██────█▄────█────█  \n████────────██████────█────█────█  \n█████────█──███████▀──█───▄█▄▄▄▄█  \n██▀▀██────▀─██▄──▄█───█───█─────█  \n██▄──────────██████───█───█─────█  \n─██▄────────────▄▄────█───█─────█  \n─███████─────────────▄█───█─────█  \n──██████─────────────█───█▀─────█  \n──▄███████▄─────────▄█──█▀──────█  \n─▄█─────▄▀▀▀█───────█───█───────█  \n▄█────────█──█────▄███▀▀▀▀──────█  \n█──▄▀▀────────█──▄▀──█──────────█  \n█────█─────────█─────█──────────█  \n█────────▀█────█─────█─────────██  \n█───────────────█──▄█▀─────────█  \n█──────────██───█▀▀▀───────────█  \n█───────────────█──────────────█  \n█▄─────────────██──────────────█  \n─█▄────────────█───────────────█  \n──██▄────────▄███▀▀▀▀▀▄────────█  \n─█▀─▀█▄────────▀█──────▀▄──────█  \n─█────▀▀▀▀▄─────█────────▀─────█  \n─█─────────▀▄──▀───────────────█  ","tags":"#reddit#ASCII#look#son#a#retard","favourites":109,"__v":0,"created_on":"2015-06-28T04:34:18.432Z","score":0.006076592787899315},{"_id":"558e46b663aff1a558465efd","id":1815,"pasta":"L.M.F.A.O.\n\nYa'll are some truly epic Johnsons... Seriously, I'm thinking ya'll are from the former U.S.S.R and you're communists. You have the communist behavior down to a T. Instead of taking the feedback and fixing your suck ass sub, you ban people who point out to you that your top posts are quite often a 50/50 mix of reposts from YOUR OWN  FUCKING SUB (bwaaahhahahahahahahahahahaha, it takes a special kind of incompetent fuckup to pull that off, as in full-on retarded communistic party boss suckup.)\n\nI saw in a note from one of you communistic Johnsons claiming to be American \"in the army\" but I don't believe it for a second. The American Army doesn't breed incompetent, inbred communistic fuckups like that Johnson obviously is. That Johnson is as communist as they get... I am guessing his dad is an ex-communist party boss or KGB middle management, based on the 4th grade level he writes and communicates at.\n\nAnyways comrades, have a good one. I hope you figure out a way to get your collective heads out of your collective, shared asshole so you can focus on doing your job, rather than banning people for pointing out your incompetence. \n\nThen maybe you can take a shit sub that is a pain in the neck to use, and turn it into something somewhat usable. I won't hold my breath too long though, because I know you'll need to run any ideas that have some semblance of making sense back through K.G.B/HQ/comrade party boss and your dear leader. Doing that will involve you all spending a lot of time on your knees, sucking ass. Given how much all you all communists love kissing and sucking the party bosses ass, I understand that it could be awhile before we see any improvements. ","tags":"#reddit#banned#commie","favourites":1,"__v":0,"created_on":"2015-06-26T12:09:59.571Z","score":0},{"_id":"558e468e63aff1a558465efc","id":1814,"pasta":"You're joking right? Cuz you MUST be fucking joking..Those are GREEN ONIONS you FUCKING IDIOT! That may have been the single stupidest thing I've ever seen written in my entire life. I'm a chef, 16 years, I have 675 restaurants in and around the greater portland area, yea.. thats right.. all the restaurants, they're all mine...and I have to wake up and see this garbage sully my masterpiece post. I'm debating whether or not to delete this thing just so other people don't have to read that and squirm with discomfort knowing that there are people like you who eat food. You think you know food? You would't last 19 days in my kitchen. I'm so upset with you, seriously. CHIVES are Herbs, GREEN ONIONS are ONIONS. Don't you know that? Don't you? Well now you do, you shit! Unbelievable.","tags":"#reddit#food#onion#onions","favourites":10,"__v":0,"created_on":"2015-06-25T11:42:25.538Z","score":0.0007223896310723675},{"_id":"558e468b63aff1a558465efb","id":1813,"pasta":"HE!1!!!!!!11!!!!!!!!!!!!!!!!!!1111111111!!11 KEK!! KEK!! KEK!!\nWHATA Meme MAN xD i just fall of my chair cuz i couldnt and i CANT stop laugh xDXDXDXDXDDDDDXXXXXXDDDDDD OMGOSH DDDDDXXXXXDDDDD DDDDDD LOOOOOOOLLLLL I CANT JUST STOP LAUGHING CAUSE HE HE HE HE HE JUST TO FUNNY MAN!!!1!11!\nHOOOOOOOOLLLLLLYYYYY poo i just fall of chair!!!! simply le epic so ebin dae le epin win xD pwn’d ftw le bacon narwhale xP upboated good sir i tip my fedora to you! tips fedora, le any1 athiest? LOL\nGOOD MEME\nSORRY I MEAN\nGREAT MEME\nGR88888 MEME BRO I WISH I COULD STOP LAUGHING BUT I CANT MAN!!!!\nNICE MEME IMMA REPOST TO REDDIT LELELELELE TY FOR LE KARMA XDDDDDDDDDDDDDDDD\nXD\nLE UPBOAT\nXD\nWAIT TIL LE DERPINA HEARS ABOUT THIS\nXDDDDDDDDDDDDDDDDDDDDDD\nEPIC MEMEING /b/ro BAZINGA BAZINGA BAZINGAAAAAAAAAAAAAAAAA ZIMBABWE is this a le new epic meme? screen kapped for dat sweet karma xD. FUS ROH DAH!!!!!1 i used to be a christmas but then i took an arrow 2 da knee : BAZINGA BAZINGA ZIMBABWE. top kek, toppest of keks. le nyan cat? hahahaha le mayonaise. epic meme i love that meme so much man wait let me just gets crack pipe out smoke some of that good 420: rips a bongAHHHHHHHHH YES!!!!!!!!!!!!!!!\nthat sure hit the spot ok now repeat that epic M E M E","tags":"#reddit#cancer#weeaboo#nerd","favourites":55,"__v":0,"created_on":"2015-06-25T11:39:00.935Z","score":0.003215207407509067},{"_id":"558e468663aff1a558465efa","id":1812,"pasta":"    a y y a     l    \n          y     m  \n          y     a \n    a y y l m a o  \n    y     m     \n    y     a     \n    a     o a m l  ","tags":"#reddit#ayy#lmao#nazi#swastika","favourites":6,"__v":0,"created_on":"2015-06-27T06:43:46.268Z","score":0.0004601182994317175},{"_id":"558e465263aff1a558465ef7","id":1809,"pasta":"There once was a niggery jew\nWhen asked to unb& said \"fuck you\"\nHe yanked on his peepee\nAnd stroked his fat belly\nI can't rhyme, fuck you, unban me","tags":"#4chan#unban#reddit","favourites":2,"__v":0,"created_on":"2015-06-26T01:33:21.520Z","score":0.0001172002920887982},{"_id":"5589fe272a7929bd7a8b1f84","id":1798,"pasta":"    Gomenasai, my name is Adolf-Sama.\n\n    I’m a 43 year old German Otaku (Anime fan for you gaijins). I draw Anime and Manga on my tablet, and spend my days perfecting my art and playing superior Japanese games. (Disgaea, Final Fantasy, Persona series)\n\n    I train with my Katana every day, this superior weapon can cut clean through steel because it is folded over a thousand times, and is vastly superior to any other weapon on earth. I earned my sword license two years ago, and I have been getting better every day.\n\n    I speak Japanese fluently, both Kanji and the Osaka dialect, and I write fluently as well. I know everything about Japanese history and their bushido code, which I follow 100%\n\n    When I get my Japanese visa, I am moving to Tokyo to attend a prestigious High School to learn more about their magnificent culture. I hope I can become an animator for Studio Ghibli or a game designer!\n\n    I own several kimonos, which I wear around town. I want to get used to wearing them before I move to Japan, so I can fit in easier. I bow to my elders and seniors and speak Japanese as often as I can, but rarely does anyone manage to respond.\n\n    Wish me luck in Japan!","tags":"#general#Hitler#Hitlersama#Otaku","favourites":9,"__v":0,"created_on":"2015-06-21T23:14:20.627Z","score":0.0006089122790926592},{"_id":"5589fe212a7929bd7a8b1f83","id":1797,"pasta":"I don't appreciate your insensitivity and lack of respect towards my religion.\nIn case you don't know, we the Christians of America are facing one of the worst tragedies of the history of mankind right now, and your misuse of the Lord's name in this moment comes across as bigoted, hateful, and seems like a celebration of the deaths of so many Christians.\nI righteously command you to edit your hateful remarks from your comment, in case you don't want me to report this sub to the admins and get it banned for harassment.\nSincerely\n-Your friendly Reddit Christian, that is currently facing an excruciating time with his brothers and sisters.","tags":"#reddit#religion#christian#tragedies#oppressed#banned","favourites":3,"__v":0,"created_on":"2015-06-21T22:45:59.963Z","score":0.00019171958016055612},{"_id":"5589fde82a7929bd7a8b1f82","id":1796,"pasta":"Nani the fuck did you just fucking iimasu about watashi, you chiisai bitch desuka? Watashi’ll have anata know that watashi graduated top of my class in Nihongo 3, and watashi’ve been involved in iroirona Nihongo tutoring sessions, and watashi have over sanbyaku perfect test scores. Watashi am trained in kanji, and watashi is the top letter writer in all of southern California. Anata are nothing to watashi but just another weaboo. Watashi will korosu anata the fuck out with vocabulary the likes of which has never been mimasu’d before on this continent, mark watashino fucking words. Anata thinks anata can get away with hanashimasing that kuso to watashi over the intaaneto? Omou again, fucker. As we hanashimasu, watashi am contacting watashino secret netto of otakus across the USA, and anatano IP is being traced right now so you better junbishimasu for the ame, ujimushi. The ame that korosu’s the pathetic chiisai thing anata calls anatano life. You’re fucking shinimashita’d, akachan.","tags":"#reddit#anime#weeaboo#navy#seal","favourites":14,"__v":0,"created_on":"2015-06-21T07:39:35.342Z","score":0.0009008138760697858},{"_id":"55864e295690838c060c5cdd","id":1786,"pasta":"SHAME SHAME SHAME 🔔🔔🔔","tags":"#general#game#of#thrones#shame#bell","favourites":2,"__v":0,"created_on":"2015-06-21T05:39:22.941Z","score":0.00010607891180142352},{"_id":"55864e125690838c060c5cdc","id":1785,"pasta":"Hello M'lady *tips fedora*. I was just riding my classy powerchair through your steam page and noticed your beautiful anime features. Message me on reddit (u/IncredibleAtheistIntellectual) and we can talk about feminism or fundies! You could possibly be my next waifu :O if you are up to the challenge of serving my every need (because I am a nice guy).\n\nBest Wishes,\nu/IncredibleAthiestIntellectual\n\nP.S. sorry for any typos, my keyboard is slightly stiff from cheeto dust and neckbear hairs.","tags":"#gentlesir#tips#fedora#steam#reddit#neckbeard","favourites":20,"__v":0,"created_on":"2015-06-20T12:33:50.978Z","score":0.0012166171416546764},{"_id":"5584be91e9db9a1f6c8f8284","id":1782,"pasta":"THE HALLOWED ONE, THE MASTER OF CELLPHONES, THE KING OF BATTERIES, THE SULTAN OF BUTTONED PHONES, THE TSAR OF TELECOMMUNICATIONS, THE SLAYER OF ALCATEL, THE CAPTAIN OF THE INDUSTRY, THE CHAMPION OF THE PEOPLE THE ONE AND ONLY NOKIA IS BACK TO MAKING PHONES!!!","tags":"#general#nokia","favourites":2,"__v":0,"created_on":"2015-06-18T22:32:37.587Z","score":0.00010143576825809684},{"_id":"5584be85e9db9a1f6c8f8283","id":1781,"pasta":"Careful what you say asshole! Do you know where my dad works? Yeah, down at the cannery. He's one of the whoop-ass guys on the whoop-ass line. He sits there all day adding a bunch of whoop to some asses, and putting it in a can. It's a union job. Has decent benefits. My family gets our dental insurance through the whoop ass canning job. I mean, it's not super well paying or anything. He drives around in a camery, but his license plate says \"WHP A55\", where the 5's are supposed to be S's. Anyways, twice a year, he gets allotted a case or two of cans of whoop ass. Normally he uses them on my big brother, who's trying out for some arena football team in the next town over. He says it's his big ticket to the pros, so he doesn't have to work the whoop ass line. But, my brother always saves me a couple of cans, so I am prepared to open one or two. SO WATCH YOUR FUCKING MOUTH!","tags":"#reddit#whoop#ass#canning","favourites":38,"__v":0,"created_on":"2015-06-18T15:39:27.562Z","score":0.0020447743454070494}]