[{"_id":"5584be60e9db9a1f6c8f8281","id":1779,"pasta":"         ☝\n           ＼＼  \n             ＼＼  \n               ＼(ಠ益ಠ)\n                /     \\\n               /     へ＼\n             /     /   ＼＼\n            /    ノ      ヽ_つ   ayy  lmao\n           /   / \\\n          /   / \\  \\\n         (   /   \\  \\\n         |  |      \\ ＼\n         | 丿       ＼⌒)\n         | |         ) /\n         /  )        Lﾉ﻿\n        |  /\n        Lﾉ﻿               ","tags":"#general#ASCII#ayy#lmao","favourites":11,"__v":0,"created_on":"2015-06-19T12:44:33.524Z","score":0.0006989822613994696},{"_id":"558232bf2120570651f0ae31","id":1773,"pasta":"lmao. you're such a faggot dude. go fuck myself? wow really got me there dude, really hurt my feelings. I'm glad you think you're protecting and serving the internet. Jesus christ you should be a comedian. The neck beard virgin one made you cry too? must really hit at home for that one. since you're such a good person you should invite all the local hoodlums and criminals to your (mom's) house for the holidays, see how that goes. Im sure your good faith and beliefs in people would keep you and your poor mother safe. have fun being a faggot your whole life, good thing I subscribe to the sub on my mobile account I'm sure we will talk again soon","tags":"#reddit#buttmad#banned","favourites":9,"__v":0,"created_on":"2015-06-17T19:14:38.886Z","score":0.0005615513222243705},{"_id":"557e4258b0d7a73e4c787bdc","id":1767,"pasta":"Mr. 4.0 STEM major casually walks to the front of the line of a very exclusive club.\n\n\"Sir, you'll have to go to the back of the line,\" the bouncer says.\n\nMr. 4.0 STEM major pulls out a card. \"I believe this says otherwise,\" he says. The card is a miniaturized version of his college transcripts.\n\nThe bouncer reads over the card and his cheeks become flushed. \"S-sorry, sir. Go right in.\"\n\nMr. 4.0 STEM major chuckles as he plucks the card from the bouncer's hands. He walks inside the club. \"He was probably a Liberal Arts major,\" he thinks.","tags":"#reddit#stem#liberal#arts#STEMmasterrace","favourites":3,"__v":0,"created_on":"2015-06-15T03:11:13.206Z","score":0.00016837853614564584},{"_id":"557b63257d2300ce44f0cf07","id":1761,"pasta":"Reddit has gone to complete shit lately.This site used to be so promising and felt so free, but has now became what I hate most. A censored up, circle jerk, reposting, social media machine that bows to the demands of fat, tublr, SJWs. Several of sub reddits have gone private due to the moderators not agreeing with the admins that censored other subs. While I agree with the mods of those subs that censorship is not what this site needs, they too have ruined the experience. Either you allow all content (within legal means) or don't have any content at all. I no longer want to be a part of this site now that the CEO and Admins feel the need to water down reddit to make it seem more PC. FUCK YOU ADMINS! You ruined this site and now i am looking for an alternative that shares the same values that reddit used to.\nEllen Pao recently said \"It's not our site's goal to be a completely free-speech platform.\" I hope she dies along with all the fat, tumblr, mouth breathers that she made feel \"safer.\"\nIt would have never came to this had she just left this fucking site alone.\nCannot wait for voat.co to be stable, in the meantime I am going to throw gas on this fire and watch reddit burn!","tags":"#pao#reddit#fatpeoplehate#drama","favourites":3,"__v":0,"created_on":"2015-06-12T13:37:29.774Z","score":0.0001608786167402779},{"_id":"5579f2797d2300ce44f0ceff","id":1757,"pasta":"For months now you've seen it here and there. \"Hategroup GamerGate uses excuse of ethical gaming journalism to harass women out of gaming.\" *\"Whatever\"*, you think. Sure, gaming journalism sucks, but that seems like a mess, so I'm not getting involved. Or maybe you don't think gaming journalism is relevant anymore, and your solution is to just not go to any of these sites. Why raise a fuss? Or maybe you thought it was a cause worth getting invested in, but too many bad eggs in the bunch ruined it. Why care? Why put forth the effort? It'll die down. It's the internet. \n\nNow you've seen why it does matter. As many people on KotakuInAction have learned, this goes far beyond gaming journalism. Some people will argue that GamerGate is only just about that, and this attached culture war is only connected in small ways. However, as GamerGate drew on and on, we saw first hand just how far this network spreads. It woke many of us up. I never liked the term \"taking the red pill\" because it seemed to make it more dramatic than it really seemed, but after being exposed to everything, that's exactly what it is. There's a moment in this mess where suddenly, all those more outlandish claims became true, and even went beyond what people said. Many times, truth was stranger than fiction. \n\nOur opposition is corrupt. They are liars. They are opportunists. They have power. They are privileged. They take up the banner of \"Social Justice\" and make the people who don't have power, believe they are in the situation they're in because of their race, their gender, or their sexual identity. That have them believe that there's a systematic problem that's woven into our very culture that stops them from ever being successful, no matter how hard they might try. So why bother? Instead, take up arms. Become an army. Become their tool. \n\nYou thought GamerGate might not effect you. You still play good games. You still have fun. Sure, some games might be shit, and launches fucked up, but there's still those gems out there you love. But this isn't just about video games. And you see it now. You see the tip of the ice berg and you're starting to make all the connections. You might have been surprised at first, finding your way to KotakuInAction, thinking *\"Why was a thread on 'all'? Why are a bunch of gators talking about this?\"* Then you looked around. You didn't see any harassment. You didn't see any women being targeted. You saw discussions. Debate. Concerns. You saw threads talking about censorship, ethics, science fiction and fantasy books. \n\nKotakuInAction's days are numbered. This new policy of banning subreddits due to what they consider harassment was the perfect excuse to push it on its way out. GamerGate has been labeled as misogynist harassers from the start, and that label extends to KotakuInAction, even though there's never been any proof of this. Do you want to see how easy it is to label this group as harassers? \n\nBrianna Wu is a self proclaimed \"target\" of GamerGate. She spent months trying to instigate GamerGate on [Twitter by posting trolling comments and images.](https://archive.is/NCLXB) Then, in October, she finally got GamerGate to take the bait. She used a meme generator to poke fun at GamerGate, and several users on 8chan's /gg/ board did what they do best. Shitpost. They flooded the meme generator with trolling comments, much in the vein of Wu's originals. Some went too far, but most of them were shit posts. /gg/ was talking about this on their board. \n\nThen, right in the middle of discussing her reactions to the memes, someone, without being asked, posts personal information about Brianna Wu. They board instantly reported the post, as it is against that board's rules to dox or harass anyone, and it was removed quickly. No one asked for it, no one celebrated its release, and many people called out the post. Within minutes, Wu had a screenshot on her twitter blaming the entire board, and all of GamerGate for doxing her. This was clearly the action of one person, acting against the board's own rules, without anyone asking for the information, and yet she somehow was stil able to blame the entire board, and all of GamerGate for it. Shortly after she tweeted that her personal information was released, she received death threats by a newly created Twitter account, that mentioned some of the personal information. \n\nThe following weekend she was on National television labeling GamerGate and 8chan as a hategroup. Claiming that they were trying to drive her out of gaming and that she was a target of a hategroup. Many within GamerGate believe she posted her own information, and even made the Twitter account and sent herself the threats. None of that matters. There's not even an ounce of evidence to support any of that, but at the same time there's not an ounce of evidence to support it being the intent of GamerGate for these actions. However, she was able to smear an entire group of people for the actions of one, possible two, people. No one in the media questioned her accounts. They broadcasted her side of the story, and other media outlets copied what they said, and published their own stories. GamerGate had reached some main stream media before this event, but this is the moment when the reach spread far and wide, and even main stream media outlets had GamerGate pegged as a hate group. \n\nI have found the [archived thread where her dox was posted](http://archive.is/5xlts), so you can see for yourself what happened. You'll notice the post containing the dox was removed, because it was deleted within a few minutes (but not before [Wu made her Twitter post blaming them](https://archive.is/gslaL)), but here's a [screenshot](http://i.imgur.com/MeyVACc.jpg) of it. You can see exactly where it fit into the thread, and how the thread reacted to it. \n\nSo now you see how easy it can be to paint a subreddit as a harassment/hate group. All you need is one account, one person, to post something against the board's rules. Reddit claims they will only delete subreddits where their moderators aren't doing what they can to stop these sort of posts, but /gg/ did a good job of stamping out calls to harassment and doxes, yet that didn't stop them getting smeared on national TV, which is  used in Wikipedia as a source to prove GamerGate's a hategroup. KotakuInAction is already known to some as a hub for a hategroup, and even though Reddit hasn't banned it yet, it's leading up to it. \n\nSo now you see why this matters. Now you see why we've been at this for months. Now you see how this effects you. What's to stop your favorite subreddit from being next? Some claim the simple solution is to migrate to other sites, but that's already been done before. Places that were thought to be bastions of free speech slowly turned into this exact scenario. A stand has to be made. This isn't about whether or not 'fatpeoplehate' was worth deleting. Some will say it was, some will say it wasn't. The problem is how easy this new policy will be for them to abuse. This isn't about stopping hate, this is about shutting us up. Chairman Pao has come up a lot in this subreddit, because her actions and scams have directly related to our interests and discussions. The stories uncovered leaked into 'all' on more than one occasion. And every time it did, our numbers bumped. KotakuInAction is becoming more and more active, with more and more people discovering just how far this goes, and just how it effects them. Often times, they find out before it's too late, and they've already been silenced. Even now, I fear how little exposure this thread will get, due to the on and off vote-locking that seems to be undergoing. \n\nSpread this message. Show people how this relates to them. We can't afford to ignore this festering wound any longer. It will just spread. We need to expose people to this information as much as we can, and call out these actions and show those in power they can't get away with it. If we go quietly, they'll win and it will be easier to bury this all and in months time it will be forgotten. The more this gets exposed, the more people know, the less influence they will have. \n\n**Edit:** While I know you can't make everyone happy, at this point in time, a good 10% of the votes have been downvotes. I tagged this Discussion for a reason. I would be more than happy to hear what you have to say if you don't agree with what I've said. While I have a busy day ahead, I would love to talk with you, and will respond to anyone who disagrees with this.","tags":"#reddit#chairman#ellen#pao#censorship#gg","favourites":1,"__v":0,"created_on":"2015-06-11T16:23:49.547Z","score":0},{"_id":"5579f26b7d2300ce44f0cefe","id":1756,"pasta":"Your post has been Ellen Paoed! ヽ༼ຈل͜ຈ༽ﾉ\n\nAnother user liked your comment so much that they Ellen Paoed it, giving you reddit Ellen Paos. Reddit Ellen Paos is reddit's ultra-premium Ellen Paoship program. Here are the benefits:\n\n    Extra site Ellen Paos\n    Extra Ellen Paos\n\nDiscuss and get help on the features and perks at /r/ellenpaobenefits\n\nGrab a drink and join us in /r/ellenpaolounge, the super-secret Ellen Paos-only community that may or may not exist.\n\nDid you know: Most Ellen Paos—78 percent of the yearly Ellen Pao supply—is made into literally hitler mods. Other industries, mostly electronics, medical, and dental, require about 12 percent. The remaining 10 percent of the yearly Ellen Pao supply is used in financial transactions and advocating for fat steeples.","tags":"#reddit#ellen#pao#censorship#pao'd#fatpeoplehate","favourites":1,"__v":0,"created_on":"2015-06-11T12:01:56.653Z","score":0},{"_id":"5579f2517d2300ce44f0cefd","id":1755,"pasta":"<message pao'd> FeelsBadMan","tags":"#reddit#dota2#twitch#ellen#pao#censorship","favourites":4,"__v":0,"created_on":"2015-06-11T19:38:14.960Z","score":0.00022263466179028418},{"_id":"5578be8b7d2300ce44f0cef9","id":1754,"pasta":"FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF  \nFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF  \nFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF  \nFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF  \nFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF  \nFFFFFFFFFFFF  \nFFFFFFFFFFFF  \nFFFFFFFFFFFF  \nFFFFFFFFFFFF  \nFFFFFFFFFFFF  \nFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF  \nFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF  \nFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF  \nFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF  \nFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF  \nFFFFFFFFFFFF  \nFFFFFFFFFFFF  \nFFFFFFFFFFFF  \nFFFFFFFFFFFF  \nFFFFFFFFFFFF  \nFFFFFFFFFFFF  \nFFFFFFFFFFFF  \nFFFFFFFFFFFF  \nFFFFFFFFFFFF  \nFFFFFFFFFFFF  ","tags":"#general#F#to#pay#respects","favourites":17,"__v":0,"created_on":"2015-06-10T22:47:28.449Z","score":0.0008850173439122315},{"_id":"5578aa857d2300ce44f0cef5","id":1752,"pasta":"###You've been banned from /r/paoyongyang for the following reason:\n\n##Failed to create a safe space for diverse peoples, triggering content. \n\n#찬양 영광스러운 친애하는 지도자 엘렌 파오\n\n\nPraise glorious dear leader Ellen Pao.","tags":"#reddit#chairman#pao#safe#spaces#banned","favourites":5,"__v":0,"created_on":"2015-06-10T21:21:59.249Z","score":0.00027848095483865503},{"_id":"55738fb47d2300ce44f0ced7","id":1740,"pasta":"Let's say you get up in the morning and go to the bathroom. You step in the shower and have some breakfast, ready to face the day ahead. Maybe you went for a run earlier and need to change into more fitting clothes. Now you head off to work, and work from 9 to 5 to support yourself for the future. You commute back home, however you may do that, and lie down on the couch, throwing your bag on the floor.\nHave you ever lied there, staring up at the ceiling and thought, \"Wow, my life is so pointless.\"? Because I do. I think that about you every single day of my life, ever since you wrote this shit-tier comment. \"That guy's life is so pointless,\" I think to myself before I go to bed. All you are is an iota of the cosmic whole, one thousandth the relative size of a spec of dust to the universe. Every day of your life that goes by is about as consequential as an attosecond (one quintillionth of a second), in the grand scheme of things.\nAnd yet there you are. There you sit at your desktop. Shitposting all day long and wasting away, feeling the need to poke yourself into every minuscule facet of the lives of people you never met, and likely never will meet. All from the comfort of your worthless, steadily decaying clump of matter that you call a computer.\nYour life is so fleeting. Yet this is how you choose to spend it. Wandering the internet looking only to bitch and moan at people for something you ultimately know deep down that you will never be able to change about them.\nI pity you more than anything. Hopefully one day you'll become aware of your supreme faggotry and give up your ways. All I can do is implore, insist, beg, pray, and hope beyond hope that you shut your stupid and diseased mouth for one fucking second and let people live their own meaningless existences outside of yours. At least they can find something to do with their time. If you met these people face to face, you wouldn't have the balls to talk shit like that.\nSo yeah basically go fuck yourself is what I'm saying.","tags":"#reddit#4chan#go#fuck#yourself#euphoric","favourites":4,"__v":0,"created_on":"2015-06-06T18:23:15.448Z","score":0.00020463469981330716},{"_id":"55738f897d2300ce44f0ced5","id":1738,"pasta":"The year is 2077. I stand at a window of my mansion and revel at my prized possessions - the vast acres of suburban real estate that my father and grandfather endlessly toiled to build up, and now, I have inherited it all. My grandson stands next to me and asks, \"grandpa, can I be a big businessman like you when I grow up?\"\n\"Of course,\" I said, \"this will all be yours someday.\"\nI walk over to my computer and sit on my gold-plated, diamond crusted seat. I open Reddit, a leading and most-trusted source for world news. The top headline reads, \"Immortal III treasure released.\"\n\"Marvelous!\" I chuckle to myself. This is just in time to boost the TI67 prize pool. I purchase several chests as a present for my grandson's compendium. As I click \"checkout\" on the website, I can't help but take a peek in one of the chests.\n\"Why, it's a shiny Zeus hammer!\"\nI cannot resist but open the chest. I receive a Crystal Maiden staff.\n\"This is no Zeus hammer,\" I thought. Let me just open another.\nTo my dismay, I still have not found the elusive Zeus treasure. I continue to buy more and more chests, determined that my wealth would eventually overpower Valve's determination to hide the chest from me. This quickly escalated to precisely 90,663,887,774 chests purchased, and not a single Zeus hammer lay between my wrinkly hands.\nSlowly, a cloud of darkness consumed my mind. I began dreaming of Valve's logo being carved and stamped on every piece of real estate I owned. I have thrown all my wealth away in search of this treasure. My grandson's future--no longer secured.\nI only have a few pennies left at this point, and I decided to spend them on internet bandwidth to search reddit for guidance. I went back to the Dota 2 subreddit to make sense of this all. I see a post on the front page titled, \"I opened one treasure with my level 1 compendium and look what I got :D!!!\" I clicked the post, only to see Zeus with all his might, holding a shiny, golden hammer, engulfed by lightening. Merlini himself would be blinded by such beauty.\nAt this point, my grandson came to me and climbed on my lap. \"whoa,\" he said, \"I want one of those!\" He asked if he can have just one Zeus hammer when he's a \"rich business man\" like me. I slowly carried him off my lap, with tears running down my eyes I told him,\n\"Of course, Kappa.\"","tags":"#dota2#zeus#hammer#chest#compendium#reddit","favourites":15,"__v":0,"created_on":"2015-06-05T07:58:56.590Z","score":0.0007219882143303244},{"_id":"5570bf217e8e4e5c6734aeb6","id":1724,"pasta":"You beat me up in school. You taunted me because I was different, because I was not a part of your conformist world.\nYou called me a nerd because I valued my intelligence above fleeting sporting ability that age will soon dissipate.\nYou passed me over for the douchebag, whose weapon of choice was the steroid and the fake tan bottle, then complained and acted surprised when he struck you.\nYou people... you people made me SICK for the best part of my youth and now you DARE to come to my home territory... The Internet and act as if you are safe? As if you are welcome here? As if I and the others like myself that have wronged would simply tolerate your presence in our domain?\nHow foolish of you.","tags":"#reddit#neckbeard#bully","favourites":11,"__v":0,"created_on":"2015-06-03T17:11:59.306Z","score":0.000531802020094556},{"_id":"5570bf007e8e4e5c6734aeb3","id":1721,"pasta":"605 triple spin off of the ufo in favela spinning in the air hit maker your mom then fuk ur mom throwing knife at the wall no scope 360 triple headshot silent shot xXxUrDoNeKidxxx alex garcia’d ur mom while playing pokemon then pull out my m9 and shoot ur mom then see u in the corner of my eye ur done kid shoot ur face off sphagetti everywhere ur done m8. next round of search and destroy i see you trying to run fuck that kid im jumping off the airplane on terminal get another hit maker off of ur mom slaped ur moms face with my dick knock her out shes fainted like the pokemon i was playing with earlier 890 degress 1080 headshot collateral on the whole xbox live party including you round over our team won ur gettin delete off of the leader board kid ur fukin done.. Boom\n","tags":"#general#xbox#live#cod#noscope","favourites":6,"__v":0,"created_on":"2015-06-03T23:51:08.786Z","score":0.00029975326980839697},{"_id":"556e61ad6f5b1e5714c0ef19","id":1720,"pasta":"What the bones did you just skellington say about me, you little smoothskin? I’ll have you know I graduated top of my class in the spooky skeletons trumpet school, and I’ve been involved in numerous secret raids on halloween, and I have over 300 confirmed doots. I am trained in scary spooking and I’m the top trumpeter in the entire spooky graveyard. You are nothing to me but just another little baby to be spooked. I will wig you the heck out with spookiness the likes of which has never been seen before on this Earth, mark my spooky words. You think you can get away with saying that hogwash to me over the Internet? Think again, spooker. As we speak I am contacting my secret network of spooky mummies and ghosts across the creepy crypt and your bedroom closet is being traced right now so you better prepare for the storm, doot. The storm that spooks out the pathetic little thing you call your wits. You’re hecka spooked, kid. I can spook anywhere, anytime, and I can spook you in over seven hundred ways, and that’s just with my trumpet. Not only am I extensively trained in spooky scaring, but I have access to the entire trumpet of the spooky skeletal abyss and I will use it to its full extent to spook your miserable butt off the face of the continent, doot doot doot. If only you could have known what spooky retribution your little “clever” comment was about to bring down upon you, maybe you would have held on to your hat. But you couldn’t, you didn’t, and now you’re paying the price, you dumb little baby. I will spook skellingtons all over you and you will drown in them. You’re spooked, kiddo.","tags":"#general#navy#seal#mr#skeltal#spooky","favourites":35,"__v":0,"created_on":"2015-06-03T02:08:36.379Z","score":0.001460277529683737},{"_id":"556e60856f5b1e5714c0ef17","id":1719,"pasta":"What the yiff did you just yiffing say about me, you little fox? I’ll have you know I graduated top of my group of my yiffing classes, and I’ve been involved in numerous secret orgies on Furaffinity, and I have over 300 confirmed yiffs. I am trained in Yiffing warfare and I’m the top wolf in the entire Yiffing Leauge. You are nothing to me but just another target to yiff. I will fuck you the fuck out with precision the likes of which has never been seen before on this Earth, bark my fucking words. You think you can get away with Role playing that shit to me over the Internet? Think again, fucker. As we speak I am contacting my secret network of animal species across the USA and your character is being traced right now so you better prepare for the cock, faggot. The cock that wipes out the pathetic little thing you call your tailhole. You’re fucking yiffed, kid. I can be anywhere, anytime, and I can yiff you in over seven hundred ways, and that’s just with my tail. Not only am I extensively trained in unprotected yiffing, but I have access to the entire arsenal of my best friend’s dildo collection and I will use it to its full extent to destroy your miserable ass off the face of this bed, you little fox. If only you could have known what unholy retribution your little “sexy” comment was about to bring down upon you, maybe you would have held your fucking snout. But you couldn’t, you didn’t, and now you’re paying the full price for the commission of your character, you goddamn fox. I will jizz all over you and you will drown in it. You’re gonna suck my wolf dick, kiddo.","tags":"#general#navy#seal#fox#furry#yiff","favourites":8,"__v":0,"created_on":"2015-06-03T00:47:57.605Z","score":0.00039090998387247784}]