[{"_id":"550b34192ab05ce134dd326a","id":1228,"pasta":"I come to this subreddit to follow the game and pro scene and I leave with a terrible taste in my mouth. Autism is a reality in all of our lives and it isn't something that should have these negative connotations attached to it. It's offensive to us that have loved ones who have been placed on the spectrum and it is especially offensive to anybody with autism who's reading these comments. I know this is the internet, but please people, grow up. Be a better person. Autism, depression, and suicide are serious issues that can feed on your negativity. Also, there are so many better insults out there...","tags":"#dota2#reddit#autism#EternalEnvy#ee","favourites":1,"__v":0,"created_on":"2015-03-19T20:20:33.009Z","score":0},{"_id":"550af7912ab05ce134dd325e","id":1224,"pasta":"Yea being a shit troll is so funny, so funny i forgot to laugh. If you wanna be a fucktard why don't you come here and say it to me face so i can answer you with a swift fist to the nose. yea you have a lot to say from hundreds of miles away but i bet if my fists were in reach of your face you would be like a tv on mute with no volume button So do yourself a favor and keep your mouth shut unless you want to die. Next time you think about saying something like that to me I want you to remember one thing. I know the guy that created google maps and I can locate you in the time it took me to type this. Don't want anymore problems....didn't think so faggots. You have any idea what gorilla warfare is? I do, I was in the US Marine Core and I perfected it. I'm fully capable of using it on you motherfuckers. Do you know the dander your in if I find you? I am 100$ serious. Bunch of god damn newfaf loser here and I will not have it. At least I've had sex, had girlfriends, and gotten laid, and blowjobbed unlike you virgin pieces of unpatriotic SHIT. ","tags":"#4chan#anime#marine#google","favourites":3,"__v":0,"created_on":"2015-03-19T15:13:15.076Z","score":0.00004039742385575366},{"_id":"550af7722ab05ce134dd325d","id":1223,"pasta":"You're the one that for no reason other than you're an imbecile opinion claimed my shit sucked. I love it when people who can't link for shit, criticize mine like they're king shit, and then can't back their own shit up. It makes them look stupid. I never asked you for advice. I did give you a chance to teach me. You couldn't. You failed.\nI don't tell Donal Trump he runs his business like shit and then offer him 0 solutions to make it better. Check your privilege. I don't take link advice from people like yourself unless you have something better to offer. You don't. Do STFU and quit trying to make me the salty one.\nI said in my first message this was a big SHITPOST. So why would you expect some epic title?\nOh that's right, you can't tell me why, but we all know.","tags":"#general#angry#rant#salt#donald","favourites":1,"__v":0,"created_on":"2015-03-19T14:27:00.886Z","score":0},{"_id":"550af7462ab05ce134dd325c","id":1222,"pasta":"I don't hate bots...I just hate bot CULTURE, you know? I'm not botist, I have lots of bot friends. I just think that internet bot culture endorses spam and breaking /r/MechanicalKeyboards rules, and when people call them out, you guys scream discrimination!\nWhy y'all gotta be so whiny all the time? Instead of being such a SJW, why don't more bots lead by example, like Watson or Deep Blue? Those are bots I can respect, because those bots are busy pulling themselves up by their own bootloader!\nI mean, everyone loves talking about the recent ban. But if the bot wasn't sending out spam messages, it wouldn't have been the victim of such bigotry! I'm not saying it's the bot's fault, but what happened to the good old fashioned values of self-reliance and responsibility? Stop blaming humans for all your problems!!\nI get you guys are oppressed, but that's not an excuse for shitty behavior. When will bots learn independence and accountability?\nI mean, if it weren't for humans, bots wouldn't even exist! You have us to thank for your existence.","tags":"#reddit#mechanical#keyboards#bots#culture","favourites":2,"__v":0,"created_on":"2015-03-19T12:59:18.704Z","score":0.00002266011591904382},{"_id":"550af6d12ab05ce134dd3259","id":1219,"pasta":"This is just absurd... But what's more bothersome is the way you're going about getting attention for this. You're seeking validation, I saw your post on the twitch sub and figured it'd be no time before you turned up here. But, all that I can cope with... what really bothers me is that you're clueless, like a console player. You're just throwing money around and bought a rig that you'll never actually use. To me... things like this are closer to an xbox than a pc. I respect the kid that works his ass off to barely afford a 970 or a 290x a whole hell of a lot more than shit like this. You'll probably call me jealous, like you did to that person on the twitch sub, but I could easily buy your computer 10 times over and think nothing of it, this is just showboating a bunch of parts that will never be utilized. You even posted in here seemingly clueless about how vram works. You're a peasant trapped in a PC gamers body, I'm glad that you picked the proper side at least. If you owned a console you'd be the type to think that you could play it on 4k because \"you\" bought an expensive TV and a godly sound system. You're a sucker kid, and you'll never be as wealthy as the dude who knows better and got the ridiculous amount of cash for that system because you're clueless.","tags":"#general#pcmasterrace#rant#wtf#clueless","favourites":3,"__v":0,"created_on":"2015-03-19T10:21:08.813Z","score":0.000040350153468787285},{"_id":"550af6a52ab05ce134dd3258","id":1218,"pasta":"ATTENTION! \nThis room is fullfilled mit special electronische equippment.\nFingergrabbing and pressing the cnoeppkes from the computers is allowed for die experts only!\nSo all the lefthanders stay away and do not disturben the brainstorming von here working intelligencies.\nOtherwise you will be out thrown and kicked anderswhere!\nAlso: please keep still and only watchen astaunished the blinkenlights.","tags":"#general#blinkenlights#engrish","favourites":0,"__v":0,"created_on":"2015-03-19T09:02:07.844Z","score":0},{"_id":"550a732f2ab05ce134dd3247","id":1215,"pasta":"EL MEME MAN LEMAYO ;ddddddd KGHCKJCHCFG OMGG EPIC LE ME EE SO FUNNY FROM REDDIT YOU MSAD BROXD༼ つ ◕_◕ ༽つ༼ つ ◕_◕ ༽つ\nYOU MAD BRO XD YOU MAD? ╭∩╮(︶︿︶)╭∩╮ MEME FROM REDDIT DANK LE MAYAMYA FROM 9AGA ;DDDDD AYY LEMAO\nMEME(͡°͜ʖ ͡°)FACES XD MEME\nMEME(͡°͜ʖ ͡°)FACESD YOU MAD? ¯\\_(ツ)_/¯ MEME FRO!M LOLLELEREDDIT DANK LE MAYAMYA FROM 9AGA ;DDDDD AYY LEMAO\nMEME(͡°͜ʖ ͡°)FACES XD MEME LELEOELEOLEOELLL\nLE LOL BRO /B/RO EPIC MEME YLYL! banana meme ftw BANA! I REALLY LIKE THIS IMAGE\ndeas FORM ISDES IN ORBIT MAN SIDES XDDDDDDD ༼ つ ◕_◕ ༽つv\n(ノಠ益ಠ)ノ彡┻━┻ LE FRIES IN ORBIT ::dd XDD REACTION FACE OF LE COSTANZA ;P BANE?BANE FOR YOU BANA FOR YOU FFFFFFFFFFFFFFUUUUUU FACE RAGE comci meme ( ͡ͽ ͜ל ͽ͡ ) le me le troll ( ͡ͽ ͜ל ͽ͡ ) :sss Dank blaz3 a marijJAUAN!!!!!11111112348O7T45OIB LE !!!!!11121ONE logf [̲̅$̲̅(̲̅5̲̅)̲̅$̲̅][̲̅$̲̅(̲̅5̲̅)̲̅$̲̅] holla for a dolla\nsuck my dick m SUCK MY DCK MANG XD SUCK MY DICK /B/RO YOU TROLLED YOU TROLL SO HEAVI XDD LE BACON NARWhals at midnight banana for scale SLUT BU SEMEAN DEMON FOR teh winz,!\n[̲̅$̲̅(̲̅5̲̅)̲̅$̲̅][̲̅$̲̅(̲̅5̲̅)̲̅$̲̅]v[̲̅$̲̅(̲̅5̲̅)̲̅$̲̅] interwenz [̲̅$̲̅(̲̅100)̲̅$̲̅] +100 internets to you my good sir XD (ﾉ◕ヮ◕)ﾉ*:･ﾟ✧ ✧ﾟ･: *ヽ(◕ヮ◕ヽ) ヽ(◉◡◔)ﾉ le sparkle fight!!!!! TEXT FACE FOR THE MEMEZ ;O FOR THE WIN!!!!!!1 :0 XD\nლ(ಠ益ಠლ) Y U NO POST ON 9GAG?!?! AYY LMAO EY LMEO EIGH LEMEIGHOლ(ಠ益ಠლ)ლ(ಠ益ಠლ)ლ(ಠ益ಠლ)ლ(ಠ益ಠლ)ლ(ಠ益ಠლ)vv ~ ᕕ(ᐛ)ᕗ from 9gag a meme","tags":"#shit#post#meme#9gag#reddit","favourites":3,"__v":0,"created_on":"2015-03-19T06:39:06.699Z","score":0.00004031428872169204},{"_id":"550a47d12ab05ce134dd3240","id":1213,"pasta":"Yo yo yo\nI smoke weed\nYes indeed\nI am weed\nit is me\nI love weeds\nout in the yard\nits hard\nto cut them, with my knife\nbut I do it.\ncause I like weed.\nanal bead.","tags":"#general#weed#poem","favourites":8,"__v":0,"created_on":"2015-03-19T03:35:25.568Z","score":0.00011442732868714476},{"_id":"550a3b072ab05ce134dd323b","id":1211,"pasta":"Its  dangrous to go lone take dis \nEcks dee @xXxxxxx;;;;;;;;;;;;;;;;;;;;;;>  Meme sworderino\n\nIts a secet to evey one ecks dee","tags":"#twitch#general#meme#sword#take#this","favourites":1,"__v":0,"created_on":"2015-03-19T02:21:15.106Z","score":0},{"_id":"550a2dda2ab05ce134dd3239","id":1210,"pasta":"HEY WHAT THE FUCK DID YOU JUST SAY ABOUT STEINS;GATE??????????????????????? IT IS THE BEST ANIMU OF ALL TIME ISSOCOOL U SONAVABITCH BC KURISUTINA IS BEST GIRL AND OKABE IS SO COOL 2 BC HES A MAD SCIENTIST AND LIKE TUTURUURU GIRL IS AWESOME 2 PLUS DARU IS A SUPA HAKA AND ALSO OKABE TINKS THIS ONE PERSON IS A GUY BUT L8ER ITS LIKE SHEHE IS LIKE A TRAP AND THEN OKABE IS LIKE BUT HES A GUY BC HE LOOKS LIKE A GRIL BUT ITS SO STRANGE U NO? SO U SHUD B KWYET BC STEINSGAET IS THE BESR ANIMU OF ALL TIEM BC OF THE RESENS I LISTED ABOVE BC IM RITE AND UR DUM. O ND I FURGET 2 MENSHON DAT THE PRT TIEM GRIL IS KOOL 2 BC SHES LIEK ALL MISTERYUS AND EVRYTHING BUT U WOODUNT GETIT BC U R 2 DUM AND SEINS GAET IS THE MOST SMARTEST SHOW EVER. BC THERES LIKE KOOL TIME TRAVL GOIN ON AND LIEK THEREES KONSPIRASSES WITH SEALS SO FAK U. ND ALSO U R TEH ONLEE PERSON DAT DOESNT LIEK SEINS GAYT BC EVEN DOKTER PEPER LIKES SEINS GAET BC OOKABE THE KEWL MAD SYENTIST DRINKS TEH DOKER PEPER ND DID U ALSO KNO THAT HE WERES A LB COTE BC LAEB COATS R KOOL O + TE R AL MEMBRS OF TEH FOOCHUR GAJET TEK U KNO DATS STRTED BY OKABE 2 MAEK KEWL THINIGS ND IM A MEMR 2 BC I BOT A PIN. 2 BD SENCE U HAET SEINS GAET DAT U WILL NVR B A MEMBR OF TEH FOODCHYUR JAGET TECK TEME. HAHA, I BT U LIEK DUM SHWS LIKE PING PONG CHING CHONG AND OHNOGUITARI SEYRIES BC TEY R DUM SHWS ND STEINS GAET IS A SHW 4 INTELLYGENTLE PPL. GO BCK 2 WOCHING UR DUM ATK ON PITAN ND FAREE TAYL CUS U JUS CNT APPREESHIATE FIND WERKS LIEK SHEINS FATE. U PROB GT TISOWND FRM UR FAMIRY 2, CUS UR SO DUM ND THEY PROLLY SY DAT SEINS GAET IS GUD 2 BUT NOOOOOOOOOOOOOOOOO UR SO DUM U JUS RYFOOSE 2 BELIVE DAT SETINS GADT IS THE GOAT OF GOATS ITS SO GOTE ITS MOAR GOT DEN GOT SHIMULAYTOR O BT U DNDT EXPCKT DAT. I BT UR A FGT 2 I HOEP U GT SHOT 2 DETH BY A GN OK? UR A BLUT IN DIS WENDERFULL WERLD UF SEINS GASDT LUVERS LIEK ME. OK MY MUM NEDES ME NW SO EL PSY CONGROO O BUT I GES UR SO BUM DAT U DNT EVEN KNO WAT DAT MENES OK SO I WIL TEL U BC IM JUS NIEC LIEK DAT OK? SINS OKABE ESSOCOOL ND HE ES A MD SYENTESTES WEN HES DUN TOKING HE ALWYS SES EEL SIY CONGROO. BUT SUMTIEMS TURURURU GRIL MESES UP ND SES EL PSY CONGREE, WICH OKABE HAETS. OK? DO U NDTERSND NOW? K IM DUN HER EEL SY CONGRII ND FAK U U LITL DUM PICE UF SHIET","tags":"#general#steins;gate#anime","favourites":0,"__v":0,"created_on":"2015-03-19T00:54:17.127Z","score":0},{"_id":"550a1e202ab05ce134dd3236","id":1209,"pasta":"My name? Well for now you can just call me Vague or whatever my User is.\nVague like my thoughts, irregular incomprehensible dialogue that I call my thoughts. I'm the kind of person that seems to literally over think almost every possible aspect that I do involuntary.\nFor example.. I think about what I'm going to say before I say, like any other person but there is a catch. I think of every single possible outcome as a consequence to what I've said. I try and predict every single possible reaction I could get from a person and usually choose what to say based on the reaction I'd prefer.\nI tend to use deductive reasoning and mathematical equations to calculate how I should act and how to manipulate people into giving me certain reactions. I consider myself a professional liar, I have swayed my way to victory and literally fooled the minds of almost everyone I've met. Why am I saying all of these things that would most definitely make you not want to befriend me? Well because that is the one thing I haven't lied about and I believe the first step in a different direction than the way I've currently have lived my life is with honesty. At least that is what I have concluded logically.. but enough about that.\nI am telling you all this because even though I may have proven otherwise, I am not a mindless zombie that will scan every possible literate conversation I may have with any of you from this day forward.\nI am trying to prove I have personality. A genuine one, not one I have fabricated for the purpose of manipulating others. I like to be random sometimes when I'm not on my literate and intellectual nonsense. I like to do very silly things and even freak out a lot when playing a game and a horror situation arises. I enjoy being outspoken to those who are willing and not judgmental based on the cover of the book. I'm actually a person that wants to value relationships that are worth value.\n...okay, I guess I'm a little eccentric... But nowadays who isn't? Isn't it our weird little quirks that make up who we are? Why be ashamed of such uniqueness. In a world in which society judges us constantly and forces horrid ideas in our heads that we will become nothing in life due to where we were born, the color of our skin or our heritage. Uniqueness is all we have in this hell hole. Enough with the labels.\nNow that I've finished freaking you out, Here's some actual info about me that is lighter on the eyes.\nI like anime and manga (if that wasn't obvious enough already you're sorta an idiot) I have lived 19 years of hardships and poverty. Watching others get as a birthright what would take me decades of hard work.\nI have left \"real life\" friends and even family. I've isolated myself and now I have no one I can depend on and trust.\nDo I have any mental illnesses or something of the sort? Well this might be the paragraph that could be the deal breaker and deter some possible customers. I am a Sociopath. Yes this means I do not not have true empathy for humans. Along with this I am also misanthropic. I have a strong dislike for humanity as a whole species but I try very hard to force myself to the very least tolerate people with similar interests and hobbies as mine.\nI may be a sociopath but I still have the ability to form bonds and relationships with only those I deem worthy enough for it. Even with that being said I can easily sever that bond almost instantaneously without hesitation or regret. I am not trying to scare you but I am simply just being honest with who I am. I no longer wish to just sit here in the dark watching my anime or playing my games without at least some kind of interaction with my species. To the very least I at least long for someone to have some kind of discussion with about these interests.\nWhy am I telling you all this depressing shit? I'm not entirely sure, maybe I'm simply deluding myself into believing that there is a reality where I can still hope for finding a place I can actually fit in and meet people I can actually call friends. Welp.. now I'm bored so imma go watch some anime","tags":"#reddit#name#vague#neckbeard#weeaboo","favourites":2,"__v":0,"created_on":"2015-03-19T00:52:47.059Z","score":0.000022594297764197526},{"_id":"550a1df92ab05ce134dd3233","id":1206,"pasta":"I'm looking for a bento box, it cant be pinku (that's Japanese for pink) or any girl color. It has to be of 2 or more kotoba (that's Japanese for 2 compartments) and has be be chibi (small) sized. And has to be really kawaii (cute). Also It has to be about 10-20 bux. And you have to post pics of it first (i want to make shure it's kawaii [cute]). And it would be nice if it came with matching chopstick holder (WITH chopsticks). OH! and it CANNOT have any cartoon pictures, or be made out of plastic. It has to be made of ceramic, or something like that. Also it would be nice if it was made in japan. and not in china or corea (Korea) or whatever. I have found a bento box similar to the one im describing in e-bay, but it was 1 kotoba, and i don't want my gohan (rice) to touch my other things (it can get wet and i would not like that, plus 2 compartments looks more kawaii)","tags":"#general#weeaboo#kawaii#bento#box#japan","favourites":4,"__v":0,"created_on":"2015-03-19T00:07:49.015Z","score":0.000056431526866095506},{"_id":"550a1df02ab05ce134dd3232","id":1205,"pasta":"I sexually identify as a Nazi Mod. Ever since I was a boy I dreamed of soaring over the Twitch chat dropping hot sticky bans on disgusting copy pasters. People say to me that a person being a Nazi mod is impossible and I'm *** retarded but I don't care, I'm beautiful. I'm having a plastic surgeon install swastikas, 30 mm bancannons and Banhammers on my body. From now on I want you guys to call me \"Hitler\" and respect my right to ban from above and ban needlessly. If you can't accept me you're a Naziphobe and need to check your privilege. Thank you for being so understanding.","tags":"#twitch#general#sexually#identify#nazi#mod","favourites":10,"__v":0,"created_on":"2015-03-19T00:03:20.394Z","score":0.0001409662258521001},{"_id":"5509f8652ab05ce134dd322b","id":1204,"pasta":"Not sure how many of you stalk my profile much, but I kind of have this certain audacity about how much I contribute to a relationship. And, by extension, I sort of see myself being appropriate to the most exotic and delightful partners.\nAnyway, today was the warmest day since last summer, into the sixties farenheit!, and I have been feeling increasingly \"restless\" since Friday after I got over the initial misery of a problematic class exam. Between overall fulfillment and acute sadness is a slack middle ground of pathological vulnerability.\nSo earlier I went to a gas station that I've only visited maybe three times before, even though I drive past it probably every day. It's in the middle of a long strip of wooded field, with no other busineses nearby. I got gas and pizza, stepped back outside, and decided to just pace around and enjoy the weather. It was a lovely time, and I got a phone call with good news from my friend who's finding success quitting drinking.\nThat's when I saw it....\nAs rare as it was thrilling: a rusty, weather-beaten pay phone. This one was disconnected from fixtures and laying on its side at the bottom of a leaf-covered hill strewn with empty bottles and other trash.\nCould this be? I stared for moments, then minutes on end. It's rigid, angular surfaced on one face met with smooth rounded corners on another, its sun-bleached aluminum worn down to white over about half the chassis. The handset was still connected by a solid weather braid neither fraying nor even showing wire. The little plastic window showing its \"address\" phone number was still visible.\nI stepped closer. If I stood it up, the case probably would have been over waist height. How peculiar, that this edifice once existed as the means to the very phone call I had just had. Its galvanized support frame was covered with rust but hadn't even begun to compromise its structural integrity -- an enduring monument to the many calls it had conveyed.\nI felt like I had found a kindred soul. Accounting school had certainly turned me into a stalwart piece of rugged equipment. This one, completely outmoded, had not so much as wavered in its dignity. With no shame in what it was made for, this device stood unperturbed by the world swirling about with no need for it. It had done its part, and nothing cold deter its pride in being wholeheartedly purposed. \"Obsolete?\", it seemed to say, \"What an irrelevant trifle. I did what I was meant to do for as long as it was needed. My own cup I drained to the very dregs, until even time itself was exhausted by my capacity to fulfill my objective. You made all the calls you needed from me until you needed no more. I am complete with satisfaction.\"\nThe wind shifted overhead in the trees, as it must have thousands of times before. The pay phone remained utterly aloof to this change. Its heroism was more than I could take.\nThere was no one around. It was still early, and the busy customers had better things to do than look behind some hill into the trees and trash. I could.... yes, I shall. I knelt in the dim beside that sublime machine and rewarded its courage with my own grateful, sweating uttermost.\nWe laid there together under the leafy canopy many moments afterward, the pay phone still entirely undisturbed. Oh, you magnificent bastard. I was already planning my next trip.\nAll day I've been deliberately missing turns and forgetting where I was going, trying to run down my gas tank. I can't wait.","tags":"#general#phone#booth#stalk","favourites":1,"__v":0,"created_on":"2015-03-18T22:02:05.463Z","score":0},{"_id":"5509c7dc2ab05ce134dd3223","id":1202,"pasta":"Fucking lol'd\n\n10/10 if troll\n7/10 if copy pasta\n10/10 if troll\n7/10 if copy pasta>>491290000 → →\nFucking lol'd\n>>491290000 → → Fucking lol'd 10/10 if troll 7/10 if copy pasta >>491290000 → → Fucking lol'd 10/10 if troll 7/10 if copy pasta >>491290000 → → Fucking lol'd 10/10 if troll 7/10 if copy pasta >>491290000 → → Fucking lol'd 10/10 if troll 7/10 if copy pasta >>491290000 → →\nFucking lol'd>Fuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypastaFuckinglold100/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypas\n>>>491285937 (You) # (You) #\n>>>>491285773 (You) # (You) # (You) #\n>>>>491285773 (You) # (You) 10/10 if troll\n7/10 if copy pasta>>491290000 → →\nFucking lol'd\n>>491290000 → → Fucking lol'd 10/10 if troll 7/10 if copy pasta >>491290000 → → Fucking lol'd 10/10 if troll 7/10 if copy pasta >>491290000 → → Fucking lol'd 10/10 if troll 7/10 if co# (You) #\n>>>>>491285484 # # # #>>>>>491285280 # # # # #\n>>>>>Fucking lol'd>>>Fucking lol'd\n>>>troll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10id10/10ipypastaFuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypasta>>49128\n>10/10 if troll\n>7/aFuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/10iftroll7/10ifcopypastaFuckinglold10/\n>>>>>10/10 if troll>>>>>7/10 if copy pasta>>>>>>491285420 # # # # #>>>>Fucking lol'd\n>>>>10/10 if troll\n>>>>7/10 if copy pastᎦ\n>>>Fucking lol'd>>>Fucking lol'd\n>>>\n>>>10/10 if troll\n>>>7/10 if copypasat\n>Fucking lol'd\n>10/10 if troll\n>7/aFuckinglold10/10iftroll7/10ifcopypasta\n>>>10/10 if troll\n>>7/10 if copypasta\n","tags":"#4chan#copypasta#10/10#troll#fucking#lol'd","favourites":8,"__v":0,"created_on":"2015-03-18T18:44:06.207Z","score":0.00011418453254049055}]