[{"_id":"55542289709a8b601ae12e02","id":1631,"pasta":"I sexually Identify as Salsa. Ever since I was a boy I dreamed of soaring over the mexican lunch tables getting poured on disgusting plates. People say to me that a person being Salsa is Impossible and I'm fucking retarded but I don't care, I'm beautiful. I'm having a plastic surgeon install tomatoes, jalapeños and various spices on my body. From now on I want you guys to call me \"Medium hot\" and respect my right to be in your food and be eaten needlessly. If you can't accept me you're a salsaphobe and need to check your solid food privilege. Thank you for being so understanding.","tags":"#general#sexually#identify#salsa","favourites":7,"__v":0,"created_on":"2015-05-14T03:33:14.460Z","score":0.0002614362764203861},{"_id":"5553d2c6709a8b601ae12df9","id":1627,"pasta":"~卐卐 YOU HAVE BEEN VISITED BY THE SWASTIKA OF MEME FACES!! 卐卐~\nREPOST THIS 3 (THREE) TIMES IN THE NEXT 5 (FIVE) MINUTES OR YOU WILL JOIN THESE TORTURED SOULS IN THE SWASTIKA AS ANOTHER MEME FACE...\n눈 ͜ಎ눈                          눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈\n눈 ͜ಎ눈                          눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈\n눈 ͜ಎ눈                          눈 ͜ಎ눈\n눈 ͜ಎ눈                          눈 ͜ಎ눈\n눈 ͜ಎ눈                          눈 ͜ಎ눈\n눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈\n눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈\n                                       눈 ͜ಎ눈                          눈 ͜ಎ눈\n                                       눈 ͜ಎ눈                          눈 ͜ಎ눈\n                                       눈 ͜ಎ눈                          눈 ͜ಎ눈\n눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈                          눈 ͜ಎ눈\n눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈눈 ͜ಎ눈                          눈 ͜ಎ눈","tags":"#general#ASCII#swastika#meme","favourites":14,"__v":0,"created_on":"2015-05-13T20:08:08.385Z","score":0.0004960609737640483},{"_id":"55527fad716cba474fb1d10a","id":1624,"pasta":"Fuck you you don't know what's up. MS has been progressing toward lockdown for many years while they also try to establish web services. The end point is a kiosk OS, which is not separate from the device. Interactive TV. Eliminating cost and giving everyone free upgrades is a great way to help that process along: You can use Microsoft's latest services UI on all of your devices. (Which is essentially what their latest ads are saying.)\n\nYou'd probably know a lot of ATMs are running XP, but you wouldn't know it to look at them. One doesn't go to the bank and pick between an XP ATM or a MacOS\nATM. One just uses the ATM interface to use bank services. It will be the same way with Windows. MS doesn't want you to feel like you've paid for a\nvehicle or tool that you own and have a right to\nuse as you like. They want you to pay them for the usage. (Thus, they now sell \"services\" and\n\"experiences\", not software.) Just as you don't buy\nan ATM. You use the service and pay for that usage.\n\nEssentially Microsoft is hoping to eliminate private cars and force you to use their taxi service. But their plan is even better than that, because they don't deal in hardware. They don't need to produce a million taxi cars to hand out to former car owners. They just have to run the taxi service. You still buy the car. It's not even yours anymore!\n\nThe trick is not to offer any other option. So everyone eventually has to buy a services taxi and pay to use it. Get it together /g/","tags":"#general#microsoft#services#4chan#ATM#OS#freedom","favourites":0,"__v":0,"created_on":"2015-05-12T21:31:42.557Z","score":0},{"_id":"5551a28656e740e00fcf4c6d","id":1619,"pasta":"What in tarnation did you just say about me, you little whippersnapper? I’ll have you know I graduated top of my class in the Old Coot Insitution for Elderly Men, and I’ve been involved in secret underground bingo games, and I have over 300 confirmed diagonal wins. I am trained in rummy warfare and I’m the top jokester in the entire west wing of my nursing home. You are nothing to me but a young little boy. I will wipe you out with farts with smells the likes of which has never been seen before in this living room, mark my words. You think you can get away with talking smack about a granpappy, huh? Think again, young'un. As we speak I am licking my lips to dry them and my grandson is good with computers so you better prepare for the storm, kiddo. The storm like that which caused the Dust Bowl right after I was born. You’re gonna regret this! I can be anywhere, with at least 3 days notice, and I can fall and break my bones in at least 700 ways, and that’s just in my back. Not only am I well-versed in the names of the nurses around here, but I have access to the entire bathroom storage closet and I will use it to its full extent to spray you with disinfectant and throw toilet paper on you, ya whippersnapper. If only you knew what God thought about your “funny” comment, maybe you would have held your tongue. You didn’t, and now you’re getting your chain yanked with a farting contest.. I will eventually shit all over this chair and you will smell it. Prepare to have a bad mid-afternoon, sonny!","tags":"#general#navy#seal#kiddo#old#man","favourites":6,"__v":0,"created_on":"2015-05-12T02:32:11.122Z","score":0.00021903913445655234},{"_id":"554e70df9c7b317c68f63140","id":1610,"pasta":"There he is. There he goes again. Look, everyone! He posted it once again! Isn’t he just the funniest guy around?! Oh my God.\n\nI can almost see your pathetic overweight frame glowing in the dark, lit by your computer screen which is the only source of light in your room, giggling like a like girl as you once again type your little Banana thread up and fill in the captcha. Or maybe you don’t even fill in the captcha. Maybe you’re such a disgusting NEET that you actually paid for a 4chan pass, so you just choose the picture. Oh, and we all know the picture. The “epic” Banana guy, isn’t it? I imagine you little shit laughing so hard as you click it that you drop your Doritos on the floor, but it’s ok, your mother will clean it up in the morning. Oh, that’s right. Did I fail to mention? You live with your mother. You are a fat fucking fuckup, she’s probably so sick of you already. So sick of having to do everything for you all goddamn day, every day, for a grown man who spends all his time on 4chan posting about a fucking banana. Just imagine this. She had you, and then she thought you were gonna be a scientist or an astronaut or something grand, and then you became a NEET. A pathetic Bananafag NEET. She probably cries herself to sleep everyday thinking about how bad it is and how she wishes she could just disappear. She can’t even try to talk with you because all you say is “I REALLY REALLY LIKE THIS PICTURE.” You’ve become a parody of your own self. And that’s all you are. A sad little man laughing in the dark by himself as he prepares to indulge in the same old dance that he’s done a million times now. And that’s all you’ll ever be.","tags":"#general#neckbeard#oh#my#god#funny#shitpost","favourites":9,"__v":0,"created_on":"2015-05-09T20:40:59.232Z","score":0.0003154538436762514},{"_id":"554d2ee47219523f46484b41","id":1607,"pasta":"[WARNING: Omegle™ is required under United States Federal Law to inform you that the IP (98.179.227.210) of the person whom you are chatting with is linked to a registered sex offender. Omegle™ encourages you to consider this when giving out personal information. The stranger cannot see this message.]","tags":"#4chan#omegle","favourites":8,"__v":0,"created_on":"2015-05-08T20:47:49.646Z","score":0.0002789366128016604},{"_id":"554d2ecd7219523f46484b40","id":1606,"pasta":"How do I get Japanese girls to like me? When I approach them, I say konichiwa, and I ask them about anime, but they seem to be shy around me (which is cute (XwX) ). Once this girl just laughed at me with her friends and left, and I told her that Pearl Harbour was all in the past, but she still ignored me.","tags":"#general#weeaboo#anime#pearl#japanese#girls","favourites":9,"__v":0,"created_on":"2015-05-08T15:44:31.293Z","score":0.0003109984009256303},{"_id":"554bccb5525664a17d1581d3","id":1598,"pasta":"Wykrhm,\nno words can begin to describe the hard work you've up into this community. Most of us who have been here for a long time have probably seen your name pop up the most. It's not popping up in a bad way, but rather in a good way thanks to the essential quality you bring to all your posts.\nI'm looking through your comment history and all I see is positivity - is this guy for real? Yes I think he is. And his name is wykrhm. \"Wykrhm the good guy\" is what I like to call you when I'm not browsing reddit and when I talk about you around my friends.\nI don't know when you started helping this community but it feels like you've been in it forever. Hence I think your flair as a fundamental suits you well. As the fundamentals were one of the pillars of the dota universe I think you're one, if not the pillar of this subreddit. You started off from scratch and built something amazing with your account. People associate your account and your flair with genuine positivity as well as a source of quality information. \"How does he do it?\" I think to myself sometimes before I go to sleep. \"I don't know, but he's dam good at it anyway\" I respond in the Plato-esque dialogue I repeat in my head.\nWykrhm I would like to end this text with a tank you note I found: \"from the bottom of my heart I'd like to thank you; but for you my heart has no bottom\"\nThank you most beautiful purveyor of reddit aurum! Thank you Wykrhm!","tags":"#reddit#wykrhm#rocksolidmain#dota#dota2","favourites":3,"__v":0,"created_on":"2015-05-07T07:39:46.639Z","score":0.0000964439889815264},{"_id":"5548d677d51fb1666ee0bbf3","id":1588,"pasta":"I sexually Identify as a Packet of Pringles. Ever since I was a young chip I dreamed of trapping people’s hands and morbidly deforming them beyond recognition as they tried to go for my delicious core. People say to me that a person being a packet of pringles is Impossible and I'm fucking retarded but I don't care, I'm beautiful. I'm having a plastic surgeon install long tubular cannisters, a plastic cap and crunchy goodness in me. From now on I want you guys to call me \"Xtra Kickin’\" and respect my right to taste delicious and cause addiction. If you can't accept me you're a pringophobe and need to check your snack privilege. Thank you for being so understanding.","tags":"#general#sexually#identify#packet#pringles","favourites":22,"__v":0,"created_on":"2015-05-05T12:45:27.647Z","score":0.000670418873674496},{"_id":"55480d0c55e55dd11d56ece5","id":1586,"pasta":"I sexually Identify as a room. Ever since I was a boy I dreamed of being part of a house. People say to me that a person being a room is Impossible and I’m fucking retarded but I don’t care, I’m beautiful. I’m having a plastic surgeon install walls, wallpaper and a carpeted floor on my body. From now on I want you guys to call me “Roomie” and respect my right to have furniture inside of me. If you can’t accept me you’re a roomiphobe and need to check your architectural privilege. Thank you for being so understanding.","tags":"#reddit#sexually#identify#room","favourites":5,"__v":0,"created_on":"2015-05-04T19:33:24.468Z","score":0.0001669852719457828},{"_id":"5546c69792ac5d29444dfc96","id":1578,"pasta":"need something with a bit more range? To start off, the lever-action 7-round buckfork:\n\n▄︻̷̿┻̿═━一E\n\nRuggedly reliable, best suited for lynching OP's at a close distance.\n\nNext we have the fully automatic forkpitcher:\n\n︻̷┻̿●═E\n\nA modified tommy submachine gun equipped with a 100-minifork drum, perfect for dispatching entire herds of OPs without reloading.\n\nAnnouncing the motherforker, a belt-fed beast that hates OP even more than we hate spoons:\n\n︻╦̵̵͇̿̿̿̿══╤─E\n\nBanned in most first-world countries, we have the privledge of manufacturing these exclusively in forkistan.\n\nFinally, the experimental railfork, 69420 volts of electric lynching power:\n\n︻̷̿┻̿═━═━E\n\nWe scraped this together with 3D printed parts and magnetized titanium ammunition, the future is now!\n\nPetition forkistan to standardize these models and bring glory to the resistance once more!","tags":"#reddit#pitchfork#guns","favourites":16,"__v":0,"created_on":"2015-05-04T01:08:32.827Z","score":0.0004980560122031132},{"_id":"5546c67f92ac5d29444dfc94","id":1577,"pasta":"COD VET: Hello Meme Master, I’m going into reddit and I want your dankest memes.\n\nMEME~MASTER: My memes are too dank for you redditor.\n\n\nCOD VET: Meme Master, I tell you I’m going into reddit and I want only your dankest memes.\n\nMEME~MASTER: You can’t handle my memes they are too dank for you.\n\nCOD VET: Meme Master listen to me, I want only your dankest memes.\n\nMEME~MASTER: My memes would ban you redditor, you cannot handle my memes.\n\nCOD VET: Meme Master enough of this trolling, I’m going to reddit and I need your dankest memes.\n\nMEME~MASTER: My dankest memes would ban you redditor, you can’t handle my dankest memes. You better go to a seller that sells weaker memes.\n\nCOD VET: Meme Master I’m telling you right now, I’m going into reddit and I need only your dankest memes.\n\nMEME~MASTER: You don’t know what you ask redditor, my dankest memes would ban a 4channer, let alone a redditor. You need to go to a seller that sells weaker memes, because my memes are too dank.\n\nCOD VET: Meme Master, I’m telling you I need your dankest memes, I’m going into a reddit, I’m going to reddit, and I need your dankest memes.\n\nMEME~MASTER: You can’t handle my dankest memes. No one can, my dankest memes are fit for a 4channer, let alone a redditor.\n\nCOD VET: Meme Master what do I have to tell you to get your memes. Why won’t you trust me with your dankest memes, Meme Master? I need them if I’m to be successful in the reddit.\n\nMEME~MASTER: I can’t give you my dankest memes because my dankest memes are only for the dankest beings and you are of the weakest.\n\nCOD VET: Well then that’s it Meme Master, I’ll go elsewhere, I’ll go elsewhere for my memes\n\nMEME~MASTER: That’s what you better do.\n\n\nCOD VET: I’ll go elsewhere for my memes and I’ll never come back.\n\nMEME~MASTER: Good, you are not welcome here. My memes are only for the dankest and you are clearly are not of the dankest, you are clearly of the weakest.\n\nCOD VET: You have had your say Meme Master, but I’ll have mine. You’re a rascal; you’re a rascal with no respect for the redditors, no respect for anything except your memes.\n\nMEME~MASTER: Why respect redditors? When my memes can do anything that you can?","tags":"#meme#reddit#4chan#cod","favourites":5,"__v":0,"created_on":"2015-05-03T21:27:45.905Z","score":0.00016526111581451717},{"_id":"5545cbf492ac5d29444dfc76","id":1563,"pasta":"the 9/11 incident was a conspiracy tho not a theory, new owner same year, goes through mad amounts of legal procedures just for trror attack insurance (YES SPECIFICALLY TERRORIST ATTACK INSURANCE) and we are talking a mad rich guy to, he spent most of his time that year, getting terrorist insurance. and he got it.\nfor twice the value he bought the complex for..\nalso Al quaida was founded by the CIA 1969. but that irrelevant because aside from beeing PATZI they had nothing to do with 9/11, literally nothing.\nThe helicopted crew that killed bin laden all died while flying back to homebase to lay their report. EVERY ONE OF THEm\nthese are just a few of the endless amount of facts\nit really isnt something to discusss. its way tof uckin obvious.\ni am normally not the conspiracy kinda of guy.\nbut i knew this was fake when i first saw it. on 9/11 2001.\njust 5 days before i had seen a movie where american airforce was involved. 3 hours off ur flight path without reporting in, would never happen in the states. U WOULD GET SHOT DOWN\n7 year old me. literally knows better than everysingle one of u. People that cant see how obviously profitable this \"terror attack\" was for OOOOHHH so many parties, are fuckin braindead puppets.\nAnd then there is what a cop would called evidence. we have evidence and motive, oh and look the guy they made out to be a patzi got killed and then every body that killed him got killed\nNO LOOSE ENDS\nfuck u seriously.\nwhat USA did the the middle east during the 60s 70s deserves terror attacks, cant even imagine how they felt after u faked one and then started exterminating what little was left of their freedom.\nSome seriously fucked up Darth Vader shit","tags":"#general#911#Conspiracy","favourites":1,"__v":0,"created_on":"2015-05-03T04:02:40.830Z","score":0},{"_id":"5543299c928ac33f5896315b","id":1559,"pasta":"I am disgusted that young boys are exposed to this filth in our great country. This has clear Satanic and Mexican influences and I am deeply troubled that our vulnerable youth finds this atheist black man amusing. This is why American children are shooting up our schools and becoming less Christian. Did you know that atheists and Islams are on the rise in the Western world? What happened to our Judeo-Christian values? Please join me in boycotting this evil man's video and putting America back on track.\nLove, Faith, and the American Way.","tags":"#general#christian#america#MURICA#hicks","favourites":3,"__v":0,"created_on":"2015-05-01T07:06:16.403Z","score":0.00009011325363475337},{"_id":"5542bafa107beab4641ec2e8","id":1556,"pasta":"What the fuck did you just fucking say about me, you little bitch. I’ll have you know my name is Joseph, and I woke up this morning 5:30 sharp to the smell of wet pussy. I was getting a blowjob from two bitches (Shit was SO Cash), one was trying to fit my humongous 3 pound balls in her mouth while the other was choking halfway on my 18 and 3\\8 inch dick. She started to squirt hard, she was convulsing and having 6 orgasms at the same time. I gave it to them and they were on the floor squirting like motherfucking fountains. Must have come about a quart of sperm and compressed air. Imagine your best orgasm, then multiply it by 35. I had to go to base camp so I front-flipped from my 14th floor barracks into my valet parked 2012 Ferrari (I got connexions). Pushed my shit to about 4 hundo (mph, mind you) and I was at base camp in no time. When I entered, I became a top sniper and was granted access to the entire arsenal of the USMC. I learned how to kill someone in over 700 different ways and was assigned to be the leader of a squad that will kill 300 terrorists using gorilla warfare tactics. Also did 6000 push-ups, 8000 sit-ups and bench-pressed 30 plates in 16 minutes. After basic training, I met a network of secret spies who will help me trace your IP address, while eating gold plated sushi and 15,000 $ champagne. My unit got the rest of the day off and I became captain of our base’s football team and starter of the basketball team. I got straight A’s on the military entrance exams and received more awards. Meanwhile, you were jacking off to pictures on Facebook and naked drawn Japanese people. Went back in the Lambo to my barracks and now I am getting ready to go to sleep. I am going to graduate at the top of my class in the Navy Seals tomorrow and I want to look pretty much perfect for it. Don’t be a stranger and remember, I did more in one day than you will your entire life.","tags":"#general#joseph","favourites":6,"__v":0,"created_on":"2015-04-30T19:51:41.599Z","score":0.00019238791320829598}]