[{"_id":"5509ba432ab05ce134dd3221","id":1201,"pasta":"The part about homophobia being more common among black folks is true but then he had to go on with an unfounded stereotype at the end.","tags":"#general#homophobia#racist#stereotype","favourites":3,"__v":0,"created_on":"2015-03-18T17:46:59.502Z","score":0.000040164983794204904},{"_id":"5509b6922ab05ce134dd321f","id":1200,"pasta":"You really have no respect. No respect at all. How hard would it be just complying with my simple request? But no, you had to be obnoxious morons and ruin it all. OK, well done, motherfuckers. Keep acting like this and in a few years you most likely will need someone else's consideration for an endeavor of yours to succeed. and you know what will happen? You will fail miserably, and will have nobody to blame but yourselves and your selfish, bleeding faggot cunt. you disgust me more than everything, and I really hope you drown in a pool of horse semen while being sodomized by five niggers and your mother watches the scene. You are just so bad that calling you names is praising you, so I'll just stop here, hoping that you get your shit together and stop acting like the little cum gargling pieces of shit you are. Bastards.","tags":"#general#respect#bastards#rage","favourites":17,"__v":0,"created_on":"2015-03-18T16:34:45.174Z","score":0.0002271419608720833},{"_id":"55099a012ab05ce134dd3218","id":1199,"pasta":"♚_♕","tags":"#general#twitch#chess#checkmate","favourites":3,"__v":0,"created_on":"2015-03-18T15:30:06.663Z","score":0.00004014304936589281},{"_id":"5509995c2ab05ce134dd3215","id":1197,"pasta":"Just to be clear, I'm not a professional \"quote maker\". I'm just an atheist teenager who greatly values his intelligence and scientific fact over any silly fiction book written 3,500 years ago. That being said, I am open to any and all criticism.\n\n\"In this moment, I am euphoric. Not because of any phony god's blessing. But because, I am englightened by my intelligence.\" - Aalewis","tags":"#reddit#AALewis#professional#quote#maker#euphoric","favourites":3,"__v":0,"created_on":"2015-03-18T15:03:04.736Z","score":0.00004013872015598011},{"_id":"550998e92ab05ce134dd3214","id":1196,"pasta":"I will just preface this by saying I am in fact 17 years old, I am white, and I do live in America. Do I think my problems are worse than that of the people in Ethiopia? Yes, yes I do. I can explain to you in detail. I am being spied on constantly. They watch what I do, they read my emails, and they probably snicker at the things I watch, and you act like you know oppression? Those Ethiopians get hurt, sure, but the time is going to come when the US government will arrest me simply for not agreeing with them. Where men and women will not have their say any where. And for now, we have to pay a tax for people who live off welfare (lazy bastards) who won't do anything with it and will only buy drugs and beer, even Kafka would find this shit unbelievable. You act smug to people like me, but you don't even know the half of it.","tags":"#reddit#ethiopians#white#libertarian#america","favourites":3,"__v":0,"created_on":"2015-03-18T15:01:35.549Z","score":0.00004013848212448555},{"_id":"5509986a2ab05ce134dd3212","id":1195,"pasta":"Allow us old men the small luxury of fawning over you. It's really... exciting when a (presumably) clever and friendly mind comes in such a pretty package. You are the girlfriend most of us would love to have.\nIt's not that we don't take you seriously as an atheist/scientist/whatever. It's that people who are knowledgeable about this stuff are a dime a dozen but people who are both knowledgeable and hot looking are much rarer.\nMeanwhile, while everybody's (figuratively) climbing all over you, is your mother already doing anything tonight?? ;)\n\nEdit: To the horde of assholes who choose to be offended at this comment, please take note: At the time I wrote this it wasn't yet known that she's 15. I'd guessed her to be between 17 and 21. No, I don't want a 15 year old girlfriend, and my own personal standards of \"young girl\" are meanwhile at age 30. But I don't think I'm wrong in saying that many Redditors, if she turned out to be legal, would be only too happy to have a pretty girlfriend like her. If you have a problem with that statement, then fuck you.","tags":"#reddit#nukethepope#neckbeard#athiesm","favourites":2,"__v":0,"created_on":"2015-03-18T15:00:04.116Z","score":0.00002252682447734121},{"_id":"55098d6f2ab05ce134dd320e","id":1194,"pasta":"Who are you? Are you LS? I don't recall seeing you post on this sub before and here you come waltzing in like you own the place threatening to take away our map if we don't decide to \"improve\" it in some way. \n\nWho the hell do you think you are, sir? ","tags":"#reddit#tagpro#ls","favourites":1,"__v":0,"created_on":"2015-03-18T14:35:47.898Z","score":0},{"_id":"55098d642ab05ce134dd320d","id":1193,"pasta":"I abide by the code of honor and chivalry, so to all those who repeatedly insult me on forums hiding behind their computer screen: I am available at anytime of the day for a fistfight or any type of sword or crossbow duel. I just purchased an automatic pistol crossbow. It's a mix between a gun and a crossbow, it's like a pistol but it fires arrows. I killed a goat with a shot in the stomach at point-blank range by alluring it with grass; the beast died three hours later. I will do the same with you. I know that you like grass, like all sheep do.","tags":"#general#sheep#crossbow#honor#chivalry#tough#guy","favourites":10,"__v":0,"created_on":"2015-03-18T14:15:51.034Z","score":0.0001405482552724805},{"_id":"55098d472ab05ce134dd320c","id":1192,"pasta":"You can't parse [X]HTML with regex. Because HTML can't be parsed by regex. Regex is not a tool that can be used to correctly parse HTML. As I have answered in HTML-and-regex questions here so many times before, the use of regex will not allow you to consume HTML. Regular expressions are a tool that is insufficiently sophisticated to understand the constructs employed by HTML. HTML is not a regular language and hence cannot be parsed by regular expressions. Regex queries are not equipped to break down HTML into its meaningful parts. so many times but it is not getting to me. Even enhanced irregular regular expressions as used by Perl are not up to the task of parsing HTML. You will never make me crack. HTML is a language of sufficient complexity that it cannot be parsed by regular expressions. Even Jon Skeet cannot parse HTML using regular expressions. Every time you attempt to parse HTML with regular expressions, the unholy child weeps the blood of virgins, and Russian hackers pwn your webapp. Parsing HTML with regex summons tainted souls into the realm of the living. HTML and regex go together like love, marriage, and ritual infanticide. The <center> cannot hold it is too late. The force of regex and HTML together in the same conceptual space will destroy your mind like so much watery putty. If you parse HTML with regex you are giving in to Them and their blasphemous ways which doom us all to inhuman toil for the One whose Name cannot be expressed in the Basic Multilingual Plane, he comes. HTML-plus-regexp will liquify the n​erves of the sentient whilst you observe, your psyche withering in the onslaught of horror. Rege̿̔̉x-based HTML parsers are the cancer that is killing StackOverflow it is too late it is too late we cannot be saved the trangession of a chi͡ld ensures regex will consume all living tissue (except for HTML which it cannot, as previously prophesied) dear lord help us how can anyone survive this scourge using regex to parse HTML has doomed humanity to an eternity of dread torture and security holes using regex as a tool to process HTML establishes a breach between this world and the dread realm of c͒ͪo͛ͫrrupt entities (like SGML entities, but more corrupt) a mere glimpse of the world of reg​ex parsers for HTML will ins​tantly transport a programmer's consciousness into a world of ceaseless screaming, he comes, the pestilent slithy regex-infection wil​l devour your HT​ML parser, application and existence for all time like Visual Basic only worse he comes he comes do not fi​ght he com̡e̶s, ̕h̵i​s un̨ho͞ly radiańcé destro҉ying all enli̍̈́̂̈́ghtenment, HTML tags lea͠ki̧n͘g fr̶ǫm ̡yo​͟ur eye͢s̸ ̛l̕ik͏e liq​uid pain, the song of re̸gular exp​ression parsing will exti​nguish the voices of mor​tal man from the sp​here I can see it can you see ̲͚̖͔̙î̩́t̲͎̩̱͔́̋̀ it is beautiful t​he final snuffing of the lie​s of Man ALL IS LOŚ͖̩͇̗̪̏̈́T ALL I​S LOST the pon̷y he comes he c̶̮omes he comes the ich​or permeates all MY FACE MY FACE ᵒh god no NO NOO̼O​O NΘ stop the an​*̶͑̾̾​̅ͫ͏̙̤g͇̫͛͆̾ͫ̑͆l͖͉̗̩̳̟̍ͫͥͨe̠̅s ͎a̧͈͖r̽̾̈́͒͑e n​ot rè̑ͧ̌aͨl̘̝̙̃ͤ͂̾̆ ZA̡͊͠͝LGΌ ISͮ̂҉̯͈͕̹̘̱ TO͇̹̺ͅƝ̴ȳ̳ TH̘Ë͖́̉ ͠P̯͍̭O̚​N̐Y̡ H̸̡̪̯ͨ͊̽̅̾̎Ȩ̬̩̾͛ͪ̈́̀́͘ ̶̧̨̱̹̭̯ͧ̾ͬC̷̙̲̝͖ͭ̏ͥͮ͟Oͮ͏̮̪̝͍M̲̖͊̒ͪͩͬ̚̚͜Ȇ̴̟̟͙̞ͩ͌͝S̨̥̫͎̭ͯ̿̔̀ͅ","tags":"#general#html#regex#fucked#text","favourites":3,"__v":0,"created_on":"2015-03-18T13:54:35.569Z","score":0.00004012775582355862},{"_id":"55098d1b2ab05ce134dd320a","id":1191,"pasta":"A white heteronormative cisgendered CEO professor and Baptist preacher was teaching a class on Karl Rove, known Christian.\n\n“Before the class begins, you must get on your knees and worship Jesus Christ and accept that you too can become straight through daily prayer, self-flagellation, and eating Chik-Fil-A every day!”\n\nAt this moment, a brave, trans-Asian, self-diagnosed pansexual demiromantic vegan multisouled person who had been free of all animal products and only bought products at the local transgender co-op boldly stood up, holding a glass filled with some white liquid.\n\n“Hey, Professor, what is this?”\n\nThe arrogant professor smirked like a rapist and smugly replied “It’s clearly milk, you crazy faggot. What the fuck does milk have to do with political science?”\n\n“Wrong. It’s an all natural vegan soy almond kombucha latte. No animals or transpeople were harmed or raped in the making of this product.”\n\nThe professor was visibly shaken, and dropped his chalk and copy of the Wall Street Journal. He stormed out of the room, clearly planning some kind of rape. The professor realized that he had been playing into the hands of the kyriarchy of CEOs, investment bankers, the Religious Right, and psychiatrists. He then killed himself. The proper term for this is “trans-dead”.\n\nThe students checked their privilege, all diagnosed themselves with autism and gender identity disorder and joined the Gay-Straight Alliance. An obese trans-eagle furry otherkin waddled into the room and tried to perch upon the American Flag, bending the flagpole in the process. All parties involved gave up meat, Christianity, and the right to bear arms.\n\nThe students all lifted their glasses of soy fluid in a toast.\n\n“That beverage’s name? Harvey “The One Percent” Milk.” said the vegan trans-autistic Korean.","tags":"#general#baptist#professor#tumblr#privilege#milk","favourites":3,"__v":0,"created_on":"2015-03-18T13:49:00.252Z","score":0.000040126861348000996},{"_id":"55097effb47c3d010fd9660d","id":1190,"pasta":"Just held the door for an Asian guy and he said \"sank you\"... So I punched him in the face. I can't believe somebody brought up Pearl Harbor like that.","tags":"#general#asian#pearl#harbor#sank","favourites":39,"__v":0,"created_on":"2015-03-18T13:30:17.613Z","score":0.00046669245745541583},{"_id":"55097ec4b47c3d010fd9660c","id":1189,"pasta":"#include <stdio.h>\n#define SOMEONEGETTHISHOTHEADOUTTAHERE return 0\n#define HEDIDNTFLYSOGOOD return 1\n#define YOUREABIG \n#define INT int\n#define GUY char\n#define FOR =\n#define DRPAVELIMCIA int main() {\n#define GETEMONBOARDILLCALLITIN }\n#define HEWASNTALONE (\n#define WHYWOULDIWANTTHEM )\n#define FIRSTONETOTALKGETSTOSTAYONMYAIRCRAFT printf\n#define ATLEASTYOUCANTALK if\n#define ISABIGGERGUY >\n#define TELLMEABOUTBANE scanf\n//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nDRPAVELIMCIA\n YOUREABIG INT X FOR 5;\n YOUREABIG INT Y FOR 2;\n YOUREABIG GUY* INPUT FOR \"\";\n FIRSTONETOTALKGETSTOSTAYONMYAIRCRAFT HEWASNTALONE \"ARE YOU BIG GUY?\\nANSWER: \" WHYWOULDIWANTTHEM;\n TELLMEABOUTBANE HEWASNTALONE \"%s\",&INPUT WHYWOULDIWANTTHEM;\n ATLEASTYOUCANTALK HEWASNTALONE X ISABIGGERGUY Y WHYWOULDIWANTTHEM {\n FIRSTONETOTALKGETSTOSTAYONMYAIRCRAFT HEWASNTALONE \"FOR YOU\" WHYWOULDIWANTTHEM;\n }\n SOMEONEGETTHISHOTHEADOUTTAHERE;\nGETEMONBOARDILLCALLITIN;\n//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~","tags":"#general#c++#big#guy#bane","favourites":1,"__v":0,"created_on":"2015-03-18T13:21:51.217Z","score":0},{"_id":"55097b76b47c3d010fd96608","id":1187,"pasta":"This troll was clearly compiled with inferior tools. My guess is that you used Visual Troll++, or possibly TurboTroll 2000.\n\nThese first generation tools are quite limited, and there is a severe garbage-collection-related performance hit when you try optimizing the output of VT++ for flaming or insults.\n\nI suggest that you try the latest version of GTC; the Gnu Troller Collection. It is the standard when it comes to creating Trolls. It is also Open Source, reentrant, and is fully compliant with the Triple Troll, Troll-On-Troll and TrollChow protocols.","tags":"#general#programming#usenet#newsgroup","favourites":3,"__v":0,"created_on":"2015-03-18T13:17:42.173Z","score":0.00004012185213783719},{"_id":"55097941b47c3d010fd96605","id":1186,"pasta":"***\n\n**Your comment has been shit on!** **ヽ༼ຈل͜ຈ༽ﾉ**\n#\nAnother user hated your comment so much that they shat on it, giving you **Reddit Shit**.\n\nReddit Shit is reddit's premium shit program. Here are the benefits:\n\n* Extra shit\n\n* Free YouTube comments (*[congratulations!](https://www.youtube.com/watch?v=MoI8Z8Dq1yY)*)\n\n* Discuss and get absolutely no help on the annoyances at /r/shitbenefits \n\n* Grab a drink and join us in /r/shitlounge, the super-secret-shit-only community that may or may not exist.\n\n***\n\n**Did you know:** Most Reddit Shit—78 percent of the yearly shit supply—is made into fedoras. Other industries, mostly electronics, medical, and dental, require about 12 percent. The remaining 10 percent of the yearly shit supply is used in financial transactions.\n\n***","tags":"#reddit#shit#on#hated#comment#post","favourites":14,"__v":0,"created_on":"2015-03-18T13:06:31.639Z","score":0.00019089274098806788},{"_id":"55097608b47c3d010fd96603","id":1185,"pasta":"ヽ༼ຈل͜ຈ༽ﾉ ʀᴀɪsᴇ ᴜʀ ᴅᴏɴɢᴇʀs ヽ༼ຈل͜ຈ༽ﾉ\n(ง°ل͜°)ง I TRIED TO SILENCE MY DONGER ONCE; BOY THAT WENT WELL (ง°ل͜°)ง\nᕦ༼ຈل͜ຈ༽ᕤ Flex your dongers ᕦ༼ຈل͜ຈ༽ᕤ\nᕦ༼ຈل͜ຈ༽ᕤ ＤＯ ＹＯＵ ＥＶＥＮ ＤＯＮＧ? ᕦ༼ຈل͜ຈ༽ᕤ\n┌༼ຈل͜ຈ༽┐ lower your dongers ┌༼ຈل͜ຈ༽┐\n(ง ͠° ل͜ °)ง THE UNSEEN DONGER IS THE DEADLIEST (ง ͠° ل͜ °)ง\n(ง ͠° ل͜ °)ง heres a tip. And a dong behind it (ง ͠° ل͜ °)ง\n(ง ͠ ͠° ل͜ °)ง ᴛᴏ ᴅᴏɴɢᴇʀ, ᴏʀ ɴᴏᴛ ᴛᴏ ᴅᴏɴɢᴇʀ (ง ͠ ͠° ل͜ °)ง\n(ง ͠ ͠° ل͜ °)ง sᴏᴜɴᴅs ᴅᴏɴɢᴇʀᴏᴜs... ɪᴍ ɪɴ (ง ͠ ͠° ل͜ °)ง\n(ง ͠° ل͜ °)ง ᴍᴀsᴛᴇʀ ʏᴏᴜʀ ᴅᴏɴɢᴇʀ, ᴍᴀsᴛᴇʀ ᴛʜᴇ ᴇɴᴇᴍʏ (ง ͠° ل͜ °)ง\n(ง ͠ ͠° ل͜ °)ง ᴛʜᴇ ᴅᴏɴɢᴇʀ ᴀʟsᴏ ʀɪsᴇs (ง ͠ ͠° ل͜ °)ง\n(ง ͠ ͠° ل͜ °)ง YOUR DONGERS ARE INFERIOR (ง ͠ ͠° ل͜ °)ง\n(ง ͠ ͠° ل͜ °)ง MY RIGHT DONGER IS A LOT STRONGER THAN MY LEFT DONGER (ง ͠ ͠° ͟ل͜ ͡°)ง\n(ง ͠ ͠° ل͜ °)ง NEVER UNDERESTIMATE THE POWER OF THE DONGER (ง ͠ ͠° ل͜ °)ง\nヽ( ° ͜ʖ͡°)ﾉ ʀuʙ ᴍʏ ᴅᴏɴɢᴇʀ ヽ( ° ͜ʖ͡°)ﾉ\n(ง •̀_•́)ง focus your dongers (ง •̀_•́)ง\n༼ ºل͟º༼ ºل͟º༼ ºل͟º༼ ºل͟º ༽ºل͟º ༽ºل͟º ༽YOU CAME TO THE WRONG DONGERHOOD༼ ºل͟º༼ ºل͟º༼ ºل͟º༼ ºل͟º ༽ºل͟º ༽ºل͟º ༽\n༼ ºل͟º ༼ ºل͟º ༼ ºل͟º ༽ ºل͟º ༽ ºل͟º ༽ YOU PASTARINO'D THE WRONG DONGERINO ༼ ºل͟º ༼ ºل͟º ༼ ºل͟º ༽ ºل͟º ༽ ºل͟º ༽\n༼ ºل͟º༼ ºل͟º༽ºل͟º ༽ YOU COPERINO﻿ FRAPPUCCIONO PASTARINO'D THE WRONG DONGERINO ༼ ºل͟º༼ ºل͟º༽ºل͟º ༽\n༼ ºل͟º༼ ºل͟º༼ ºل͟º༼ ºل͟º ༽ºل͟º ༽ºل͟º ༽You either die a DONG, or live long enough to become the DONGER༼ ºل͟º༼ ºل͟º༼ ºل͟º༼ ºل͟º ༽ºل͟º ༽ºل͟º ༽\nᕙ༼ຈل͜ຈ༽ᕗ. ʜᴀʀᴅᴇʀ,﻿ ʙᴇᴛᴛᴇʀ, ғᴀsᴛᴇʀ, ᴅᴏɴɢᴇʀ .ᕙ༼ຈل͜ຈ༽ᕗ\n(ง ͠° ل͜ °)ง LET ME DEMONSTRATE DONGER DIPLOMACY (ง ͠° ل͜ °)ง\n(ง'̀-'́)ง ＤＯＮＧ ＯＲ ＤＩＥ (ง'̀-'́)ง\nヽ༼ຈل͜ຈ༽ﾉ raise your dongers ヽ༼ຈل͜ຈ༽ﾉ\nヽ༼ຈل͜ຈ༽ﾉ VOICE OF AN ANGEL ヽ༼ຈل͜ຈ༽ﾉ\nヽ༼ຈل͜ຈ༽ﾉ LETS GET DONGERATED ヽ༼ຈل͜ຈ༽ﾉ\nヽ༼ຈل͜ຈ༽ﾉ RAISE YOUR BARNO ヽ༼ຈل͜ຈ༽ﾉ\nヽ༼ຈل͜ຈ༽ﾉITS A HARD DONG LIFE ヽ༼ຈل͜ຈ༽ﾉ\nヽ༼ຈل͜ຈ༽ﾉ \"I have a dong\" ヽ༼ຈل͜ຈ༽ﾉ - Martin Luther King Jr.\nヽ༼ຈل͜ຈ༽ﾉ WHAT DOESNT KILL ME ONLY MAKES ME DONGER ᕙ༼ຈل͜ຈ༽ᕗ\nノ(ಠ_ಠノ ) ʟᴏᴡᴇʀ ʏᴏᴜʀ ᴅᴏɴɢᴇʀs ノ(ಠ_ಠノ)\nヽ༼Ὸل͜ຈ༽ﾉ HOIST THY DONGERS ヽ༼Ὸل͜ຈ༽ﾉ\n༼ ºل͟º ༽ I AM A DONG ༼ ºل͟º ༽\n༼ ºل͟º༽ I DIDN'T CHOOSE THE DONGLIFE, THE DONGLIFE CHOSE ME ༼ ºل͟º༽\n༼ ºل͟º༽ NO ONE CARED WHO I WAS UNTIL I PUT ON THE DONG ༼ ºل͟º༽\n༼ ºººººل͟ººººº ༽ I AM SUPER DONG ༼ ºººººل͟ººººº ༽\n┌∩┐༼ ºل͟º ༽┌∩┐ SUCK MY DONGER ┌∩┐༼ ºل͟º ༽┌∩┐\nζ༼Ɵ͆ل͜Ɵ͆༽ᶘ FINALLY A REAL DONG ζ༼Ɵ͆ل͜Ɵ͆༽ᶘ\n<ᴍᴇssᴀɢᴇ ᴅᴏɴɢᴇʀᴇᴅ>\nヽ༼ʘ̚ل͜ʘ̚༽ﾉIS THAT A DONGER IN YOUR POCKET?ヽ༼ʘ̚ل͜ʘ̚༽ﾉ\n༼ ͡■ل͜ ͡■༽ OPPA DONGER STYLE ༼ ͡■ل͜ ͡■༽\n( ° ͜ ʖ °) REGI OP ( ° ͜ ʖ °)\n(▀̿ ̿Ĺ̯̿̿▀̿ ̿) IM DONG,JAMES DONG (▀̿ ̿Ĺ̯̿̿▀̿ ̿)\n(ง⌐□ل͜□)ง WOULD YOU HIT A DONGER WITH GLASSES (ง⌐□ل͜□)ง\nʕ•ᴥ•ʔ CUDDLE UR DONGERS ʕ•ᴥ•ʔ\nლ(́◉◞౪◟◉‵ლ) let me hold your donger for a while ლ(́◉◞౪◟◉‵ლ)\nヽ༼ຈل͜ຈ༽ง MY RIGHT DONG IS ALOT STRONGER THAN MY LEFT ONE ヽ ༼ຈل͜ຈ༽ง\n(✌ﾟ∀ﾟ)☞ May the DONG be with you! ☚(ﾟヮﾟ☚)\nѰζ༼ᴼل͜ᴼ༽ᶘѰ HIT IT WITH THE FORK Ѱζ༼ᴼل͜ᴼ༽ᶘѰ\n(ง ͡ʘ ͜ʖ ͡ʘ)ง GO FABBBYYY GO (ง ͡ʘ ͜ʖ ͡ʘ)ง\n( ° ͡ ͜ ͡ʖ ͡ °)ﾉ RAISE YOUR GENJAS ヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉ\n༼ ºل͟º༼ ºل͟º༽ºل͟º ༽ Chester Cheeto Support our Dongers ༼ ºل͟º༼ ºل͟º༽ºل͟º ༽\nヽ༼ຈل͜ຈ༽ﾉ NEVER UNDERESTIMATE THE POWER OF THE DONG CODE ヽ༼ຈل͜ຈ༽ﾉ\nヽ༼° ل͜ °༽ﾉ DONGMACIA NOW AND FOREVER ヽ༼° ل͜ °༽ﾉ\n(ง ͠° ل͜ °)ง DON'T YOU DONG ME, SUMMONER?? (ง ͠° ل͜ °)ง\nง ͠° ل͜ °)ง MASTER YOUR DONGER, MASTER THE ENEMY (ง ͠° ل͜ °)ง\n(ง ͠° ل͜ °)ง FOR MY FATHER THE DONG (ง ͠° ل͜ °)ง\n╭∩╮( °﻿ ͜ʖ͡°)wнαт doeѕɴт ĸιll мe мαĸeѕ мe doɴɢer ( °﻿ ͜ʖ͡°)╭∩╮\n(ง ͠° ل͜ °)ง KNOWN IF THE DONGERS WERE TURNED I WOULD SHOW YOU NO DONG (ง ͠° ل͜ °)ง\n(っ◕‿◕)っpenetrate nintendude's anus (っ◕‿◕)っ\n(ง ͠° ل͜ °)ง Your donger belongs in a museum (ง ͠° ل͜ °)ง\nヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉ YOU CAME TO THE WRONG GENJAHOOD ヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉ\n( ° ͜ʖ͡°) Mom always said my donger was big for my age ( ° ͜ʖ͡°)\n( ° ͜ʖ͡°) I WAS BORN WITH A NEEDLESSLY LARGE DONGER ( ° ͜ʖ͡°)\n( ° ͜ʖ͡°) IS THAT A DONGER IN YOUR POCKET? ( ° ͜ʖ͡°)\n(ง ͠° ل͜ °)ง Vi? Stands For DONGER (ง ͠° ل͜ °)ง\nヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉ I BELIEVE I CAN DONGヽ( ° ͡ ͜ ͡ʖ ͡ °)ﾉ\nΨ༼ຈل͜ຈ༽Ψ﻿ HIT IT WITH A DONGER Ψ༼ຈل͜ຈ༽Ψ\n༼ʘ̚ل͜ʘ̚༽ I NEED A DONGTOR ༼ʘ̚ل͜ʘ̚༽\nヽ༼ຈل͜ຈ༽ﾉ Darude your Sandstorms ヽ༼ຈل͜ຈ༽ﾉ\n༼ ºل͟º༼ ºل͟º༼ ºل͟º༼ ºل͟º ༽ºل͟º ༽ºل͟º ༽ºل͟º ༽ 7 DEADLY DONGERS ༼ ºل͟º༼ ºل͟º༼ ºل͟º༼ ºل͟º ༽ºل͟º ༽ºل͟º ༽ºل͟º ༽\nヽ( ͝° ͜ʖ͡°)ﾉ IMAGINE IF I HAD A REAL DONGER ヽ( ͝° ͜ʖ͡°)ﾉ\n~(˘▾˘~) Wave Your Dongers (~˘▾˘)~\nwork it ᕙ༼ຈل͜ຈ༽ᕗ harder make it (ง •̀_•́)ง better do it ᕦ༼ຈل͜ຈ༽ᕤ faster raise ur ヽ༼ຈل͜ຈ༽ﾉ donger\nɳ༼ຈل͜ຈ༽ɲ more than ever hour after ɳ༼ຈل͜ຈ༽ɲ\nヽ ༼ຈل͜ຈ༽ﾉ our work is always dongers ヽ༼ຈل͜ຈ༽ﾉ\nヽ༼ຈل͜ຈ༽ﾉ FOREVER DONG ヽ༼ຈل͜ຈ༽ﾉ\n༼ ºل͟º ༼ ºل͟º ( ° ͡ ͜ ͡ʖ ͡ °) ºل͟º ༽ ºل͟º ༽ 5 MEN 1 DREAM 9 EYEBROWS ༼ ºل͟º ༼ ºل͟º( ° ͡ ͜ ͡ʖ ͡ °) ºل͟º ༽ ºل͟","tags":"#general#oh#god#the#dongers#long#list#all","favourites":124,"__v":0,"created_on":"2015-03-18T12:54:20.125Z","score":0.0012418517796855372}]