[{"_id":"577f59b8c2b85a51055b317c","id":2828,"pasta":"I sexually Identify as a country. Ever since I was a boy I dreamed of being a nice pile of dirt in the ocean. People say to me that a person being a country is Impossible and I’m fucking retarded but I don’t care, I’m beautiful. I’m having a plastic surgeon install some trees, lakes and mountains on my body. From now on I want you guys to call me “Canada” and respect my right to be a sovereign state. If you can’t accept me you’re a countriphobe and need to check your border privilege. Thank you for being so understanding.","tags":"#general#sexually#indentify#country","favourites":0,"__v":0,"created_on":"2016-07-08T07:43:52.132Z","score":0},{"_id":"577f59c3c2b85a51055b317d","id":2829,"pasta":"You know what I don't understand? No one ever takes copypastas seriously. I'm being honest here. No one ever stops and really understands the copypastas. They just pass it off as just another shitpost that was made by some edgy shit in his basement, waiting for downvotes and hate comments. These people are wrong. copypastas are made by the greatest minds on the planet. Each one is carefully and delicately crafted to get the least amount of karma on Reddit. I'm led to believe that maybe even Ernest Hemingway made a copypasta. Now, I am not talking about the shitty twitter copypastas that don't take any effort at all, like what you see on say, for example, Berny Snaders' page. They lack a soul. I only speak of 4Chan copypastas and the like. Copypastas that make fun of the saltiness of OP and call his post cancer. These types of copypastas deserve respect. They aren't trash. They are literature. ","tags":"#general#pasta#respect#dank","favourites":0,"__v":0,"created_on":"2016-07-08T07:44:03.401Z","score":0},{"_id":"577f59d2c2b85a51055b317e","id":2830,"pasta":"In west Pakistania\nBorn and raised\nOn the bomb range where  I  spent most of my days\nBlowin up infidels, relaxin all cool\nShootin U.S. troops outside of school\nWhen a couple of americans who were up to no good\nStarted defiling islam in my neighborhood\nI set off one chem bomb and my mom got scared\nShe said \"You're moving in with your 6 aunties in Tehran\"\nI whistled for a plane\nAnd when it came near\nThe license plate said \"Boom\" and there were severed heads in the mirror\nI thought to myself \"Man, this plane is rare\"\nThen  I  thought \"Nah man, fulfill Sharia law\"\n\"Go bomb in Tehran\"\nI pulled up to the cell about 9:11 or later\nI looked at the driver and said \"Allah hu akbar, madh Allah, yarzuqna\"\nI looked at my flag\nI've earned my title\nTime to sit on my nukes as the prince of ISIL","tags":"#general#islam#fresh#prince#bel#air#general#isis","favourites":0,"__v":0,"created_on":"2016-07-08T07:44:18.667Z","score":0},{"_id":"577f59fdc2b85a51055b3180","id":2832,"pasta":"You're going to love our wall. Let me tell you: I've got a great wall. Just fantastic. It's... China says they have a great wall, but have you seen it? It's small, tiny, miniscule. Sure you can see it from space but if you google you can see your car from space, too. I'm going to make a wall you can see from mars. It'll be great. They'll take those rovers or droids or whatever they have up there and they'll turn around and take pictures of my wall and we'll realize we don't even need to go to space anymore because everything we could ever want is right here. Let's make walls great again!","tags":"#general#trump#wall#merica#trumptrain#thedonald","favourites":0,"__v":0,"created_on":"2016-07-08T07:45:01.346Z","score":0},{"_id":"577f5a18c2b85a51055b3181","id":2833,"pasta":"im 13 and just descoverd The Donald, i am now addicted to these dank memes and cannot continue life without this lovely dank dood. I now sexually identify as this very man. I have printed out his picture of him onto paper and blended them up with my hentai anime books and multiple donald trump memes in my dank nutri-ninja blender and then poured it into a syringe and injected it directly into my genital area. I will continue doing this untill i am donald trump we all spent countless hours on. Plz like to support my belief on becoming this man by liking. By liking you will create the dankest memes from now on and will be instantly famous on our beloved website 9gag witch i had recently failed to inject the donald into my cat, who sadly past away because there were impure memes in the paper, It was cancerous. <3 R.I.P FaZeRainTheCat. we will never forget.","tags":"#general#donald#the_donald#trump#13","favourites":0,"__v":0,"created_on":"2016-07-08T07:45:28.299Z","score":0},{"_id":"577f5a32c2b85a51055b3182","id":2834,"pasta":"So i went to this really ℱ𝓪𝓷𝓬𝔂 restaurant called the \"Pasta Palace\" and I really liked the food, service and overall mood of the restaurant, very ℱ𝓪𝓷𝓬𝔂. First off, the smell is ℱ𝓪𝓷𝓬𝔂. Its much better than the smell in my house, which is currently flooded in a pool of shit water from a toilet  I didn't flush. Anyways, other ℱ𝓪𝓷𝓬𝔂 aspects about this ℱ𝓪𝓷𝓬𝔂 restaurant is that the music is very ℱ 𝓪 𝓷 𝓬 𝔂. The music actually made my ᕙ༼ຈل͜ຈ༽ᕗ dong ᕙ༼ຈل͜ຈ༽ᕗ rise a little bit. So I bet you're wondering about the food. The food is indeed very ℱ𝓪𝓷𝓬𝔂. I ordered some pasta and I really liked the ℱ𝓪𝓷𝓬𝔂 smell, ℱ𝓪𝓷𝓬𝔂 taste and ℱ𝓪𝓷𝓬𝔂 touch of the pasta, it was all very ℱ𝓪𝓷𝓬𝔂. Here's my complaint though. I realized that you can't pay with your dong in this particular restaurant. Yep, I asked the waiter if I could show the manager my ℱ𝓪𝓷𝓬𝔂 dong and that could cover my bill. You know what that bitch did? SHE KICKED ME OUT. Like jeez, who doesn't want their eyes to gaze in awe in sight of my very ℱ𝓪𝓷𝓬𝔂 ᕙ༼ຈل͜ຈ༽ᕗdongᕙ༼ຈل͜ຈ༽ᕗ? This restaurant is ass. Until they allow my ℱ𝓪𝓷𝓬𝔂  method of payment, i'll give the restaurant 1 out of 10 dong points. More like the \"pASSta palASSe\".","tags":"#general#dongers#reddit","favourites":0,"__v":0,"created_on":"2016-07-08T07:45:54.575Z","score":0},{"_id":"577f5a55c2b85a51055b3183","id":2835,"pasta":"You casuals don't understand the value of a good meme. It's a blood thing. Some people collect good memes. There are entire families that collect good memes, and the people from those families can't pass over a good meme. Shit. I live in a fucking apartment, I never make memes. Yet, I have a dank meme I found on reddit as my phone wallpaper. No one understands good memes. You never know when you're going to need one.","tags":"#general#dank#good#memes#value","favourites":0,"__v":0,"created_on":"2016-07-08T07:46:29.817Z","score":0}]